{
  "apple_music_id": "721242",
  "apple_music_url": "https://music.apple.com/gb/artist/sam-dave/721242",
  "biography": "Sam & Dave was an American soul and rhythm and blues (R&B) duo remembered for their gospel-infused performances.  Considered one of the greatest live acts of the 1960s, The tenor (higher) voice was Sam Moore (born Samuel David Hicks in Miami, Florida, on 12 October 1935; died in Coral Gables, Florida, on January 2025), and the baritone/tenor (lower) voice was David Prater (born in Ocilla, Georgia, on 9 May 1937;  died in Sycamore, Georgia, on 9 April 1988).  Performing together from 1961 through 1981, during 1965–68 they had consistent R&B chart success in the USA, including ten consecutive top 20 singles and three consecutive top 10 albums. \n\nSam & Dave are members of the Rock & Roll Hall of Fame, the Grammy Hall of Fame, the Vocal Group Hall of Fame, and are Grammy Award and multiple gold record award winning artists. According to the Rock & Roll Hall of Fame, Sam & Dave were the most successful soul duo, and brought the sounds of the black gospel church to pop music with their call-and-response records. Recorded primarily at Stax Records in Memphis, Tennessee, from 1965 through 1968, these included \"Soul Man\", \"Hold On, I'm Comin\", \"I Thank You\", \"When Something is Wrong with My Baby\", \"Wrap It Up\", and many other Southern Soul classics. Other than Aretha Franklin, no soul act during Sam & Dave's Stax years (1965-1968) had more consistent R&B chart success, including 10 consecutive top 20 singles and 3 consecutive top 10 LPs. Their crossover charts appeal (13 straight appearances and 2 top 10 singles) helped to pave the way for the acceptance of soul music by white pop audiences, and their song \"Soul Man\" was one of the first songs by a black group to top the pop charts using the word \"soul\", helping define the genre \"Soul Music\". \"Soul Man\" was a number one Pop Hit (Cashbox: November 11, 1967) and has been recognized as one of the most influential songs of the past 50 years by the Grammy Hall of Fame, The Rock & Roll Hall of Fame, Rolling Stone magazine, and RIAA Songs of the Century. \"Soul Man\" was featured as the soundtrack and title for a 1986 film and also a 1997–1998 television series, and Soul Men was a 2008 feature film. \n\nNicknamed \"Double Dynamite\", \"The Sultans of Sweat\", and \"The Dynamic Duo\" for their sweaty, gritty, gospel-infused performances, Sam & Dave were one of the greatest live acts of the 1960s. They were an influence on many future musicians, including Bruce Springsteen, Al Green, Tom Petty, Phil Collins, Michael Jackson, Elvis Costello, Teddy Pendergrass, Billy Joel and Stevie Winwood. The Blues Brothers, who helped create a resurgence of popularity for soul, R&B, and blues in the 1980s, were influenced by Sam & Dave. (Their biggest hit was a cover of \"Soul Man\" and their act and stage show had many similarities to the duo.)  \n\n[edit] Early years \n\nSam Moore and Dave Prater's early musical backgrounds involved listening to and singing gospel music in their homes and churches, and in Dave's case, also singing gospel in the choir in his church. Dave later sang with his older brother JT Prater in the gospel group The Sensational Hummingbirds, which recorded the record \"Lord Teach Me\" in the 1950s. Sam recorded \"Nitey-Nite\"/\"Caveman Rock\" in 1954 with the doo-wop group The Majestics, and later sang with the gospel groups The Gales and The Mellonaires. Moore and Prater listed Jackie Wilson and Sam Cooke as influences on their styles,[2] and Moore was also influenced by Little Willie John, whom he and Dave opened for often in the early 1960s.\n\nSam & Dave met working the gospel music circuit, and later in small clubs in Miami during amateur nights in 1961 according to Dave.[3] They sang together one night at the King of Hearts club, and started working together immediately thereafter, developing a live act featuring gospel-inspired call-and-response. Soul singer and record producer Steve Alaimo discovered them while performing on the same show with them at the King of Hearts nightclub in Miami and signed them to Marlin Records.\n\nAfter two singles in early 1962 were released on the local Marlin label owned by Miami's Henry Stone, Stone helped sign them to Roulette Records in New York. They released six 45s from 1962–1964 (two were re-releases of Marlin recordings) with Roulette, and one single on Stone and Alaimo's Alston Label. A few of the singles received regional airplay, but did not achieve national chart success. The songs, some of which were produced by Steve Alaimo and some of which were produced by Henry Glover,were similar in many ways to r&b recordings by Sam Cooke, Jackie Wilson and Little Willie John. Prater was the lead vocalist on most of these singles, with Moore singing harmony and alternate verses.\n\nIn summer 1964, Stone introduced the duo to Atlantic Records' Jerry Wexler, who signed them to Atlantic.[4] Wexler asked Memphis, Tennessee-based Stax Records, which Atlantic distributed nationally, to work with Sam & Dave. Wexler wanted the Southern roots and gospel style of their live performances, so the pair were loaned to Stax to record, although they remained Atlantic Records artists. According to Wexler's autobiography Rhythms & Blues, \"Their live act was filled with animation, harmony and seeming goodwill. I put Sam in the sweet tradition of Sam Cooke or Solomon Burke, while Dave had an ominous Four Tops' Levi Stubbs-sounding voice, the preacher promising hellfire.\"\n[edit] The Stax years (1965–1968)\n[edit] Arrival at Stax and early Stax singles\n\nWhen Sam & Dave arrived at Stax, they worked with producer & engineer Jim Stewart and songwriters including the MGs' guitarist Steve Cropper, who wrote or co-wrote four of their first eight recordings. The duo then moved to relative newcomer writers and producers Isaac Hayes and David Porter. Hayes and Porter wrote and produced the duo's biggest hits (although they did not receive production credits until the Soul Men LP and singles). According to Moore and Prater, they also greatly influenced the duo's singing style,[5] and had them shift their recording style from the style of their Roulette records to a more live, more energetic gospel, call-and-response feel and beat driven soul style the group is known for today.\n\nSam & Dave's Stax records also benefited from the musicians and engineering at Stax. The Stax house band, Booker T. & the M.G.'s, and the Stax horn section, the Mar-Keys had world-class musicians who co-wrote (often without credit) and contributed to recordings—the same musicians who recorded with Otis Redding, Wilson Pickett, Carla Thomas and other soul artists. Sam & Dave's Stax recordings through 1967 were engineered by Stax founder Jim Stewart, who created the Memphis Sound by recording live in a single take. Stewart is credited for instrumental mixes that allowed for instrumental separation and the distinct contribution of each instrument to the overall feel of the song. Hayes and Porter are in the Songwriters Hall of Fame, The Mar-Keys are in the Musicians Hall of Fame, and Booker T. & the MG's, Jim Stewart, Isaac Hayes and Sam & Dave are all in the Rock & Roll Hall of Fame.\n\nWhile the first two Stax singles failed to chart, the third, the Hayes/Porter composition (with similarities, including the title, to a gospel standard) \"You Don't Know Like I Know\" hit #7 R&B in 1966. This was the first of 10 consecutive Top Twenty R&B chart hits over three years, and 14 R&B chart appearances during their career.\n[edit] \"Hold On, I'm A-Comin'\" single and Hold On I'm Comin' LP\n\n\"Hold On, I'm A-Comin\" (R&B#1/Pop#21), released in March 1966, was a monster R&B hit for Sam & Dave, and also their first single to break into the Top 40 Pop charts. The song was named the #1 song of the year for 1966 by the Billboard R&B charts, and spent 20 weeks on the R&B charts in 1966, peaking at #1 in June. In 1988, Rolling Stone named it one of the best 100 songs of the past 25 years. \"Hold On, I'm A-Comin'\" received a belated RIAA gold record for one million sales in 1995, 29 years after its release.[6] \"Hold On, I'm Comin'\" has since been recorded by over 28 other artists.\n\n\"Hold On, I'm Comin\" was also the first recording on which Moore took lead on the first verse and the deeper, rougher voiced Prater was given the response role and second verse at Hayes and Porter's suggestion. The duo used this format, or singing dual leads, on most of their songs. The song was created when Hayes called to Porter, who was in the bathroom. Porter supposedly said \"Hold on, man, I'm comin'\", and Hayes and Porter had the song written in 10 minutes.[6] \"Hold On, I'm Comin'\", when released, received objections from radio stations over the suggestive title. This resulted in a name change by Stewart and quick re-recording and re-release, and nearly all the original U.S. copies of the single bear the title \"Hold On, I'm A-Comin'\".\n\nThe LP Hold On, I'm Comin' (4/66) reached #1 during 19 weeks on the R&B album charts in 1966. After Sam & Dave's chart success, Roulette quickly released the album Sam & Dave in 1966 as well, a collection of the A & B sides of their six Roulette 45s, which did not chart.\n[edit] When Something is Wrong, Double Dynamite LP and singles\n\nSam & Dave's next huge R&B hit was \"When Something is Wrong With My Baby\", their only ballad single, which was released in January 1967. Stax author Rob Bowman called this \"One of the most sublime records in soul music's history\", and Mar-Keys trumpet player Wayne Jackson called it the greatest song he has ever heard. This was the only Sam & Dave hit where Dave sang the first verse solo; their other hits started with Sam & Dave together or Sam singing the first verse. \"When Something is Wrong With My Baby\" has since become an often recorded and performed duet for male and female singers performing together.\n\nIn the later part of 1966, Sam & Dave also charted with the top 10 R&B hits \"Said I Wasn't Gonna Tell Nobody\", and \"You Got Me Hummin\". These three singles, along with other tracks, were compiled on Double Dynamite (12/66), Sam & Dave's second LP on Stax. The LP peaked at #7 R&B and #118 Pop.\n[edit] \"Soul Man\" single and Soul Men LP\n\nSam and Dave's biggest hit and best remembered song, \"Soul Man\"(R&B #1/Pop #2), was released in August 1967. It was the number #1 song in the US according to Cashbox magazine Pop charts in November 1967. Sam & Dave won the Grammy Award in 1967 for \"Best Performance - Rhythm & Blues Group\" for \"Soul Man\", their first gold record. \"Soul Man\" was voted into the Grammy Hall of Fame in 1999. The song helped popularize the term to describe the emerging music genre \"Soul Music\" that would be so popular in the late 1960s. According to co-writer Isaac Hayes, the title was inspired by news reports of soul pride that emerged after the 1967 race riots, where stories that painting the word \"soul\" on your door was a message for looters to bypass your house. Hayes-Porter extrapolated that to \"I'm a soul brother, I'm a soul man.\". It has been recognized as one of the best or most influential songs of 50 years by the Grammy Hall of Fame, The Rock & Roll Hall of Fame, Rolling Stone, and R.I.A.A. Songs of the Century. \"Soul Man\" was used as the soundtrack and title for a 1986 film, a 2008 film Soul Men, a 1997–1998 television series.\n\nThe Soul Men LP (October 1967) was Sam & Dave's third Stax LP, reaching #5 on the R&B charts and #68 Pop.[7] Musicologist Rob Bowman called Soul Men One of the greatest soul music albums of all time.\" \"Don't Knock It\" from the LP was released as a single in France, but other songs were not released as U.S. singles due to the long run by \"Soul Man\" on the Pop charts (15 weeks), by which time \"I Thank You/Wrap it Up\" was ready for release. \"May I Baby\", the b-side of \"Soul Man\", is also regarded as a classic non-hot 100 song on the LP by Whitburn's \"Top Pop Singles\" guide, and was a popular live song performed frequently by Sam & Dave.\n[edit] \"I Thank You\" single and I Thank You LP\n\nThe first single for Sam & Dave in 1968 was \"I Thank You/Wrap it Up\" (R&B #4/Pop #9). It is one of many gospel-inspired tunes and was a hit on both charts. Critics commented that the B side \"Wrap it Up\" could have been a separate successful single, which it later became for The Fabulous Thunderbirds. Sam & Dave were so busy touring at this point that Hayes & Porter travelled to Europe where Sam & Dave were touring to record the vocal track on \"Wrap it Up\" so they could release the single. Due to the end of the distribution agreement between Stax and Atlantic Records in May 1968, \"I Thank You\" was Sam and Dave's final single on Stax. Although they continued to work at Stax with Hayes/Porter, as of May 1968, the duo's work was released on Atlantic Records. \"I Thank You\" sold over one million copies, and was another to earn gold disc status.[8]\n\nSam and Dave's first 1968 single for Atlantic was \"You Don't Know What You Mean To Me\", written by Eddie Floyd and Steve Cropper. Sam and Dave said it was their favorite of their songs,[9] and the single charted #48 Pop and #19 R&B. Sam & Dave also released \"Can't You Find Another Way (of Doing It)\" which charted at #54 Pop and #20 R&B, but which was not included in the I Thank You LP. Their final single of 1968, \"Everybody Got To Believe In Somebody\", charted in the lower levels of the pop charts and ended Sam and Dave's streak at ten straight R&B top 20 singles.\n\nThough on Atlantic, the I Thank You LP (10/68) included 1968 singles initially on both Stax and Atlantic. The LP peaked at #38 on the R&B charts, and was the only LP of their Stax recordings not to chart on the Pop LP charts.[10]\n[edit] Sam & Dave's live performances\n\nSam & Dave's live act earned them the nickname \"Double Dynamite\". Phil Walden, Otis Redding's manager, said \"I think Sam and Dave will probably stand the test of time as being the best live act that there ever was. Those guys were absolutely unbelievable. Every night they were awesome.\" An October 1968 Time article reads: \"Of all the R & B cats, nobody steams up a place like Sam & Dave ... weaving and dancing (while singing!), they gyrate through enough acrobatics to wear out more than 100 costumes per year.\" Jerri Hershey described in Nowhere to Run: They carried red suits, white suits, three piece lime green suits, all with matching patent boots and coordinated silk hankies woefully inadequate to absorb a soul man's nightly outpourings. Both Sam & Dave talk a lot about sweat. To Dave, its proof that he's worked for his pay. For Sam its essential, almost mystical. He says he can't work without it. \"Unless my body reaches a certain temperature, starts to liquefy, I just don't feel right without it.\" Wayne Jackson said Sam & Dave left puddles of sweat onstage by the end of a performance.\n\nIn March 1967, Sam and Dave were co-headliners for the Stax/Volt Revue in Europe, which included Booker T & the MGs, The Mar-Keys, Eddie Floyd, Carla Thomas, Arthur Conley and headliner Otis Redding. For Sam & Dave, it was their first time in Europe, largely to all-white audiences, sometimes up to 2,000 people.[11] Although Redding headlined the tour, many agreed Sam & Dave stole the show on many nights. According to Redding's and Sam & Dave's manager Phil Walden, Redding refused to be booked on the same bill with Sam & Dave again, not wanting to have to follow their explosive act. A live version of Sam and Dave's Double Dynamite LP track \"Soothe Me\" was recorded in Paris during the '67 tour. Released as a single in mid-1967, it continued Sam & Dave's string of top 20 U.S. R&B hits and was their first in the UK Top 40.\n\nAfter the tour, Sam & Dave worked as headliners in the U.S. and in Europe in during the Fall of 1967, Fall 1968 and January 1970, and in Japan in 1969 and 1970. Their band grew to 16 pieces and a 35-person entourage with a plane and bus, and they continued to be in demand even as record sales began to drop in late 1969 and 1970. They were doing an average 280 shows per year from 1967 through 1969 and in 1967 only took ten days off for the year. Other high points included headlining the Montreal World's Fair in 1967, performing at the tribute to Martin Luther King, Jr at Madison Square Garden in June 1968, being the first black Soul act to headline the Fillmore East in December 1968, and headlining the Texas International Pop Festival for two nights in August 1969. Sam & Dave also performed on U.S. and European television, including two appearances on The Ed Sullivan Show in 1969, appearing on The Tonight Show and American Bandstand in 1967, and performing on The Mike Douglas Show in 1969 and 1970. Moore frequently recalls the Sullivan Show performances as a career highlight.\n[edit] The Atlantic Records years (1968–1972)\n[edit] Best of LP, Stax recorded singles (1969)\n\nThe year 1969 started well, with the Atlantic release of The Best of Sam & Dave LP in January. It contained all their Stax A sides except \"A Place Nobody Can Find\" and several B-sides, and peaked at #24 on the R&B LP charts and #89 on the Billboard LP charts.[12] Their first single of the year, \"Soul Sister, Brown Sugar\", returned Sam and Dave to the R&B top 20, and was a #15 hit in the UK.[13] The follow-up \"Born Again\", reached the lower levels of the charts, and was the last single Sam and Dave recorded at Stax.\n[edit] Atlantic produced records, first break-up, and reunion (1969–1972)\n\nJerry Wexler with co-producer Tom Dowd tried producing Sam & Dave in New York, with Atlantic songwriters and musicians. It took eight months to issue the first Atlantic single in August 1969, \"Ooh, Ooh, Ooh\", a long time in that era. It was not a very good record, by Sam's own admission, and the first time in four years that a Sam & Dave single failed to chart.\n\nTwo more singles followed in 1970, \"Baby, Baby, Don't Stop Now\", and \"One Part Love, Two Parts Pain\". The first was a leftover Hayes-Porter recording from Stax; the second was produced by Wexler and Dowd in New York, and was written by Stax executive Al Bell and Allen Jones. Both failed to hit the US R&B charts or the Hot 100. According to Wexler, \"We just made some shit-ass records with them. I never really got into their sensibilities as a producer\".[14] Wexler then sent the duo south to Muscle Shoals and Miami to work with producers Brad Shapiro and Dave Crawford for their next single \"Knock It Out The Park\", which failed to chart.\n\nSam & Dave split up in June 1970, according to Moore[15] as a result of Moore's dissatisfaction with the duo and his desire to pursue a career solo. According to Prater, they broke up because \"[Moore] decided to do what he wanted to do on his own.\" Moore recorded three solo singles (none of which charted) for Atlantic over the next year and was preparing an album produced by King Curtis, which was shelved after Curtis was stabbed to death in 1971. Prater recorded a single for Alston. Neither was commercially successful as a solo act, and they reunited in August 1971.\n\nIn October 1971, their last Atlantic single, \"Don't Pull Your Love\", was a cover of a hit by Hamilton, Joe Frank & Reynolds. This Shapiro/Crawford production was a minor hit (R&B #36/Pop #102), but not a substantial enough commercial success to keep the duo signed to the label. Sam & Dave made their final Atlantic recordings in August 1972, four songs never released by the label. Their contract with Atlantic expired shortly thereafter.\n[edit] Later years (1972–1981)\n\nDespite inability to attract a major label after Atlantic, there was still demand for public performances, especially in Europe.[16] They toured Turkey in Spring 1972 and England in Spring 1973. Sam & Dave also continued to be visible in the U.S., performing on TV shows including The Midnight Special and The Mike Douglas Show. According to Sam, most U.S. shows in the 70s were small clubs, oldies shows, and whatever they could get. Sam & Dave's poor relationship with each other and rumours of drug use at this point were well known within the music industry and contributed to the limited ability to get high quality bookings, also, according to Sam. According to Jerri Hirshey, who saw them many times in the 1970s, their shows could range anywhere from incredible, to horrible.\n\nSam and Dave returned to the studio in 1974-5, recording an album of new songs titled Back at Cha for United Artists. The album – their first album of new material in 7 years – was produced by Steve Cropper, and featured the MGs and The Memphis Horns and had a minor R&B single, \"A Little Bit of Good\" (R&B #89). Songwriters included Cropper, Allen Toussaint, and Jimmy Cliff.[17] Although the LP received positive reviews, it failed to chart. In a side project, they provided vocals on \"Come On, Come Over\" for Jaco Pastorius for his debut album on Epic in 1976.\n\nIn 1976-77, Sam & Dave recorded songs in the UK with producer John Abbey. Two singles were released on Abbey's Contempo label in the UK and Germany, with limited success. Ironically, given the duo's disputes, one of the last singles by Sam & Dave was a cover of The Beatles \"We Can Work It Out\". Sam & Dave also briefly retired in 1977, with Dave working at a Pontiac dealership in New Jersey and Sam working at an Austin, Texas, law firm as a process server.\n\nIn 1978, Sam & Dave re-recorded old hits for the LP \"Sweet & Funky Gold\" (Gusto), and re-recorded songs and other soul hits during this period in Nashville for an album for K-Tel Records, The Original Soul Man.[18] In Summer 1978, they toured Germany for two weeks.\n\nIn 1979, Sam & Dave enjoyed a significant resurgence of interest as a result of Dan Aykroyd's and John Belushi's sketch characters in the cult film The Blues Brothers, and The Blues Brothers' 1979 top 40 cover of \"Soul Man\". Moore stated they were offered an opportunity to perform onstage with Belushi and Aykroyd on SNL, but turned it down when Belushi said Sam & Dave had to perform the intro, then the Blues Brothers would take over. The Blues Brothers' personas and stage act were influenced by Sam & Dave, according to an April 1988 interview with Aykroyd in the Chicago Sun-Times. Aykroyd saw Sam & Dave as a teenager at the Montreal Expo in 1967, and said they were one of his biggest influences. Aykroyd got director John Landis to include the Jake and Elwood Blues characters listening to \"Hold On, I'm Comin'\" and \"Soothe Me\" while riding in the Bluesmobile during the film as a tribute to Sam & Dave.\n\nAlso in 1979, Sam and Dave opened shows for The Clash on their U.S. tour, including at the Palladium in New York City. In 1980, the duo performed in Paul Simon's film One Trick Pony and on Saturday Night Live. In 1980, they also were featured in a U.S. tour opening for the 50s band Sha Na Na.\n\nIn 1981, they re-recorded many hits along with Sam Cooke and Otis Redding covers for LPs titled Soul Study Vol. 1 and Soul Study Vol. 2 (Odyssey). The pair last performed on New Year's Eve, 1981, at the Old Waldorf in San Francisco. According to Moore, when they walked off stage it was the last time they spoke to each other.[19]\n[edit] Dave Prater and Sam Daniels (1982–1988)\n\nIn 1982, Prater started touring under the \"Sam & Dave\" name or as \"The New Sam & Dave Revue\" with Sam Daniels, who performed with Dave from October 1982 until Dave's death in 1988. Moore attempted to block Prater from using the group's name,[20] but was largely unsuccessful. The Daniels & Prater incarnation played 100 shows per year over the next seven years, including in Europe, Japan and Canada.\n\nIn 1985, Prater and Sam Daniels released a newly-sung medley of Sam & Dave hits recorded in The Netherlands, which peaked at #92 R&B and was credited to \"Sam & Dave\". Sam Moore got the record company to recall the single for using the \"Sam & Dave\" name without permission, and the record was re-labelled and re-issued by \"The New Sam & Dave Revue\".[21]\n\nPrater had his last performance with Sam Daniels on April 3, 1988 at a Stax Reunion at the Atlanta Civic Center which also featured Isaac Hayes, Eddie Floyd, and Rufus and Carla Thomas. Six days later, on April 9, 1988, Prater died in a car crash in Sycamore, Georgia, while driving to his mother's house.\n\nSee more details on his career under his Dave Prater Wikipedia bio.\n[edit] Sam Moore solo career (1982-present)\n\nMoore has continued to perform and record as a solo artist, and has also performed in numerous duets with other popular artists. (See the Sam Moore article.)\n[edit] Conflict between Moore and Prater\n\nSam & Dave were also famous for having a very tumultuous partnership during most of their 21 years together. According to Moore, they did not speak to each other offstage for almost 13 years. During the 1970s, they broke up many times, and would typically show up separately for shows, require separate dressing rooms, not look at each other onstage, and communicate through intermediaries.[22] They also had performances in the 1970s where only one of them would show up. Moore describes personal issues with Prater, drug use, touring fatigue, and a desire to do his own act with new material as contributing to their break-up.[15] Prater attributed their rift and break-ups to Moore's frustrations in wanting to do his own act and diversify from having to perform the Sam & Dave song catalogue (which Moore has often stated that he does not like very much) over and over.[3]\n[edit] Covers by other artists/use in pop culture\n\nSam & Dave songs have been recorded by other artists, including 29 covers of \"Hold On, I'm Comin'\". Others who charted with Sam & Dave songs include ZZ Top -\"I Thank You\", The Fabulous Thunderbirds -\"Wrap It Up\", James & Bobby Purify -\"I Take What I Want\", Linda Ronstadt featuring Aaron Neville -\"When Something is Wrong with my Baby\", Chuck Jackson & Maxine Brown -\"Hold On, I'm Comin'\", and Lydia Pense & Cold Blood -\"I Take What I Want\". A diverse group of other successful artists also recorded Sam & Dave covers including: Aretha Franklin, Elvis Costello, Peter Frampton, The Temptations, Bonnie Raitt, Jackie Wilson, The Eurythmics, Rory Gallagher, Tom Jones, The Band, Martha Reeves & the Vandellas, Michael Bolton, Patti LaBelle & Travis Tritt, Bryan Ferry, Marilyn McCoo & Billy Davis Jr., The Hollies, Paul Butterfield, Taj Majal, Guy Sebastian, and Eric Clapton & B.B. King.[23]\n\nIn 2003, the Stax Museum of American Soul Music opened in Memphis and Sam & Dave are in the film made for the Museum, titled Soulsville, and have a permanent wall and video display.\n\nBarack Obama used \"Hold On, I'm Comin'\" as a theme song on the campaign trail, until Sam Moore requesting he stop using it. 11 months later Sam Moore performed \"Soul Man\" with Sting and Elvis Costello at one of Obama's inaugural parties. A parody of \"Soul Man\" created by Moore, \"I'm a Dole Man\", was used in the 1996 Bob Dole presidential campaign until the copyright owners objected and requested the campaign stop using it. Sam & Dave released the rare single \"Hold on, Edwin's Coming\" in 1982 to support Louisiana Governor Edwin Edwards' third run for Governor. Another parody, \"I'm a Suns Fan\", was recorded by Moore and used for the Phoenix Suns basketball games.\n\nSam & Dave songs have been frequently used in movie & TV soundtracks and commercials, including \"Hold On, I'm Comin'\" on the soundtrack of the 2007 hit film American Gangster. \"Hold On, I'm Comin'\" and \"Soothe Me\" played on the radio in the Bluesmobile during the 1980 hit movie and cult classic, The Blues Brothers. Jay Leno used \"Hold on I'm Comin\" while driving his AC Cobra on his 2009 Super Bowl commercial to announce his show's move to 10pm. \"Wrap it Up\" is used as a transition to commercial break for The O'Reilly Factor. \"Soul Man\" was used as the title and title track in the 1986 movie featuring C. Thomas Howell, and also the 1997–1998 television series featuring Dan Aykroyd. The movie Tapeheads, released in 1988 and starring John Cusack and Tim Robbins, featured Sam Moore and Junior Walker as a fictitious, legendary soul duo called \"The Swanky Modes\". The movie Soul Men, released in November 2008, was a comedy featuring Bernie Mac and Samuel L. Jackson as two feuding soul singers called \"The Real Deal\". In February 2009, Moore filed suit against the film production company and the producers for infringing on the marks Soul Man and Soul Men, claiming the movie is based on the careers of Sam & Dave, and damaged both Moore's reputation and career.\n[edit] Discography\n[edit] Studio albums\n\n    * 1966: Hold On, I'm Comin' (Stax 708) (POP #45, R&B #1)\n    * 1966: Double Dynamite (Stax 712) (POP #118, R&B #7)\n    * 1967: Soul Men (Stax 725) (POP #2, R&B #5)\n    * 1968: I Thank You (Atlantic 8205) (R&B #38)\n    * 1975: Back At Cha (United Artists LA524-G)\n\n[edit] Greatest hits/compilation albums\n\n    * 1966: Sam & Dave (Roulette-Roulette singles compilation)\n    * 1969: The Best of Sam & Dave (Atlantic 8218-Stax/Atlantic singles) Pop #87/R&B #24\n    * 1969: Double Golden Album(Nippon Grammaphone/Atlantic, Japan-Stax/Atlantic Singles)\n    * 1978: Sweet & Funky Gold (Gusto, re-recordings of hits)\n    * 1982: Soul Study Volume 1 (Odyssey, re-recordings of hits+new covers)\n    * 1982: Soul Study Volume 2 (Odyssey, re-recordings of hits+new covers)\n    * 1982: La Grande Storia Del Rock 66(GSR, Italy, KTEL recordings from 1977–1978, new covers of S&D songs and covers of other soul classics)\n    * 1984: I Can't Stand Up for Falling Down(Edsel ED 133 UK: Atlantic & Stax singles not previously released on Sam & Dave LP's)\n    * 1987: Sweet Soul Music (Topline UK, KTEL recordings 1977-78, new covers of S&D songs and covers of other soul classics)\n    * Soul Sister, Brown Sugar (Atlantic, Japan compilation LP of Stax/Atlantic releases)\n\n[edit] Singles\nRelease date \tTitle \tLabel & Cat no. \tChart positions\nUS Hot 100 \tUS R&B \tUK\n1962 \t\"I Need Love\"\n(Sam Moore/Dave Prater) \tMarlin 6100 \t\t\t\n1962 \t\"No More Pain\"\n(Steve Alaimo) \tMarlin 6104 \t\t\t\n1962 \t\"I Need Love\"\n(Sam Moore/Dave Prater) \tRoulette 4419 \t\t\t\n1962 \t\"No More Pain\"\n(Steve Alaimo) \tRoulette 4445 \t\t\t\n1963 \t\"She's Alright\"\n(Henry Glover/Morris Levy/Mayme Watts) \tRoulette 4461 \t\t\t\n1963 \t\"It Was So Nice While It Lasted\"\n(Bill Nash) \tRoulette 4480 \t\t\t\n1963 \t\"If She'll Still Have Me\"\n(Roberts/Taylor) \tRoulette 4508 \t\t\t\n1964 \t\"I Found Out\"\n(Alaimo) \tRoulette 4533 \t\t\t\n1964 \t\"I'll Never, Never\"\n(Henry Stone) \tAlston 777 \t\t\t\n1965 \t\"A Place Nobody Can Find\"\n(David Porter) \tStax 168 \t\t\t\n1965 \t\"I Take What I Want\"\n(Isaac Hayes/Mabon Hodges/David Porter) \tStax 175 \t\t\t\n1965 \t\"You Don't Know Like I Know\"\n(Hayes/Porter) \tStax 180 \t90 \t7 \t\n1966 \t\"Hold On, I'm Comin'\"\n(Hayes/Porter) \tStax 189 \t21 \t1 \t\n1966 \t\"Said I Wasn't Gonna Tell Nobody\"\n(Hayes/Porter) \tStax 198 \t64 \t8 \t\n1967 \t\"You Got Me Hummin'\"\n(Hayes/Porter) \tStax 204 \t77 \t7 \t\n1967 \t\"When Something is Wrong with My Baby\"\n(Hayes/Porter) \tStax 210 \t42 \t2 \t\n1967 \t\"Soothe Me\" (Live)\n(Sam Cooke) \tStax 218 \t56 \t16 \t35\n1967 \t\"Soul Man\"\n(Hayes/Porter) \tStax 231 \t2 \t1 \t24\n1968 \t\"I Thank You\"\n(Hayes/Porter) \tStax 242 \t9 \t4 \t34\n1968 \t\"Don't Knock It\"\n(Hayes/Porter)\nEurope only \tStax 169 016 \t\t\t\n1968 \t\"You Don't Know What You Mean to Me\"\n(Eddie Floyd/Steve Cropper) \tAtlantic 2517 \t48 \t20 \t\n1968 \t\"Can't You Find Another Way\"\n(Homer Banks/Raymond Jackson) \tAtlantic 2540 \t54 \t19 \t\n1968 \t\"Everybody Got to Believe in Somebody\"\n(Hayes/Porter) \tAtlantic 2568 \t73 \t\t\n1969 \t\"Soul Sister Brown Sugar\"\n(Hayes/Porter) \tAtlantic 2590 \t41 \t18 \t15\n1969 \t\"Born Again\"\n(Hayes/Porter) \tAtlantic 2608 \t92 \t27 \t\n1969 \t\"Ooh Ooh Ooh\"\n(Donnie Fritts/John Reid) \tAtlantic 2668 \t\t\t\n1970 \t\"Baby Baby Don't Stop Now\"\n(Hayes/Porter) \tAtlantic 2714 \t117 \t\t\n1970 \t\"One Part Love, Two Parts Pain\"\n(Alvertis Isbell/Allen Jones) \tAtlantic 2728 \t123 \t\t\n1970 \t\"Knock It Out the Park\"\n(Dave Crawford/Willie Martin) \tAtlantic 2733 \t\t\t\n1971 \t\"Don't Pull Your Love\"\n(Dennis Lambert/Brian Potter) \tAtlantic 2839 \t102 \t36 \t\n1974 \t\"A Little Bit of Good (Cures a Whole Lot of Bad)\" \tUnited Artists 438 \t\t89 \t\n1974 \t\"Under the Boardwalk\"\n(Kenny Young/Arthur Resnick) \tUnited Artists 531 \t\t\t\n1977 \t\"We Can Work It Out\"\n(John Lennon/Paul McCartney) \tContempo 7004 \t\t\t\n1977 \t\"Why Did You Do It\"\n(Kirby)\nUK/Europe only \tContempo 2109 \t\t\t\n[edit] Appearances on other albums\n\n    * 1967: The Stax/Volt Revue Volume 1-Live in London (three Sam & Dave tracks, four on UK version)\n    * 1967: The Stax/Volt Revue Volume 2-Live in Paris (three Sam & Dave tracks)\n    * 1967: Stay in School, Don't Be A Dropout (Stax, Promo LP, 1 Sam & Dave track plus a PSA)\n    * 1976: Jaco Pastorius (Jaco Pastorius album, Sam & Dave vocals on \"Come On, Come Over\")\n    * 1977: Soul Express (released in Germany by Contempo UK, two Sam & Dave tracks)\n    * 1978: Soul Deep Vol 2 (released in Germany by Contempo UK, 1 track \"Living It Down\" only known release of this track)\n    * Hold On Im Coming (Spice Records-Belgium, contains 5 of the 6 known tracks from the Contempo recording sessions)\n\n[edit] CD and DVD collections\n\n    * 1987: The Best of Sam & Dave (Atlantic) 21 tracks on one CD\n    * 1990: An Anthology of Sam & Dave (Atlantic-Canada) 33 tracks, including extensive bio insert by Rob Bowman. Out of Print.\n    * 1991: Sweat & Soul (Rhino CD) 50 tracks, including four previously unreleased tracks and extensive booklet on the duo. Out of Print.\n    * 2006: Sam & Dave: The Definitive Soul Collection (Rhino CD) 30 tracks, digitally remastered.\n    * 2007: The 1967 Stax/Volt Revue-Norway (DVD Reelin in the Years) Four live tracks from spring 67 tour performing with Booker T. & The MG's and the Mar-Keys. Interviews with Sam Moore & others..\n    * 2008: The Original Soul Men: Sam & Dave (DVD) 21 Sam & Dave tracks, including 17 live tracks from 1966-1980 and interview with Sam Moore and others\n\nNote: The original Stax and Atlantic albums are also available on CD(Rhino)\n[edit] Other issues\n\n    * 1982: \"Hold On, Edwin's Coming\" (Guv-nor Records) Single for Louisiana Governor Edwin Edwards' third election campaign.\n    * 1985: The New Sam & Dave Review: A:\"Medley-Hold On Im Comin-You Dont Know-Soul Man-I Thank You Soul Sister, Brown Sugar/B:Hold On\" Atlantic 7-99636 (with Sam Daniels & Dave Prater). R&B #92\n\n[edit] References\n\n   1. ^ An Anthology of Sam & Dave-The Stax Years CD liner notes page 1 Rob Bowman\n   2. ^ Sam & Dave-An Oral History Moore & Marsh, Avon Books 1998 pp 24-25,27-28\n   3. ^ a b Interview with Dave Prater and Dave Booth cover of 1984 I Can't Stand Up for Falling Down LP\n   4. ^ Soulville, Bowman pp 66-69\n   5. ^ Soulsville, Bowman pp 67-69\n   6. ^ a b Soulville Bowman pp 91-92\n   7. ^ Billboard.com list of chart placements\n   8. ^ Murrells, Joseph (1978). The Book of Golden Discs (2nd ed.). London: Barrie and Jenkins Ltd. p. 247. ISBN 0-214-20512-6. \n   9. ^ Blitz magazine - July 1978, p8\n  10. ^ Soulsville, Bowman pp 138\n  11. ^ In My Wildest Dreams, Wayne Jackson, Pub. By Wayne & Amy Jackson 2005 pp 108–134\n  12. ^ Billboard Charts Online\n  13. ^ database of UK chart singles:www.everyhit.com\n  14. ^ Soulsville, Bowman pp 140\n  15. ^ a b Interview with Blues and Soul magazine (July 17-30, 1970) and later interviews\n  16. ^ Blues and Soul August 6–19 1971 pp 6\n  17. ^ All Music Guide To Soul ed Boganov/Bush/Woodstra/Erlewine 2003 Backbeat Books pp 598\n  18. ^ Sam & Dave-An Oral History pp 130\n  19. ^ Sam & Dave-An Oral History pp 118\n  20. ^ San Diego Union Tribune 9/25/85 \"Singer Finds Sour Note in New Duo's Name\" PP B1\n  21. ^ Congressional Testimony 5/21/1998 \"Protection Against Artistic Knock-Off's:Sam Moore\"\n  22. ^ Jeri Hirshey from book Nowhere to Run\n  23. ^ www.secondhandsongs.com under Sam & Dave\n\n[edit] External links\n\n    * http://www.melingo.com/thesoulnet/samndave.htm Includes realaudio songs by Sam & Dave\n    * Hold on Im Comin' performance from Stax/Volt 67 Tour\n    * http://www.history-of-rock.com/sam_and_dave.htm\n    * http://www.classicbands.com/samdave.html\n    * http://www.geocities.com/shakin_stacks/daveprater.txt\n    * http://www.rockhall.com/hof/inductee.asp?id=183\n    * Youtube video\n    * http://jpp-product.club.fr/sp_-_sam_&_dave.htm\n    * http://www.sammoore.net/ Sam Moore's website, with videos, bio, tour schedule, press and news\n\n[hide]\nv • d • e\nStax/Volt Records\nMajor figures \t\nJim Stewart · Estelle Axton · Al Bell · Steve Cropper · Booker T. Jones · Donald \"Duck\" Dunn · Al Jackson, Jr. · Isaac Hayes · David Porter · Jerry Wexler · Clive Davis\nMajor artists\n(Atlantic years) \t\nOtis Redding · Sam & Dave · Carla Thomas · Rufus Thomas · The Mar-Keys · Booker T. & The MG's · William Bell · Eddie Floyd · Johnnie Taylor · Albert King · The Bar-Kays\nMajor artists\n(Post-Atlantic) \t\nIsaac Hayes · David Porter · Eddie Floyd · Johnnie Taylor · The Rance Allen Group · The Soul Children · The Staple Singers · The Temprees · The Emotions · Mel & Tim · The Bar-Kays · Linda Lyndell · Richard Pryor · Bill Cosby · William Bell · Little Milton · Jesse Jackson · Big Star\nModern Stax artists \t\nSoulive · Angie Stone · Lalah Hathaway · Leela James · Isaac Hayes  · Leon Ware · N'dambi · Nikka Costa · Teena Marie\nRelated articles \t\nMemphis soul · Wattstax · Stax Museum of American Soul Music · Atlantic Records · Union Planters Bank · CBS Records · Fantasy Records · Concord Records <a href=\"https://www.last.fm/music/Sam+&+Dave\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T16:57:33.375115",
  "discogs_id": "73921",
  "discogs_url": "https://www.discogs.com/artist/73921-Sam-Dave",
  "followers": 362720,
  "formed_date": null,
  "genres": [
    "R&B/Soul",
    "motown",
    "soul",
    "classic soul",
    "rhythm and blues",
    "60s",
    "funk",
    "rnb"
  ],
  "id": "sam-&-dave-1751731055",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/1d/b9/37/1db937fe-f5d3-b560-7886-b72420c812c8/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 1160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/b1f68bdefbe49b474c9aac457114aac70d06f880",
      "width": 1000
    },
    {
      "height": 742,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/a3cefb27c2aad573e4dae048effaa9cae6af7268",
      "width": 640
    },
    {
      "height": 232,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/4b3c227ca32325f7d12ef75db8f5a6e5222be441",
      "width": 200
    },
    {
      "height": 74,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/9728f51f16176cec402b5022073f5e120a9cd220",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/kJzA2uXgrI4hCUw9_8kq2paiOdw4Lr-LAjWcVmU76ms/rs:fit/g:sm/q:90/h:460/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/Pl4rZNxNR62fjleNfbqxiXAT4xlbk5oGY1tSDhT2VT8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "f1d7f1fd-8883-47e9-ad2b-e9ec9ff61aac",
  "lastfm_url": "https://www.last.fm/music/Sam+&+Dave",
  "local_images": {
    "hi-res": "../public/artist/sam-dave/sam-dave-hi-res.jpg",
    "medium": "../public/artist/sam-dave/sam-dave-medium.jpg",
    "small": "../public/artist/sam-dave/sam-dave-small.jpg"
  },
  "name": "Sam & Dave",
  "popularity": 60,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/1d/b9/37/1db937fe-f5d3-b560-7886-b72420c812c8/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "R&B/Soul"
      ],
      "id": "721242",
      "name": "Sam & Dave",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/sam-dave/721242"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/kJzA2uXgrI4hCUw9_8kq2paiOdw4Lr-LAjWcVmU76ms/rs:fit/g:sm/q:90/h:460/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "73921",
      "images": [
        {
          "height": 460,
          "resource_url": "https://i.discogs.com/kJzA2uXgrI4hCUw9_8kq2paiOdw4Lr-LAjWcVmU76ms/rs:fit/g:sm/q:90/h:460/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/kJzA2uXgrI4hCUw9_8kq2paiOdw4Lr-LAjWcVmU76ms/rs:fit/g:sm/q:90/h:460/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
          "uri150": "https://i.discogs.com/Pl4rZNxNR62fjleNfbqxiXAT4xlbk5oGY1tSDhT2VT8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
          "width": 460
        },
        {
          "height": 541,
          "resource_url": "https://i.discogs.com/Za5ZrVnVqTkp_H8bOsXjGGc5nGL-lnUQeJRjSvWGJO8/rs:fit/g:sm/q:90/h:541/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzYt/MjI1Ny5wbmc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Za5ZrVnVqTkp_H8bOsXjGGc5nGL-lnUQeJRjSvWGJO8/rs:fit/g:sm/q:90/h:541/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzYt/MjI1Ny5wbmc.jpeg",
          "uri150": "https://i.discogs.com/BbaRxqHqMV4VE867hA4uI5U40KlKXJyCO1joEn-xvik/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzYt/MjI1Ny5wbmc.jpeg",
          "width": 600
        },
        {
          "height": 738,
          "resource_url": "https://i.discogs.com/SMRUZ3QVH_8w-8AB94btraxY-w2NXVZUng7ffvdGUqI/rs:fit/g:sm/q:90/h:738/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/ODA3NS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/SMRUZ3QVH_8w-8AB94btraxY-w2NXVZUng7ffvdGUqI/rs:fit/g:sm/q:90/h:738/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/ODA3NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/bTNXKmMyU1jwS1w4Sp3ymDz0ZwdXYnXNLuIhHu7djv8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/ODA3NS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 739,
          "resource_url": "https://i.discogs.com/Kdq19WYGV0pQqAiUZbTxfBFmgjYUdMfEWtfwK0DlRYs/rs:fit/g:sm/q:90/h:739/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/MjEwNS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Kdq19WYGV0pQqAiUZbTxfBFmgjYUdMfEWtfwK0DlRYs/rs:fit/g:sm/q:90/h:739/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/MjEwNS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/L_o0fSv1RG2pa8pxvOhmOCs7tlDycRdnpzeqcwTXsi0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/MjEwNS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 419,
          "resource_url": "https://i.discogs.com/9DbT2jI_a9kEw0y9cBKE8c0NfChcEjljHdSEc5XvgqQ/rs:fit/g:sm/q:90/h:419/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/MTQxMS5wbmc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/9DbT2jI_a9kEw0y9cBKE8c0NfChcEjljHdSEc5XvgqQ/rs:fit/g:sm/q:90/h:419/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/MTQxMS5wbmc.jpeg",
          "uri150": "https://i.discogs.com/jH42KlVI-35JFN1mh2-_fmmEY7XpMoiA9CUXduZPZSw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/MTQxMS5wbmc.jpeg",
          "width": 450
        },
        {
          "height": 688,
          "resource_url": "https://i.discogs.com/e1ciPuQbRMbydekR7BUpVTNzcpf8YIZcaz0lFAWlGqw/rs:fit/g:sm/q:90/h:688/w:594/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDY5NDI5NDQt/ODMxNi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/e1ciPuQbRMbydekR7BUpVTNzcpf8YIZcaz0lFAWlGqw/rs:fit/g:sm/q:90/h:688/w:594/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDY5NDI5NDQt/ODMxNi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/drcTAmJ868nPebhiDHdsySxU7QdcxWPv3YaqMHL9kz4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDY5NDI5NDQt/ODMxNi5qcGVn.jpeg",
          "width": 594
        },
        {
          "height": 601,
          "resource_url": "https://i.discogs.com/zSpdmUNTro4l_uIhATDrmMlcaw5pWZ8C4XKswf2Xmjs/rs:fit/g:sm/q:90/h:601/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzQt/MTU0Ny5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/zSpdmUNTro4l_uIhATDrmMlcaw5pWZ8C4XKswf2Xmjs/rs:fit/g:sm/q:90/h:601/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzQt/MTU0Ny5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/nxmoLNNVS3sI6JaNy7PBSYTZnKY6S5NyClgJofDQ_VQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzQt/MTU0Ny5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 510,
          "resource_url": "https://i.discogs.com/Tl8mw40wGjlCA46YxguOTvgg3OX9Qz78F763q7sugOQ/rs:fit/g:sm/q:90/h:510/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDU1ODYwNjkt/ODIxMC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Tl8mw40wGjlCA46YxguOTvgg3OX9Qz78F763q7sugOQ/rs:fit/g:sm/q:90/h:510/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDU1ODYwNjkt/ODIxMC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/ZEks6l3mUQSLj62WcqjhmGD7FG-t7wdHIhvVNrAYb3A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDU1ODYwNjkt/ODIxMC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 594,
          "resource_url": "https://i.discogs.com/BjaCUxeVpfejqPikGkwLL7MbqBtyVukQwA-Kl_SPi8g/rs:fit/g:sm/q:90/h:594/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTA1MDQt/Mjg5MS5wbmc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/BjaCUxeVpfejqPikGkwLL7MbqBtyVukQwA-Kl_SPi8g/rs:fit/g:sm/q:90/h:594/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTA1MDQt/Mjg5MS5wbmc.jpeg",
          "uri150": "https://i.discogs.com/hXIFmdi9fffQsvZ6QToKU0jsJeT4spZwRM9OBXxXf-g/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTA1MDQt/Mjg5MS5wbmc.jpeg",
          "width": 600
        }
      ],
      "members": [
        {
          "active": true,
          "id": 260934,
          "name": "David Prater",
          "resource_url": "https://api.discogs.com/artists/260934",
          "thumbnail_url": "https://i.discogs.com/OFvyjdkhFjGeeEwjc2Enn2t3on1vZlSEgkaRSJjBSGI/rs:fit/g:sm/q:40/h:456/w:304/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI2MDkz/NC0xNjg4MzkwNTg3/LTIyMjIucG5n.jpeg"
        },
        {
          "active": true,
          "id": 274401,
          "name": "Sam Moore",
          "resource_url": "https://api.discogs.com/artists/274401",
          "thumbnail_url": "https://i.discogs.com/2NyFwMtYSO1lXl68R3UkM_rC89-h2KjA5xZq5Xbh3ps/rs:fit/g:sm/q:40/h:779/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI3NDQw/MS0xNjg4MzkwMDIx/LTkwMzUuanBlZw.jpeg"
        }
      ],
      "name": "Sam & Dave",
      "namevariations": [
        "Sam 'N' Dave",
        "Sam 'n' Dave",
        "Sam + Dave",
        "Sam / Dave",
        "Sam And Dave",
        "Sam and Dave",
        "Sam&Dave",
        "Sam-Dave",
        "Same & Dave",
        "San & Dave",
        "San And Dave",
        "The New Sam & Dave Revue",
        "サムとデイヴ"
      ],
      "profile": "US soul vocal duo that consisted of [a=Sam Moore] and [a=David Prater]. Formed in 1961 in Miami, Florida, they only enjoyed minor success until the duo was coupled with the songwriting team of [a=Isaac Hayes] and [a=David Porter] in 1965. The best known hits from this period are probably \"Hold On, I'm Coming\" (1966) and \"Soul Man\" (1967). \r\n\r\nSam & Dave were renowned for their exciting stage performance. In the late 1970's [a=Dan Aykroyd] and [a=John Belushi] would be very much inspired by that stage performance when they did their [a=The Blues Brothers] act.\r\n\r\nSam & Dave disbanded in 1971, but reunited shortly several times during the 1970's and 1980's. They were inducted into the Rock & Roll Hall of Fame in 1992.\r\n\r\nSam Moore died January 10, 2025.",
      "raw_data": {
        "data_quality": "Needs Vote",
        "id": 73921,
        "images": [
          {
            "height": 460,
            "resource_url": "https://i.discogs.com/kJzA2uXgrI4hCUw9_8kq2paiOdw4Lr-LAjWcVmU76ms/rs:fit/g:sm/q:90/h:460/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/kJzA2uXgrI4hCUw9_8kq2paiOdw4Lr-LAjWcVmU76ms/rs:fit/g:sm/q:90/h:460/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
            "uri150": "https://i.discogs.com/Pl4rZNxNR62fjleNfbqxiXAT4xlbk5oGY1tSDhT2VT8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
            "width": 460
          },
          {
            "height": 541,
            "resource_url": "https://i.discogs.com/Za5ZrVnVqTkp_H8bOsXjGGc5nGL-lnUQeJRjSvWGJO8/rs:fit/g:sm/q:90/h:541/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzYt/MjI1Ny5wbmc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Za5ZrVnVqTkp_H8bOsXjGGc5nGL-lnUQeJRjSvWGJO8/rs:fit/g:sm/q:90/h:541/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzYt/MjI1Ny5wbmc.jpeg",
            "uri150": "https://i.discogs.com/BbaRxqHqMV4VE867hA4uI5U40KlKXJyCO1joEn-xvik/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzYt/MjI1Ny5wbmc.jpeg",
            "width": 600
          },
          {
            "height": 738,
            "resource_url": "https://i.discogs.com/SMRUZ3QVH_8w-8AB94btraxY-w2NXVZUng7ffvdGUqI/rs:fit/g:sm/q:90/h:738/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/ODA3NS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/SMRUZ3QVH_8w-8AB94btraxY-w2NXVZUng7ffvdGUqI/rs:fit/g:sm/q:90/h:738/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/ODA3NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/bTNXKmMyU1jwS1w4Sp3ymDz0ZwdXYnXNLuIhHu7djv8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/ODA3NS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 739,
            "resource_url": "https://i.discogs.com/Kdq19WYGV0pQqAiUZbTxfBFmgjYUdMfEWtfwK0DlRYs/rs:fit/g:sm/q:90/h:739/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/MjEwNS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Kdq19WYGV0pQqAiUZbTxfBFmgjYUdMfEWtfwK0DlRYs/rs:fit/g:sm/q:90/h:739/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/MjEwNS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/L_o0fSv1RG2pa8pxvOhmOCs7tlDycRdnpzeqcwTXsi0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE1NTkyMTc3Nzgt/MjEwNS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 419,
            "resource_url": "https://i.discogs.com/9DbT2jI_a9kEw0y9cBKE8c0NfChcEjljHdSEc5XvgqQ/rs:fit/g:sm/q:90/h:419/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/MTQxMS5wbmc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/9DbT2jI_a9kEw0y9cBKE8c0NfChcEjljHdSEc5XvgqQ/rs:fit/g:sm/q:90/h:419/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/MTQxMS5wbmc.jpeg",
            "uri150": "https://i.discogs.com/jH42KlVI-35JFN1mh2-_fmmEY7XpMoiA9CUXduZPZSw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/MTQxMS5wbmc.jpeg",
            "width": 450
          },
          {
            "height": 688,
            "resource_url": "https://i.discogs.com/e1ciPuQbRMbydekR7BUpVTNzcpf8YIZcaz0lFAWlGqw/rs:fit/g:sm/q:90/h:688/w:594/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDY5NDI5NDQt/ODMxNi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/e1ciPuQbRMbydekR7BUpVTNzcpf8YIZcaz0lFAWlGqw/rs:fit/g:sm/q:90/h:688/w:594/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDY5NDI5NDQt/ODMxNi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/drcTAmJ868nPebhiDHdsySxU7QdcxWPv3YaqMHL9kz4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDY5NDI5NDQt/ODMxNi5qcGVn.jpeg",
            "width": 594
          },
          {
            "height": 601,
            "resource_url": "https://i.discogs.com/zSpdmUNTro4l_uIhATDrmMlcaw5pWZ8C4XKswf2Xmjs/rs:fit/g:sm/q:90/h:601/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzQt/MTU0Ny5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/zSpdmUNTro4l_uIhATDrmMlcaw5pWZ8C4XKswf2Xmjs/rs:fit/g:sm/q:90/h:601/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzQt/MTU0Ny5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/nxmoLNNVS3sI6JaNy7PBSYTZnKY6S5NyClgJofDQ_VQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzQt/MTU0Ny5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 510,
            "resource_url": "https://i.discogs.com/Tl8mw40wGjlCA46YxguOTvgg3OX9Qz78F763q7sugOQ/rs:fit/g:sm/q:90/h:510/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDU1ODYwNjkt/ODIxMC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Tl8mw40wGjlCA46YxguOTvgg3OX9Qz78F763q7sugOQ/rs:fit/g:sm/q:90/h:510/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDU1ODYwNjkt/ODIxMC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/ZEks6l3mUQSLj62WcqjhmGD7FG-t7wdHIhvVNrAYb3A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2NDU1ODYwNjkt/ODIxMC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 594,
            "resource_url": "https://i.discogs.com/BjaCUxeVpfejqPikGkwLL7MbqBtyVukQwA-Kl_SPi8g/rs:fit/g:sm/q:90/h:594/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTA1MDQt/Mjg5MS5wbmc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/BjaCUxeVpfejqPikGkwLL7MbqBtyVukQwA-Kl_SPi8g/rs:fit/g:sm/q:90/h:594/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTA1MDQt/Mjg5MS5wbmc.jpeg",
            "uri150": "https://i.discogs.com/hXIFmdi9fffQsvZ6QToKU0jsJeT4spZwRM9OBXxXf-g/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTA1MDQt/Mjg5MS5wbmc.jpeg",
            "width": 600
          }
        ],
        "members": [
          {
            "active": true,
            "id": 260934,
            "name": "David Prater",
            "resource_url": "https://api.discogs.com/artists/260934",
            "thumbnail_url": "https://i.discogs.com/OFvyjdkhFjGeeEwjc2Enn2t3on1vZlSEgkaRSJjBSGI/rs:fit/g:sm/q:40/h:456/w:304/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI2MDkz/NC0xNjg4MzkwNTg3/LTIyMjIucG5n.jpeg"
          },
          {
            "active": true,
            "id": 274401,
            "name": "Sam Moore",
            "resource_url": "https://api.discogs.com/artists/274401",
            "thumbnail_url": "https://i.discogs.com/2NyFwMtYSO1lXl68R3UkM_rC89-h2KjA5xZq5Xbh3ps/rs:fit/g:sm/q:40/h:779/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI3NDQw/MS0xNjg4MzkwMDIx/LTkwMzUuanBlZw.jpeg"
          }
        ],
        "name": "Sam & Dave",
        "namevariations": [
          "Sam 'N' Dave",
          "Sam 'n' Dave",
          "Sam + Dave",
          "Sam / Dave",
          "Sam And Dave",
          "Sam and Dave",
          "Sam&Dave",
          "Sam-Dave",
          "Same & Dave",
          "San & Dave",
          "San And Dave",
          "The New Sam & Dave Revue",
          "サムとデイヴ"
        ],
        "profile": "US soul vocal duo that consisted of [a=Sam Moore] and [a=David Prater]. Formed in 1961 in Miami, Florida, they only enjoyed minor success until the duo was coupled with the songwriting team of [a=Isaac Hayes] and [a=David Porter] in 1965. The best known hits from this period are probably \"Hold On, I'm Coming\" (1966) and \"Soul Man\" (1967). \r\n\r\nSam & Dave were renowned for their exciting stage performance. In the late 1970's [a=Dan Aykroyd] and [a=John Belushi] would be very much inspired by that stage performance when they did their [a=The Blues Brothers] act.\r\n\r\nSam & Dave disbanded in 1971, but reunited shortly several times during the 1970's and 1980's. They were inducted into the Rock & Roll Hall of Fame in 1992.\r\n\r\nSam Moore died January 10, 2025.",
        "releases_url": "https://api.discogs.com/artists/73921/releases",
        "resource_url": "https://api.discogs.com/artists/73921",
        "uri": "https://www.discogs.com/artist/73921-Sam-Dave",
        "urls": [
          "https://en.wikipedia.org/wiki/Sam_%26_Dave",
          "https://www.imdb.com/name/nm3172647/",
          "https://www.youtube.com/channel/UC0jVmnViSoUHl_XwocssdPg"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/73921",
      "thumb": "https://i.discogs.com/Pl4rZNxNR62fjleNfbqxiXAT4xlbk5oGY1tSDhT2VT8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTczOTIx/LTE2ODgzOTAzNzUt/Mzk5MC5wbmc.jpeg",
      "url": "https://www.discogs.com/artist/73921-Sam-Dave",
      "urls": [
        "https://en.wikipedia.org/wiki/Sam_%26_Dave",
        "https://www.imdb.com/name/nm3172647/",
        "https://www.youtube.com/channel/UC0jVmnViSoUHl_XwocssdPg"
      ]
    },
    "lastfm": {
      "bio_content": "Sam & Dave was an American soul and rhythm and blues (R&B) duo remembered for their gospel-infused performances.  Considered one of the greatest live acts of the 1960s, The tenor (higher) voice was Sam Moore (born Samuel David Hicks in Miami, Florida, on 12 October 1935; died in Coral Gables, Florida, on January 2025), and the baritone/tenor (lower) voice was David Prater (born in Ocilla, Georgia, on 9 May 1937;  died in Sycamore, Georgia, on 9 April 1988).  Performing together from 1961 through 1981, during 1965–68 they had consistent R&B chart success in the USA, including ten consecutive top 20 singles and three consecutive top 10 albums. \n\nSam & Dave are members of the Rock & Roll Hall of Fame, the Grammy Hall of Fame, the Vocal Group Hall of Fame, and are Grammy Award and multiple gold record award winning artists. According to the Rock & Roll Hall of Fame, Sam & Dave were the most successful soul duo, and brought the sounds of the black gospel church to pop music with their call-and-response records. Recorded primarily at Stax Records in Memphis, Tennessee, from 1965 through 1968, these included \"Soul Man\", \"Hold On, I'm Comin\", \"I Thank You\", \"When Something is Wrong with My Baby\", \"Wrap It Up\", and many other Southern Soul classics. Other than Aretha Franklin, no soul act during Sam & Dave's Stax years (1965-1968) had more consistent R&B chart success, including 10 consecutive top 20 singles and 3 consecutive top 10 LPs. Their crossover charts appeal (13 straight appearances and 2 top 10 singles) helped to pave the way for the acceptance of soul music by white pop audiences, and their song \"Soul Man\" was one of the first songs by a black group to top the pop charts using the word \"soul\", helping define the genre \"Soul Music\". \"Soul Man\" was a number one Pop Hit (Cashbox: November 11, 1967) and has been recognized as one of the most influential songs of the past 50 years by the Grammy Hall of Fame, The Rock & Roll Hall of Fame, Rolling Stone magazine, and RIAA Songs of the Century. \"Soul Man\" was featured as the soundtrack and title for a 1986 film and also a 1997–1998 television series, and Soul Men was a 2008 feature film. \n\nNicknamed \"Double Dynamite\", \"The Sultans of Sweat\", and \"The Dynamic Duo\" for their sweaty, gritty, gospel-infused performances, Sam & Dave were one of the greatest live acts of the 1960s. They were an influence on many future musicians, including Bruce Springsteen, Al Green, Tom Petty, Phil Collins, Michael Jackson, Elvis Costello, Teddy Pendergrass, Billy Joel and Stevie Winwood. The Blues Brothers, who helped create a resurgence of popularity for soul, R&B, and blues in the 1980s, were influenced by Sam & Dave. (Their biggest hit was a cover of \"Soul Man\" and their act and stage show had many similarities to the duo.)  \n\n[edit] Early years \n\nSam Moore and Dave Prater's early musical backgrounds involved listening to and singing gospel music in their homes and churches, and in Dave's case, also singing gospel in the choir in his church. Dave later sang with his older brother JT Prater in the gospel group The Sensational Hummingbirds, which recorded the record \"Lord Teach Me\" in the 1950s. Sam recorded \"Nitey-Nite\"/\"Caveman Rock\" in 1954 with the doo-wop group The Majestics, and later sang with the gospel groups The Gales and The Mellonaires. Moore and Prater listed Jackie Wilson and Sam Cooke as influences on their styles,[2] and Moore was also influenced by Little Willie John, whom he and Dave opened for often in the early 1960s.\n\nSam & Dave met working the gospel music circuit, and later in small clubs in Miami during amateur nights in 1961 according to Dave.[3] They sang together one night at the King of Hearts club, and started working together immediately thereafter, developing a live act featuring gospel-inspired call-and-response. Soul singer and record producer Steve Alaimo discovered them while performing on the same show with them at the King of Hearts nightclub in Miami and signed them to Marlin Records.\n\nAfter two singles in early 1962 were released on the local Marlin label owned by Miami's Henry Stone, Stone helped sign them to Roulette Records in New York. They released six 45s from 1962–1964 (two were re-releases of Marlin recordings) with Roulette, and one single on Stone and Alaimo's Alston Label. A few of the singles received regional airplay, but did not achieve national chart success. The songs, some of which were produced by Steve Alaimo and some of which were produced by Henry Glover,were similar in many ways to r&b recordings by Sam Cooke, Jackie Wilson and Little Willie John. Prater was the lead vocalist on most of these singles, with Moore singing harmony and alternate verses.\n\nIn summer 1964, Stone introduced the duo to Atlantic Records' Jerry Wexler, who signed them to Atlantic.[4] Wexler asked Memphis, Tennessee-based Stax Records, which Atlantic distributed nationally, to work with Sam & Dave. Wexler wanted the Southern roots and gospel style of their live performances, so the pair were loaned to Stax to record, although they remained Atlantic Records artists. According to Wexler's autobiography Rhythms & Blues, \"Their live act was filled with animation, harmony and seeming goodwill. I put Sam in the sweet tradition of Sam Cooke or Solomon Burke, while Dave had an ominous Four Tops' Levi Stubbs-sounding voice, the preacher promising hellfire.\"\n[edit] The Stax years (1965–1968)\n[edit] Arrival at Stax and early Stax singles\n\nWhen Sam & Dave arrived at Stax, they worked with producer & engineer Jim Stewart and songwriters including the MGs' guitarist Steve Cropper, who wrote or co-wrote four of their first eight recordings. The duo then moved to relative newcomer writers and producers Isaac Hayes and David Porter. Hayes and Porter wrote and produced the duo's biggest hits (although they did not receive production credits until the Soul Men LP and singles). According to Moore and Prater, they also greatly influenced the duo's singing style,[5] and had them shift their recording style from the style of their Roulette records to a more live, more energetic gospel, call-and-response feel and beat driven soul style the group is known for today.\n\nSam & Dave's Stax records also benefited from the musicians and engineering at Stax. The Stax house band, Booker T. & the M.G.'s, and the Stax horn section, the Mar-Keys had world-class musicians who co-wrote (often without credit) and contributed to recordings—the same musicians who recorded with Otis Redding, Wilson Pickett, Carla Thomas and other soul artists. Sam & Dave's Stax recordings through 1967 were engineered by Stax founder Jim Stewart, who created the Memphis Sound by recording live in a single take. Stewart is credited for instrumental mixes that allowed for instrumental separation and the distinct contribution of each instrument to the overall feel of the song. Hayes and Porter are in the Songwriters Hall of Fame, The Mar-Keys are in the Musicians Hall of Fame, and Booker T. & the MG's, Jim Stewart, Isaac Hayes and Sam & Dave are all in the Rock & Roll Hall of Fame.\n\nWhile the first two Stax singles failed to chart, the third, the Hayes/Porter composition (with similarities, including the title, to a gospel standard) \"You Don't Know Like I Know\" hit #7 R&B in 1966. This was the first of 10 consecutive Top Twenty R&B chart hits over three years, and 14 R&B chart appearances during their career.\n[edit] \"Hold On, I'm A-Comin'\" single and Hold On I'm Comin' LP\n\n\"Hold On, I'm A-Comin\" (R&B#1/Pop#21), released in March 1966, was a monster R&B hit for Sam & Dave, and also their first single to break into the Top 40 Pop charts. The song was named the #1 song of the year for 1966 by the Billboard R&B charts, and spent 20 weeks on the R&B charts in 1966, peaking at #1 in June. In 1988, Rolling Stone named it one of the best 100 songs of the past 25 years. \"Hold On, I'm A-Comin'\" received a belated RIAA gold record for one million sales in 1995, 29 years after its release.[6] \"Hold On, I'm Comin'\" has since been recorded by over 28 other artists.\n\n\"Hold On, I'm Comin\" was also the first recording on which Moore took lead on the first verse and the deeper, rougher voiced Prater was given the response role and second verse at Hayes and Porter's suggestion. The duo used this format, or singing dual leads, on most of their songs. The song was created when Hayes called to Porter, who was in the bathroom. Porter supposedly said \"Hold on, man, I'm comin'\", and Hayes and Porter had the song written in 10 minutes.[6] \"Hold On, I'm Comin'\", when released, received objections from radio stations over the suggestive title. This resulted in a name change by Stewart and quick re-recording and re-release, and nearly all the original U.S. copies of the single bear the title \"Hold On, I'm A-Comin'\".\n\nThe LP Hold On, I'm Comin' (4/66) reached #1 during 19 weeks on the R&B album charts in 1966. After Sam & Dave's chart success, Roulette quickly released the album Sam & Dave in 1966 as well, a collection of the A & B sides of their six Roulette 45s, which did not chart.\n[edit] When Something is Wrong, Double Dynamite LP and singles\n\nSam & Dave's next huge R&B hit was \"When Something is Wrong With My Baby\", their only ballad single, which was released in January 1967. Stax author Rob Bowman called this \"One of the most sublime records in soul music's history\", and Mar-Keys trumpet player Wayne Jackson called it the greatest song he has ever heard. This was the only Sam & Dave hit where Dave sang the first verse solo; their other hits started with Sam & Dave together or Sam singing the first verse. \"When Something is Wrong With My Baby\" has since become an often recorded and performed duet for male and female singers performing together.\n\nIn the later part of 1966, Sam & Dave also charted with the top 10 R&B hits \"Said I Wasn't Gonna Tell Nobody\", and \"You Got Me Hummin\". These three singles, along with other tracks, were compiled on Double Dynamite (12/66), Sam & Dave's second LP on Stax. The LP peaked at #7 R&B and #118 Pop.\n[edit] \"Soul Man\" single and Soul Men LP\n\nSam and Dave's biggest hit and best remembered song, \"Soul Man\"(R&B #1/Pop #2), was released in August 1967. It was the number #1 song in the US according to Cashbox magazine Pop charts in November 1967. Sam & Dave won the Grammy Award in 1967 for \"Best Performance - Rhythm & Blues Group\" for \"Soul Man\", their first gold record. \"Soul Man\" was voted into the Grammy Hall of Fame in 1999. The song helped popularize the term to describe the emerging music genre \"Soul Music\" that would be so popular in the late 1960s. According to co-writer Isaac Hayes, the title was inspired by news reports of soul pride that emerged after the 1967 race riots, where stories that painting the word \"soul\" on your door was a message for looters to bypass your house. Hayes-Porter extrapolated that to \"I'm a soul brother, I'm a soul man.\". It has been recognized as one of the best or most influential songs of 50 years by the Grammy Hall of Fame, The Rock & Roll Hall of Fame, Rolling Stone, and R.I.A.A. Songs of the Century. \"Soul Man\" was used as the soundtrack and title for a 1986 film, a 2008 film Soul Men, a 1997–1998 television series.\n\nThe Soul Men LP (October 1967) was Sam & Dave's third Stax LP, reaching #5 on the R&B charts and #68 Pop.[7] Musicologist Rob Bowman called Soul Men One of the greatest soul music albums of all time.\" \"Don't Knock It\" from the LP was released as a single in France, but other songs were not released as U.S. singles due to the long run by \"Soul Man\" on the Pop charts (15 weeks), by which time \"I Thank You/Wrap it Up\" was ready for release. \"May I Baby\", the b-side of \"Soul Man\", is also regarded as a classic non-hot 100 song on the LP by Whitburn's \"Top Pop Singles\" guide, and was a popular live song performed frequently by Sam & Dave.\n[edit] \"I Thank You\" single and I Thank You LP\n\nThe first single for Sam & Dave in 1968 was \"I Thank You/Wrap it Up\" (R&B #4/Pop #9). It is one of many gospel-inspired tunes and was a hit on both charts. Critics commented that the B side \"Wrap it Up\" could have been a separate successful single, which it later became for The Fabulous Thunderbirds. Sam & Dave were so busy touring at this point that Hayes & Porter travelled to Europe where Sam & Dave were touring to record the vocal track on \"Wrap it Up\" so they could release the single. Due to the end of the distribution agreement between Stax and Atlantic Records in May 1968, \"I Thank You\" was Sam and Dave's final single on Stax. Although they continued to work at Stax with Hayes/Porter, as of May 1968, the duo's work was released on Atlantic Records. \"I Thank You\" sold over one million copies, and was another to earn gold disc status.[8]\n\nSam and Dave's first 1968 single for Atlantic was \"You Don't Know What You Mean To Me\", written by Eddie Floyd and Steve Cropper. Sam and Dave said it was their favorite of their songs,[9] and the single charted #48 Pop and #19 R&B. Sam & Dave also released \"Can't You Find Another Way (of Doing It)\" which charted at #54 Pop and #20 R&B, but which was not included in the I Thank You LP. Their final single of 1968, \"Everybody Got To Believe In Somebody\", charted in the lower levels of the pop charts and ended Sam and Dave's streak at ten straight R&B top 20 singles.\n\nThough on Atlantic, the I Thank You LP (10/68) included 1968 singles initially on both Stax and Atlantic. The LP peaked at #38 on the R&B charts, and was the only LP of their Stax recordings not to chart on the Pop LP charts.[10]\n[edit] Sam & Dave's live performances\n\nSam & Dave's live act earned them the nickname \"Double Dynamite\". Phil Walden, Otis Redding's manager, said \"I think Sam and Dave will probably stand the test of time as being the best live act that there ever was. Those guys were absolutely unbelievable. Every night they were awesome.\" An October 1968 Time article reads: \"Of all the R & B cats, nobody steams up a place like Sam & Dave ... weaving and dancing (while singing!), they gyrate through enough acrobatics to wear out more than 100 costumes per year.\" Jerri Hershey described in Nowhere to Run: They carried red suits, white suits, three piece lime green suits, all with matching patent boots and coordinated silk hankies woefully inadequate to absorb a soul man's nightly outpourings. Both Sam & Dave talk a lot about sweat. To Dave, its proof that he's worked for his pay. For Sam its essential, almost mystical. He says he can't work without it. \"Unless my body reaches a certain temperature, starts to liquefy, I just don't feel right without it.\" Wayne Jackson said Sam & Dave left puddles of sweat onstage by the end of a performance.\n\nIn March 1967, Sam and Dave were co-headliners for the Stax/Volt Revue in Europe, which included Booker T & the MGs, The Mar-Keys, Eddie Floyd, Carla Thomas, Arthur Conley and headliner Otis Redding. For Sam & Dave, it was their first time in Europe, largely to all-white audiences, sometimes up to 2,000 people.[11] Although Redding headlined the tour, many agreed Sam & Dave stole the show on many nights. According to Redding's and Sam & Dave's manager Phil Walden, Redding refused to be booked on the same bill with Sam & Dave again, not wanting to have to follow their explosive act. A live version of Sam and Dave's Double Dynamite LP track \"Soothe Me\" was recorded in Paris during the '67 tour. Released as a single in mid-1967, it continued Sam & Dave's string of top 20 U.S. R&B hits and was their first in the UK Top 40.\n\nAfter the tour, Sam & Dave worked as headliners in the U.S. and in Europe in during the Fall of 1967, Fall 1968 and January 1970, and in Japan in 1969 and 1970. Their band grew to 16 pieces and a 35-person entourage with a plane and bus, and they continued to be in demand even as record sales began to drop in late 1969 and 1970. They were doing an average 280 shows per year from 1967 through 1969 and in 1967 only took ten days off for the year. Other high points included headlining the Montreal World's Fair in 1967, performing at the tribute to Martin Luther King, Jr at Madison Square Garden in June 1968, being the first black Soul act to headline the Fillmore East in December 1968, and headlining the Texas International Pop Festival for two nights in August 1969. Sam & Dave also performed on U.S. and European television, including two appearances on The Ed Sullivan Show in 1969, appearing on The Tonight Show and American Bandstand in 1967, and performing on The Mike Douglas Show in 1969 and 1970. Moore frequently recalls the Sullivan Show performances as a career highlight.\n[edit] The Atlantic Records years (1968–1972)\n[edit] Best of LP, Stax recorded singles (1969)\n\nThe year 1969 started well, with the Atlantic release of The Best of Sam & Dave LP in January. It contained all their Stax A sides except \"A Place Nobody Can Find\" and several B-sides, and peaked at #24 on the R&B LP charts and #89 on the Billboard LP charts.[12] Their first single of the year, \"Soul Sister, Brown Sugar\", returned Sam and Dave to the R&B top 20, and was a #15 hit in the UK.[13] The follow-up \"Born Again\", reached the lower levels of the charts, and was the last single Sam and Dave recorded at Stax.\n[edit] Atlantic produced records, first break-up, and reunion (1969–1972)\n\nJerry Wexler with co-producer Tom Dowd tried producing Sam & Dave in New York, with Atlantic songwriters and musicians. It took eight months to issue the first Atlantic single in August 1969, \"Ooh, Ooh, Ooh\", a long time in that era. It was not a very good record, by Sam's own admission, and the first time in four years that a Sam & Dave single failed to chart.\n\nTwo more singles followed in 1970, \"Baby, Baby, Don't Stop Now\", and \"One Part Love, Two Parts Pain\". The first was a leftover Hayes-Porter recording from Stax; the second was produced by Wexler and Dowd in New York, and was written by Stax executive Al Bell and Allen Jones. Both failed to hit the US R&B charts or the Hot 100. According to Wexler, \"We just made some shit-ass records with them. I never really got into their sensibilities as a producer\".[14] Wexler then sent the duo south to Muscle Shoals and Miami to work with producers Brad Shapiro and Dave Crawford for their next single \"Knock It Out The Park\", which failed to chart.\n\nSam & Dave split up in June 1970, according to Moore[15] as a result of Moore's dissatisfaction with the duo and his desire to pursue a career solo. According to Prater, they broke up because \"[Moore] decided to do what he wanted to do on his own.\" Moore recorded three solo singles (none of which charted) for Atlantic over the next year and was preparing an album produced by King Curtis, which was shelved after Curtis was stabbed to death in 1971. Prater recorded a single for Alston. Neither was commercially successful as a solo act, and they reunited in August 1971.\n\nIn October 1971, their last Atlantic single, \"Don't Pull Your Love\", was a cover of a hit by Hamilton, Joe Frank & Reynolds. This Shapiro/Crawford production was a minor hit (R&B #36/Pop #102), but not a substantial enough commercial success to keep the duo signed to the label. Sam & Dave made their final Atlantic recordings in August 1972, four songs never released by the label. Their contract with Atlantic expired shortly thereafter.\n[edit] Later years (1972–1981)\n\nDespite inability to attract a major label after Atlantic, there was still demand for public performances, especially in Europe.[16] They toured Turkey in Spring 1972 and England in Spring 1973. Sam & Dave also continued to be visible in the U.S., performing on TV shows including The Midnight Special and The Mike Douglas Show. According to Sam, most U.S. shows in the 70s were small clubs, oldies shows, and whatever they could get. Sam & Dave's poor relationship with each other and rumours of drug use at this point were well known within the music industry and contributed to the limited ability to get high quality bookings, also, according to Sam. According to Jerri Hirshey, who saw them many times in the 1970s, their shows could range anywhere from incredible, to horrible.\n\nSam and Dave returned to the studio in 1974-5, recording an album of new songs titled Back at Cha for United Artists. The album – their first album of new material in 7 years – was produced by Steve Cropper, and featured the MGs and The Memphis Horns and had a minor R&B single, \"A Little Bit of Good\" (R&B #89). Songwriters included Cropper, Allen Toussaint, and Jimmy Cliff.[17] Although the LP received positive reviews, it failed to chart. In a side project, they provided vocals on \"Come On, Come Over\" for Jaco Pastorius for his debut album on Epic in 1976.\n\nIn 1976-77, Sam & Dave recorded songs in the UK with producer John Abbey. Two singles were released on Abbey's Contempo label in the UK and Germany, with limited success. Ironically, given the duo's disputes, one of the last singles by Sam & Dave was a cover of The Beatles \"We Can Work It Out\". Sam & Dave also briefly retired in 1977, with Dave working at a Pontiac dealership in New Jersey and Sam working at an Austin, Texas, law firm as a process server.\n\nIn 1978, Sam & Dave re-recorded old hits for the LP \"Sweet & Funky Gold\" (Gusto), and re-recorded songs and other soul hits during this period in Nashville for an album for K-Tel Records, The Original Soul Man.[18] In Summer 1978, they toured Germany for two weeks.\n\nIn 1979, Sam & Dave enjoyed a significant resurgence of interest as a result of Dan Aykroyd's and John Belushi's sketch characters in the cult film The Blues Brothers, and The Blues Brothers' 1979 top 40 cover of \"Soul Man\". Moore stated they were offered an opportunity to perform onstage with Belushi and Aykroyd on SNL, but turned it down when Belushi said Sam & Dave had to perform the intro, then the Blues Brothers would take over. The Blues Brothers' personas and stage act were influenced by Sam & Dave, according to an April 1988 interview with Aykroyd in the Chicago Sun-Times. Aykroyd saw Sam & Dave as a teenager at the Montreal Expo in 1967, and said they were one of his biggest influences. Aykroyd got director John Landis to include the Jake and Elwood Blues characters listening to \"Hold On, I'm Comin'\" and \"Soothe Me\" while riding in the Bluesmobile during the film as a tribute to Sam & Dave.\n\nAlso in 1979, Sam and Dave opened shows for The Clash on their U.S. tour, including at the Palladium in New York City. In 1980, the duo performed in Paul Simon's film One Trick Pony and on Saturday Night Live. In 1980, they also were featured in a U.S. tour opening for the 50s band Sha Na Na.\n\nIn 1981, they re-recorded many hits along with Sam Cooke and Otis Redding covers for LPs titled Soul Study Vol. 1 and Soul Study Vol. 2 (Odyssey). The pair last performed on New Year's Eve, 1981, at the Old Waldorf in San Francisco. According to Moore, when they walked off stage it was the last time they spoke to each other.[19]\n[edit] Dave Prater and Sam Daniels (1982–1988)\n\nIn 1982, Prater started touring under the \"Sam & Dave\" name or as \"The New Sam & Dave Revue\" with Sam Daniels, who performed with Dave from October 1982 until Dave's death in 1988. Moore attempted to block Prater from using the group's name,[20] but was largely unsuccessful. The Daniels & Prater incarnation played 100 shows per year over the next seven years, including in Europe, Japan and Canada.\n\nIn 1985, Prater and Sam Daniels released a newly-sung medley of Sam & Dave hits recorded in The Netherlands, which peaked at #92 R&B and was credited to \"Sam & Dave\". Sam Moore got the record company to recall the single for using the \"Sam & Dave\" name without permission, and the record was re-labelled and re-issued by \"The New Sam & Dave Revue\".[21]\n\nPrater had his last performance with Sam Daniels on April 3, 1988 at a Stax Reunion at the Atlanta Civic Center which also featured Isaac Hayes, Eddie Floyd, and Rufus and Carla Thomas. Six days later, on April 9, 1988, Prater died in a car crash in Sycamore, Georgia, while driving to his mother's house.\n\nSee more details on his career under his Dave Prater Wikipedia bio.\n[edit] Sam Moore solo career (1982-present)\n\nMoore has continued to perform and record as a solo artist, and has also performed in numerous duets with other popular artists. (See the Sam Moore article.)\n[edit] Conflict between Moore and Prater\n\nSam & Dave were also famous for having a very tumultuous partnership during most of their 21 years together. According to Moore, they did not speak to each other offstage for almost 13 years. During the 1970s, they broke up many times, and would typically show up separately for shows, require separate dressing rooms, not look at each other onstage, and communicate through intermediaries.[22] They also had performances in the 1970s where only one of them would show up. Moore describes personal issues with Prater, drug use, touring fatigue, and a desire to do his own act with new material as contributing to their break-up.[15] Prater attributed their rift and break-ups to Moore's frustrations in wanting to do his own act and diversify from having to perform the Sam & Dave song catalogue (which Moore has often stated that he does not like very much) over and over.[3]\n[edit] Covers by other artists/use in pop culture\n\nSam & Dave songs have been recorded by other artists, including 29 covers of \"Hold On, I'm Comin'\". Others who charted with Sam & Dave songs include ZZ Top -\"I Thank You\", The Fabulous Thunderbirds -\"Wrap It Up\", James & Bobby Purify -\"I Take What I Want\", Linda Ronstadt featuring Aaron Neville -\"When Something is Wrong with my Baby\", Chuck Jackson & Maxine Brown -\"Hold On, I'm Comin'\", and Lydia Pense & Cold Blood -\"I Take What I Want\". A diverse group of other successful artists also recorded Sam & Dave covers including: Aretha Franklin, Elvis Costello, Peter Frampton, The Temptations, Bonnie Raitt, Jackie Wilson, The Eurythmics, Rory Gallagher, Tom Jones, The Band, Martha Reeves & the Vandellas, Michael Bolton, Patti LaBelle & Travis Tritt, Bryan Ferry, Marilyn McCoo & Billy Davis Jr., The Hollies, Paul Butterfield, Taj Majal, Guy Sebastian, and Eric Clapton & B.B. King.[23]\n\nIn 2003, the Stax Museum of American Soul Music opened in Memphis and Sam & Dave are in the film made for the Museum, titled Soulsville, and have a permanent wall and video display.\n\nBarack Obama used \"Hold On, I'm Comin'\" as a theme song on the campaign trail, until Sam Moore requesting he stop using it. 11 months later Sam Moore performed \"Soul Man\" with Sting and Elvis Costello at one of Obama's inaugural parties. A parody of \"Soul Man\" created by Moore, \"I'm a Dole Man\", was used in the 1996 Bob Dole presidential campaign until the copyright owners objected and requested the campaign stop using it. Sam & Dave released the rare single \"Hold on, Edwin's Coming\" in 1982 to support Louisiana Governor Edwin Edwards' third run for Governor. Another parody, \"I'm a Suns Fan\", was recorded by Moore and used for the Phoenix Suns basketball games.\n\nSam & Dave songs have been frequently used in movie & TV soundtracks and commercials, including \"Hold On, I'm Comin'\" on the soundtrack of the 2007 hit film American Gangster. \"Hold On, I'm Comin'\" and \"Soothe Me\" played on the radio in the Bluesmobile during the 1980 hit movie and cult classic, The Blues Brothers. Jay Leno used \"Hold on I'm Comin\" while driving his AC Cobra on his 2009 Super Bowl commercial to announce his show's move to 10pm. \"Wrap it Up\" is used as a transition to commercial break for The O'Reilly Factor. \"Soul Man\" was used as the title and title track in the 1986 movie featuring C. Thomas Howell, and also the 1997–1998 television series featuring Dan Aykroyd. The movie Tapeheads, released in 1988 and starring John Cusack and Tim Robbins, featured Sam Moore and Junior Walker as a fictitious, legendary soul duo called \"The Swanky Modes\". The movie Soul Men, released in November 2008, was a comedy featuring Bernie Mac and Samuel L. Jackson as two feuding soul singers called \"The Real Deal\". In February 2009, Moore filed suit against the film production company and the producers for infringing on the marks Soul Man and Soul Men, claiming the movie is based on the careers of Sam & Dave, and damaged both Moore's reputation and career.\n[edit] Discography\n[edit] Studio albums\n\n    * 1966: Hold On, I'm Comin' (Stax 708) (POP #45, R&B #1)\n    * 1966: Double Dynamite (Stax 712) (POP #118, R&B #7)\n    * 1967: Soul Men (Stax 725) (POP #2, R&B #5)\n    * 1968: I Thank You (Atlantic 8205) (R&B #38)\n    * 1975: Back At Cha (United Artists LA524-G)\n\n[edit] Greatest hits/compilation albums\n\n    * 1966: Sam & Dave (Roulette-Roulette singles compilation)\n    * 1969: The Best of Sam & Dave (Atlantic 8218-Stax/Atlantic singles) Pop #87/R&B #24\n    * 1969: Double Golden Album(Nippon Grammaphone/Atlantic, Japan-Stax/Atlantic Singles)\n    * 1978: Sweet & Funky Gold (Gusto, re-recordings of hits)\n    * 1982: Soul Study Volume 1 (Odyssey, re-recordings of hits+new covers)\n    * 1982: Soul Study Volume 2 (Odyssey, re-recordings of hits+new covers)\n    * 1982: La Grande Storia Del Rock 66(GSR, Italy, KTEL recordings from 1977–1978, new covers of S&D songs and covers of other soul classics)\n    * 1984: I Can't Stand Up for Falling Down(Edsel ED 133 UK: Atlantic & Stax singles not previously released on Sam & Dave LP's)\n    * 1987: Sweet Soul Music (Topline UK, KTEL recordings 1977-78, new covers of S&D songs and covers of other soul classics)\n    * Soul Sister, Brown Sugar (Atlantic, Japan compilation LP of Stax/Atlantic releases)\n\n[edit] Singles\nRelease date \tTitle \tLabel & Cat no. \tChart positions\nUS Hot 100 \tUS R&B \tUK\n1962 \t\"I Need Love\"\n(Sam Moore/Dave Prater) \tMarlin 6100 \t\t\t\n1962 \t\"No More Pain\"\n(Steve Alaimo) \tMarlin 6104 \t\t\t\n1962 \t\"I Need Love\"\n(Sam Moore/Dave Prater) \tRoulette 4419 \t\t\t\n1962 \t\"No More Pain\"\n(Steve Alaimo) \tRoulette 4445 \t\t\t\n1963 \t\"She's Alright\"\n(Henry Glover/Morris Levy/Mayme Watts) \tRoulette 4461 \t\t\t\n1963 \t\"It Was So Nice While It Lasted\"\n(Bill Nash) \tRoulette 4480 \t\t\t\n1963 \t\"If She'll Still Have Me\"\n(Roberts/Taylor) \tRoulette 4508 \t\t\t\n1964 \t\"I Found Out\"\n(Alaimo) \tRoulette 4533 \t\t\t\n1964 \t\"I'll Never, Never\"\n(Henry Stone) \tAlston 777 \t\t\t\n1965 \t\"A Place Nobody Can Find\"\n(David Porter) \tStax 168 \t\t\t\n1965 \t\"I Take What I Want\"\n(Isaac Hayes/Mabon Hodges/David Porter) \tStax 175 \t\t\t\n1965 \t\"You Don't Know Like I Know\"\n(Hayes/Porter) \tStax 180 \t90 \t7 \t\n1966 \t\"Hold On, I'm Comin'\"\n(Hayes/Porter) \tStax 189 \t21 \t1 \t\n1966 \t\"Said I Wasn't Gonna Tell Nobody\"\n(Hayes/Porter) \tStax 198 \t64 \t8 \t\n1967 \t\"You Got Me Hummin'\"\n(Hayes/Porter) \tStax 204 \t77 \t7 \t\n1967 \t\"When Something is Wrong with My Baby\"\n(Hayes/Porter) \tStax 210 \t42 \t2 \t\n1967 \t\"Soothe Me\" (Live)\n(Sam Cooke) \tStax 218 \t56 \t16 \t35\n1967 \t\"Soul Man\"\n(Hayes/Porter) \tStax 231 \t2 \t1 \t24\n1968 \t\"I Thank You\"\n(Hayes/Porter) \tStax 242 \t9 \t4 \t34\n1968 \t\"Don't Knock It\"\n(Hayes/Porter)\nEurope only \tStax 169 016 \t\t\t\n1968 \t\"You Don't Know What You Mean to Me\"\n(Eddie Floyd/Steve Cropper) \tAtlantic 2517 \t48 \t20 \t\n1968 \t\"Can't You Find Another Way\"\n(Homer Banks/Raymond Jackson) \tAtlantic 2540 \t54 \t19 \t\n1968 \t\"Everybody Got to Believe in Somebody\"\n(Hayes/Porter) \tAtlantic 2568 \t73 \t\t\n1969 \t\"Soul Sister Brown Sugar\"\n(Hayes/Porter) \tAtlantic 2590 \t41 \t18 \t15\n1969 \t\"Born Again\"\n(Hayes/Porter) \tAtlantic 2608 \t92 \t27 \t\n1969 \t\"Ooh Ooh Ooh\"\n(Donnie Fritts/John Reid) \tAtlantic 2668 \t\t\t\n1970 \t\"Baby Baby Don't Stop Now\"\n(Hayes/Porter) \tAtlantic 2714 \t117 \t\t\n1970 \t\"One Part Love, Two Parts Pain\"\n(Alvertis Isbell/Allen Jones) \tAtlantic 2728 \t123 \t\t\n1970 \t\"Knock It Out the Park\"\n(Dave Crawford/Willie Martin) \tAtlantic 2733 \t\t\t\n1971 \t\"Don't Pull Your Love\"\n(Dennis Lambert/Brian Potter) \tAtlantic 2839 \t102 \t36 \t\n1974 \t\"A Little Bit of Good (Cures a Whole Lot of Bad)\" \tUnited Artists 438 \t\t89 \t\n1974 \t\"Under the Boardwalk\"\n(Kenny Young/Arthur Resnick) \tUnited Artists 531 \t\t\t\n1977 \t\"We Can Work It Out\"\n(John Lennon/Paul McCartney) \tContempo 7004 \t\t\t\n1977 \t\"Why Did You Do It\"\n(Kirby)\nUK/Europe only \tContempo 2109 \t\t\t\n[edit] Appearances on other albums\n\n    * 1967: The Stax/Volt Revue Volume 1-Live in London (three Sam & Dave tracks, four on UK version)\n    * 1967: The Stax/Volt Revue Volume 2-Live in Paris (three Sam & Dave tracks)\n    * 1967: Stay in School, Don't Be A Dropout (Stax, Promo LP, 1 Sam & Dave track plus a PSA)\n    * 1976: Jaco Pastorius (Jaco Pastorius album, Sam & Dave vocals on \"Come On, Come Over\")\n    * 1977: Soul Express (released in Germany by Contempo UK, two Sam & Dave tracks)\n    * 1978: Soul Deep Vol 2 (released in Germany by Contempo UK, 1 track \"Living It Down\" only known release of this track)\n    * Hold On Im Coming (Spice Records-Belgium, contains 5 of the 6 known tracks from the Contempo recording sessions)\n\n[edit] CD and DVD collections\n\n    * 1987: The Best of Sam & Dave (Atlantic) 21 tracks on one CD\n    * 1990: An Anthology of Sam & Dave (Atlantic-Canada) 33 tracks, including extensive bio insert by Rob Bowman. Out of Print.\n    * 1991: Sweat & Soul (Rhino CD) 50 tracks, including four previously unreleased tracks and extensive booklet on the duo. Out of Print.\n    * 2006: Sam & Dave: The Definitive Soul Collection (Rhino CD) 30 tracks, digitally remastered.\n    * 2007: The 1967 Stax/Volt Revue-Norway (DVD Reelin in the Years) Four live tracks from spring 67 tour performing with Booker T. & The MG's and the Mar-Keys. Interviews with Sam Moore & others..\n    * 2008: The Original Soul Men: Sam & Dave (DVD) 21 Sam & Dave tracks, including 17 live tracks from 1966-1980 and interview with Sam Moore and others\n\nNote: The original Stax and Atlantic albums are also available on CD(Rhino)\n[edit] Other issues\n\n    * 1982: \"Hold On, Edwin's Coming\" (Guv-nor Records) Single for Louisiana Governor Edwin Edwards' third election campaign.\n    * 1985: The New Sam & Dave Review: A:\"Medley-Hold On Im Comin-You Dont Know-Soul Man-I Thank You Soul Sister, Brown Sugar/B:Hold On\" Atlantic 7-99636 (with Sam Daniels & Dave Prater). R&B #92\n\n[edit] References\n\n   1. ^ An Anthology of Sam & Dave-The Stax Years CD liner notes page 1 Rob Bowman\n   2. ^ Sam & Dave-An Oral History Moore & Marsh, Avon Books 1998 pp 24-25,27-28\n   3. ^ a b Interview with Dave Prater and Dave Booth cover of 1984 I Can't Stand Up for Falling Down LP\n   4. ^ Soulville, Bowman pp 66-69\n   5. ^ Soulsville, Bowman pp 67-69\n   6. ^ a b Soulville Bowman pp 91-92\n   7. ^ Billboard.com list of chart placements\n   8. ^ Murrells, Joseph (1978). The Book of Golden Discs (2nd ed.). London: Barrie and Jenkins Ltd. p. 247. ISBN 0-214-20512-6. \n   9. ^ Blitz magazine - July 1978, p8\n  10. ^ Soulsville, Bowman pp 138\n  11. ^ In My Wildest Dreams, Wayne Jackson, Pub. By Wayne & Amy Jackson 2005 pp 108–134\n  12. ^ Billboard Charts Online\n  13. ^ database of UK chart singles:www.everyhit.com\n  14. ^ Soulsville, Bowman pp 140\n  15. ^ a b Interview with Blues and Soul magazine (July 17-30, 1970) and later interviews\n  16. ^ Blues and Soul August 6–19 1971 pp 6\n  17. ^ All Music Guide To Soul ed Boganov/Bush/Woodstra/Erlewine 2003 Backbeat Books pp 598\n  18. ^ Sam & Dave-An Oral History pp 130\n  19. ^ Sam & Dave-An Oral History pp 118\n  20. ^ San Diego Union Tribune 9/25/85 \"Singer Finds Sour Note in New Duo's Name\" PP B1\n  21. ^ Congressional Testimony 5/21/1998 \"Protection Against Artistic Knock-Off's:Sam Moore\"\n  22. ^ Jeri Hirshey from book Nowhere to Run\n  23. ^ www.secondhandsongs.com under Sam & Dave\n\n[edit] External links\n\n    * http://www.melingo.com/thesoulnet/samndave.htm Includes realaudio songs by Sam & Dave\n    * Hold on Im Comin' performance from Stax/Volt 67 Tour\n    * http://www.history-of-rock.com/sam_and_dave.htm\n    * http://www.classicbands.com/samdave.html\n    * http://www.geocities.com/shakin_stacks/daveprater.txt\n    * http://www.rockhall.com/hof/inductee.asp?id=183\n    * Youtube video\n    * http://jpp-product.club.fr/sp_-_sam_&_dave.htm\n    * http://www.sammoore.net/ Sam Moore's website, with videos, bio, tour schedule, press and news\n\n[hide]\nv • d • e\nStax/Volt Records\nMajor figures \t\nJim Stewart · Estelle Axton · Al Bell · Steve Cropper · Booker T. Jones · Donald \"Duck\" Dunn · Al Jackson, Jr. · Isaac Hayes · David Porter · Jerry Wexler · Clive Davis\nMajor artists\n(Atlantic years) \t\nOtis Redding · Sam & Dave · Carla Thomas · Rufus Thomas · The Mar-Keys · Booker T. & The MG's · William Bell · Eddie Floyd · Johnnie Taylor · Albert King · The Bar-Kays\nMajor artists\n(Post-Atlantic) \t\nIsaac Hayes · David Porter · Eddie Floyd · Johnnie Taylor · The Rance Allen Group · The Soul Children · The Staple Singers · The Temprees · The Emotions · Mel & Tim · The Bar-Kays · Linda Lyndell · Richard Pryor · Bill Cosby · William Bell · Little Milton · Jesse Jackson · Big Star\nModern Stax artists \t\nSoulive · Angie Stone · Lalah Hathaway · Leela James · Isaac Hayes  · Leon Ware · N'dambi · Nikka Costa · Teena Marie\nRelated articles \t\nMemphis soul · Wattstax · Stax Museum of American Soul Music · Atlantic Records · Union Planters Bank · CBS Records · Fantasy Records · Concord Records <a href=\"https://www.last.fm/music/Sam+&+Dave\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Sam & Dave was an American soul and rhythm and blues (R&B) duo remembered for their gospel-infused performances.  Considered one of the greatest live acts of the 1960s, The tenor (higher) voice was Sam Moore (born Samuel David Hicks in Miami, Florida, on 12 October 1935; died in Coral Gables, Florida, on January 2025), and the baritone/tenor (lower) voice was David Prater (born in Ocilla, Georgia, on 9 May 1937;  died in Sycamore, Georgia, on 9 April 1988). <a href=\"https://www.last.fm/music/Sam+&+Dave\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 864198,
      "mbid": "f1d7f1fd-8883-47e9-ad2b-e9ec9ff61aac",
      "name": "Sam & Dave",
      "playcount": 6222955,
      "similar_artists": [
        {
          "name": "Wilson Pickett",
          "url": "https://www.last.fm/music/Wilson+Pickett"
        },
        {
          "name": "Eddie Floyd",
          "url": "https://www.last.fm/music/Eddie+Floyd"
        },
        {
          "name": "Rufus Thomas",
          "url": "https://www.last.fm/music/Rufus+Thomas"
        },
        {
          "name": "Otis Redding",
          "url": "https://www.last.fm/music/Otis+Redding"
        },
        {
          "name": "Carla Thomas",
          "url": "https://www.last.fm/music/Carla+Thomas"
        }
      ],
      "tags": [
        "soul",
        "rhythm and blues",
        "60s",
        "funk",
        "rnb"
      ],
      "url": "https://www.last.fm/music/Sam+&+Dave"
    },
    "spotify": {
      "followers": 362720,
      "genres": [
        "motown",
        "soul",
        "classic soul"
      ],
      "id": "2BVYdY4PyfCF9z4NrkhEB2",
      "images": [
        {
          "height": 1160,
          "url": "https://i.scdn.co/image/b1f68bdefbe49b474c9aac457114aac70d06f880",
          "width": 1000
        },
        {
          "height": 742,
          "url": "https://i.scdn.co/image/a3cefb27c2aad573e4dae048effaa9cae6af7268",
          "width": 640
        },
        {
          "height": 232,
          "url": "https://i.scdn.co/image/4b3c227ca32325f7d12ef75db8f5a6e5222be441",
          "width": 200
        },
        {
          "height": 74,
          "url": "https://i.scdn.co/image/9728f51f16176cec402b5022073f5e120a9cd220",
          "width": 64
        }
      ],
      "name": "Sam & Dave",
      "popularity": 60,
      "url": "https://open.spotify.com/artist/2BVYdY4PyfCF9z4NrkhEB2"
    }
  },
  "spotify_id": "2BVYdY4PyfCF9z4NrkhEB2",
  "spotify_url": "https://open.spotify.com/artist/2BVYdY4PyfCF9z4NrkhEB2",
  "updated_at": "2025-07-08T10:04:23.326525",
  "wikipedia_url": null
}