{
  "apple_music_id": "312095",
  "apple_music_url": "https://music.apple.com/gb/artist/beck/312095",
  "biography": "There are multiple artists named Beck:\n\n1) Beck Hansen (born Bek David Campbell, July 8, 1970) is an American musician, singer-songwriter, and multi-instrumentalist.  Beck's music is known for its pop-junk culture collage of musical styles, ironic lyrics, samples, drum machines, live instrumentation and heady sound effects.\n\nBeck was born in Los Angeles, California, to David Campbell (a musician and son of a Presbyterian minister) and Bibbe Hansen (a former dancer for The Velvet Underground, founding member of the satirical band Black Fag, and visual artist). When his parents separated, Beck stayed with his mother and brother in Los Angeles, where he was influenced by that city's diverse musical offerings—everything from hip-hop to latin music—and his mother's art scene – all of which would later reappear in his recorded and published work.\n\nAlthough Beck's work defies easy description, his eclecticism and genre experiments have sparked comparisons with Prince, though Beck was undoubtedly a less prolific artist, and drew on an absurdist, free-flowing lyrical style totally original when first exposed to mainstream audiences (indeed, some critics labeled him and his breakthrough single Loser as novelties - see below). Despite this individualism, Beck's music was very much a product of the 90s and the media age in general, with hip hop, alternative rock, electronic music, and genre-benders like the Beastie Boys as notable touchstones; in addition, some critics could not resist likening his head-spinning lyrical aesthetic to a post-modern Bob Dylan sensibility.\n\nAfter dropping out of high school in the mid-1980s, Beck educated himself and traveled widely. In Germany, he spent time with his grandfather, fluxus artist Al Hansen. His artistic relationship with his grandfather may have influenced both his album art and sense of musical collage. He began the musical activity in 1988. The late-80's found him in New York City as part of the punk-influenced anti-folk music movement.\n\nBeck returned to Los Angeles at the turn of the decade, destitute but motivated. During this time, Beck sought out (or snuck onto) stages at venues all over Los Angeles, from punk clubs to coffee shops. Some of his earliest and most thought-provoking recordings were achieved by working with Tom Grimley at Poop Alley Studios, a part of WIN Records.\n\nIn this atmosphere of heady creativity the founders of Bong Load Custom Records discovered Beck. Their 1993 12\" vinyl Loser, from an initial run of 530 copies, created a sensation on college and alternative radio that led to a furious bidding war between labels to sign Beck. Eventually, he chose Geffen Records, who offered him terms that included an allowance for the release of independent albums while under contract (he may have owed Bong Load another album or two).\n\nIn 1994, Geffen's official debut release of Mellow Gold made Beck a mainstream smash success; it also led to his iconic status as the \"slacker\" representative of the alternative rock scene, although the title of the song had been ironic.\n\nAt the same time, he released Stereopathetic Soulmanure on Flipside Records and One Foot in the Grave on independent K Records. Beck took his act on the road with the 1995 Lollapalooza tour. Still, some critics panned him as a one-hit wonder. Audiences' (especially at Lollapalooza) familiarity with Loser only, and their general disinterest in his other work only reinforced his image as a one-hit wonder.  It's been said said that Beck released Stereopathetic Soulmanure and One Foot in the Grave to shake the Gen X-ers that associated themselves with him and made \"Loser\" their slacker anthem.  \n\nThe one-hit wonder label was put to rest with the release of 1996's Odelay, a collaborative effort with The Dust Brothers, producers of Paul's Boutique. The lead single, \"Where It's At\", received heavy airplay and its video was in constant rotation on MTV. Within the year, Odelay had received perfect reviews in Rolling Stone and Spin magazines, having been listed on countless \"Best of\" lists (it topped the Pazz & Jop Critics Poll for 'Album of the Year'), receiving double-platinum status, and earning an impressive number of industry awards, including two Grammys.\n\nOdelay was followed in 1998 by Mutations. Produced by Nigel Godrich of Radiohead fame, it was intended as a stopgap measure before the next album proper. Recorded over two weeks, during which Beck recorded one song a day, the sessions produced 14 songs. Mutations was a departure from the electronic density of Odelay, and was filled with folk and blues influences. Songs on the album consisted of older tracks, some even dating back as far as 1994.\n\nIn 1999, Geffen released the much-anticipated Midnite Vultures, an orgy of sexual and culinary innuendo supported by a world tour. For Beck, it was a return to the high-energy performances that had been his trademark as far back as Lollapalooza. \n\nAfter Midnite Vultures came Sea Change in 2002, another airy and emotional album with producer Nigel Godrich, which became Beck's first U.S. Top 10 album, reaching # 8.  Sea Change was conceptualized as an album with one unifying theme—the stages following the end of a relationship. The album also featured string arrangements by Beck's father and a sonically dense mix reminiscient of Mutations. The Sea Change tour featured The Flaming Lips as Beck's opening and backing band.\n\nIn September 2003, Beck returned to the studio to work on his sixth major-label album. Guero was produced by the Dust Brothers and Tony Hoffer and features a collaboration with Jack White of The White Stripes; it marked a return to Odelay-era sound. The album was released in March of 2005 and despite critical acclaim, the album received a more lackluster response from Beck's alternative-oriented fanbase.\n\nBeck married Marissa Ribisi in April 2004, shortly before the birth of their son, Cosimo Henri Hansen.  2004 also saw the release of \"10 Years of Mellow Gold,\" a short documentary about Beck's first album.\n\nBeck's next album, The Information was released on October 3, 2006. It is a largely electronic and ambient, filled with blips and beeps. It was produced by Nigel Godrich, who worked on \"Sea Change\" and a longtime Radiohead and Thom Yorke producer. The first single was Nausea, an acoustic rock hip hop song. The next single was Cellphone's Dead, and the third single was Think I'm In Love.\n\nHis next single, Timebomb, was released on iTunes on August 21, 2007, and the limited edition vinyl 12\" was released on November 2, 2007, with an instrumental version of the song on the B-side. In December, 2007, it was announced that Timebomb had been nominated for a Grammy in the category of Best Solo Rock Vocal Performance. \n\nModern Guilt was the eighth studio album by Beck. It was released on July 8, 2008. The album fulfilled Beck's recording contract with Interscope Records. Outside of North America, the record was released by XL Recordings. Its three singles were Chemtrails, Gamma Ray, and Youthless.\n\nModern Guilt features two contributions by Cat Power and was produced by Beck and Danger Mouse.\n\nThe album entered both the Billboard 200 and the Canadian Albums Chart at number four, and gave Beck his first ever Top 10 placing on the UK Albums Chart, peaking at number nine. The album has also been Beck's best charting album in Australia, reaching 13. It sold 84,000 copies in its first week. Although successful, this does not match the first week sales of The Information, which were 99,000. In December 2008, Modern Guilt was nominated for Best Alternative Album at the 51st Grammy Awards.\n\nSong Reader, a project Beck released in December 2012, is 20 songs presented only as sheet music, in the hopes that enterprising musicians will record their own versions. The idea of Song Reader came about nearly fifteen years prior, shortly after the release of Odelay. When sent a book of transcribed sheet music for that album, Beck decided to play through it and grew interested in the world before recorded sound. He aimed to keep the arrangements as open as possible, to re-create the simplicity of the standards, and became preoccupied with creating only pieces that could fit within the Great American Songbook. In 2013 Beck began playing special Song Reader concerts with a variety of guests and announced he was working on a record of Song Reader material with other musicians as well as possibly a compilation of fan versions.\n\nIn the summer of 2013, Beck was reported to be working on two new studio albums: one a more self-contained acoustic disc in the vein of One Foot in the Grave and another described as a \"proper follow-up\" to Modern Guilt. Beck expects to release both albums independently. He released two standalone singles over the course of the summer: the electro ballad Defriended and the chorus-heavy I Won't Be Long. A third single, Gimme, appeared on September 17.\n\nIn October 2013, it was announced that Beck signed to Capitol Records. Beck released his twelfth studio album entitled Morning Phase on 21 February 2014. For the recording of Morning Phase, Beck reunited with many of the same musicians with whom he had worked on the critically acclaimed 2002 album Sea Change. On January 20, 2014, the album's first single Blue Moon was released. Beck released the second single, Waking Light, on February 4, 2014.\n\n4 years later, on October 13th, 2017, Beck released the second album that was supposed to come out alongside Morning Phase. This album was called Colors. Colors is very different from Beck's previous albums, in which he takes a stab at pop music. Beck's expertise, mixing genres, works in this album when he mixes Alternative Rock, hip hop, and a lot of Pop. The album's earliest single, \"Dreams\", was released in June 2015, and three more (\"Wow\", \"Dear Life\", \"Up All Night\") were released between June 2016 and September 2017. The title track was released as a single in April 2018. The album won the Best Alternative Music Album and Best Engineered Album (Non-Classic) at the 61st Annual Grammy Awards.\n\nAfter a short wait, Beck released Hyperspace on November 22, 2019. There was little marketing for this album. The whole album is a collaboration with Pharrell Williams, as he produced almost every song on the album. The album's first single was \"Saw Lightning\" released on April 15, 2019, and had a folk-pop sound to it. It doesn't fit with the rest of the album's synth lo-fi sound. Other singles were \"Hyperlife\" and \"Uneventful Days\" on October 17, 2019, and \"Dark Places\" on November 7, 2019.\n\n2) Beck is an independent artist, singer, and multi-instrumentalist from Chiang Rai, Thailand. He first burst into the world of music at a young age while learning to play guitar in a local church. In order to pursue music full time, he moved to Bangkok. Currently he records with his brother, and his musical style is a blend of R&B, Pop, Soul, and Jazz influences.\n\n3) BECK can refer to a fictional rock band from the Japanese Anime series BECK: Mongolian Chop Squad. The fictional BECK's songs feature in the BECK Original Sound Track. BECK's style and members are highly influenced by various different artists. From vocals in the style of Zack De La Rocha from Rage Against the Machine, guitar influenced by Tom Morello of the same band, the band is highly influenced by rap-rock.\n\nAs the series develops, other influence appear, including guitar in the style of Led Zeppelin's Jimmy Page, and Red Hot Chili Peppers John Frusciante. During the series, the band covers a famous The Beatles song, 'I've got a Feeling'. The name BECK could have possibly been influenced by the first artist Beck, mentioned above. Harold Sakushi, the original author of the series, has confirmed that BECK is generally based around the Red Hot Chili Peppers, being his favourite band. <a href=\"https://www.last.fm/music/Beck\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T16:20:41.552280",
  "discogs_id": "3928",
  "discogs_url": "https://www.discogs.com/artist/3928-Beck",
  "followers": 1684484,
  "formed_date": null,
  "genres": [
    "Alternative",
    "anti-folk",
    "alternative",
    "indie",
    "rock",
    "singer-songwriter",
    "indie rock"
  ],
  "id": "beck-1751728844",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/5b/63/bd/5b63bdf8-7cba-8a4b-ad07-bcee5971437c/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb917df61d55ce3ab98d43351a",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174917df61d55ce3ab98d43351a",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178917df61d55ce3ab98d43351a",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/abOqnWpyGEEjnwp43A_SoTbENVdcXj4siVVLQPeANcE/rs:fit/g:sm/q:90/h:430/w:378/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/guK4m0cinNKEDk1MXSFzJccm4jNGX0INT25h1GUx6is/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "a8baaa41-50f1-4f63-979e-717c14979dfb",
  "lastfm_url": "https://www.last.fm/music/Beck",
  "local_images": {
    "hi-res": "../public/artist/beck/beck-hi-res.jpg",
    "medium": "../public/artist/beck/beck-medium.jpg",
    "small": "../public/artist/beck/beck-small.jpg"
  },
  "name": "Beck",
  "popularity": 68,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/5b/63/bd/5b63bdf8-7cba-8a4b-ad07-bcee5971437c/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Alternative"
      ],
      "id": "312095",
      "name": "Beck",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/beck/312095"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/abOqnWpyGEEjnwp43A_SoTbENVdcXj4siVVLQPeANcE/rs:fit/g:sm/q:90/h:430/w:378/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "3928",
      "images": [
        {
          "height": 430,
          "resource_url": "https://i.discogs.com/abOqnWpyGEEjnwp43A_SoTbENVdcXj4siVVLQPeANcE/rs:fit/g:sm/q:90/h:430/w:378/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/abOqnWpyGEEjnwp43A_SoTbENVdcXj4siVVLQPeANcE/rs:fit/g:sm/q:90/h:430/w:378/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/guK4m0cinNKEDk1MXSFzJccm4jNGX0INT25h1GUx6is/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
          "width": 378
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/o4O_JAbXGfW2_IXDFsAxDDfwg4q_W3cGcjKKMMiieUQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTE4Mi05/MTc2LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/o4O_JAbXGfW2_IXDFsAxDDfwg4q_W3cGcjKKMMiieUQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTE4Mi05/MTc2LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/t4twFSdnz-8aQF5fHmRNamiNZpmU8Q5oBx_AD7rX0Kk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTE4Mi05/MTc2LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 640,
          "resource_url": "https://i.discogs.com/e9USELXSbPFEo5dwaNNtxFziGlyup5ex6Fx8J4M2Fmw/rs:fit/g:sm/q:90/h:640/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ2NTAyOTAyMi0z/NzI3LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/e9USELXSbPFEo5dwaNNtxFziGlyup5ex6Fx8J4M2Fmw/rs:fit/g:sm/q:90/h:640/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ2NTAyOTAyMi0z/NzI3LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/h0_2KC2pzTzo-Dd6H3mZkeocJtq17PvgS6e_MHXs1JY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ2NTAyOTAyMi0z/NzI3LmpwZWc.jpeg",
          "width": 480
        },
        {
          "height": 800,
          "resource_url": "https://i.discogs.com/lpiXGA5nHpjL2Pdt4nC4wNK1-NIUduVbwoqFYjYCaLY/rs:fit/g:sm/q:90/h:800/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTMzNi00/MTcyLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/lpiXGA5nHpjL2Pdt4nC4wNK1-NIUduVbwoqFYjYCaLY/rs:fit/g:sm/q:90/h:800/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTMzNi00/MTcyLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/gUlXKTz8oVxTsY7CMGPzLlIt1Lzj_372b86mFxysSbc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTMzNi00/MTcyLmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 416,
          "resource_url": "https://i.discogs.com/GeVazuJvvzjq8oqgLvLTnKdgAxxpvFsl6kGGrH3DN6I/rs:fit/g:sm/q:90/h:416/w:398/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NTA4Ny0y/MjQ2LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/GeVazuJvvzjq8oqgLvLTnKdgAxxpvFsl6kGGrH3DN6I/rs:fit/g:sm/q:90/h:416/w:398/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NTA4Ny0y/MjQ2LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/SDLUM9-tj3h5emiTBRou7uIZ6_fh_uC5kVC7_XixfaU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NTA4Ny0y/MjQ2LmpwZWc.jpeg",
          "width": 398
        },
        {
          "height": 647,
          "resource_url": "https://i.discogs.com/7zOsiiLf7m_14x7kM9HB8OdqujRlcIfu-5uGCJRmbUY/rs:fit/g:sm/q:90/h:647/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NDc2My0x/ODkyLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/7zOsiiLf7m_14x7kM9HB8OdqujRlcIfu-5uGCJRmbUY/rs:fit/g:sm/q:90/h:647/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NDc2My0x/ODkyLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/6qmVQNpSjgIz28q1NiL9keSm_SfJ3BzvbKouhOGVHAM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NDc2My0x/ODkyLmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 385,
          "resource_url": "https://i.discogs.com/4dSFqnHsc_sQ4c1gQ9fWKtV9IEhsnVA1Y6Vc_0yWWpE/rs:fit/g:sm/q:90/h:385/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ1MjAwMDIzMC0x/NjQ1LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/4dSFqnHsc_sQ4c1gQ9fWKtV9IEhsnVA1Y6Vc_0yWWpE/rs:fit/g:sm/q:90/h:385/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ1MjAwMDIzMC0x/NjQ1LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/V8B4uLuyQUlrrDj6jFwXJ-KfyrIHQqzPFmLep-141wI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ1MjAwMDIzMC0x/NjQ1LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 587,
          "resource_url": "https://i.discogs.com/_DwyGowGyD4PBgZmn1A_yhbzuTX5E_ScVV2qeN8jlNA/rs:fit/g:sm/q:90/h:587/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTI3NzkyMzgzMS5q/cGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/_DwyGowGyD4PBgZmn1A_yhbzuTX5E_ScVV2qeN8jlNA/rs:fit/g:sm/q:90/h:587/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTI3NzkyMzgzMS5q/cGVn.jpeg",
          "uri150": "https://i.discogs.com/DLpHwauCOOc5YMKmsjrJW3aGAvf0sMKIrOZsfkn3mXw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTI3NzkyMzgzMS5q/cGVn.jpeg",
          "width": 600
        },
        {
          "height": 192,
          "resource_url": "https://i.discogs.com/SzbYzLJvYMMSK6JeohyNe2ocNXfZJJy7yA7viVstjmw/rs:fit/g:sm/q:90/h:192/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MDAxLmpwZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/SzbYzLJvYMMSK6JeohyNe2ocNXfZJJy7yA7viVstjmw/rs:fit/g:sm/q:90/h:192/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MDAxLmpwZw.jpeg",
          "uri150": "https://i.discogs.com/9srVd8bR7b3_ekHKYXUz1qAWeKjUpaEhiurN8ZnJeKc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MDAxLmpwZw.jpeg",
          "width": 170
        },
        {
          "height": 150,
          "resource_url": "https://i.discogs.com/_zYQeGZ5mvgSwhjHJkIHZ3Fv_wIUHNA_EpjWWF__iPs/rs:fit/g:sm/q:90/h:150/w:133/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTExNTY2OTA4Ny5q/cGc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/_zYQeGZ5mvgSwhjHJkIHZ3Fv_wIUHNA_EpjWWF__iPs/rs:fit/g:sm/q:90/h:150/w:133/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTExNTY2OTA4Ny5q/cGc.jpeg",
          "uri150": "https://i.discogs.com/16tFo00u7aGi0-EVQUL0PMFL5_3U2sivNC8OJoOPv2Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTExNTY2OTA4Ny5q/cGc.jpeg",
          "width": 133
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/hynxEKWw9bTFjaYPunss2BjHLRfW8Wep6c6OLcfJmdQ/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTUwNS02/ODYzLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/hynxEKWw9bTFjaYPunss2BjHLRfW8Wep6c6OLcfJmdQ/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTUwNS02/ODYzLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/N66jiNM7UPXPkTKV8gzvxI_d9M_v3R-B30m1IB6amDM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTUwNS02/ODYzLmpwZWc.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "Beck",
      "namevariations": [
        "Beck David Hansen",
        "Beck Hansen",
        "Beck!",
        "貝克"
      ],
      "profile": "American musician, singer-songwriter and multi-instrumentalist. born July 8, 1970, in Los Angeles, California, USA. Son of [a=David Campbell] and [a=Bibbe Hansen], grandson of [a=Al Hansen]. He was married to [a=Marissa Ribisi] from 2004–2019.\r\n\r\nWhen his parents split, he and his younger brother stayed with their mother. Beck dropped out of school at the age of 14 and drifted around for about a decade, ending up back in Los Angeles. While playing some open-mike events, he got noticed by the little local label Bong Load Custom Records. In 1993, \"Loser\" was released to the world in a limited pressing of 500 copies and sent out to radio DJs across the U.S. The song became quite popular, and subsequently DGC/Geffen/MCA signed Beck in November of 1993, while giving him the freedom to work with independent labels and to make uncommercial music. The DGC release of Loser in January 1994 became an international hit.",
      "raw_data": {
        "aliases": [
          {
            "id": 104321,
            "name": "Beck Hansen",
            "resource_url": "https://api.discogs.com/artists/104321",
            "thumbnail_url": "https://i.discogs.com/U-3mSEh7S6bEcTym419ZysDgQzfMe4Eo_8x8RXk0R1U/rs:fit/g:sm/q:40/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwNDMy/MS0xNjQwNzAyMTk2/LTMzOTUuanBlZw.jpeg"
          },
          {
            "id": 2426988,
            "name": "Mollusk (2)",
            "resource_url": "https://api.discogs.com/artists/2426988",
            "thumbnail_url": "https://i.discogs.com/lFaz9uCTBN_a1DOEtUWKUgfHcN-zDW_TyiciTVf980c/rs:fit/g:sm/q:40/h:640/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MjY5/ODgtMTY0MDcwMjIz/NC05Njg1LmpwZWc.jpeg"
          },
          {
            "id": 3838081,
            "name": "Bek David Campbell",
            "resource_url": "https://api.discogs.com/artists/3838081",
            "thumbnail_url": "https://i.discogs.com/ru262ykTyCkZXnCsaJr5HXv1a5wGANyn02nwJnKTpGo/rs:fit/g:sm/q:40/h:572/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM4Mzgw/ODEtMTY0MDcwMjE1/My02MjUzLmpwZWc.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 3928,
        "images": [
          {
            "height": 430,
            "resource_url": "https://i.discogs.com/abOqnWpyGEEjnwp43A_SoTbENVdcXj4siVVLQPeANcE/rs:fit/g:sm/q:90/h:430/w:378/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/abOqnWpyGEEjnwp43A_SoTbENVdcXj4siVVLQPeANcE/rs:fit/g:sm/q:90/h:430/w:378/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/guK4m0cinNKEDk1MXSFzJccm4jNGX0INT25h1GUx6is/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
            "width": 378
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/o4O_JAbXGfW2_IXDFsAxDDfwg4q_W3cGcjKKMMiieUQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTE4Mi05/MTc2LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/o4O_JAbXGfW2_IXDFsAxDDfwg4q_W3cGcjKKMMiieUQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTE4Mi05/MTc2LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/t4twFSdnz-8aQF5fHmRNamiNZpmU8Q5oBx_AD7rX0Kk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTE4Mi05/MTc2LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 640,
            "resource_url": "https://i.discogs.com/e9USELXSbPFEo5dwaNNtxFziGlyup5ex6Fx8J4M2Fmw/rs:fit/g:sm/q:90/h:640/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ2NTAyOTAyMi0z/NzI3LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/e9USELXSbPFEo5dwaNNtxFziGlyup5ex6Fx8J4M2Fmw/rs:fit/g:sm/q:90/h:640/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ2NTAyOTAyMi0z/NzI3LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/h0_2KC2pzTzo-Dd6H3mZkeocJtq17PvgS6e_MHXs1JY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ2NTAyOTAyMi0z/NzI3LmpwZWc.jpeg",
            "width": 480
          },
          {
            "height": 800,
            "resource_url": "https://i.discogs.com/lpiXGA5nHpjL2Pdt4nC4wNK1-NIUduVbwoqFYjYCaLY/rs:fit/g:sm/q:90/h:800/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTMzNi00/MTcyLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/lpiXGA5nHpjL2Pdt4nC4wNK1-NIUduVbwoqFYjYCaLY/rs:fit/g:sm/q:90/h:800/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTMzNi00/MTcyLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/gUlXKTz8oVxTsY7CMGPzLlIt1Lzj_372b86mFxysSbc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTMzNi00/MTcyLmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 416,
            "resource_url": "https://i.discogs.com/GeVazuJvvzjq8oqgLvLTnKdgAxxpvFsl6kGGrH3DN6I/rs:fit/g:sm/q:90/h:416/w:398/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NTA4Ny0y/MjQ2LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/GeVazuJvvzjq8oqgLvLTnKdgAxxpvFsl6kGGrH3DN6I/rs:fit/g:sm/q:90/h:416/w:398/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NTA4Ny0y/MjQ2LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/SDLUM9-tj3h5emiTBRou7uIZ6_fh_uC5kVC7_XixfaU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NTA4Ny0y/MjQ2LmpwZWc.jpeg",
            "width": 398
          },
          {
            "height": 647,
            "resource_url": "https://i.discogs.com/7zOsiiLf7m_14x7kM9HB8OdqujRlcIfu-5uGCJRmbUY/rs:fit/g:sm/q:90/h:647/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NDc2My0x/ODkyLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/7zOsiiLf7m_14x7kM9HB8OdqujRlcIfu-5uGCJRmbUY/rs:fit/g:sm/q:90/h:647/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NDc2My0x/ODkyLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/6qmVQNpSjgIz28q1NiL9keSm_SfJ3BzvbKouhOGVHAM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxNTI0NDc2My0x/ODkyLmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 385,
            "resource_url": "https://i.discogs.com/4dSFqnHsc_sQ4c1gQ9fWKtV9IEhsnVA1Y6Vc_0yWWpE/rs:fit/g:sm/q:90/h:385/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ1MjAwMDIzMC0x/NjQ1LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/4dSFqnHsc_sQ4c1gQ9fWKtV9IEhsnVA1Y6Vc_0yWWpE/rs:fit/g:sm/q:90/h:385/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ1MjAwMDIzMC0x/NjQ1LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/V8B4uLuyQUlrrDj6jFwXJ-KfyrIHQqzPFmLep-141wI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTQ1MjAwMDIzMC0x/NjQ1LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 587,
            "resource_url": "https://i.discogs.com/_DwyGowGyD4PBgZmn1A_yhbzuTX5E_ScVV2qeN8jlNA/rs:fit/g:sm/q:90/h:587/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTI3NzkyMzgzMS5q/cGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/_DwyGowGyD4PBgZmn1A_yhbzuTX5E_ScVV2qeN8jlNA/rs:fit/g:sm/q:90/h:587/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTI3NzkyMzgzMS5q/cGVn.jpeg",
            "uri150": "https://i.discogs.com/DLpHwauCOOc5YMKmsjrJW3aGAvf0sMKIrOZsfkn3mXw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTI3NzkyMzgzMS5q/cGVn.jpeg",
            "width": 600
          },
          {
            "height": 192,
            "resource_url": "https://i.discogs.com/SzbYzLJvYMMSK6JeohyNe2ocNXfZJJy7yA7viVstjmw/rs:fit/g:sm/q:90/h:192/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MDAxLmpwZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/SzbYzLJvYMMSK6JeohyNe2ocNXfZJJy7yA7viVstjmw/rs:fit/g:sm/q:90/h:192/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MDAxLmpwZw.jpeg",
            "uri150": "https://i.discogs.com/9srVd8bR7b3_ekHKYXUz1qAWeKjUpaEhiurN8ZnJeKc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MDAxLmpwZw.jpeg",
            "width": 170
          },
          {
            "height": 150,
            "resource_url": "https://i.discogs.com/_zYQeGZ5mvgSwhjHJkIHZ3Fv_wIUHNA_EpjWWF__iPs/rs:fit/g:sm/q:90/h:150/w:133/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTExNTY2OTA4Ny5q/cGc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/_zYQeGZ5mvgSwhjHJkIHZ3Fv_wIUHNA_EpjWWF__iPs/rs:fit/g:sm/q:90/h:150/w:133/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTExNTY2OTA4Ny5q/cGc.jpeg",
            "uri150": "https://i.discogs.com/16tFo00u7aGi0-EVQUL0PMFL5_3U2sivNC8OJoOPv2Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTExNTY2OTA4Ny5q/cGc.jpeg",
            "width": 133
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/hynxEKWw9bTFjaYPunss2BjHLRfW8Wep6c6OLcfJmdQ/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTUwNS02/ODYzLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/hynxEKWw9bTFjaYPunss2BjHLRfW8Wep6c6OLcfJmdQ/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTUwNS02/ODYzLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/N66jiNM7UPXPkTKV8gzvxI_d9M_v3R-B30m1IB6amDM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTcwMjg3OTUwNS02/ODYzLmpwZWc.jpeg",
            "width": 600
          }
        ],
        "name": "Beck",
        "namevariations": [
          "Beck David Hansen",
          "Beck Hansen",
          "Beck!",
          "貝克"
        ],
        "profile": "American musician, singer-songwriter and multi-instrumentalist. born July 8, 1970, in Los Angeles, California, USA. Son of [a=David Campbell] and [a=Bibbe Hansen], grandson of [a=Al Hansen]. He was married to [a=Marissa Ribisi] from 2004–2019.\r\n\r\nWhen his parents split, he and his younger brother stayed with their mother. Beck dropped out of school at the age of 14 and drifted around for about a decade, ending up back in Los Angeles. While playing some open-mike events, he got noticed by the little local label Bong Load Custom Records. In 1993, \"Loser\" was released to the world in a limited pressing of 500 copies and sent out to radio DJs across the U.S. The song became quite popular, and subsequently DGC/Geffen/MCA signed Beck in November of 1993, while giving him the freedom to work with independent labels and to make uncommercial music. The DGC release of Loser in January 1994 became an international hit.",
        "realname": "Bek David Campbell",
        "releases_url": "https://api.discogs.com/artists/3928/releases",
        "resource_url": "https://api.discogs.com/artists/3928",
        "uri": "https://www.discogs.com/artist/3928-Beck",
        "urls": [
          "https://www.beck.com/",
          "https://www.facebook.com/Beck",
          "https://twitter.com/beck",
          "https://www.instagram.com/beck",
          "https://myspace.com/beck",
          "https://vimeo.com/videotheque",
          "https://en.wikipedia.org/wiki/Beck",
          "https://www.imdb.com/name/nm0065059/",
          "https://www.youtube.com/@beck",
          "https://www.youtube.com/@BeckVEVO",
          "http://diskobox.org/",
          "https://whiskeyclone.net/",
          "https://soundcloud.com/planned_obsolescence"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/3928",
      "thumb": "https://i.discogs.com/guK4m0cinNKEDk1MXSFzJccm4jNGX0INT25h1GUx6is/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5Mjgt/MTUxMzM2Njc5NC0z/MzE2LmpwZWc.jpeg",
      "url": "https://www.discogs.com/artist/3928-Beck",
      "urls": [
        "https://www.beck.com/",
        "https://www.facebook.com/Beck",
        "https://twitter.com/beck",
        "https://www.instagram.com/beck",
        "https://myspace.com/beck",
        "https://vimeo.com/videotheque",
        "https://en.wikipedia.org/wiki/Beck",
        "https://www.imdb.com/name/nm0065059/",
        "https://www.youtube.com/@beck",
        "https://www.youtube.com/@BeckVEVO",
        "http://diskobox.org/",
        "https://whiskeyclone.net/",
        "https://soundcloud.com/planned_obsolescence"
      ]
    },
    "lastfm": {
      "bio_content": "There are multiple artists named Beck:\n\n1) Beck Hansen (born Bek David Campbell, July 8, 1970) is an American musician, singer-songwriter, and multi-instrumentalist.  Beck's music is known for its pop-junk culture collage of musical styles, ironic lyrics, samples, drum machines, live instrumentation and heady sound effects.\n\nBeck was born in Los Angeles, California, to David Campbell (a musician and son of a Presbyterian minister) and Bibbe Hansen (a former dancer for The Velvet Underground, founding member of the satirical band Black Fag, and visual artist). When his parents separated, Beck stayed with his mother and brother in Los Angeles, where he was influenced by that city's diverse musical offerings—everything from hip-hop to latin music—and his mother's art scene – all of which would later reappear in his recorded and published work.\n\nAlthough Beck's work defies easy description, his eclecticism and genre experiments have sparked comparisons with Prince, though Beck was undoubtedly a less prolific artist, and drew on an absurdist, free-flowing lyrical style totally original when first exposed to mainstream audiences (indeed, some critics labeled him and his breakthrough single Loser as novelties - see below). Despite this individualism, Beck's music was very much a product of the 90s and the media age in general, with hip hop, alternative rock, electronic music, and genre-benders like the Beastie Boys as notable touchstones; in addition, some critics could not resist likening his head-spinning lyrical aesthetic to a post-modern Bob Dylan sensibility.\n\nAfter dropping out of high school in the mid-1980s, Beck educated himself and traveled widely. In Germany, he spent time with his grandfather, fluxus artist Al Hansen. His artistic relationship with his grandfather may have influenced both his album art and sense of musical collage. He began the musical activity in 1988. The late-80's found him in New York City as part of the punk-influenced anti-folk music movement.\n\nBeck returned to Los Angeles at the turn of the decade, destitute but motivated. During this time, Beck sought out (or snuck onto) stages at venues all over Los Angeles, from punk clubs to coffee shops. Some of his earliest and most thought-provoking recordings were achieved by working with Tom Grimley at Poop Alley Studios, a part of WIN Records.\n\nIn this atmosphere of heady creativity the founders of Bong Load Custom Records discovered Beck. Their 1993 12\" vinyl Loser, from an initial run of 530 copies, created a sensation on college and alternative radio that led to a furious bidding war between labels to sign Beck. Eventually, he chose Geffen Records, who offered him terms that included an allowance for the release of independent albums while under contract (he may have owed Bong Load another album or two).\n\nIn 1994, Geffen's official debut release of Mellow Gold made Beck a mainstream smash success; it also led to his iconic status as the \"slacker\" representative of the alternative rock scene, although the title of the song had been ironic.\n\nAt the same time, he released Stereopathetic Soulmanure on Flipside Records and One Foot in the Grave on independent K Records. Beck took his act on the road with the 1995 Lollapalooza tour. Still, some critics panned him as a one-hit wonder. Audiences' (especially at Lollapalooza) familiarity with Loser only, and their general disinterest in his other work only reinforced his image as a one-hit wonder.  It's been said said that Beck released Stereopathetic Soulmanure and One Foot in the Grave to shake the Gen X-ers that associated themselves with him and made \"Loser\" their slacker anthem.  \n\nThe one-hit wonder label was put to rest with the release of 1996's Odelay, a collaborative effort with The Dust Brothers, producers of Paul's Boutique. The lead single, \"Where It's At\", received heavy airplay and its video was in constant rotation on MTV. Within the year, Odelay had received perfect reviews in Rolling Stone and Spin magazines, having been listed on countless \"Best of\" lists (it topped the Pazz & Jop Critics Poll for 'Album of the Year'), receiving double-platinum status, and earning an impressive number of industry awards, including two Grammys.\n\nOdelay was followed in 1998 by Mutations. Produced by Nigel Godrich of Radiohead fame, it was intended as a stopgap measure before the next album proper. Recorded over two weeks, during which Beck recorded one song a day, the sessions produced 14 songs. Mutations was a departure from the electronic density of Odelay, and was filled with folk and blues influences. Songs on the album consisted of older tracks, some even dating back as far as 1994.\n\nIn 1999, Geffen released the much-anticipated Midnite Vultures, an orgy of sexual and culinary innuendo supported by a world tour. For Beck, it was a return to the high-energy performances that had been his trademark as far back as Lollapalooza. \n\nAfter Midnite Vultures came Sea Change in 2002, another airy and emotional album with producer Nigel Godrich, which became Beck's first U.S. Top 10 album, reaching # 8.  Sea Change was conceptualized as an album with one unifying theme—the stages following the end of a relationship. The album also featured string arrangements by Beck's father and a sonically dense mix reminiscient of Mutations. The Sea Change tour featured The Flaming Lips as Beck's opening and backing band.\n\nIn September 2003, Beck returned to the studio to work on his sixth major-label album. Guero was produced by the Dust Brothers and Tony Hoffer and features a collaboration with Jack White of The White Stripes; it marked a return to Odelay-era sound. The album was released in March of 2005 and despite critical acclaim, the album received a more lackluster response from Beck's alternative-oriented fanbase.\n\nBeck married Marissa Ribisi in April 2004, shortly before the birth of their son, Cosimo Henri Hansen.  2004 also saw the release of \"10 Years of Mellow Gold,\" a short documentary about Beck's first album.\n\nBeck's next album, The Information was released on October 3, 2006. It is a largely electronic and ambient, filled with blips and beeps. It was produced by Nigel Godrich, who worked on \"Sea Change\" and a longtime Radiohead and Thom Yorke producer. The first single was Nausea, an acoustic rock hip hop song. The next single was Cellphone's Dead, and the third single was Think I'm In Love.\n\nHis next single, Timebomb, was released on iTunes on August 21, 2007, and the limited edition vinyl 12\" was released on November 2, 2007, with an instrumental version of the song on the B-side. In December, 2007, it was announced that Timebomb had been nominated for a Grammy in the category of Best Solo Rock Vocal Performance. \n\nModern Guilt was the eighth studio album by Beck. It was released on July 8, 2008. The album fulfilled Beck's recording contract with Interscope Records. Outside of North America, the record was released by XL Recordings. Its three singles were Chemtrails, Gamma Ray, and Youthless.\n\nModern Guilt features two contributions by Cat Power and was produced by Beck and Danger Mouse.\n\nThe album entered both the Billboard 200 and the Canadian Albums Chart at number four, and gave Beck his first ever Top 10 placing on the UK Albums Chart, peaking at number nine. The album has also been Beck's best charting album in Australia, reaching 13. It sold 84,000 copies in its first week. Although successful, this does not match the first week sales of The Information, which were 99,000. In December 2008, Modern Guilt was nominated for Best Alternative Album at the 51st Grammy Awards.\n\nSong Reader, a project Beck released in December 2012, is 20 songs presented only as sheet music, in the hopes that enterprising musicians will record their own versions. The idea of Song Reader came about nearly fifteen years prior, shortly after the release of Odelay. When sent a book of transcribed sheet music for that album, Beck decided to play through it and grew interested in the world before recorded sound. He aimed to keep the arrangements as open as possible, to re-create the simplicity of the standards, and became preoccupied with creating only pieces that could fit within the Great American Songbook. In 2013 Beck began playing special Song Reader concerts with a variety of guests and announced he was working on a record of Song Reader material with other musicians as well as possibly a compilation of fan versions.\n\nIn the summer of 2013, Beck was reported to be working on two new studio albums: one a more self-contained acoustic disc in the vein of One Foot in the Grave and another described as a \"proper follow-up\" to Modern Guilt. Beck expects to release both albums independently. He released two standalone singles over the course of the summer: the electro ballad Defriended and the chorus-heavy I Won't Be Long. A third single, Gimme, appeared on September 17.\n\nIn October 2013, it was announced that Beck signed to Capitol Records. Beck released his twelfth studio album entitled Morning Phase on 21 February 2014. For the recording of Morning Phase, Beck reunited with many of the same musicians with whom he had worked on the critically acclaimed 2002 album Sea Change. On January 20, 2014, the album's first single Blue Moon was released. Beck released the second single, Waking Light, on February 4, 2014.\n\n4 years later, on October 13th, 2017, Beck released the second album that was supposed to come out alongside Morning Phase. This album was called Colors. Colors is very different from Beck's previous albums, in which he takes a stab at pop music. Beck's expertise, mixing genres, works in this album when he mixes Alternative Rock, hip hop, and a lot of Pop. The album's earliest single, \"Dreams\", was released in June 2015, and three more (\"Wow\", \"Dear Life\", \"Up All Night\") were released between June 2016 and September 2017. The title track was released as a single in April 2018. The album won the Best Alternative Music Album and Best Engineered Album (Non-Classic) at the 61st Annual Grammy Awards.\n\nAfter a short wait, Beck released Hyperspace on November 22, 2019. There was little marketing for this album. The whole album is a collaboration with Pharrell Williams, as he produced almost every song on the album. The album's first single was \"Saw Lightning\" released on April 15, 2019, and had a folk-pop sound to it. It doesn't fit with the rest of the album's synth lo-fi sound. Other singles were \"Hyperlife\" and \"Uneventful Days\" on October 17, 2019, and \"Dark Places\" on November 7, 2019.\n\n2) Beck is an independent artist, singer, and multi-instrumentalist from Chiang Rai, Thailand. He first burst into the world of music at a young age while learning to play guitar in a local church. In order to pursue music full time, he moved to Bangkok. Currently he records with his brother, and his musical style is a blend of R&B, Pop, Soul, and Jazz influences.\n\n3) BECK can refer to a fictional rock band from the Japanese Anime series BECK: Mongolian Chop Squad. The fictional BECK's songs feature in the BECK Original Sound Track. BECK's style and members are highly influenced by various different artists. From vocals in the style of Zack De La Rocha from Rage Against the Machine, guitar influenced by Tom Morello of the same band, the band is highly influenced by rap-rock.\n\nAs the series develops, other influence appear, including guitar in the style of Led Zeppelin's Jimmy Page, and Red Hot Chili Peppers John Frusciante. During the series, the band covers a famous The Beatles song, 'I've got a Feeling'. The name BECK could have possibly been influenced by the first artist Beck, mentioned above. Harold Sakushi, the original author of the series, has confirmed that BECK is generally based around the Red Hot Chili Peppers, being his favourite band. <a href=\"https://www.last.fm/music/Beck\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "There are multiple artists named Beck:\n\n1) Beck Hansen (born Bek David Campbell, July 8, 1970) is an American musician, singer-songwriter, and multi-instrumentalist.  Beck's music is known for its pop-junk culture collage of musical styles, ironic lyrics, samples, drum machines, live instrumentation and heady sound effects.\n\nBeck was born in Los Angeles, California, to David Campbell (a musician and son of a Presbyterian minister) and Bibbe Hansen (a former dancer for The Velvet Underground <a href=\"https://www.last.fm/music/Beck\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 3804354,
      "mbid": "a8baaa41-50f1-4f63-979e-717c14979dfb",
      "name": "Beck",
      "playcount": 131714476,
      "similar_artists": [
        {
          "name": "Cake",
          "url": "https://www.last.fm/music/Cake"
        },
        {
          "name": "The Flaming Lips",
          "url": "https://www.last.fm/music/The+Flaming+Lips"
        },
        {
          "name": "Ween",
          "url": "https://www.last.fm/music/Ween"
        },
        {
          "name": "Spoon",
          "url": "https://www.last.fm/music/Spoon"
        },
        {
          "name": "The White Stripes",
          "url": "https://www.last.fm/music/The+White+Stripes"
        }
      ],
      "tags": [
        "alternative",
        "indie",
        "rock",
        "singer-songwriter",
        "indie rock"
      ],
      "url": "https://www.last.fm/music/Beck"
    },
    "spotify": {
      "followers": 1684484,
      "genres": [
        "anti-folk"
      ],
      "id": "3vbKDsSS70ZX9D2OcvbZmS",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb917df61d55ce3ab98d43351a",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174917df61d55ce3ab98d43351a",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178917df61d55ce3ab98d43351a",
          "width": 160
        }
      ],
      "name": "Beck",
      "popularity": 68,
      "url": "https://open.spotify.com/artist/3vbKDsSS70ZX9D2OcvbZmS"
    }
  },
  "spotify_id": "3vbKDsSS70ZX9D2OcvbZmS",
  "spotify_url": "https://open.spotify.com/artist/3vbKDsSS70ZX9D2OcvbZmS",
  "updated_at": "2025-07-08T09:32:21.799407",
  "wikipedia_url": null
}