{
  "apple_music_id": "468568",
  "apple_music_url": "https://music.apple.com/gb/artist/the-alarm/468568",
  "biography": "The Alarm were a Welsh alternative rock band that formed in Rhyl, Wales in 1981. Initially formed as a punk band, The Toilets, in 1977 under lead vocalist Mike Peters, the group soon embraced arena rock and included marked influences from Welsh language and culture. By opening for acts such as U2 and Bob Dylan, they became a popular new wave pop band of the 1980s.\n\nThe Alarm's highest-charting single in Britain is 1983's \"Sixty Eight Guns\", which reached number 17 on the UK Singles Chart. Their 1984 album Declaration, which contained \"Sixty Eight Guns\", peaked at number six on the UK Albums Chart.\n\nHistory\nEarly years\nIn 1977, a punk band was formed in Rhyl, Wales, billed as The Toilets. It contained Mike Peters (alias Eddie Bop), Glyn Crossley (alias Steve Shock), Richard \"O'Malley\" Jones (alias Bo Larks) and Nigel Buckle (alias Des Troy). In 1978 the band renamed themselves Quasimodo and played note-for-note covers of The Who's Live at Leeds with guitarist Dave Sharp. This group also included Karl Wallinger on keyboards. Later the group named themselves Seventeen, with both Mike Peters and Nigel Buckle alongside Eddie MacDonald (who had been Mike Peters' next-door-but-one neighbour in Edward Henry Street, Rhyl). Seventeen began as a three-piece but were joined by guitarist David Kitchingman (who changed his name to Dave Sharp) and became a power pop mod band that released the single (\"Don't Let Go\"/\"Bank Holiday Weekend\") in March 1980 and toured with the Stray Cats later that year. They played their last concert under the name of Alarm Alarm in January 1981 at the Half Moon, Herne Hill, London.\n\nThe band soon reformed under the new name of The Alarm (with Nigel Buckle changing his surname to 'Twist'), and played their first gig at The Victoria Hotel, Prestatyn, North Wales on 6 June 1981, opening with \"Shout to the Devil\", which later appeared on the album Declaration.\n\nThey moved from North Wales to London in September 1981, and the band recorded a one-off 7\" single. 1,000 copies were pressed that month, featuring \"Unsafe Building\" on the \"electric\" side and \"Up For Murder\" on the \"acoustic\" side. The single was noticed by Mick Mercer, who featured it as his single of the month in his ZigZag magazine. The band played a show with The Fall in December 1981, where a journalist from Sounds noticed them. This journalist attended the band's next show at Upstairs at Ronnie's in London's West End. Also at this show was a representative of Wasted Talent, who arranged a meeting between the band and Ian Wilson, U2's agent. Wilson arranged another show in order to assess the band's quality, was impressed, and soon became their manager. To celebrate, The Alarm played with U2 at the Lyceum Ballroom on 22 December 1981. \n\nIn 1982, the band began to record demos for various record labels, but had little success. At this point, they were playing with three acoustic guitarists. The band were eventually offered a deal by I.R.S. Records. This forced them to make a decision on who was to play which musical instrument, and it was decided that Peters would concentrate on singing, with Sharp on guitar and Macdonald playing bass.\n\n\"Marching On\" was released as a single in October 1982, and the band's sound started to become clear. On stage, they almost always began gigs acoustically, then finished with electric guitars. Constant gigging in London helped the band build a following, and in December 1982, they played four shows with U2. These shows were the first time that Bono joined the Alarm on stage.\n\nThe song \"The Stand\" was recorded in Battersea in April 1983, and was released in the UK as a single. The song's lyrics were inspired by Stephen King's novel of the same name. Outside the UK, the song was released as part of a five-track EP titled The Alarm. The EP was released to coincide with the Alarm's first tour of the U.S. in June 1983. Following the success of the sessions that produced \"The Stand\", I.R.S. picked up their recording option on the band, signalling the start of work on an album. Another session with producer Mick Glossop was arranged to produce the single \"Blaze of Glory\".\n\nIn June 1983, the Alarm embarked on their first tour of the U.S., supporting U2 on the War Tour. The 18-date tour established the band in the U.S. \"The Stand\" was released by I.R.S. to capitalize on this development, supported by TV appearances on The Cutting Edge and American Bandstand.\n\nFollowing the tour, the band returned to the UK to begin working with producer Alan Shacklock. They focused on re-recording \"Blaze of Glory\" and \"Sixty Eight Guns\". After the sessions, the band recorded a video for \"Sixty Eight Guns\" and flew back to America to begin their first headlining American tour as well as to play in support of The Pretenders. \"Sixty Eight Guns\" was released as a single on 12 September 1983 and charted the following week at number 50. The same week, the band performed the song on the music show Top of the Pops. The song climbed into the Top 20, and it remains their highest-charting single, peaking at No. 17.\n\nMid-career\nThe band had been recording an album from July 1983, and by the time of the Top of the Pops appearance, they had recorded the backing tracks to most of the songs. After completing a U.S. tour and a headline tour of the UK in late 1983, the band returned to the studio to record the backing tracks for the rest of the songs.\n\nOn 6 November 1983, the band recorded an acoustic radio session for the BBC. This session saw the debut of three brand new songs: \"Walk Forever by My Side\", \"One Step Closer to Home\" and \"Unbreak the Promise\".\n\nOn 7 November, the band returned to the recording studio to finish recording the album, now titled Declaration. In December, the Alarm returned to the U.S. for a third headline tour. The weather was atrocious, and on 6 December, the car in which the band was travelling crashed, but none of the four members was injured. They returned to the UK on 17 December and appeared as part of an Anti-Nuclear Benefit Concert at the Apollo Theatre in London.\n\nWhile the band had been in the U.S., Alan Shacklock and sound engineer Chris Porter finished mixing the album. The band played a handful of gigs supporting The Police over Christmas, and by 5 January 1984, the album had been mixed and finalised. Declaration was released by I.R.S. Records on 14 February 1984. A week later, the album entered the UK Albums Chart at Number 6.\n\nIn November 1984, the Alarm recorded demos of nine new songs, including \"Absolute Reality\". They played their new material to the American producer Jimmy Iovine, who agreed to come to the UK in January 1985 to begin work on the follow-up to Declaration. During this period, Peters appeared solo at a number of events, including the Greenbelt Festival in Northamptonshire, playing Alarm material as well as some unrecorded personal songs. Studio sessions were booked for early 1985, and a UK headline tour was booked for May 1985 to coincide with the release of the new album. However, Iovine never came to the UK to work with the Alarm, eventually citing personal reasons. The band had to cancel the sessions and look for another producer. Alan Shacklock was unavailable, so Ian Wilson (the band's manager) convinced I.R.S. to release the Shacklock-produced \"Absolute Reality\" as a single to promote the UK dates in May. \"Absolute Reality\" was released on 18 February 1985, entering the top 40 of the UK Singles Chart a week later. After a series of appearances at European festivals and a new producer (Mike Howlett), the Alarm began work on their follow-up album Strength. The band teamed with MTV, I.R.S. Records, and UCLA's Campus Events to present one of the early live satellite broadcasts from UCLA on 12 April 1986. They played at Queen's Live at Wembley '86 concert on 12 July 1986.\n\nStrength was released on 1 October 1985 and was another UK success, and brought them into the top 40 of the US Billboard 200 album chart for the first time; additionally, the single \"Spirit of '76\" was a top 40 UK hit. The Alarm took a break after the supporting tour, but returned in 1987 with Eye of the Hurricane and landed a tour slot supporting Bob Dylan. The concert EP Electric Folklore Live, followed in 1988. They also had a hit single in the UK in 1987 with \"Rain in the Summertime\" (from Eye of the Hurricane), which gave them their second-best placing on the UK chart.\n\nLater years\nThe band toured extensively through the United States and Europe through the 1980s into 1991. They gained much popularity in 1983 when they were the opening act for U2, a band to whom they often were compared musically. On 13 March 1988, the Alarm performed at The Fillmore in San Francisco with The 77s and House of Freaks.\n\n1989's Change was an homage to the group's native Wales, and was accompanied by an alternate Welsh-language version Newid. Produced by Tony Visconti, Change spawned the group's biggest Modern Rock hit in America, \"Sold Me Down the River\", which also put them in the U.S. Billboard Hot 100 Top 50 for the first and only time. \"Devolution Working Man Blues\" and \"Love Don't Come Easy\" also earned radio airplay, and the track \"A New South Wales\" had an appearance by the Welsh Symphony Orchestra and the Morriston Orpheus Male Voice Choir. Although it was popular in Wales, it did not sell as well as the group's earlier works, and internal band dissension, exacerbated by deaths in both Peters' and Twist's families, made 1991's Raw the original Alarm's final effort.\n\nAfter the release of Raw in 1991, despite their success and relative longevity, Peters announced on stage at the Brixton Academy that he was leaving the band.\n\n\"We've shared some great moments in time over the last ten years and tonight I would like to thank all the people who have supported me from the beginning to the end. Tonight this is my last moment with the Alarm, I'm going out in a Blaze of Glory – my hands are held up high\". This came as much of a shock to his colleagues as to the audience. Following this show Peters signed his legal right to one quarter of the Alarm name and logo over to the other three. Peters and Sharp both embarked on solo careers.\n\nPost-Brixton Academy\nAfter the Alarm, Peters teamed with a band of unknown musicians to form The Poets of Justice (which included his wife Jules Peters on keyboards), and he embarked on a solo career which produced a number of singles and albums. In 2000, the Alarm released a complete collection covering all recorded material by the band. It also included sleeve notes to which all four members had contributed. This was the first project to which all four original members had contributed since Peters left the band in 1991.\n\nFollowing the box-set release, Peters used the Alarm name on the tour to promote the complete collection release. The musicians Peters used were his backing band in the late 1990s; Steve Grantley from Stiff Little Fingers, Craig Adams from The Sisters of Mercy, The Mission and The Cult, and James Stevenson from Chelsea and Gene Loves Jezebel. The Alarm name was followed by an MM++ that indicated in Roman numerals what year the record was released. Over the past decade, Peters has replaced the band members as needed when Adams, Stevenson or Grantley have pursued other projects.\n\nIn February 2004, Peters' line-up of Alarm MM++ carried out a hoax on the British music industry by issuing \"45 RPM\" under the fictitious name The Poppy Fields. Peters, having garnered positive feedback for the song, decided to disassociate it from his veteran band to have it judged on its own merits, and recruited a young group called the Wayriders to lip-sync the song in the music video. The so-called Poppy Fields took \"45 RPM\" into the UK Top 30 before the hoax was revealed, setting the stage for the album In the Poppy Fields.\n\nThe Alarm appeared together for a one-off show on the VH1 television show Bands Reunited in 2005 and performed live in London with a subsequent expanded DVD/CD release of the episode.\n\nIn 2005, Peters discovered that he was suffering from chronic lymphocytic leukaemia. At this time, he started a cancer foundation called Love Hope Strength to help with the fight against cancer. In October 2007, Peters, along with 38 other musicians, cancer survivors and supporters, made a 14-day trek to the base camp at Mount Everest to perform the highest concert on land to raise awareness and money to fight cancer. Other musicians included Cy Curnin and Jamie West-Oram of The Fixx, Glenn Tilbrook of Squeeze, Slim Jim Phantom of The Stray Cats and Nick Harper. Peters is the co-founder of The Love Hope and Strength Foundation with fellow leukemia survivor James Chippendale, CEO of Ascend Insurance Brokerage in Austin, Texas.\n\nIn 2006, the new version of Alarm MM++ released the album Under Attack. It spawned another UK Top 30 hit with \"Superchannel\". In 2008, a studio album titled Guerrilla Tactics was released. The Alarm's song \"Sixty Eight Guns\" has been featured in a television advertisement for Heineken in the U.S. In April 2008, Sharp launched AOR – Spirit of The Alarm, his own version of the band, to showcase the band's American set lists from the late 1980s.\n\nIn 2009, the Alarm released 21, a \"best of\" collection of songs from their 2000's output. The collection included a remix of the single \"45 RPM\" as well as remixes and alternate takes of 20 other songs. This was followed by the studio album Direct Action in April 2010 and then by The Sound And Fury in 2011, an album of 12 re-imagined tracks from the catalog of the Alarm and of Mike Peters.\n\n2013 saw the release of Vinyl, which featured tracks written for the soundtrack]album and performed by Mike Peters and The Alarm with guest vocals from the film's actors Phil Daniels and Keith Allen. The film, written and directed by Sara Sugarman, is loosely based on the true events surrounding The Poppy Fields and release of the single \"45 RPM.\" It also features a cameo appearance of Mike Peters. Vinyl is a British comedy film that has aging rock star Johnny Jones (Phil Daniels) fool the media into believing his music is that of a fresh, young rock group from North Wales. The Alarm took the step of touring the soundtrack album with a showing of the film at selected venues in the UK during March and April 2013.\n\nIn 2014, Peters started the process of \"reimagining\" the Alarm's full, original albums for the 21st century. He began with Declaration [30th Anniversary] in 2014, followed quickly by Peace Train , a collection of b-sides reimagined. Some of the songs have updated lyrics to match the passage of time, and others contain edited verses, or lyrics from demo versions of the songs before they were recorded for the albums and singles. Peters continued this process for Strength : [30th Anniversary] and its companion album Majority in 2015.\n\nThe band released the album Equals on In Grooves Records in July 2018. This was followed by the companion album Sigma, released a year later. Peters' wife Jules currently plays keyboards in the band, and James Stevenson plays guitar, bass guitar, bass pedals and a bass/six string double-neck guitar made for him by Gordon-Smith Guitars.\n\nIn 2021, the band wrote and recorded the album War in 50 days, reflecting on the pandemic and lockdown situation.\n\n\"The Red Wall of Cymru\", as recorded by the Alarm, is Wales' official anthem for the Euro 2020. It features fans recorded in football grounds all across Wales.\n\nMike Peters died on 29 April 2025 after his 30 year long battle with lymphoma. May his songs and spirit live on.\n\nThe band in various forms still meet and play on occasions at local venues. Mike had a strong following and working on his solo career and still was heavily involved in music up until his death. <a href=\"https://www.last.fm/music/The+Alarm\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T15:50:08.585502",
  "discogs_id": "181236",
  "discogs_url": "https://www.discogs.com/artist/181236",
  "followers": 82935,
  "formed_date": null,
  "genres": [
    "Rock",
    "new wave",
    "80s",
    "rock",
    "alternative",
    "seen live"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features211/v4/be/5a/23/be5a231d-5bac-e8a5-4e42-c0a760dd9075/mza_16014459323870077959.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb9851a9e6ed2e689f967ccfef",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab676161000051749851a9e6ed2e689f967ccfef",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f1789851a9e6ed2e689f967ccfef",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "cee3e39e-fb10-414d-9f11-b50fa7d6fb7a",
  "lastfm_url": "https://www.last.fm/music/The+Alarm",
  "local_images": {
    "hi-res": "public/artist/the-alarm/the-alarm-hi-res.jpg",
    "medium": "public/artist/the-alarm/the-alarm-medium.jpg",
    "small": "public/artist/the-alarm/the-alarm-small.jpg"
  },
  "name": "The Alarm",
  "popularity": 42,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features211/v4/be/5a/23/be5a231d-5bac-e8a5-4e42-c0a760dd9075/mza_16014459323870077959.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "468568",
      "name": "The Alarm",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/the-alarm/468568"
    },
    "discogs": {
      "id": 181236,
      "original_name": "The Alarm",
      "role": ""
    },
    "lastfm": {
      "bio_content": "The Alarm were a Welsh alternative rock band that formed in Rhyl, Wales in 1981. Initially formed as a punk band, The Toilets, in 1977 under lead vocalist Mike Peters, the group soon embraced arena rock and included marked influences from Welsh language and culture. By opening for acts such as U2 and Bob Dylan, they became a popular new wave pop band of the 1980s.\n\nThe Alarm's highest-charting single in Britain is 1983's \"Sixty Eight Guns\", which reached number 17 on the UK Singles Chart. Their 1984 album Declaration, which contained \"Sixty Eight Guns\", peaked at number six on the UK Albums Chart.\n\nHistory\nEarly years\nIn 1977, a punk band was formed in Rhyl, Wales, billed as The Toilets. It contained Mike Peters (alias Eddie Bop), Glyn Crossley (alias Steve Shock), Richard \"O'Malley\" Jones (alias Bo Larks) and Nigel Buckle (alias Des Troy). In 1978 the band renamed themselves Quasimodo and played note-for-note covers of The Who's Live at Leeds with guitarist Dave Sharp. This group also included Karl Wallinger on keyboards. Later the group named themselves Seventeen, with both Mike Peters and Nigel Buckle alongside Eddie MacDonald (who had been Mike Peters' next-door-but-one neighbour in Edward Henry Street, Rhyl). Seventeen began as a three-piece but were joined by guitarist David Kitchingman (who changed his name to Dave Sharp) and became a power pop mod band that released the single (\"Don't Let Go\"/\"Bank Holiday Weekend\") in March 1980 and toured with the Stray Cats later that year. They played their last concert under the name of Alarm Alarm in January 1981 at the Half Moon, Herne Hill, London.\n\nThe band soon reformed under the new name of The Alarm (with Nigel Buckle changing his surname to 'Twist'), and played their first gig at The Victoria Hotel, Prestatyn, North Wales on 6 June 1981, opening with \"Shout to the Devil\", which later appeared on the album Declaration.\n\nThey moved from North Wales to London in September 1981, and the band recorded a one-off 7\" single. 1,000 copies were pressed that month, featuring \"Unsafe Building\" on the \"electric\" side and \"Up For Murder\" on the \"acoustic\" side. The single was noticed by Mick Mercer, who featured it as his single of the month in his ZigZag magazine. The band played a show with The Fall in December 1981, where a journalist from Sounds noticed them. This journalist attended the band's next show at Upstairs at Ronnie's in London's West End. Also at this show was a representative of Wasted Talent, who arranged a meeting between the band and Ian Wilson, U2's agent. Wilson arranged another show in order to assess the band's quality, was impressed, and soon became their manager. To celebrate, The Alarm played with U2 at the Lyceum Ballroom on 22 December 1981. \n\nIn 1982, the band began to record demos for various record labels, but had little success. At this point, they were playing with three acoustic guitarists. The band were eventually offered a deal by I.R.S. Records. This forced them to make a decision on who was to play which musical instrument, and it was decided that Peters would concentrate on singing, with Sharp on guitar and Macdonald playing bass.\n\n\"Marching On\" was released as a single in October 1982, and the band's sound started to become clear. On stage, they almost always began gigs acoustically, then finished with electric guitars. Constant gigging in London helped the band build a following, and in December 1982, they played four shows with U2. These shows were the first time that Bono joined the Alarm on stage.\n\nThe song \"The Stand\" was recorded in Battersea in April 1983, and was released in the UK as a single. The song's lyrics were inspired by Stephen King's novel of the same name. Outside the UK, the song was released as part of a five-track EP titled The Alarm. The EP was released to coincide with the Alarm's first tour of the U.S. in June 1983. Following the success of the sessions that produced \"The Stand\", I.R.S. picked up their recording option on the band, signalling the start of work on an album. Another session with producer Mick Glossop was arranged to produce the single \"Blaze of Glory\".\n\nIn June 1983, the Alarm embarked on their first tour of the U.S., supporting U2 on the War Tour. The 18-date tour established the band in the U.S. \"The Stand\" was released by I.R.S. to capitalize on this development, supported by TV appearances on The Cutting Edge and American Bandstand.\n\nFollowing the tour, the band returned to the UK to begin working with producer Alan Shacklock. They focused on re-recording \"Blaze of Glory\" and \"Sixty Eight Guns\". After the sessions, the band recorded a video for \"Sixty Eight Guns\" and flew back to America to begin their first headlining American tour as well as to play in support of The Pretenders. \"Sixty Eight Guns\" was released as a single on 12 September 1983 and charted the following week at number 50. The same week, the band performed the song on the music show Top of the Pops. The song climbed into the Top 20, and it remains their highest-charting single, peaking at No. 17.\n\nMid-career\nThe band had been recording an album from July 1983, and by the time of the Top of the Pops appearance, they had recorded the backing tracks to most of the songs. After completing a U.S. tour and a headline tour of the UK in late 1983, the band returned to the studio to record the backing tracks for the rest of the songs.\n\nOn 6 November 1983, the band recorded an acoustic radio session for the BBC. This session saw the debut of three brand new songs: \"Walk Forever by My Side\", \"One Step Closer to Home\" and \"Unbreak the Promise\".\n\nOn 7 November, the band returned to the recording studio to finish recording the album, now titled Declaration. In December, the Alarm returned to the U.S. for a third headline tour. The weather was atrocious, and on 6 December, the car in which the band was travelling crashed, but none of the four members was injured. They returned to the UK on 17 December and appeared as part of an Anti-Nuclear Benefit Concert at the Apollo Theatre in London.\n\nWhile the band had been in the U.S., Alan Shacklock and sound engineer Chris Porter finished mixing the album. The band played a handful of gigs supporting The Police over Christmas, and by 5 January 1984, the album had been mixed and finalised. Declaration was released by I.R.S. Records on 14 February 1984. A week later, the album entered the UK Albums Chart at Number 6.\n\nIn November 1984, the Alarm recorded demos of nine new songs, including \"Absolute Reality\". They played their new material to the American producer Jimmy Iovine, who agreed to come to the UK in January 1985 to begin work on the follow-up to Declaration. During this period, Peters appeared solo at a number of events, including the Greenbelt Festival in Northamptonshire, playing Alarm material as well as some unrecorded personal songs. Studio sessions were booked for early 1985, and a UK headline tour was booked for May 1985 to coincide with the release of the new album. However, Iovine never came to the UK to work with the Alarm, eventually citing personal reasons. The band had to cancel the sessions and look for another producer. Alan Shacklock was unavailable, so Ian Wilson (the band's manager) convinced I.R.S. to release the Shacklock-produced \"Absolute Reality\" as a single to promote the UK dates in May. \"Absolute Reality\" was released on 18 February 1985, entering the top 40 of the UK Singles Chart a week later. After a series of appearances at European festivals and a new producer (Mike Howlett), the Alarm began work on their follow-up album Strength. The band teamed with MTV, I.R.S. Records, and UCLA's Campus Events to present one of the early live satellite broadcasts from UCLA on 12 April 1986. They played at Queen's Live at Wembley '86 concert on 12 July 1986.\n\nStrength was released on 1 October 1985 and was another UK success, and brought them into the top 40 of the US Billboard 200 album chart for the first time; additionally, the single \"Spirit of '76\" was a top 40 UK hit. The Alarm took a break after the supporting tour, but returned in 1987 with Eye of the Hurricane and landed a tour slot supporting Bob Dylan. The concert EP Electric Folklore Live, followed in 1988. They also had a hit single in the UK in 1987 with \"Rain in the Summertime\" (from Eye of the Hurricane), which gave them their second-best placing on the UK chart.\n\nLater years\nThe band toured extensively through the United States and Europe through the 1980s into 1991. They gained much popularity in 1983 when they were the opening act for U2, a band to whom they often were compared musically. On 13 March 1988, the Alarm performed at The Fillmore in San Francisco with The 77s and House of Freaks.\n\n1989's Change was an homage to the group's native Wales, and was accompanied by an alternate Welsh-language version Newid. Produced by Tony Visconti, Change spawned the group's biggest Modern Rock hit in America, \"Sold Me Down the River\", which also put them in the U.S. Billboard Hot 100 Top 50 for the first and only time. \"Devolution Working Man Blues\" and \"Love Don't Come Easy\" also earned radio airplay, and the track \"A New South Wales\" had an appearance by the Welsh Symphony Orchestra and the Morriston Orpheus Male Voice Choir. Although it was popular in Wales, it did not sell as well as the group's earlier works, and internal band dissension, exacerbated by deaths in both Peters' and Twist's families, made 1991's Raw the original Alarm's final effort.\n\nAfter the release of Raw in 1991, despite their success and relative longevity, Peters announced on stage at the Brixton Academy that he was leaving the band.\n\n\"We've shared some great moments in time over the last ten years and tonight I would like to thank all the people who have supported me from the beginning to the end. Tonight this is my last moment with the Alarm, I'm going out in a Blaze of Glory – my hands are held up high\". This came as much of a shock to his colleagues as to the audience. Following this show Peters signed his legal right to one quarter of the Alarm name and logo over to the other three. Peters and Sharp both embarked on solo careers.\n\nPost-Brixton Academy\nAfter the Alarm, Peters teamed with a band of unknown musicians to form The Poets of Justice (which included his wife Jules Peters on keyboards), and he embarked on a solo career which produced a number of singles and albums. In 2000, the Alarm released a complete collection covering all recorded material by the band. It also included sleeve notes to which all four members had contributed. This was the first project to which all four original members had contributed since Peters left the band in 1991.\n\nFollowing the box-set release, Peters used the Alarm name on the tour to promote the complete collection release. The musicians Peters used were his backing band in the late 1990s; Steve Grantley from Stiff Little Fingers, Craig Adams from The Sisters of Mercy, The Mission and The Cult, and James Stevenson from Chelsea and Gene Loves Jezebel. The Alarm name was followed by an MM++ that indicated in Roman numerals what year the record was released. Over the past decade, Peters has replaced the band members as needed when Adams, Stevenson or Grantley have pursued other projects.\n\nIn February 2004, Peters' line-up of Alarm MM++ carried out a hoax on the British music industry by issuing \"45 RPM\" under the fictitious name The Poppy Fields. Peters, having garnered positive feedback for the song, decided to disassociate it from his veteran band to have it judged on its own merits, and recruited a young group called the Wayriders to lip-sync the song in the music video. The so-called Poppy Fields took \"45 RPM\" into the UK Top 30 before the hoax was revealed, setting the stage for the album In the Poppy Fields.\n\nThe Alarm appeared together for a one-off show on the VH1 television show Bands Reunited in 2005 and performed live in London with a subsequent expanded DVD/CD release of the episode.\n\nIn 2005, Peters discovered that he was suffering from chronic lymphocytic leukaemia. At this time, he started a cancer foundation called Love Hope Strength to help with the fight against cancer. In October 2007, Peters, along with 38 other musicians, cancer survivors and supporters, made a 14-day trek to the base camp at Mount Everest to perform the highest concert on land to raise awareness and money to fight cancer. Other musicians included Cy Curnin and Jamie West-Oram of The Fixx, Glenn Tilbrook of Squeeze, Slim Jim Phantom of The Stray Cats and Nick Harper. Peters is the co-founder of The Love Hope and Strength Foundation with fellow leukemia survivor James Chippendale, CEO of Ascend Insurance Brokerage in Austin, Texas.\n\nIn 2006, the new version of Alarm MM++ released the album Under Attack. It spawned another UK Top 30 hit with \"Superchannel\". In 2008, a studio album titled Guerrilla Tactics was released. The Alarm's song \"Sixty Eight Guns\" has been featured in a television advertisement for Heineken in the U.S. In April 2008, Sharp launched AOR – Spirit of The Alarm, his own version of the band, to showcase the band's American set lists from the late 1980s.\n\nIn 2009, the Alarm released 21, a \"best of\" collection of songs from their 2000's output. The collection included a remix of the single \"45 RPM\" as well as remixes and alternate takes of 20 other songs. This was followed by the studio album Direct Action in April 2010 and then by The Sound And Fury in 2011, an album of 12 re-imagined tracks from the catalog of the Alarm and of Mike Peters.\n\n2013 saw the release of Vinyl, which featured tracks written for the soundtrack]album and performed by Mike Peters and The Alarm with guest vocals from the film's actors Phil Daniels and Keith Allen. The film, written and directed by Sara Sugarman, is loosely based on the true events surrounding The Poppy Fields and release of the single \"45 RPM.\" It also features a cameo appearance of Mike Peters. Vinyl is a British comedy film that has aging rock star Johnny Jones (Phil Daniels) fool the media into believing his music is that of a fresh, young rock group from North Wales. The Alarm took the step of touring the soundtrack album with a showing of the film at selected venues in the UK during March and April 2013.\n\nIn 2014, Peters started the process of \"reimagining\" the Alarm's full, original albums for the 21st century. He began with Declaration [30th Anniversary] in 2014, followed quickly by Peace Train , a collection of b-sides reimagined. Some of the songs have updated lyrics to match the passage of time, and others contain edited verses, or lyrics from demo versions of the songs before they were recorded for the albums and singles. Peters continued this process for Strength : [30th Anniversary] and its companion album Majority in 2015.\n\nThe band released the album Equals on In Grooves Records in July 2018. This was followed by the companion album Sigma, released a year later. Peters' wife Jules currently plays keyboards in the band, and James Stevenson plays guitar, bass guitar, bass pedals and a bass/six string double-neck guitar made for him by Gordon-Smith Guitars.\n\nIn 2021, the band wrote and recorded the album War in 50 days, reflecting on the pandemic and lockdown situation.\n\n\"The Red Wall of Cymru\", as recorded by the Alarm, is Wales' official anthem for the Euro 2020. It features fans recorded in football grounds all across Wales.\n\nMike Peters died on 29 April 2025 after his 30 year long battle with lymphoma. May his songs and spirit live on.\n\nThe band in various forms still meet and play on occasions at local venues. Mike had a strong following and working on his solo career and still was heavily involved in music up until his death. <a href=\"https://www.last.fm/music/The+Alarm\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "The Alarm were a Welsh alternative rock band that formed in Rhyl, Wales in 1981. Initially formed as a punk band, The Toilets, in 1977 under lead vocalist Mike Peters, the group soon embraced arena rock and included marked influences from Welsh language and culture. By opening for acts such as U2 and Bob Dylan, they became a popular new wave pop band of the 1980s.\n\nThe Alarm's highest-charting single in Britain is 1983's \"Sixty Eight Guns\", which reached number 17 on the UK Singles Chart. <a href=\"https://www.last.fm/music/The+Alarm\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 122402,
      "mbid": "cee3e39e-fb10-414d-9f11-b50fa7d6fb7a",
      "name": "The Alarm",
      "playcount": 1132138,
      "similar_artists": [
        {
          "name": "The Call",
          "url": "https://www.last.fm/music/The+Call"
        },
        {
          "name": "Big Country",
          "url": "https://www.last.fm/music/Big+Country"
        },
        {
          "name": "The Smithereens",
          "url": "https://www.last.fm/music/The+Smithereens"
        },
        {
          "name": "The Icicle Works",
          "url": "https://www.last.fm/music/The+Icicle+Works"
        },
        {
          "name": "The Fixx",
          "url": "https://www.last.fm/music/The+Fixx"
        }
      ],
      "tags": [
        "80s",
        "rock",
        "new wave",
        "alternative",
        "seen live"
      ],
      "url": "https://www.last.fm/music/The+Alarm"
    },
    "spotify": {
      "followers": 82935,
      "genres": [
        "new wave"
      ],
      "id": "0oQLexIBY9SlMhtbSIPFAO",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb9851a9e6ed2e689f967ccfef",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab676161000051749851a9e6ed2e689f967ccfef",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f1789851a9e6ed2e689f967ccfef",
          "width": 160
        }
      ],
      "name": "The Alarm",
      "popularity": 42,
      "url": "https://open.spotify.com/artist/0oQLexIBY9SlMhtbSIPFAO"
    }
  },
  "spotify_id": "0oQLexIBY9SlMhtbSIPFAO",
  "spotify_url": "https://open.spotify.com/artist/0oQLexIBY9SlMhtbSIPFAO",
  "updated_at": "2025-07-05T15:50:14.920786",
  "wikipedia_url": null
}