{
  "apple_music_id": "107917",
  "apple_music_url": "https://music.apple.com/gb/artist/nine-inch-nails/107917",
  "biography": "Nine Inch Nails, commonly abbreviated as NIN (stylized as NIИ), is an American industrial rock band formed in 1988 in Cleveland, Ohio. Singer, songwriter, multi-instrumentalist, and producer Trent Reznor was the only permanent member of the band until the official addition of English musician Atticus Ross in 2016. \n\nReznor chose the name \"Nine Inch Nails\" because it \"abbreviated easily\" rather than for \"any literal meaning\". Other rumored explanations have circulated, alleging that Reznor chose to reference Jesus' crucifixion with nine-inch spikes,  or Freddy Krueger's nine-inch fingernails. The Nine Inch Nails logo first appeared on the music video for their debut single, \"Down In It\". Reznor and Gary Talpas designed the logo, inspired by Tibor Kalman's typography on the Talking Heads album Remain in Light. The logo features the band's initials, with the second N mirrored. Talpas, a native of Cleveland, continued to design Nine Inch Nails packaging until 1997.\n\nThe band's debut album, Pretty Hate Machine (1989), was released via TVT Records. After disagreeing with TVT about how to promote the album, the band signed with Interscope Records and released the EP Broken (1992). The following albums, The Downward Spiral (1994) and The Fragile (1999), were released to critical acclaim and commercial success.\n\nFollowing a hiatus, Nine Inch Nails resumed touring in 2005 and released the album With Teeth (2005). Following the release of the album Year Zero (2007), the band left Interscope after a feud. Nine Inch Nails continued touring and independently released Ghosts I–IV (2008) and The Slip (2008) before a second hiatus. Their eighth album, Hesitation Marks (2013), was followed by a trilogy which consisted of the EPs Not the Actual Events (2016) and Add Violence (2017) and their ninth album Bad Witch (2018). In 2020, Nine Inch Nails simultaneously released two further installments in the Ghosts series: Ghosts V: Together and Ghosts VI: Locusts. The band announced a number of new projects in 2024 through their multimedia company With Teeth, and plan to embark on the Peel It Back Tour in 2025.\n\nWhen touring, Reznor typically assembles a live band to perform with him under the Nine Inch Nails name. This live band has varied over the decades, with various members leaving and returning; the most recent lineup consists of Robin Finck (who initially joined in 1994), Alessandro Cortini (who initially joined in 2005), and Ilan Rubin (who initially joined in 2009) alongside Reznor and Ross. The band's concerts are noted for their extensive use of thematic visual elements, complex special effects, and elaborate lighting. Songs are often rearranged to fit any given performance, and melodies or lyrics of songs that are not scheduled to be performed are sometimes assimilated into other songs.\nNine Inch Nails as a live band is generally understood to be a separate entity from its recording studio-based component. Occasionally, past band members are invited to participate in the process when not directly involved with recording new material, Nine Inch Nails' lineup tends to change drastically between major tours. Aside from Trent Reznor remaining on lead vocals, nothing about the live band has remained constant since its inception. Reznor cited the long gestation period between studio albums as part of the reason for these frequent personnel changes.\n\nNine Inch Nails have sold over 20 million records and been nominated for 13 Grammy Awards, winning for the songs \"Wish\" in 1992 and \"Happiness in Slavery\" in 1996. Time magazine named Reznor one of its most influential people in 1997, while Spin magazine has described him as \"the most vital artist in music\". In 2004, Rolling Stone placed Nine Inch Nails at No. 94 on its list of the 100 greatest artists of all time. Nine Inch Nails were inducted into the Rock and Roll Hall of Fame in 2020, after being nominated in 2014 (their first year of eligibility) and again in 2015.\n\nMusic and lyrics\n\nNine Inch Nails has been described as incorporating alternative rock, industrial rock, industrial dance, industrial, electro-industrial, industrial metal, electronic rock, and alternative metal. AllMusic's Steve Huey states that \"Nine Inch Nails were the most popular industrial group ever and were largely responsible for bringing the music to a mass audience\". Reznor has never referred to his own work as industrial music, but admits to borrowing techniques from such early industrial bands as Throbbing Gristle and Test Dept. Despite the disparity between those artists initially operating under the term \"industrial\" and Nine Inch Nails, it has become common in journalistic descriptions of Reznor's body of work to describe it as such. Reznor acknowledged in Spin magazine that \"Down in It\" was influenced by early Skinny Puppy, particularly the band's song \"Dig It\"; other songs from Pretty Hate Machine and With Teeth have been described as synth-pop. Reviewing The Fragile, critic Steve Cooper noted that the album juxtaposes widely varied genres, such as solo piano in \"The Frail\" and drum and bass elements in \"Starfuckers, Inc.\" Ambient music has been featured in some of Nine Inch Nails' music, including on Ghosts I–IV (which is specifically dark ambient), Hesitation Marks, The Downward Spiral, The Slip, and The Fragile.\n\nSongs such as \"Wish\" and \"The Day the World Went Away\" exhibit terraced dynamics. Reznor's singing follows a similar pattern, frequently moving from whispers to screams. He also has used software to alter his voice in several songs, as evident in \"Starfuckers, Inc.\" and \"Burn\". The band's music also occasionally contains complex time signatures, notably in \"The Collector\" from With Teeth and concert favorite \"March Of The Pigs\". Reznor uses noise and distortion in his song arrangements and incorporates dissonance with chromatic melody and/or harmony. These techniques are all used in the song \"Hurt\", which contains a highly dissonant tritone played on guitar during the verses, a B5#11, emphasized when Reznor sings the eleventh note on the word \"I\" every time the B/E# dyad is played. \"Closer\" concludes with a chromatic piano motif: the melody is debuted during the second verse of \"Piggy\" on organ, then reappears in power chords at drop D tuning throughout the chorus of \"Heresy\", while an inverted (ascending) version is used throughout \"A Warm Place\", and then recurs in its original state for the final time on \"The Downward Spiral\".\n\nOn The Fragile, Reznor revisits the technique of repeating a motif multiple times throughout different songs, either on a different musical instrument with a transposed harmony or in an altered tempo. Many of the songs on Year Zero contain an extended instrumental ending, which encompasses the entire second half of the three-minute long \"The Great Destroyer\". AllMusic's review described the album's laptop-mixed sound: \"Guitars squall against glitches, beeps, pops, and blotches of blurry sonic attacks. Percussion looms large, distorted, organic, looped, screwed, spindled and broken.\" Lyrical themes found in Nine Inch Nails songs are largely concerned with dark explorations of the self ranging from religion, greed, fame, lust, addiction, self-deception, aging, regret, and nihilism. Occasionally, the lyrics depart from their introspective nature to deal with a topic like politics, which is the focus of Year Zero. Three Nine Inch Nails albums are concept albums: The Downward Spiral, The Fragile, and Year Zero. The album With Teeth was originally set to be a concept album about an endless dream occurring in reality, but Reznor eventually took this idea out of the record.\n\nInfluences\n\nNine Inch Nails' earliest influence was the punk rock band the Clash; Reznor stated that he started out trying to directly imitate them, only to abandon that direction due to his lack of a political message. Other early influences include Ministry and Skinny Puppy, which helped shape 1989's Pretty Hate Machine. The album's liner notes also paid tribute to Public Enemy and Prince. Another large influence on the band's sound is Gary Numan, which is evident as Reznor once said that \"after hearing 'Cars' I knew I wanted to make music with synthesizers\". The 2005 single \"Only\" exemplifies the disco-style beats and synthesizers drawn from Numan's persuasion. Other artists of significance to Nine Inch Nails include acts such as Depeche Mode, Queen, King Crimson, Devo, the Cure, Joy Division, U2, Bauhaus, Adam Ant, Coil, and Soft Cell.\n\nReznor has toured with some of his influences, including a brief tour opening for Skinny Puppy in 1988. In 1995, Nine Inch Nails went on tour with David Bowie, who, along with Pink Floyd, had been a significant influence on The Downward Spiral. In 2006, Nine Inch Nails went on tour with Bauhaus, on their Summer Amphitheatre Tour.\n\nLegacy\n\nNine Inch Nails has influenced many newer artists, which according to Reznor range from \"generic imitations\" dating from his initial success to younger bands echoing his style in a \"truer, less imitative way\". Following the release of The Downward Spiral, mainstream artists began to take notice of Nine Inch Nails' influence: David Bowie compared Reznor's impact to that of The Velvet Underground. Guns N' Roses singer Axl Rose was influenced heavily by Nine Inch Nails in changing his band's sound to an industrial style in the mid-90's. Bob Ezrin, producer for Pink Floyd, Kiss, Alice Cooper, and Peter Gabriel, described Reznor in 2007 as a \"true visionary\" and advised aspiring artists to take note of his no-compromise attitude. Nine Inch Nails has been credited by music journalists for popularizing industrial music, despite ambivalence from Reznor.\n\nThe act has received four awards from 25 nominations, including two Grammy Awards for the songs \"Wish\" and \"Happiness in Slavery\" in 1993 and 1996 respectively. Nine Inch Nails have received two Kerrang! Awards; one of them being the Kerrang! Icon in 2006, honoring the band's overall contributions since 1988 and long-standing influence on rock music. The band has also received nine nominations from the MTV Video Music Awards for several of its videos, including two nominations for the \"Closer\" music video and five nominations for \"The Perfect Drug\" music video, including Video of the Year.\n\nIn 1997, Reznor appeared in Time magazine's list of the year's most influential people, and Spin described him as \"the most vital artist in music\". The Recording Industry Association of America certified sales for 10.5 million units of the band's albums in the United States, which accounted for roughly half of the band's reported sales worldwide at that time. In 2003, Rolling Stone magazine placed The Downward Spiral at No. 200 in a 2003 list of The 500 Greatest Albums of All Time, and by the following year ranked Nine Inch Nails at No. 94 in their The 100 Greatest Artists of All Time list.\n\nIn 2019, Reznor and Ross received songwriting and production credits for the number-one single \"Old Town Road\" by Lil Nas X, which sampled their track \"34 Ghosts IV\" from Ghosts I–IV. \"Old Town Road\" broke the record for most consecutive weeks at number one on the Billboard Hot 100. As producers for the song, Reznor and Ross won a CMA Award for the 'Musical Event of the Year', along with Lil Nas X, featured artist Billy Ray Cyrus and producer YoungKio.\n\nIn January 2020, after previous nominations in 2014 and 2015, Nine Inch Nails (Alessandro Cortini, Robin Finck, Danny Lohner, Trent Reznor, Atticus Ross, Ilan Rubin and Chris Vrenna) were named as inductees of the 2020 class of the Rock and Roll Hall of Fame.\n\nOfficial members\n\nOfficial members\nTrent Reznor – lead and backing vocals, guitars, bass, keyboards, synthesizers, saxophone, piano, programming, drums, percussion (1988–present)\nAtticus Ross – keyboards, synthesizers, programming, bass, backing vocals (2016–present)\n\nAdditional touring lineup\nRobin Finck – guitars, synthesizers, keyboards, lap steel, violin, backing vocals (1994–1996, 1999–2000, 2008–2009, 2013–present)\nAlessandro Cortini – bass, keyboards, synthesizers, guitars, backing vocals (2005–2008, 2013–present)\nIlan Rubin – drums, percussion, bass, guitars, cello, keyboards, backing vocals (2008–2009, 2013–present)\n\nKey former members\nChris Vrenna – drums, percussion, keyboards, samplers (1988–1990, 1992–1997)\nRichard Patrick – guitars, backing vocals (1989–1993)\nJeff Ward – drums (1990–1991; died 1993)\nJames Woolley – keyboards, synthesizers, programming, backing vocals (1991–1994; died 2016)\nDanny Lohner – bass, guitars, synthesizers, backing vocals (1993–2003)\nCharlie Clouser – keyboards, synthesizers, theremin, percussion, programming, backing vocals (1994–2001)\nJerome Dillon – drums, guitars (1999–2005)\nJeordie White (a.k.a. Twiggy Ramirez) – bass, guitars, backing vocals (2005–2007)\nAaron North – guitars, backing vocals (2005–2007)\nJosh Freese – drums, marimba (2005, 2005–2008)\nJustin Meldal-Johnsen – bass, backing vocals (2008–2009) <a href=\"https://www.last.fm/music/Nine+Inch+Nails\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T14:39:18.837370",
  "discogs_id": "3857",
  "discogs_url": "https://www.discogs.com/artist/3857",
  "followers": 2936682,
  "formed_date": null,
  "genres": [
    "Alternative",
    "industrial rock",
    "industrial",
    "industrial metal",
    "alternative metal",
    "nu metal",
    "rock",
    "alternative",
    "electronic"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/4b/19/85/4b1985cc-9db6-b1fa-d3fe-7aad3fb6e500/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb047095c90419cf2a97266f77",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174047095c90419cf2a97266f77",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178047095c90419cf2a97266f77",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "b7ffd2af-418f-4be2-bdd1-22f8b48613da",
  "lastfm_url": "https://www.last.fm/music/Nine+Inch+Nails",
  "local_images": {
    "hi-res": "public/artist/nine-inch-nails/nine-inch-nails-hi-res.jpg",
    "medium": "public/artist/nine-inch-nails/nine-inch-nails-medium.jpg",
    "small": "public/artist/nine-inch-nails/nine-inch-nails-small.jpg"
  },
  "name": "Nine Inch Nails",
  "popularity": 71,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/4b/19/85/4b1985cc-9db6-b1fa-d3fe-7aad3fb6e500/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Alternative"
      ],
      "id": "107917",
      "name": "Nine Inch Nails",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/nine-inch-nails/107917"
    },
    "discogs": {
      "id": 3857,
      "original_name": "Nine Inch Nails",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Nine Inch Nails, commonly abbreviated as NIN (stylized as NIИ), is an American industrial rock band formed in 1988 in Cleveland, Ohio. Singer, songwriter, multi-instrumentalist, and producer Trent Reznor was the only permanent member of the band until the official addition of English musician Atticus Ross in 2016. \n\nReznor chose the name \"Nine Inch Nails\" because it \"abbreviated easily\" rather than for \"any literal meaning\". Other rumored explanations have circulated, alleging that Reznor chose to reference Jesus' crucifixion with nine-inch spikes,  or Freddy Krueger's nine-inch fingernails. The Nine Inch Nails logo first appeared on the music video for their debut single, \"Down In It\". Reznor and Gary Talpas designed the logo, inspired by Tibor Kalman's typography on the Talking Heads album Remain in Light. The logo features the band's initials, with the second N mirrored. Talpas, a native of Cleveland, continued to design Nine Inch Nails packaging until 1997.\n\nThe band's debut album, Pretty Hate Machine (1989), was released via TVT Records. After disagreeing with TVT about how to promote the album, the band signed with Interscope Records and released the EP Broken (1992). The following albums, The Downward Spiral (1994) and The Fragile (1999), were released to critical acclaim and commercial success.\n\nFollowing a hiatus, Nine Inch Nails resumed touring in 2005 and released the album With Teeth (2005). Following the release of the album Year Zero (2007), the band left Interscope after a feud. Nine Inch Nails continued touring and independently released Ghosts I–IV (2008) and The Slip (2008) before a second hiatus. Their eighth album, Hesitation Marks (2013), was followed by a trilogy which consisted of the EPs Not the Actual Events (2016) and Add Violence (2017) and their ninth album Bad Witch (2018). In 2020, Nine Inch Nails simultaneously released two further installments in the Ghosts series: Ghosts V: Together and Ghosts VI: Locusts. The band announced a number of new projects in 2024 through their multimedia company With Teeth, and plan to embark on the Peel It Back Tour in 2025.\n\nWhen touring, Reznor typically assembles a live band to perform with him under the Nine Inch Nails name. This live band has varied over the decades, with various members leaving and returning; the most recent lineup consists of Robin Finck (who initially joined in 1994), Alessandro Cortini (who initially joined in 2005), and Ilan Rubin (who initially joined in 2009) alongside Reznor and Ross. The band's concerts are noted for their extensive use of thematic visual elements, complex special effects, and elaborate lighting. Songs are often rearranged to fit any given performance, and melodies or lyrics of songs that are not scheduled to be performed are sometimes assimilated into other songs.\nNine Inch Nails as a live band is generally understood to be a separate entity from its recording studio-based component. Occasionally, past band members are invited to participate in the process when not directly involved with recording new material, Nine Inch Nails' lineup tends to change drastically between major tours. Aside from Trent Reznor remaining on lead vocals, nothing about the live band has remained constant since its inception. Reznor cited the long gestation period between studio albums as part of the reason for these frequent personnel changes.\n\nNine Inch Nails have sold over 20 million records and been nominated for 13 Grammy Awards, winning for the songs \"Wish\" in 1992 and \"Happiness in Slavery\" in 1996. Time magazine named Reznor one of its most influential people in 1997, while Spin magazine has described him as \"the most vital artist in music\". In 2004, Rolling Stone placed Nine Inch Nails at No. 94 on its list of the 100 greatest artists of all time. Nine Inch Nails were inducted into the Rock and Roll Hall of Fame in 2020, after being nominated in 2014 (their first year of eligibility) and again in 2015.\n\nMusic and lyrics\n\nNine Inch Nails has been described as incorporating alternative rock, industrial rock, industrial dance, industrial, electro-industrial, industrial metal, electronic rock, and alternative metal. AllMusic's Steve Huey states that \"Nine Inch Nails were the most popular industrial group ever and were largely responsible for bringing the music to a mass audience\". Reznor has never referred to his own work as industrial music, but admits to borrowing techniques from such early industrial bands as Throbbing Gristle and Test Dept. Despite the disparity between those artists initially operating under the term \"industrial\" and Nine Inch Nails, it has become common in journalistic descriptions of Reznor's body of work to describe it as such. Reznor acknowledged in Spin magazine that \"Down in It\" was influenced by early Skinny Puppy, particularly the band's song \"Dig It\"; other songs from Pretty Hate Machine and With Teeth have been described as synth-pop. Reviewing The Fragile, critic Steve Cooper noted that the album juxtaposes widely varied genres, such as solo piano in \"The Frail\" and drum and bass elements in \"Starfuckers, Inc.\" Ambient music has been featured in some of Nine Inch Nails' music, including on Ghosts I–IV (which is specifically dark ambient), Hesitation Marks, The Downward Spiral, The Slip, and The Fragile.\n\nSongs such as \"Wish\" and \"The Day the World Went Away\" exhibit terraced dynamics. Reznor's singing follows a similar pattern, frequently moving from whispers to screams. He also has used software to alter his voice in several songs, as evident in \"Starfuckers, Inc.\" and \"Burn\". The band's music also occasionally contains complex time signatures, notably in \"The Collector\" from With Teeth and concert favorite \"March Of The Pigs\". Reznor uses noise and distortion in his song arrangements and incorporates dissonance with chromatic melody and/or harmony. These techniques are all used in the song \"Hurt\", which contains a highly dissonant tritone played on guitar during the verses, a B5#11, emphasized when Reznor sings the eleventh note on the word \"I\" every time the B/E# dyad is played. \"Closer\" concludes with a chromatic piano motif: the melody is debuted during the second verse of \"Piggy\" on organ, then reappears in power chords at drop D tuning throughout the chorus of \"Heresy\", while an inverted (ascending) version is used throughout \"A Warm Place\", and then recurs in its original state for the final time on \"The Downward Spiral\".\n\nOn The Fragile, Reznor revisits the technique of repeating a motif multiple times throughout different songs, either on a different musical instrument with a transposed harmony or in an altered tempo. Many of the songs on Year Zero contain an extended instrumental ending, which encompasses the entire second half of the three-minute long \"The Great Destroyer\". AllMusic's review described the album's laptop-mixed sound: \"Guitars squall against glitches, beeps, pops, and blotches of blurry sonic attacks. Percussion looms large, distorted, organic, looped, screwed, spindled and broken.\" Lyrical themes found in Nine Inch Nails songs are largely concerned with dark explorations of the self ranging from religion, greed, fame, lust, addiction, self-deception, aging, regret, and nihilism. Occasionally, the lyrics depart from their introspective nature to deal with a topic like politics, which is the focus of Year Zero. Three Nine Inch Nails albums are concept albums: The Downward Spiral, The Fragile, and Year Zero. The album With Teeth was originally set to be a concept album about an endless dream occurring in reality, but Reznor eventually took this idea out of the record.\n\nInfluences\n\nNine Inch Nails' earliest influence was the punk rock band the Clash; Reznor stated that he started out trying to directly imitate them, only to abandon that direction due to his lack of a political message. Other early influences include Ministry and Skinny Puppy, which helped shape 1989's Pretty Hate Machine. The album's liner notes also paid tribute to Public Enemy and Prince. Another large influence on the band's sound is Gary Numan, which is evident as Reznor once said that \"after hearing 'Cars' I knew I wanted to make music with synthesizers\". The 2005 single \"Only\" exemplifies the disco-style beats and synthesizers drawn from Numan's persuasion. Other artists of significance to Nine Inch Nails include acts such as Depeche Mode, Queen, King Crimson, Devo, the Cure, Joy Division, U2, Bauhaus, Adam Ant, Coil, and Soft Cell.\n\nReznor has toured with some of his influences, including a brief tour opening for Skinny Puppy in 1988. In 1995, Nine Inch Nails went on tour with David Bowie, who, along with Pink Floyd, had been a significant influence on The Downward Spiral. In 2006, Nine Inch Nails went on tour with Bauhaus, on their Summer Amphitheatre Tour.\n\nLegacy\n\nNine Inch Nails has influenced many newer artists, which according to Reznor range from \"generic imitations\" dating from his initial success to younger bands echoing his style in a \"truer, less imitative way\". Following the release of The Downward Spiral, mainstream artists began to take notice of Nine Inch Nails' influence: David Bowie compared Reznor's impact to that of The Velvet Underground. Guns N' Roses singer Axl Rose was influenced heavily by Nine Inch Nails in changing his band's sound to an industrial style in the mid-90's. Bob Ezrin, producer for Pink Floyd, Kiss, Alice Cooper, and Peter Gabriel, described Reznor in 2007 as a \"true visionary\" and advised aspiring artists to take note of his no-compromise attitude. Nine Inch Nails has been credited by music journalists for popularizing industrial music, despite ambivalence from Reznor.\n\nThe act has received four awards from 25 nominations, including two Grammy Awards for the songs \"Wish\" and \"Happiness in Slavery\" in 1993 and 1996 respectively. Nine Inch Nails have received two Kerrang! Awards; one of them being the Kerrang! Icon in 2006, honoring the band's overall contributions since 1988 and long-standing influence on rock music. The band has also received nine nominations from the MTV Video Music Awards for several of its videos, including two nominations for the \"Closer\" music video and five nominations for \"The Perfect Drug\" music video, including Video of the Year.\n\nIn 1997, Reznor appeared in Time magazine's list of the year's most influential people, and Spin described him as \"the most vital artist in music\". The Recording Industry Association of America certified sales for 10.5 million units of the band's albums in the United States, which accounted for roughly half of the band's reported sales worldwide at that time. In 2003, Rolling Stone magazine placed The Downward Spiral at No. 200 in a 2003 list of The 500 Greatest Albums of All Time, and by the following year ranked Nine Inch Nails at No. 94 in their The 100 Greatest Artists of All Time list.\n\nIn 2019, Reznor and Ross received songwriting and production credits for the number-one single \"Old Town Road\" by Lil Nas X, which sampled their track \"34 Ghosts IV\" from Ghosts I–IV. \"Old Town Road\" broke the record for most consecutive weeks at number one on the Billboard Hot 100. As producers for the song, Reznor and Ross won a CMA Award for the 'Musical Event of the Year', along with Lil Nas X, featured artist Billy Ray Cyrus and producer YoungKio.\n\nIn January 2020, after previous nominations in 2014 and 2015, Nine Inch Nails (Alessandro Cortini, Robin Finck, Danny Lohner, Trent Reznor, Atticus Ross, Ilan Rubin and Chris Vrenna) were named as inductees of the 2020 class of the Rock and Roll Hall of Fame.\n\nOfficial members\n\nOfficial members\nTrent Reznor – lead and backing vocals, guitars, bass, keyboards, synthesizers, saxophone, piano, programming, drums, percussion (1988–present)\nAtticus Ross – keyboards, synthesizers, programming, bass, backing vocals (2016–present)\n\nAdditional touring lineup\nRobin Finck – guitars, synthesizers, keyboards, lap steel, violin, backing vocals (1994–1996, 1999–2000, 2008–2009, 2013–present)\nAlessandro Cortini – bass, keyboards, synthesizers, guitars, backing vocals (2005–2008, 2013–present)\nIlan Rubin – drums, percussion, bass, guitars, cello, keyboards, backing vocals (2008–2009, 2013–present)\n\nKey former members\nChris Vrenna – drums, percussion, keyboards, samplers (1988–1990, 1992–1997)\nRichard Patrick – guitars, backing vocals (1989–1993)\nJeff Ward – drums (1990–1991; died 1993)\nJames Woolley – keyboards, synthesizers, programming, backing vocals (1991–1994; died 2016)\nDanny Lohner – bass, guitars, synthesizers, backing vocals (1993–2003)\nCharlie Clouser – keyboards, synthesizers, theremin, percussion, programming, backing vocals (1994–2001)\nJerome Dillon – drums, guitars (1999–2005)\nJeordie White (a.k.a. Twiggy Ramirez) – bass, guitars, backing vocals (2005–2007)\nAaron North – guitars, backing vocals (2005–2007)\nJosh Freese – drums, marimba (2005, 2005–2008)\nJustin Meldal-Johnsen – bass, backing vocals (2008–2009) <a href=\"https://www.last.fm/music/Nine+Inch+Nails\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Nine Inch Nails, commonly abbreviated as NIN (stylized as NIИ), is an American industrial rock band formed in 1988 in Cleveland, Ohio. Singer, songwriter, multi-instrumentalist, and producer Trent Reznor was the only permanent member of the band until the official addition of English musician Atticus Ross in 2016. \n\nReznor chose the name \"Nine Inch Nails\" because it \"abbreviated easily\" rather than for \"any literal meaning\". Other rumored explanations have circulated <a href=\"https://www.last.fm/music/Nine+Inch+Nails\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 3146369,
      "mbid": "b7ffd2af-418f-4be2-bdd1-22f8b48613da",
      "name": "Nine Inch Nails",
      "playcount": 259435273,
      "similar_artists": [
        {
          "name": "How to Destroy Angels",
          "url": "https://www.last.fm/music/How+to+Destroy+Angels"
        },
        {
          "name": "Trent Reznor and Atticus Ross",
          "url": "https://www.last.fm/music/Trent+Reznor+and+Atticus+Ross"
        },
        {
          "name": "Filter",
          "url": "https://www.last.fm/music/Filter"
        },
        {
          "name": "Skinny Puppy",
          "url": "https://www.last.fm/music/Skinny+Puppy"
        },
        {
          "name": "Gravity Kills",
          "url": "https://www.last.fm/music/Gravity+Kills"
        }
      ],
      "tags": [
        "industrial",
        "industrial rock",
        "rock",
        "alternative",
        "electronic"
      ],
      "url": "https://www.last.fm/music/Nine+Inch+Nails"
    },
    "spotify": {
      "followers": 2936682,
      "genres": [
        "industrial rock",
        "industrial",
        "industrial metal",
        "alternative metal",
        "nu metal"
      ],
      "id": "0X380XXQSNBYuleKzav5UO",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb047095c90419cf2a97266f77",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174047095c90419cf2a97266f77",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178047095c90419cf2a97266f77",
          "width": 160
        }
      ],
      "name": "Nine Inch Nails",
      "popularity": 71,
      "url": "https://open.spotify.com/artist/0X380XXQSNBYuleKzav5UO"
    }
  },
  "spotify_id": "0X380XXQSNBYuleKzav5UO",
  "spotify_url": "https://open.spotify.com/artist/0X380XXQSNBYuleKzav5UO",
  "updated_at": "2025-07-05T14:39:19.569061",
  "wikipedia_url": null
}