{
  "apple_music_id": "5796114",
  "apple_music_url": "https://music.apple.com/gb/artist/skunk-anansie/5796114",
  "biography": "Skunk Anansie is a British rock band whose members include Skin (lead vocals, guitar), Cass (bass, guitar, backing vocals), Ace (guitar, backing vocals) and Mark Richardson (drums and percussion).\n\nSkunk Anansie formed in 1994, disbanded in 2001 and reformed in 2009. The name \"Skunk Anansie\" is taken from Akan folk tales of Anansi the spider-man of Ghana, with \"Skunk\" added to \"make the name nastier\".\n\nThey have released six studio albums: Paranoid & Sunburnt (1995), Stoosh (1996), Post Orgasmic Chill (1999), Wonderlustre (2010), Black Traffic (2012) and Anarchytecture (2016); one compilation album, Smashes and Trashes (2009); and several hit singles, including \"Charity\", \"Hedonism\", \"Selling Jesus\" and \"Weak\".\n\nThey are often grouped as part of the Britrock movement, as opposed to the contemporary Britpop of their early years due to their overall harder sound. The band, in 2004, was named as one of the most successful UK chart acts between 1952 and 2003 by the Guinness Book of British Hit Singles & Albums, with a total of 142 weeks on both the singles and album charts ranking them at No. 491. Skunk Anansie have sold 5 million records.\n\nFormation and early career: 1994–2001\nThe group played its first gig at London's Splash club in March 1994.[1] In 1995 they were voted Best New British Band by the readers of Kerrang! magazine. At the award ceremony that year drummer Mark Richardson met the band who were looking for a permanent replacement for Robbie France, so an audition was set up and the band was reformed. Soon after that, two of their songs, \"Feed\" and \"Selling Jesus\", appeared on the soundtrack of the film Strange Days in 1995. \"Selling Jesus\" became Skunk Anansie's controversial second song to receive radio play, following their first radio release \"Little Baby Swastikkka\".[13] After hearing this song, radio personality Howard Stern claimed that the band would become a huge hit. Success continued for the band and they were also voted Kerrang!'s Best British Live Act in 1996. In 1997 they were nominated for Best Live Act and Best Group at the MTV Europe Music Awards.\n\nThe group played its first gig at London's Splash club in March 1994, subsequently taking six weeks to record its debut album, Paranoid & Sunburnt,[13] with producer Sylvia Massy at a \"haunted house\" outside the city. The band's first single, \"Selling Jesus,\" was featured on the soundtrack of the film Strange Days; Stoosh followed in 1996.[13] Both albums were released by One Little Indian Records.[13] After switching to the Virgin label in 1998, their third album, Post Orgasmic Chill, was released in 1999.\n\nIn 1996, the band played a set at the Coppid Beech Hotel, Bracknell during a record label event.\n\nIn 1999, the band was the last band of the 20th Century to headline Glastonbury Festival; closing the Pyramid Stage on Sunday 27 June.[14]\n\nThroughout the 1990s, the group toured globally with such bands as U2, Aerosmith, Feeder, Lenny Kravitz, Bad Religion, Rollins Band, Therapy?, Rammstein, Killing Joke, Soulfly, Sevendust, Oomph!, Muse, Staind, Powerman 5000, Veruca Salt, Marion and A Perfect Circle.\n\nDespite becoming one of the largest British acts of the 1990s and having much success throughout Europe, Skunk Anansie did not receive as much success in the U.S. However, they did have several concerts in the U.S., with their first being in Pittsburgh, Pennsylvania in 2001 before performing a second time in 2016 in Brooklyn, New York City.[15]\n\nSide projects: 2002–2008\nAfter their split in April 2001, Skin embarked on a solo career. Her debut solo album Fleshwounds, co-written with longtime songwriting partner Len Arran was released in September 2003 and Fake Chemical State was released in March 2006. She has also provided vocals for a number of other acts' songs.\n\nAce released a low-key album, Still Hungry, under the name Ace Sounds, which featured many collaborations including Shingai Shoniwa from Noisettes and Skye from Morcheeba. He later joined a band called \"Inner Mantra\". Ace is also a tutor at the Brighton Institute of Modern Music\n\nIn 2002 Cass recorded the album Scars with Gary Moore, and played bass and performed backing vocals. Cass also played various instruments on Skin's first solo album. When not recording he concentrates on photography.\n\nMark recorded sessions for various artists including Skin before joining Feeder after the death of their original drummer, Jon Lee.[16][17] Mark has also been tutoring at the Brighton Institute with bandmate Ace.\n\nReunion: 2009–2010\nMark Richardson confirmed reports that the band was reforming in an interview with Drummer Magazine (November 2008 issue), and said that the band planned to release a \"best of\" compilation as well as new material. Ace later set up an official page for the band on MySpace.\n\nOn 2 and 3 April 2009, two shows took place at the Monto Water Rats (the former venue of the Splash Club) in London, under the alias SCAM (Skin, Cass, Ace, Mark) and sold out in 20 minutes.[18] The band began their \"Greatest Hits\" tour on Friday, 9 October 2009 at the Ancienne Belgique in Brussels, with other dates across Europe. It was their first actual tour in eight years.[needs update] A \"greatest hits\" album, Smashes and Trashes, was released 2 November 2009. It is a 15-track career-embracing album and includes three brand new tracks: \"Because of You\", \"Tear the Place Up\" and \"Squander\". A best-of remixes[clarification needed] companion album was also released digitally.\n\nOn 3 July 2009, the music video for \"Tear the Place Up\" was presented exclusively on MySpace, before on 10 August 2009, a new video for \"Because of You\" was presented exclusively on Kerrang.com. It was released 14 September 2009 in the UK and was the first single to be released from Smashes and Trashes. The single was a top 10 hit in Italy, before its follow-up \"Squander\" was a top 75 success in Flanders, the Dutch-speaking part of Belgium.\n\nTheir fifth album Wonderlustre was released internationally on 13 September 2010, preceded by the first single \"My Ugly Boy\", which was released in the UK on 16 August 2010 and in Europe July/August. The video for \"My Ugly Boy\" was presented exclusively on Kerrang.com on 23 July 2010. Wonderlustre reached number one on the Italian albums chart on 1 October 2010 and placed in the top 10 in charts all over Europe including in Germany, the Netherlands, France and Poland.\n\nIn May 2010 they were a supporting act for Rammstein, during two concerts in Berlin. The second single from Wonderlustre, \"Over the Love\" was released internationally in November 2010. In November 2010 the band played on Ídolos, a Portuguese equivalent to the UK's Pop Idol.\n\n\"You Saved Me\", the third single from Wonderlustre was released internationally in March 2011.\n\nContinuing career: 2011–present\nOn 12 June 2011, the band performed at the open air Rock on the Volga festival at Samara, Russia. The performance was exceptionally well-received. The band also appeared on Friday 12 August at Sziget Festival in Budapest, Hungary playing a mixed set of hits and newer material. This was their first appearance at Sziget. Sziget's own website reporting \"nobody had any doubts who the Queen of this year's Sziget turned out to be\".[19]\n\nSkunk Anansie was on stage when the tragedy occurred at Pukkelpop in Belgium on 18 August 2011. As the band was performing a small tornado hit the venue and artists and revellers alike were sent running for their lives. Five were killed whilst several more were injured. Singer Skin described the incident as the most terrifying of her life.[20]\n\nFormer drummer Robbie France died on 14 January 2012 in Spain. He was 52.[21]\n\nOn 11 June 2012, Skunk Anansie revealed the title for their 5th studio album: Black Traffic. The band's follow-up to 2010's critically acclaimed[citation needed] Wonderlustre was recorded in London and produced by Skunk Anansie and Chris Sheldon and mixed by Jeremy Wheatley and Adrian Bushby.\n\nBlack Traffic became the band's first independent release via their own label working in partnership with 100% Records. The album was released in September 2012 release and was backed by the first leg of an extensive 20 date European Tour.[22][23][24] On 29 June 2012, the band released the lyric video for a new track called \"Sad, Sad, Sad\". Nick Bassett praised the track on his site The Re-View: \"Thrashing percussion and Skin's vocal – she remains one of the UK's greatest and most underrated female vocalists – are all in check as the band return to the heavy rock sound that first shot them into the mainstream in the mid-nineties.\"\n\nIn September 2013, the band released their seventh album, An acoustic Skunk Anansie – Live in London which was recorded live at Cadogan Hall in April of that year. The album was also released as a live DVD and was described by the band as 'a family affair' as it featured Skin's longtime writing partner Len Arran on guitar and Erika Footman, Mark's wife on backing vocals and keyboards.\n\nOn 15 January 2016, Skunk Anansie released their sixth studio album Anarchytecture, and embarked upon an extensive European tour in February 2016[26] and throughout Summer 2016.[27]\n\nIn 2017, Skunk Anansie turned their influence to help young aspiring musicians and launched the first ever Skunk Anansie scholarship in conjunction with The Academy of Contemporary Music. The band pick one successful applicant from either ACM Guildford, ACM London or ACM Birmingham and offer them £27,000 of funding for their degree course. The scholarship was again awarded the following year.\n\nIn September 2018, the band announced they’d be releasing the very special live album, 25LIVE@25 through Republic of Music in celebration of their forthcoming 25th anniversary. It was released 25 January 2019 and features 25 tracks taken from across their six studio albums, which were captured live from various performances on their 2017 tour.\n\nContinuing the 25th anniversary celebrations Skunk Anansie will be touring Europe throughout the summer of 2019, headlining festivals and their own shows, finishing with a string of UK shows\n\nAcross the UK and European media the importance of the band in today's culture has been given renewed prominence. The UK media have embraced the band once more with Skin appearing in interviews for the likes of Channel 4 News, Newsnight, The One Show, ITN, and Radio 2 discussing current political and social issues. The band have also been hailed as one of the most important rock bands of the modern age rock across a broad spectrum of UK press titles, and were the recipients of the Hall of Fame Award at the 2019 Kerrang! Awards on 19 June 2019.\n\nThe single \"What You Do For Love\" was released in 2019. The black and white video for the song shows Skunk Anansie in concert. \"This Means War\" followed in 2020. At the beginning of 2022, the singles \"Piggy\" and \"Can't Take You Anywhere\" were released, but there was no announcement of a new album.\n\nSkunk Anansie singer Skin received her OBE from King Charles on 7th February 2023 at Windsor Castle. <a href=\"https://www.last.fm/music/Skunk+Anansie\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T16:45:45.930406",
  "discogs_id": "11394",
  "discogs_url": "https://www.discogs.com/artist/11394-Skunk-Anansie",
  "followers": 409866,
  "formed_date": null,
  "genres": [
    "Rock",
    "rock",
    "alternative rock",
    "female vocalists",
    "alternative",
    "seen live"
  ],
  "id": "skunk-anansie-1751730348",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/e4/0d/62/e40d62d3-8287-eb10-b149-7ced9b048ce7/ami-identity-6be0759b614e00fd6be319ea9b702910-2025-01-10T14-17-02.277Z_cropped.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5ebb60d97921d6c0157e7b8bb2c",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174b60d97921d6c0157e7b8bb2c",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178b60d97921d6c0157e7b8bb2c",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/0A8z8pbBZBVRGiIoJGSSUP7PS9E9T7iXtRPTuKjZI1w/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/14LaEfEVtoGovNALqdcnz7pOoM5tkdt5MukSVeNEbUI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "e212efdf-98b2-4dce-92ed-62cfc1e29854",
  "lastfm_url": "https://www.last.fm/music/Skunk+Anansie",
  "local_images": {
    "hi-res": "../public/artist/skunk-anansie/skunk-anansie-hi-res.jpg",
    "medium": "../public/artist/skunk-anansie/skunk-anansie-medium.jpg",
    "small": "../public/artist/skunk-anansie/skunk-anansie-small.jpg"
  },
  "name": "Skunk Anansie",
  "popularity": 57,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/e4/0d/62/e40d62d3-8287-eb10-b149-7ced9b048ce7/ami-identity-6be0759b614e00fd6be319ea9b702910-2025-01-10T14-17-02.277Z_cropped.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "5796114",
      "name": "Skunk Anansie",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/skunk-anansie/5796114"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/0A8z8pbBZBVRGiIoJGSSUP7PS9E9T7iXtRPTuKjZI1w/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "11394",
      "images": [
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/0A8z8pbBZBVRGiIoJGSSUP7PS9E9T7iXtRPTuKjZI1w/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/0A8z8pbBZBVRGiIoJGSSUP7PS9E9T7iXtRPTuKjZI1w/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/14LaEfEVtoGovNALqdcnz7pOoM5tkdt5MukSVeNEbUI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 327,
          "resource_url": "https://i.discogs.com/A1eYREGnqWMAgu_bskaG3PgawlWtG9YV77SQlfWgqtk/rs:fit/g:sm/q:90/h:327/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTkt/NTE2MS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/A1eYREGnqWMAgu_bskaG3PgawlWtG9YV77SQlfWgqtk/rs:fit/g:sm/q:90/h:327/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTkt/NTE2MS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/TsGcRk27X1FeLQXBayfzEnuYyJ6C90FlCzfoie8wUog/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTkt/NTE2MS5qcGVn.jpeg",
          "width": 500
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/-P2zueCNap5QItXtY6w6HjBxJle5wU5p06REHFSUzJM/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE0NTUzMDk2NzMt/OTIxOC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/-P2zueCNap5QItXtY6w6HjBxJle5wU5p06REHFSUzJM/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE0NTUzMDk2NzMt/OTIxOC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/AlZTxgPk3qKhsEnpOV3_GbQLM-hc39HGm4vqy7o5ke8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE0NTUzMDk2NzMt/OTIxOC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 432,
          "resource_url": "https://i.discogs.com/kPb9MBL762NkNC1XNSv2cmdOGO0ESa5hL3JMj_3ufC8/rs:fit/g:sm/q:90/h:432/w:591/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTIt/NjEwMy5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/kPb9MBL762NkNC1XNSv2cmdOGO0ESa5hL3JMj_3ufC8/rs:fit/g:sm/q:90/h:432/w:591/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTIt/NjEwMy5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/V-Wv9nOJS6JH5RChifYlT26AGL2ZZpa9dK-9jjVUChg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTIt/NjEwMy5qcGVn.jpeg",
          "width": 591
        },
        {
          "height": 633,
          "resource_url": "https://i.discogs.com/dkSTf8X3pvy4gj1PL4w6IC156DFvJekWu-CxN3-LyFc/rs:fit/g:sm/q:90/h:633/w:558/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NjQt/MzM5Ny5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/dkSTf8X3pvy4gj1PL4w6IC156DFvJekWu-CxN3-LyFc/rs:fit/g:sm/q:90/h:633/w:558/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NjQt/MzM5Ny5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Faz6I78hkuY5AUW0Sqt2lX0yWM_qd_CBanNdX7qH6bs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NjQt/MzM5Ny5qcGVn.jpeg",
          "width": 558
        },
        {
          "height": 646,
          "resource_url": "https://i.discogs.com/OErr858orjMYqrPdTPSd0_ysXurqF_jZ_XscmFlXBVc/rs:fit/g:sm/q:90/h:646/w:599/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NzEt/NzI0MC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/OErr858orjMYqrPdTPSd0_ysXurqF_jZ_XscmFlXBVc/rs:fit/g:sm/q:90/h:646/w:599/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NzEt/NzI0MC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/ZgjHvBteOAfQ0AYiZICiJtBqd_94deVxTupWpsHpskk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NzEt/NzI0MC5qcGVn.jpeg",
          "width": 599
        }
      ],
      "members": [
        {
          "active": true,
          "id": 494418,
          "name": "Richard 'Cass' Lewis",
          "resource_url": "https://api.discogs.com/artists/494418",
          "thumbnail_url": "https://i.discogs.com/C83E3PfQUC8I6-xG5pjhXjKPUv9v3I7bQTvj728Uqfs/rs:fit/g:sm/q:40/h:640/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ5NDQx/OC0xMzEzODI5NTI5/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 494420,
          "name": "Mark Richardson (5)",
          "resource_url": "https://api.discogs.com/artists/494420",
          "thumbnail_url": "https://i.discogs.com/1bD5-qCRtmLwZ3FdAMoCLCHpCX3irZzrYr3PvKOMGO4/rs:fit/g:sm/q:40/h:186/w:350/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ5NDQy/MC0xMTU0MDg1ODMx/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 494421,
          "name": "Martin \"Ace\" Kent",
          "resource_url": "https://api.discogs.com/artists/494421",
          "thumbnail_url": "https://i.discogs.com/HHlafXk2HntqBM-qE796HFG97XC04EB7CoqUJQIUKds/rs:fit/g:sm/q:40/h:600/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ5NDQy/MS0xNTI4MjA1MTYw/LTY5MDMuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 725431,
          "name": "Deborah Anne Dyer",
          "resource_url": "https://api.discogs.com/artists/725431",
          "thumbnail_url": "https://i.discogs.com/CQ0fJNMG75eh724fERQ8jo82TfO2q8A8ARFMb3oqqrk/rs:fit/g:sm/q:40/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcyNTQz/MS0xNTk2MDY2MjUw/LTIwMzEuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 923383,
          "name": "Robbie France",
          "resource_url": "https://api.discogs.com/artists/923383",
          "thumbnail_url": "https://i.discogs.com/3dWzRz7QbCAkeNAxFfO2LwND6_09jpRaNme7Yr-Xq5Q/rs:fit/g:sm/q:40/h:336/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkyMzM4/My0xMzI2ODIyNjA2/LmpwZWc.jpeg"
        }
      ],
      "name": "Skunk Anansie",
      "namevariations": [
        "Scunk Anansie",
        "Shunk Anansie",
        "Skunk A.",
        "Skunk Anansi",
        "Skunk Anasie"
      ],
      "profile": "Skunk Anansie was formed in 1994, broke up around 2001 and reunited again in 2009.\r\nThe band took their name from the combination of the mammal/cannabis sort skunk and a spider from West African folk stories Anansi.\r\n[b]Line-up:[/b]\r\n[a=Deborah Anne Dyer] a.k.a. [a=Skin]: vocals\r\n[a=Richard 'Cass' Lewis]: bass\r\n[a=Martin \"Ace\" Kent]: guitar\r\n[a=Mark Richardson (5)]: drums (1996-now)\r\n[a=Robbie France]: drums (on 1995's [m=47320])",
      "raw_data": {
        "data_quality": "Needs Vote",
        "id": 11394,
        "images": [
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/0A8z8pbBZBVRGiIoJGSSUP7PS9E9T7iXtRPTuKjZI1w/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/0A8z8pbBZBVRGiIoJGSSUP7PS9E9T7iXtRPTuKjZI1w/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/14LaEfEVtoGovNALqdcnz7pOoM5tkdt5MukSVeNEbUI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 327,
            "resource_url": "https://i.discogs.com/A1eYREGnqWMAgu_bskaG3PgawlWtG9YV77SQlfWgqtk/rs:fit/g:sm/q:90/h:327/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTkt/NTE2MS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/A1eYREGnqWMAgu_bskaG3PgawlWtG9YV77SQlfWgqtk/rs:fit/g:sm/q:90/h:327/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTkt/NTE2MS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/TsGcRk27X1FeLQXBayfzEnuYyJ6C90FlCzfoie8wUog/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTkt/NTE2MS5qcGVn.jpeg",
            "width": 500
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/-P2zueCNap5QItXtY6w6HjBxJle5wU5p06REHFSUzJM/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE0NTUzMDk2NzMt/OTIxOC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/-P2zueCNap5QItXtY6w6HjBxJle5wU5p06REHFSUzJM/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE0NTUzMDk2NzMt/OTIxOC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/AlZTxgPk3qKhsEnpOV3_GbQLM-hc39HGm4vqy7o5ke8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE0NTUzMDk2NzMt/OTIxOC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 432,
            "resource_url": "https://i.discogs.com/kPb9MBL762NkNC1XNSv2cmdOGO0ESa5hL3JMj_3ufC8/rs:fit/g:sm/q:90/h:432/w:591/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTIt/NjEwMy5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/kPb9MBL762NkNC1XNSv2cmdOGO0ESa5hL3JMj_3ufC8/rs:fit/g:sm/q:90/h:432/w:591/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTIt/NjEwMy5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/V-Wv9nOJS6JH5RChifYlT26AGL2ZZpa9dK-9jjVUChg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NTIt/NjEwMy5qcGVn.jpeg",
            "width": 591
          },
          {
            "height": 633,
            "resource_url": "https://i.discogs.com/dkSTf8X3pvy4gj1PL4w6IC156DFvJekWu-CxN3-LyFc/rs:fit/g:sm/q:90/h:633/w:558/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NjQt/MzM5Ny5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/dkSTf8X3pvy4gj1PL4w6IC156DFvJekWu-CxN3-LyFc/rs:fit/g:sm/q:90/h:633/w:558/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NjQt/MzM5Ny5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Faz6I78hkuY5AUW0Sqt2lX0yWM_qd_CBanNdX7qH6bs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NjQt/MzM5Ny5qcGVn.jpeg",
            "width": 558
          },
          {
            "height": 646,
            "resource_url": "https://i.discogs.com/OErr858orjMYqrPdTPSd0_ysXurqF_jZ_XscmFlXBVc/rs:fit/g:sm/q:90/h:646/w:599/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NzEt/NzI0MC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/OErr858orjMYqrPdTPSd0_ysXurqF_jZ_XscmFlXBVc/rs:fit/g:sm/q:90/h:646/w:599/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NzEt/NzI0MC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/ZgjHvBteOAfQ0AYiZICiJtBqd_94deVxTupWpsHpskk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTEzNDc5MTM5NzEt/NzI0MC5qcGVn.jpeg",
            "width": 599
          }
        ],
        "members": [
          {
            "active": true,
            "id": 494418,
            "name": "Richard 'Cass' Lewis",
            "resource_url": "https://api.discogs.com/artists/494418",
            "thumbnail_url": "https://i.discogs.com/C83E3PfQUC8I6-xG5pjhXjKPUv9v3I7bQTvj728Uqfs/rs:fit/g:sm/q:40/h:640/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ5NDQx/OC0xMzEzODI5NTI5/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 494420,
            "name": "Mark Richardson (5)",
            "resource_url": "https://api.discogs.com/artists/494420",
            "thumbnail_url": "https://i.discogs.com/1bD5-qCRtmLwZ3FdAMoCLCHpCX3irZzrYr3PvKOMGO4/rs:fit/g:sm/q:40/h:186/w:350/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ5NDQy/MC0xMTU0MDg1ODMx/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 494421,
            "name": "Martin \"Ace\" Kent",
            "resource_url": "https://api.discogs.com/artists/494421",
            "thumbnail_url": "https://i.discogs.com/HHlafXk2HntqBM-qE796HFG97XC04EB7CoqUJQIUKds/rs:fit/g:sm/q:40/h:600/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ5NDQy/MS0xNTI4MjA1MTYw/LTY5MDMuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 725431,
            "name": "Deborah Anne Dyer",
            "resource_url": "https://api.discogs.com/artists/725431",
            "thumbnail_url": "https://i.discogs.com/CQ0fJNMG75eh724fERQ8jo82TfO2q8A8ARFMb3oqqrk/rs:fit/g:sm/q:40/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcyNTQz/MS0xNTk2MDY2MjUw/LTIwMzEuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 923383,
            "name": "Robbie France",
            "resource_url": "https://api.discogs.com/artists/923383",
            "thumbnail_url": "https://i.discogs.com/3dWzRz7QbCAkeNAxFfO2LwND6_09jpRaNme7Yr-Xq5Q/rs:fit/g:sm/q:40/h:336/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkyMzM4/My0xMzI2ODIyNjA2/LmpwZWc.jpeg"
          }
        ],
        "name": "Skunk Anansie",
        "namevariations": [
          "Scunk Anansie",
          "Shunk Anansie",
          "Skunk A.",
          "Skunk Anansi",
          "Skunk Anasie"
        ],
        "profile": "Skunk Anansie was formed in 1994, broke up around 2001 and reunited again in 2009.\r\nThe band took their name from the combination of the mammal/cannabis sort skunk and a spider from West African folk stories Anansi.\r\n[b]Line-up:[/b]\r\n[a=Deborah Anne Dyer] a.k.a. [a=Skin]: vocals\r\n[a=Richard 'Cass' Lewis]: bass\r\n[a=Martin \"Ace\" Kent]: guitar\r\n[a=Mark Richardson (5)]: drums (1996-now)\r\n[a=Robbie France]: drums (on 1995's [m=47320])",
        "releases_url": "https://api.discogs.com/artists/11394/releases",
        "resource_url": "https://api.discogs.com/artists/11394",
        "uri": "https://www.discogs.com/artist/11394-Skunk-Anansie",
        "urls": [
          "http://www.skunkanansie.net",
          "http://www.facebook.com/OfficialSkunkAnansie",
          "https://www.instagram.com/officialskunkanansie",
          "https://skunkanansie.bandcamp.com/music",
          "http://www.youtube.com/SkunkAnansieOfficial",
          "http://www.lastfm.fr/music/Skunk+Anansie",
          "http://www.myspace.com/skunkanansiemusic",
          "http://twitter.com/Aceskunkanansie",
          "http://en.wikipedia.org/wiki/Skunk_Anansie"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/11394",
      "thumb": "https://i.discogs.com/14LaEfEVtoGovNALqdcnz7pOoM5tkdt5MukSVeNEbUI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMzk0/LTE1NjEyOTQxNzAt/NTE3Mi5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/11394-Skunk-Anansie",
      "urls": [
        "http://www.skunkanansie.net",
        "http://www.facebook.com/OfficialSkunkAnansie",
        "https://www.instagram.com/officialskunkanansie",
        "https://skunkanansie.bandcamp.com/music",
        "http://www.youtube.com/SkunkAnansieOfficial",
        "http://www.lastfm.fr/music/Skunk+Anansie",
        "http://www.myspace.com/skunkanansiemusic",
        "http://twitter.com/Aceskunkanansie",
        "http://en.wikipedia.org/wiki/Skunk_Anansie"
      ]
    },
    "lastfm": {
      "bio_content": "Skunk Anansie is a British rock band whose members include Skin (lead vocals, guitar), Cass (bass, guitar, backing vocals), Ace (guitar, backing vocals) and Mark Richardson (drums and percussion).\n\nSkunk Anansie formed in 1994, disbanded in 2001 and reformed in 2009. The name \"Skunk Anansie\" is taken from Akan folk tales of Anansi the spider-man of Ghana, with \"Skunk\" added to \"make the name nastier\".\n\nThey have released six studio albums: Paranoid & Sunburnt (1995), Stoosh (1996), Post Orgasmic Chill (1999), Wonderlustre (2010), Black Traffic (2012) and Anarchytecture (2016); one compilation album, Smashes and Trashes (2009); and several hit singles, including \"Charity\", \"Hedonism\", \"Selling Jesus\" and \"Weak\".\n\nThey are often grouped as part of the Britrock movement, as opposed to the contemporary Britpop of their early years due to their overall harder sound. The band, in 2004, was named as one of the most successful UK chart acts between 1952 and 2003 by the Guinness Book of British Hit Singles & Albums, with a total of 142 weeks on both the singles and album charts ranking them at No. 491. Skunk Anansie have sold 5 million records.\n\nFormation and early career: 1994–2001\nThe group played its first gig at London's Splash club in March 1994.[1] In 1995 they were voted Best New British Band by the readers of Kerrang! magazine. At the award ceremony that year drummer Mark Richardson met the band who were looking for a permanent replacement for Robbie France, so an audition was set up and the band was reformed. Soon after that, two of their songs, \"Feed\" and \"Selling Jesus\", appeared on the soundtrack of the film Strange Days in 1995. \"Selling Jesus\" became Skunk Anansie's controversial second song to receive radio play, following their first radio release \"Little Baby Swastikkka\".[13] After hearing this song, radio personality Howard Stern claimed that the band would become a huge hit. Success continued for the band and they were also voted Kerrang!'s Best British Live Act in 1996. In 1997 they were nominated for Best Live Act and Best Group at the MTV Europe Music Awards.\n\nThe group played its first gig at London's Splash club in March 1994, subsequently taking six weeks to record its debut album, Paranoid & Sunburnt,[13] with producer Sylvia Massy at a \"haunted house\" outside the city. The band's first single, \"Selling Jesus,\" was featured on the soundtrack of the film Strange Days; Stoosh followed in 1996.[13] Both albums were released by One Little Indian Records.[13] After switching to the Virgin label in 1998, their third album, Post Orgasmic Chill, was released in 1999.\n\nIn 1996, the band played a set at the Coppid Beech Hotel, Bracknell during a record label event.\n\nIn 1999, the band was the last band of the 20th Century to headline Glastonbury Festival; closing the Pyramid Stage on Sunday 27 June.[14]\n\nThroughout the 1990s, the group toured globally with such bands as U2, Aerosmith, Feeder, Lenny Kravitz, Bad Religion, Rollins Band, Therapy?, Rammstein, Killing Joke, Soulfly, Sevendust, Oomph!, Muse, Staind, Powerman 5000, Veruca Salt, Marion and A Perfect Circle.\n\nDespite becoming one of the largest British acts of the 1990s and having much success throughout Europe, Skunk Anansie did not receive as much success in the U.S. However, they did have several concerts in the U.S., with their first being in Pittsburgh, Pennsylvania in 2001 before performing a second time in 2016 in Brooklyn, New York City.[15]\n\nSide projects: 2002–2008\nAfter their split in April 2001, Skin embarked on a solo career. Her debut solo album Fleshwounds, co-written with longtime songwriting partner Len Arran was released in September 2003 and Fake Chemical State was released in March 2006. She has also provided vocals for a number of other acts' songs.\n\nAce released a low-key album, Still Hungry, under the name Ace Sounds, which featured many collaborations including Shingai Shoniwa from Noisettes and Skye from Morcheeba. He later joined a band called \"Inner Mantra\". Ace is also a tutor at the Brighton Institute of Modern Music\n\nIn 2002 Cass recorded the album Scars with Gary Moore, and played bass and performed backing vocals. Cass also played various instruments on Skin's first solo album. When not recording he concentrates on photography.\n\nMark recorded sessions for various artists including Skin before joining Feeder after the death of their original drummer, Jon Lee.[16][17] Mark has also been tutoring at the Brighton Institute with bandmate Ace.\n\nReunion: 2009–2010\nMark Richardson confirmed reports that the band was reforming in an interview with Drummer Magazine (November 2008 issue), and said that the band planned to release a \"best of\" compilation as well as new material. Ace later set up an official page for the band on MySpace.\n\nOn 2 and 3 April 2009, two shows took place at the Monto Water Rats (the former venue of the Splash Club) in London, under the alias SCAM (Skin, Cass, Ace, Mark) and sold out in 20 minutes.[18] The band began their \"Greatest Hits\" tour on Friday, 9 October 2009 at the Ancienne Belgique in Brussels, with other dates across Europe. It was their first actual tour in eight years.[needs update] A \"greatest hits\" album, Smashes and Trashes, was released 2 November 2009. It is a 15-track career-embracing album and includes three brand new tracks: \"Because of You\", \"Tear the Place Up\" and \"Squander\". A best-of remixes[clarification needed] companion album was also released digitally.\n\nOn 3 July 2009, the music video for \"Tear the Place Up\" was presented exclusively on MySpace, before on 10 August 2009, a new video for \"Because of You\" was presented exclusively on Kerrang.com. It was released 14 September 2009 in the UK and was the first single to be released from Smashes and Trashes. The single was a top 10 hit in Italy, before its follow-up \"Squander\" was a top 75 success in Flanders, the Dutch-speaking part of Belgium.\n\nTheir fifth album Wonderlustre was released internationally on 13 September 2010, preceded by the first single \"My Ugly Boy\", which was released in the UK on 16 August 2010 and in Europe July/August. The video for \"My Ugly Boy\" was presented exclusively on Kerrang.com on 23 July 2010. Wonderlustre reached number one on the Italian albums chart on 1 October 2010 and placed in the top 10 in charts all over Europe including in Germany, the Netherlands, France and Poland.\n\nIn May 2010 they were a supporting act for Rammstein, during two concerts in Berlin. The second single from Wonderlustre, \"Over the Love\" was released internationally in November 2010. In November 2010 the band played on Ídolos, a Portuguese equivalent to the UK's Pop Idol.\n\n\"You Saved Me\", the third single from Wonderlustre was released internationally in March 2011.\n\nContinuing career: 2011–present\nOn 12 June 2011, the band performed at the open air Rock on the Volga festival at Samara, Russia. The performance was exceptionally well-received. The band also appeared on Friday 12 August at Sziget Festival in Budapest, Hungary playing a mixed set of hits and newer material. This was their first appearance at Sziget. Sziget's own website reporting \"nobody had any doubts who the Queen of this year's Sziget turned out to be\".[19]\n\nSkunk Anansie was on stage when the tragedy occurred at Pukkelpop in Belgium on 18 August 2011. As the band was performing a small tornado hit the venue and artists and revellers alike were sent running for their lives. Five were killed whilst several more were injured. Singer Skin described the incident as the most terrifying of her life.[20]\n\nFormer drummer Robbie France died on 14 January 2012 in Spain. He was 52.[21]\n\nOn 11 June 2012, Skunk Anansie revealed the title for their 5th studio album: Black Traffic. The band's follow-up to 2010's critically acclaimed[citation needed] Wonderlustre was recorded in London and produced by Skunk Anansie and Chris Sheldon and mixed by Jeremy Wheatley and Adrian Bushby.\n\nBlack Traffic became the band's first independent release via their own label working in partnership with 100% Records. The album was released in September 2012 release and was backed by the first leg of an extensive 20 date European Tour.[22][23][24] On 29 June 2012, the band released the lyric video for a new track called \"Sad, Sad, Sad\". Nick Bassett praised the track on his site The Re-View: \"Thrashing percussion and Skin's vocal – she remains one of the UK's greatest and most underrated female vocalists – are all in check as the band return to the heavy rock sound that first shot them into the mainstream in the mid-nineties.\"\n\nIn September 2013, the band released their seventh album, An acoustic Skunk Anansie – Live in London which was recorded live at Cadogan Hall in April of that year. The album was also released as a live DVD and was described by the band as 'a family affair' as it featured Skin's longtime writing partner Len Arran on guitar and Erika Footman, Mark's wife on backing vocals and keyboards.\n\nOn 15 January 2016, Skunk Anansie released their sixth studio album Anarchytecture, and embarked upon an extensive European tour in February 2016[26] and throughout Summer 2016.[27]\n\nIn 2017, Skunk Anansie turned their influence to help young aspiring musicians and launched the first ever Skunk Anansie scholarship in conjunction with The Academy of Contemporary Music. The band pick one successful applicant from either ACM Guildford, ACM London or ACM Birmingham and offer them £27,000 of funding for their degree course. The scholarship was again awarded the following year.\n\nIn September 2018, the band announced they’d be releasing the very special live album, 25LIVE@25 through Republic of Music in celebration of their forthcoming 25th anniversary. It was released 25 January 2019 and features 25 tracks taken from across their six studio albums, which were captured live from various performances on their 2017 tour.\n\nContinuing the 25th anniversary celebrations Skunk Anansie will be touring Europe throughout the summer of 2019, headlining festivals and their own shows, finishing with a string of UK shows\n\nAcross the UK and European media the importance of the band in today's culture has been given renewed prominence. The UK media have embraced the band once more with Skin appearing in interviews for the likes of Channel 4 News, Newsnight, The One Show, ITN, and Radio 2 discussing current political and social issues. The band have also been hailed as one of the most important rock bands of the modern age rock across a broad spectrum of UK press titles, and were the recipients of the Hall of Fame Award at the 2019 Kerrang! Awards on 19 June 2019.\n\nThe single \"What You Do For Love\" was released in 2019. The black and white video for the song shows Skunk Anansie in concert. \"This Means War\" followed in 2020. At the beginning of 2022, the singles \"Piggy\" and \"Can't Take You Anywhere\" were released, but there was no announcement of a new album.\n\nSkunk Anansie singer Skin received her OBE from King Charles on 7th February 2023 at Windsor Castle. <a href=\"https://www.last.fm/music/Skunk+Anansie\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Skunk Anansie is a British rock band whose members include Skin (lead vocals, guitar), Cass (bass, guitar, backing vocals), Ace (guitar, backing vocals) and Mark Richardson (drums and percussion).\n\nSkunk Anansie formed in 1994, disbanded in 2001 and reformed in 2009. The name \"Skunk Anansie\" is taken from Akan folk tales of Anansi the spider-man of Ghana, with \"Skunk\" added to \"make the name nastier\".\n\nThey have released six studio albums: Paranoid & Sunburnt (1995) <a href=\"https://www.last.fm/music/Skunk+Anansie\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 761776,
      "mbid": "e212efdf-98b2-4dce-92ed-62cfc1e29854",
      "name": "Skunk Anansie",
      "playcount": 13992813,
      "similar_artists": [
        {
          "name": "Skin",
          "url": "https://www.last.fm/music/Skin"
        },
        {
          "name": "K's Choice",
          "url": "https://www.last.fm/music/K%27s+Choice"
        },
        {
          "name": "Therapy?",
          "url": "https://www.last.fm/music/Therapy%3F"
        },
        {
          "name": "Garbage",
          "url": "https://www.last.fm/music/Garbage"
        },
        {
          "name": "Guano Apes",
          "url": "https://www.last.fm/music/Guano+Apes"
        }
      ],
      "tags": [
        "rock",
        "alternative rock",
        "female vocalists",
        "alternative",
        "seen live"
      ],
      "url": "https://www.last.fm/music/Skunk+Anansie"
    },
    "spotify": {
      "followers": 409866,
      "genres": [],
      "id": "5HlXA01kcjssYDT7EoqUJF",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5ebb60d97921d6c0157e7b8bb2c",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174b60d97921d6c0157e7b8bb2c",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178b60d97921d6c0157e7b8bb2c",
          "width": 160
        }
      ],
      "name": "Skunk Anansie",
      "popularity": 57,
      "url": "https://open.spotify.com/artist/5HlXA01kcjssYDT7EoqUJF"
    }
  },
  "spotify_id": "5HlXA01kcjssYDT7EoqUJF",
  "spotify_url": "https://open.spotify.com/artist/5HlXA01kcjssYDT7EoqUJF",
  "updated_at": "2025-07-08T10:02:31.523520",
  "wikipedia_url": null
}