{
  "apple_music_id": "166302",
  "apple_music_url": "https://music.apple.com/gb/artist/the-time/166302",
  "biography": "The Time (now The Original 7ven) is an American funk and dance-pop ensemble formed in Minneapolis in 1981. They are close Prince associates and arguably the most successful artists who have worked with him.\n\nPrince and Formation\n\nThe band was assembled under a clause in Prince's contract with Warner Bros. that allowed him to recruit and produce other artists for the label. Inspired by the 1980 film The Idolmaker, Prince decided to put together a pop-funk group that would serve as an outlet for material in the vein of his own early albums, while he explored other genres and styles in his own career.\n\nBy 1981, he had built The Time out of an existing Minneapolis funk unit, Flyte Time (from the Donald Byrd song), which featured Jellybean Johnson on drums, Jimmy Jam and Monte Moir on keyboards, and Terry Lewis on bass. To this base were added Jesse Johnson on guitar and a lead singer and childhood friend named Morris Day, and Jerome Benton who was a promoter drawn from another local band called \"Enterprise\", who became Day's comic foil. Prince had used an Enterprise song, \"Partyup\", on his Dirty Mind album, and his selection of Day was essentially a reward; he had originally tapped Alexander O'Neal – yet another player in the Minneapolis Uptown funk scene – for the vocalist slot, but O'Neal wanted too much money, himself being quoted as saying, \"I basically didn't see no point in being a superstar with no money.\"\n\nSuccess\n\nThe band went on to release four albums (mostly performed by Prince + singer Morris Day alone) during the course of their main career, each a solid slice of jammy, rock-infused 1980s funk, generally light and humorous in tone, strongly influenced by Parliament, James Brown, Sly – and, of course, Prince. Although they scored numerous hits (including \"The Bird\", \"Jungle Love\", \"777-9311\", \"Get It Up\", \"Gigolos Get Lonely Too\", \"The Walk\" and \"Cool\", mostly on the R&B charts) during the early 1980s, they never approached superstardom. But as good as they were, they weren't allowed to play a note on their debut album. Prince recorded all the music himself, crediting the production to Jamie Starr and Morris Day, who at least was allowed to sing on the record, but was required to follow Prince's guide vocals note-for-note.\n\nA growing rivalry began to develop between the two groups as The Time toured with Prince and his band during his 1982 Controversy Tour. Frustrated with their lack of input on the albums bearing their name and at being underpaid, The Time would take to the stage with the purpose of showing up Prince, in much the same way that Prince and his band had undermined Rick James when they had toured as James' opening act (unlike what happened during Rick James' Light it Up tour, this time people didn't leave before the headliner, Prince, finished his set). The tension came to a head on the final night of the tour in Cincinnati during the Time's set when Prince and some of his band threw eggs at their supporting act from offstage. Things further escalated after The Time's performance when guitarist Jesse Johnson was handcuffed to a wall-mounted coat rack and further humiliated. Prince demanded no interruptions during his performance, but as soon as he left the stage, a food fight erupted. When the battle continued at the hotel, Prince made Morris Day pay for all damages, claiming that he had started the whole thing.\n\nDuring the 1982–83 1999/Triple Threat tour, The Time served as Vanity 6's backing band from behind a curtain, before playing their own hour-long set. They liked the arrangement because the band saw it as free money. As Terry Lewis put it; \"I'll play behind Vanity 6 for thirty minutes for $250. No problem. I was going to have to do the sound check, anyway.\" Jimmy Jam and Terry Lewis, who had begun writing songs and production work of their own (working with SOLAR to produce Klymaxx and with Tabu Records to produce the S.O.S. Band), were stranded in Atlanta by a blizzard and failed to make it to a Time concert in San Antonio, for which Jerome had to mime playing bass guitar on stage while Prince played Lewis' part off stage, and Lisa Coleman stood in for Jimmy Jam. Subsequently, the duo were fined and then fired, although Prince would state in a 1990 Rolling Stone's interview that \"I didn't fire Jimmy Jam and Terry Lewis. Morris asked me what I would do in his situation. Remember, it was his band.\" Whether their firing was due to the incident or to their increasing independence has never been clear. Monte Moir took the opportunity to leave as well, and would also work with Jam and Lewis. The three were replaced with Mark Cardenas and Paul Peterson on keyboards and Rocky Harris on bass. This new line up, except with Jerry Hubbard replacing Rocky Harris, were featured in Prince's Purple Rain film. The Time rode the wave of popularity created by the movie and hit singles \"Jungle Love\" and \"The Bird\" and were household names in 1984.\n\nFirst split\n\nIt was Day who left next after arguments with Prince, choosing to pursue a solo career in 1985 after a successful acting turn in Purple Rain. Soon thereafter, with Jesse Johnson also opting to go solo (taking other Time members Cardenas and Hubbard with him), the band disintegrated; the remaining members (Benton, Jellybean Johnson and Peterson) were reformed into a new short-lived project called The Family. Meanwhile, Jimmy Jam and Terry Lewis went on to become one of the most successful songwriting and production teams of the 1980s and 1990s.\n\nFirst reunion\n\nIn 1990, the original seven members of the band reunited for the Graffiti Bridge movie and soundtrack, as well as a new album, Pandemonium. The project was originally called Corporate World and was set to only feature Morris and Jerome, but Warner Bros. demanded that the original line-up be brought in if Prince wanted the company's backing for the movie. This spawned their highest selling single, \"Jerk Out\" and the album featured more input from the band than any other Time album. \"Nobody really needed to put The Time back together,\" said Lewis, \"but everybody wanted to. That makes it a great experience all round. We take the musicianship and the craft of what we do very seriously but, when the seven of us get together, it's naturally a party, fun kinda situation. We carry that from the record on to the stage.\"\n\nThe reunion was short-lived, however – infighting within the band caused them to disband once again. Morris and Jerome have since remained a team, with both trying out some small acting roles over the next few years.\n\nIn 1995 Morris met a young 22 year old up and coming LA, California music producer through manager David Lombard (Toni Tone Tony/Envoge) named Robert GI' Grissett and the two started producing songs together for a new Morris Day album with the lead single to be a song entitled 'My Baby Boo'! Rumor has it that it was to be released through Scotti Bros. Records, but the deal fell through. In a 2003 LA Weekly Interview with GI' now known as Rob Gi'hana, Rob was quoted as saying, \"man Morris and I recorded a lot of songs and 'work in progress' ideas, and I truly believe at least 4 of them can be hits now or even in the future if they ever get to see the light of day I pray! We became really good friends at the time and it was an experience I will never forget and we still Cool. I believe we will release those songs when the time is right.\" After Rob gives us a sneak listen to a couple of the tracks (which are in my opinion some of the best solo Morris Day jams I've EVER heard not produced by Prince or Jimmy Jam & Terry Lewis) starts to get excited after we ask him what the titles of some of the songs were a \"My favorites are called Sexy Lady & My Baby Boo. Ohhh and the one that should be a classic Morris ala The Bird, The Oak Tree, is a song we did called Drop (ya DRawz)!! Man.. funky classic morris day and he is in classic YeSSSS mode! We acted a fool in the studio that nite man!!!!!... its got to come out!!\n\nSeveral members of The Time reunited in 1995, added a few new recruits, Torri Ruffin on guitar, Chance Howard on Keyboards, Robert GI' Grissett Jr on third Keyboards and Freeze on Bass Guitar. This version of the band can be seen in the Kevin Smith film Jay and Silent Bob Strike Back and tours frequently to this day. The band is usually billed as \"Morris Day and The Time\".\n\nA fifth Time album is rumoured to have been completed in the late 1990s, recorded with the new lineup but production and coordination with Prince has prevented its release. The title Old Dogs, New Tricks was the working title. A 2004 album attributed to Morris Day called It's About Time contains a few new tracks written and performed by Day and a number of live performances by The Time featuring the new members along with Jellybean, Jerome, Monte & Morris.\n\nSecond reunion and The Original 7ven\n\nThe Time reunited at The 50th Grammy Awards on February 10, 2008, performing a medley that included Rihanna and featured \"Jungle Love\".\n\nIn June and July 2008, all of the original members of The Time (Morris Day, Jimmy Jam, Terry Lewis, Jesse Johnson, Jerome Benton, Jellybean Johnson, and Monte Moir) reunited once again for a series of shows at the Flamingo Hotel and Casino in Las Vegas.\n\nA recent interview as of January 2009 mentions that guitarist Jesse Johnson states he is working with The Time on their upcoming album. The Time appeared at The Fox Theater, in Detroit, Michigan on June 11, 2010, with the original lineup to a packed house. Two days later during what Jimmy Jam dubbed \"The Stingy Tour\" on June 13, 2010 the \"magnificent 7\" played a hometown reunion concert in Minneapolis, MN, and, during that concert, announced on stage that a new album was \"90% complete,\" which confirmed information provided in a Billboard profile published a week earlier.\n\nIn September 2011, the band announced a name change to The Original 7ven and a new album Condensate which was released October 18, 2011 with the single \"#Trendin\" released September 20.\n\nAs for why the band decided to call themselves by a new name, Jimmy Jam said that “the decision was made at that point that we could either continue to, shall we say, negotiate or argue or plead or whatever. We decided to go the route of let’s not hold things up because of the name. Let’s embrace the opportunity to move forward in a new era, with a new outlook, with a new album and that’s what we did. We think the name reflects exactly who we are. We are the Original 7even and that basically, for me, covers it.”\n\nOn October 27, 2011, The Original 7ven appeared on The Tonight Show with Jay Leno.\n\nOn November 17, 2011, The Original 7ven opened the Soul Train Music Awards in Atlanta, GA, playing a medley of greatest hits and new single #TRENDIN. The show was broadcast on November 27.",
  "country": null,
  "created_at": "2025-07-05T15:47:15.780585",
  "discogs_id": "32550",
  "discogs_url": "https://www.discogs.com/artist/32550-The-Time",
  "followers": 493054,
  "formed_date": null,
  "genres": [
    "R&B/Soul",
    "funk rock",
    "post-disco",
    "funk",
    "80s",
    "pop",
    "Minneapolis funk",
    "prince",
    "Funk",
    "Rock/Pop"
  ],
  "id": "the-time-1751726838",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/3a/b0/ed/3ab0ed2c-b60e-a983-ef86-55759613b134/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616d0000b273c093f4dd308ad9c41e20eee8",
      "width": 640
    },
    {
      "height": 300,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616d00001e02c093f4dd308ad9c41e20eee8",
      "width": 300
    },
    {
      "height": 64,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616d00004851c093f4dd308ad9c41e20eee8",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/qwtsww1440349390.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/wxvwuu1440349423.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xstpuq1454864151.jpg",
      "width": 1920
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/time-the-5ef64a823be4a.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/kgGrBIi0J1n0dzWlyik-OrZGB5jWv0fzDgTgcERrYoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "3bfa8f23-2dbb-43e2-b1da-3cfaa6c5ff9d",
  "lastfm_url": "https://www.last.fm/music/The+Time",
  "local_images": {
    "hi-res": "../public/artist/the-time/the-time-hi-res.jpg",
    "medium": "../public/artist/the-time/the-time-medium.jpg",
    "small": "../public/artist/the-time/the-time-small.jpg"
  },
  "name": "The Time",
  "popularity": 45,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='166302', url='https://music.apple.com/gb/artist/the-time/166302', name='The Time', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/3a/b0/ed/3ab0ed2c-b60e-a983-ef86-55759613b134/pr_source.png/2000x2000bb.jpg', genres=['R&B/Soul'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '166302', 'type': 'artists', 'href': '/v1/catalog/gb/artists/166302', 'attributes': {'name': 'The Time', 'genreNames': ['R&B/Soul'], 'artwork': {'width': 1225, 'height': 1225, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/3a/b0/ed/3ab0ed2c-b60e-a983-ef86-55759613b134/pr_source.png/{w}x{h}bb.jpg', 'bgColor': '10110c', 'textColor1': 'd4e0f7', 'textColor2': 'bac2d2', 'textColor3': 'acb6c8', 'textColor4': '989eaa'}, 'url': 'https://music.apple.com/gb/artist/the-time/166302'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/166302/albums', 'data': [{'id': '273890984', 'type': 'albums', 'href': '/v1/catalog/gb/albums/273890984'}, {'id': '302057903', 'type': 'albums', 'href': '/v1/catalog/gb/albums/302057903'}, {'id': '1572861686', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1572861686'}, {'id': '40285826', 'type': 'albums', 'href': '/v1/catalog/gb/albums/40285826'}, {'id': '251016479', 'type': 'albums', 'href': '/v1/catalog/gb/albums/251016479'}, {'id': '797819673', 'type': 'albums', 'href': '/v1/catalog/gb/albums/797819673'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "32550",
      "images": [
        {
          "height": 413,
          "resource_url": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/kgGrBIi0J1n0dzWlyik-OrZGB5jWv0fzDgTgcERrYoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
          "width": 528
        },
        {
          "height": 581,
          "resource_url": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/rGY9z4l1Ly578KBp0S-JkgbHRwxEZffZys8OBvO1_O0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
          "width": 459
        },
        {
          "height": 548,
          "resource_url": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/n2I7EBVeFgPjSFr6utFoKdsn9l2MitEP7Z42eemGzzM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 644,
          "resource_url": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/geLcrCJ46lhCOgGbm-tejwV-x5RMIclTUBxRstiq0hE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
          "width": 472
        },
        {
          "height": 540,
          "resource_url": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/jTypyzYpLw2-q81Fq-rnqMytF-m739GpYGoXFaDyLOE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
          "width": 432
        },
        {
          "height": 359,
          "resource_url": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/D4bYdT6ldW7v7AlFLbJji_yyY-r-gOHDGrp8hIesbJQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
          "width": 525
        },
        {
          "height": 368,
          "resource_url": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/GcBSS9YzxpYJ-YXV4Oul3jUagr33r2AakSI1bqE3rEk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/nogko2Ty2OPAQ3BHoFWFvNshb3IxW3llhCp5dpVMBoE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
          "width": 473
        },
        {
          "height": 712,
          "resource_url": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/9Qc12_oBWnDUILBXDipd_cyvxxuSN7YM574qpUoigzo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
          "width": 560
        },
        {
          "height": 436,
          "resource_url": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Qv3eJHbvsztFAQhMwg2WNcp5PPknJwRS2p7Bp1Uk4tE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 659,
          "resource_url": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/wbedxVfaf-CbE2aW7Dz4TlvEWEveGtshjS7ban6QD0g/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
          "width": 492
        },
        {
          "height": 405,
          "resource_url": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/fCzgRNnwO3_KQlnQEBONv-OwctplCopcFct0Y9FIgjM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
          "width": 600
        }
      ],
      "members": [
        {
          "active": false,
          "id": 23446,
          "name": "Alexander O'Neal",
          "resource_url": "https://api.discogs.com/artists/23446",
          "thumbnail_url": "https://i.discogs.com/4kLfDujJ2cPtQSpPYKLYmbdcjh-H8lWOZ1Jr-TaQPVU/rs:fit/g:sm/q:40/h:472/w:533/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzNDQ2/LTE1MTIyMTYzNzYt/NjYzNy5qcGVn.jpeg"
        },
        {
          "active": true,
          "id": 37806,
          "name": "Jesse Johnson",
          "resource_url": "https://api.discogs.com/artists/37806",
          "thumbnail_url": "https://i.discogs.com/faB_cvw7LFBwDjzTbUfC0NKvU_kKQZZs9rObtEbUb5U/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3ODA2/LTE1ODYxMDQ1Nzkt/NjI4OS5qcGVn.jpeg"
        },
        {
          "active": true,
          "id": 55449,
          "name": "Terry Lewis",
          "resource_url": "https://api.discogs.com/artists/55449",
          "thumbnail_url": "https://i.discogs.com/qlM6fd5QPJgpFyKSKX0SgNRxH4iC61RoT3ja1fP9hB8/rs:fit/g:sm/q:40/h:300/w:265/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU1NDQ5/LTEzMjc2MDYwOTEu/anBlZw.jpeg"
        },
        {
          "active": true,
          "id": 100600,
          "name": "Monte Moir",
          "resource_url": "https://api.discogs.com/artists/100600",
          "thumbnail_url": "https://i.discogs.com/oLscQsJpR_NYyQHc5QhlOu_x6V2RfbDsoqvYmudC3Yg/rs:fit/g:sm/q:40/h:408/w:530/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwMDYw/MC0xMjU0NTIyMzA3/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 152882,
          "name": "Morris Day",
          "resource_url": "https://api.discogs.com/artists/152882",
          "thumbnail_url": "https://i.discogs.com/kiNgrSSlXNZPkVwc_HnbtzgON42EvOlQqv8SksOABF0/rs:fit/g:sm/q:40/h:763/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1Mjg4/Mi0xNjA2OTUzMzk3/LTgwMTAuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 241356,
          "name": "James Harris III",
          "resource_url": "https://api.discogs.com/artists/241356",
          "thumbnail_url": "https://i.discogs.com/M_DMStNqES-lQKwZmAbd11IBEzMra0zgiWBElbHUS-I/rs:fit/g:sm/q:40/h:378/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTM1/Ni0xNjg0Mjg5Njcz/LTQ0NzEuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 242702,
          "name": "Paul Peterson",
          "resource_url": "https://api.discogs.com/artists/242702",
          "thumbnail_url": "https://i.discogs.com/o7x1JSRudabRMRJ3ksKjxqrwZevD2ibfVhygQRimFCA/rs:fit/g:sm/q:40/h:376/w:565/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0Mjcw/Mi0xMzU2ODY2MjQz/LTYxMDEuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 354129,
          "name": "Jerome Benton",
          "resource_url": "https://api.discogs.com/artists/354129",
          "thumbnail_url": "https://i.discogs.com/6Yd4Np57BGtIBlFZzNpLfrpfX_K5eaZA4tWyglgiG7U/rs:fit/g:sm/q:40/h:410/w:490/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM1NDEy/OS0xMjgyMTE4ODQ0/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 409502,
          "name": "Mark Cardenas",
          "resource_url": "https://api.discogs.com/artists/409502",
          "thumbnail_url": "https://i.discogs.com/FBet2P-UspvlMUtWThsRhslmGSCRu48c22AR09xc8BE/rs:fit/g:sm/q:40/h:400/w:347/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwOTUw/Mi0xMTU5MDU3MjQz/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 443060,
          "name": "Torrell Ruffin",
          "resource_url": "https://api.discogs.com/artists/443060",
          "thumbnail_url": "https://i.discogs.com/CQVSt0uTUTWQ_yRRxr6UtyQ00zET65FezgYisHYJ6-8/rs:fit/g:sm/q:40/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0MzA2/MC0xNjE1NjEyMjAz/LTI2MjUuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 453969,
          "name": "Jerry Hubbard",
          "resource_url": "https://api.discogs.com/artists/453969",
          "thumbnail_url": "https://i.discogs.com/QVBQadR8HXGs1zMiervJ8heyL4_2YHocUa1B7N_l5eM/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ1Mzk2/OS0xNTUyNDcxMjc3/LTQ0OTUuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 638863,
          "name": "Garry Johnson (2)",
          "resource_url": "https://api.discogs.com/artists/638863",
          "thumbnail_url": "https://i.discogs.com/Ix-VtCVH6ZEf9_Vd7ba-M7pxWJH5_Il-0M_br69FllI/rs:fit/g:sm/q:40/h:255/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYzODg2/My0xNDU3ODEyNTYw/LTQ0NDMuanBlZw.jpeg"
        }
      ],
      "name": "The Time",
      "namevariations": [
        "Morris Day & The Time",
        "The Times",
        "Time",
        "ザ・タイム"
      ],
      "profile": "Born in Minneapolis, the group featured lead-singer [a152882], keyboardist [a55448] Harris, bassist and co-lead vocalist [a55449], keyboardist [a100600], guitarist [a37806], and drummer [a113965], all from two Twin Cities funk units, [a=Flyte Tyme] and \"Enterprise\". \r\n\r\nThe band's first Warner Bros. album, 1981's The Time, was created almost single-handedly by [a=Prince] (who wrote and played on tracks he produced under the early pseudonym [a160852]). \r\n\r\nBy 1982, the year of \"777-9311\", from '82 Warner Bros. album \"What Time Is It?\", the group had already established itself as one of the hottest bands working the live circuit. \r\n\r\nThe original members reunited in 1990 for the album \"Pandemonium\" on Paisley Park label and released the single \"Jerk Out\". Despite expectations, the reunion only brought moderate success.",
      "raw_data": {
        "aliases": [
          {
            "id": 2561672,
            "name": "The Original 7ven",
            "resource_url": "https://api.discogs.com/artists/2561672",
            "thumbnail_url": "https://i.discogs.com/zYTimHLw1r7YbvzPlad1BMjEZgVDH_juKrEQm8q_0oM/rs:fit/g:sm/q:40/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1NjE2/NzItMTM1MjQ5NDc2/Ny0xODY3LmpwZWc.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 32550,
        "images": [
          {
            "height": 413,
            "resource_url": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/kgGrBIi0J1n0dzWlyik-OrZGB5jWv0fzDgTgcERrYoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
            "width": 528
          },
          {
            "height": 581,
            "resource_url": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/rGY9z4l1Ly578KBp0S-JkgbHRwxEZffZys8OBvO1_O0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
            "width": 459
          },
          {
            "height": 548,
            "resource_url": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/n2I7EBVeFgPjSFr6utFoKdsn9l2MitEP7Z42eemGzzM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 644,
            "resource_url": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/geLcrCJ46lhCOgGbm-tejwV-x5RMIclTUBxRstiq0hE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
            "width": 472
          },
          {
            "height": 540,
            "resource_url": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/jTypyzYpLw2-q81Fq-rnqMytF-m739GpYGoXFaDyLOE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
            "width": 432
          },
          {
            "height": 359,
            "resource_url": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/D4bYdT6ldW7v7AlFLbJji_yyY-r-gOHDGrp8hIesbJQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
            "width": 525
          },
          {
            "height": 368,
            "resource_url": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/GcBSS9YzxpYJ-YXV4Oul3jUagr33r2AakSI1bqE3rEk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/nogko2Ty2OPAQ3BHoFWFvNshb3IxW3llhCp5dpVMBoE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
            "width": 473
          },
          {
            "height": 712,
            "resource_url": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/9Qc12_oBWnDUILBXDipd_cyvxxuSN7YM574qpUoigzo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
            "width": 560
          },
          {
            "height": 436,
            "resource_url": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Qv3eJHbvsztFAQhMwg2WNcp5PPknJwRS2p7Bp1Uk4tE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 659,
            "resource_url": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/wbedxVfaf-CbE2aW7Dz4TlvEWEveGtshjS7ban6QD0g/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
            "width": 492
          },
          {
            "height": 405,
            "resource_url": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/fCzgRNnwO3_KQlnQEBONv-OwctplCopcFct0Y9FIgjM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
            "width": 600
          }
        ],
        "members": [
          {
            "active": false,
            "id": 23446,
            "name": "Alexander O'Neal",
            "resource_url": "https://api.discogs.com/artists/23446",
            "thumbnail_url": "https://i.discogs.com/4kLfDujJ2cPtQSpPYKLYmbdcjh-H8lWOZ1Jr-TaQPVU/rs:fit/g:sm/q:40/h:472/w:533/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzNDQ2/LTE1MTIyMTYzNzYt/NjYzNy5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 37806,
            "name": "Jesse Johnson",
            "resource_url": "https://api.discogs.com/artists/37806",
            "thumbnail_url": "https://i.discogs.com/faB_cvw7LFBwDjzTbUfC0NKvU_kKQZZs9rObtEbUb5U/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3ODA2/LTE1ODYxMDQ1Nzkt/NjI4OS5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 55449,
            "name": "Terry Lewis",
            "resource_url": "https://api.discogs.com/artists/55449",
            "thumbnail_url": "https://i.discogs.com/qlM6fd5QPJgpFyKSKX0SgNRxH4iC61RoT3ja1fP9hB8/rs:fit/g:sm/q:40/h:300/w:265/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU1NDQ5/LTEzMjc2MDYwOTEu/anBlZw.jpeg"
          },
          {
            "active": true,
            "id": 100600,
            "name": "Monte Moir",
            "resource_url": "https://api.discogs.com/artists/100600",
            "thumbnail_url": "https://i.discogs.com/oLscQsJpR_NYyQHc5QhlOu_x6V2RfbDsoqvYmudC3Yg/rs:fit/g:sm/q:40/h:408/w:530/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwMDYw/MC0xMjU0NTIyMzA3/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 152882,
            "name": "Morris Day",
            "resource_url": "https://api.discogs.com/artists/152882",
            "thumbnail_url": "https://i.discogs.com/kiNgrSSlXNZPkVwc_HnbtzgON42EvOlQqv8SksOABF0/rs:fit/g:sm/q:40/h:763/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1Mjg4/Mi0xNjA2OTUzMzk3/LTgwMTAuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 241356,
            "name": "James Harris III",
            "resource_url": "https://api.discogs.com/artists/241356",
            "thumbnail_url": "https://i.discogs.com/M_DMStNqES-lQKwZmAbd11IBEzMra0zgiWBElbHUS-I/rs:fit/g:sm/q:40/h:378/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTM1/Ni0xNjg0Mjg5Njcz/LTQ0NzEuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 242702,
            "name": "Paul Peterson",
            "resource_url": "https://api.discogs.com/artists/242702",
            "thumbnail_url": "https://i.discogs.com/o7x1JSRudabRMRJ3ksKjxqrwZevD2ibfVhygQRimFCA/rs:fit/g:sm/q:40/h:376/w:565/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0Mjcw/Mi0xMzU2ODY2MjQz/LTYxMDEuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 354129,
            "name": "Jerome Benton",
            "resource_url": "https://api.discogs.com/artists/354129",
            "thumbnail_url": "https://i.discogs.com/6Yd4Np57BGtIBlFZzNpLfrpfX_K5eaZA4tWyglgiG7U/rs:fit/g:sm/q:40/h:410/w:490/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM1NDEy/OS0xMjgyMTE4ODQ0/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 409502,
            "name": "Mark Cardenas",
            "resource_url": "https://api.discogs.com/artists/409502",
            "thumbnail_url": "https://i.discogs.com/FBet2P-UspvlMUtWThsRhslmGSCRu48c22AR09xc8BE/rs:fit/g:sm/q:40/h:400/w:347/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwOTUw/Mi0xMTU5MDU3MjQz/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 443060,
            "name": "Torrell Ruffin",
            "resource_url": "https://api.discogs.com/artists/443060",
            "thumbnail_url": "https://i.discogs.com/CQVSt0uTUTWQ_yRRxr6UtyQ00zET65FezgYisHYJ6-8/rs:fit/g:sm/q:40/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0MzA2/MC0xNjE1NjEyMjAz/LTI2MjUuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 453969,
            "name": "Jerry Hubbard",
            "resource_url": "https://api.discogs.com/artists/453969",
            "thumbnail_url": "https://i.discogs.com/QVBQadR8HXGs1zMiervJ8heyL4_2YHocUa1B7N_l5eM/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ1Mzk2/OS0xNTUyNDcxMjc3/LTQ0OTUuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 638863,
            "name": "Garry Johnson (2)",
            "resource_url": "https://api.discogs.com/artists/638863",
            "thumbnail_url": "https://i.discogs.com/Ix-VtCVH6ZEf9_Vd7ba-M7pxWJH5_Il-0M_br69FllI/rs:fit/g:sm/q:40/h:255/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYzODg2/My0xNDU3ODEyNTYw/LTQ0NDMuanBlZw.jpeg"
          }
        ],
        "name": "The Time",
        "namevariations": [
          "Morris Day & The Time",
          "The Times",
          "Time",
          "ザ・タイム"
        ],
        "profile": "Born in Minneapolis, the group featured lead-singer [a152882], keyboardist [a55448] Harris, bassist and co-lead vocalist [a55449], keyboardist [a100600], guitarist [a37806], and drummer [a113965], all from two Twin Cities funk units, [a=Flyte Tyme] and \"Enterprise\". \r\n\r\nThe band's first Warner Bros. album, 1981's The Time, was created almost single-handedly by [a=Prince] (who wrote and played on tracks he produced under the early pseudonym [a160852]). \r\n\r\nBy 1982, the year of \"777-9311\", from '82 Warner Bros. album \"What Time Is It?\", the group had already established itself as one of the hottest bands working the live circuit. \r\n\r\nThe original members reunited in 1990 for the album \"Pandemonium\" on Paisley Park label and released the single \"Jerk Out\". Despite expectations, the reunion only brought moderate success.",
        "releases_url": "https://api.discogs.com/artists/32550/releases",
        "resource_url": "https://api.discogs.com/artists/32550",
        "uri": "https://www.discogs.com/artist/32550-The-Time",
        "urls": [
          "http://www.princevault.com/index.php?title=The_Time",
          "http://en.wikipedia.org/wiki/The_Time_(band)",
          "https://twitter.com/theoriginal7ven"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/32550",
      "thumb": "https://i.discogs.com/kgGrBIi0J1n0dzWlyik-OrZGB5jWv0fzDgTgcERrYoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
      "url": "https://www.discogs.com/artist/32550-The-Time",
      "urls": [
        "http://www.princevault.com/index.php?title=The_Time",
        "http://en.wikipedia.org/wiki/The_Time_(band)",
        "https://twitter.com/theoriginal7ven"
      ]
    },
    "lastfm": "ArtistLastFmData(name='The Time', url='https://www.last.fm/music/The+Time', mbid='3bfa8f23-2dbb-43e2-b1da-3cfaa6c5ff9d', listeners=160377, playcount=1076016, bio_summary='There are at least two bands called The Time\\n \\n1. The Time is a musical group that was formed in 1981. Featuring a funky sound merging pop with dance music, soul music, and more, they are prominent proteges of Prince and arguably his most successful side project. A version of the outfit called \\'Morris Day and the Time\\' still tour to this day.\\n\\nThe band was assembled under a clause in Prince\\'s contract with Warner Bros. that allowed him to recruit and produce other artists for the label. <a href=\"https://www.last.fm/music/The+Time\">Read more on Last.fm</a>', bio_content='There are at least two bands called The Time\\n \\n1. The Time is a musical group that was formed in 1981. Featuring a funky sound merging pop with dance music, soul music, and more, they are prominent proteges of Prince and arguably his most successful side project. A version of the outfit called \\'Morris Day and the Time\\' still tour to this day.\\n\\nThe band was assembled under a clause in Prince\\'s contract with Warner Bros. that allowed him to recruit and produce other artists for the label. Inspired by the 1980 film \\'The Idolmaker\\', a work about the life of music promoter and producer Bob Marucci (the svengali behind such 50s/60s teen idols as Fabian and Frankie Avalon), Prince decided to put together a pop-infused funk group that would serve as a pet project and an outlet for further hits and material in the vein of his own early albums. Prince had the intent to explore other musical genres and go for a more avant-garde ethos in his own career.\\n\\nBy 1981, he had built \\'The Time\\' out of an existing Minneapolis funk unit called \\'Flyte Tyme\\' (from the Donald Byrd song), which featured Jellybean Johnson on drums, Jimmy Jam and Monte Moir on keyboards, and Terry Lewis on bass. To this base, musicans Jesse Johnson (on guitar) and Morris Day (on lead vocals) came in. Day was a childhood friend of Prince and was drawn from another local band called \\'Enterprise\\'. Prince had used an Enterprise song, titled \"Partyup\", on his \\'Dirty Mind\\' album, and his selection of Day was essentially a reward; he had originally tapped Alexander O\\'Neal, yet another player in the Minneapolis funk scene, for the vocalist slot yet that had fallen through. \"Valet\" Jerome Benton also became a member of The Time, despite not playing an instrument. His main contributions are backing vocals and various on-stage antics.\\n\\nThe band went on to release four albums during the course of their main career, each being welcomed by man critics as a solid slice of jammy, rock-infused 80s funk. In contrast to the spiritually and ideologically charged nature of much of Prince\\'s work at that time, The Time\\'s albums seemed generally light and humorous in tone, though the first two of which were composed and arranged entirely by Prince. The band scored numerous hits over the years. These include \"The Bird\", \"Jungle Love\", \"777-9311\", \"Get It Up\", \"Gigolos Get Lonely Too\", and \"Cool\".\\n\\nStill, despite burning up the R&B charts in the early 80s, the group never approached true super-stardom. Nor did they develop a reputation for innovation or artistic brilliance in the manner of Prince, with tensions building between the desires of the band members to spread their wings and the heavy-handed control of their famous manager. In terms of raw talent, Prince\\'s associates clearly had much to offer.\\n\\nIn 1983, musicians Jimmy Jam and Terry Lewis, who had begun writing songs and branching out into production work of their own (such as working with SOLAR to produce Klymaxx and with Tabu Records to produce the S.O.S. Band), got stranded in Atlanta by a blizzard and failed to make it to a concert in San Antonio, Texas. The two were fined and then fired. Whether their firing had that much to do with the incident per se or seemed inevitable due to their increasing independence has never been clear, but the musicians went on to successful production careers involving them with multiple soul and funk artists. Monte Moir took the opportunity to leave as well, and he would also work with Jam and Lewis. The three were replaced with Mark Cardenez, Paul Peterson (redubbed St. Paul), and Jerry Hubbard.\\n\\nThis new line-up were featured in Prince\\'s Purple Rain film. The Time rode the wave of popularity created by the movie and hit singles \"Jungle Love\" and \"The Bird\" and were household names in 1984.\\n\\nIt was Day who left next after arguments with Prince, choosing to pursue a solo career in 1985 after a successful acting turn in Purple Rain. Soon thereafter, with Jesse Johnson also opting to go solo, the band disintegrated but several members (Benton, Johnson and Peterson) were reformed into a new short-lived project called The Family. Meanwhile, Jimmy Jam and Terry Lewis went on to become one of the most successful songwriting and production teams of the 80s and 90s.\\n\\nIn 1990, Benton and the original six members of the band reunited for the Graffiti Bridge movie and soundtrack, as well as a new album called Pandemonium. This spawned their highest selling single, \"Jerk Out\" and the album featured more input from the band than any other Time album. The reunion was short-lived, however - infighting within the band caused them to disband once again. Morris and Jerome have since remained a team, with both trying out some small acting roles over the next few years.\\n\\nSeveral members of The Time reunited in 1996, added a few new recruits and have remained together since. This version of the band can be seen in the Kevin Smith film Jay and Silent Bob Strike Back and tours frequently to this day. The band is usually billed as \"Morris Day and The Time\".\\n\\nA fifth Time album is rumored to have been completed in the late 90s, recorded with the new lineup but production and coordination with Prince has prevented its release. The title Old Dogs, New Tricks was the working title. A 2004 album attributed to Morris Day called It\\'s About Time contains a few new tracks written and performed by Day and a number of live performances by The Time.\\n\\nIn 2011, the original version of the band reformed as a new entity, The Original 7ven, in order to release a new album. Issues with Prince stalled out the group\\'s momentum, even though \\'Condensate\\' and its single, \"#Trendin\", both received critical praise. This version of the band had disbanded totally by 2013, Morris Day resumed touring as \"Morris Day and The Time\".\\n\\nFrom late 2014 onward, the band shot back into international attention when genre-hopping British artist Mark Ronson used The Time\\'s work as inspiration for his gigantic hit \"Uptown Funk\" (also known as \"Uptown Funk (Feat. Bruno Mars)\" due to Bruno Mars\\' involvement). After receiving the prestigious best British Single Award at the 2015 BRIT ceremony, Ronson directly thanked Morris Day and The Time alongside artists such as James Brown and others on air for trailblazing the \"Uptown Funk\" sound. In the past several months, a sort of \\'halo effect\\' has allowed The Time to blast back into the mainstream and appear on programs such as \\'Jimmy Kimmel Live\\'.\\n\\n2. The Time was a freakbeat band of the mid-1960s from Southampton, United Kingdom. They released just two rare 45s on Pye Records in 1966, the first and best known one being \\'Take a Bit of Notice\\' b/w \\'Every Now and Then\\'. Personnel: Kevin Scott (vocals), John Glenfield (guitar), Mike Dubiel (bass), Danny Barbour (drums). Frontman Kevin Scott\\'s real name was Kevin Finn. He would move on to become the lead singer in Wishful Thinking and The New Seekers. <a href=\"https://www.last.fm/music/The+Time\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['funk', '80s', 'pop', 'Minneapolis funk', 'prince'], similar_artists=[{'name': 'Prince', 'url': 'https://www.last.fm/music/Prince'}, {'name': 'Sheila E.', 'url': 'https://www.last.fm/music/Sheila+E.'}, {'name': 'Jesse Johnson', 'url': 'https://www.last.fm/music/Jesse+Johnson'}, {'name': 'Morris Day', 'url': 'https://www.last.fm/music/Morris+Day'}, {'name': 'Prince & The Revolution', 'url': 'https://www.last.fm/music/Prince+&+The+Revolution'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'The Time', 'mbid': '3bfa8f23-2dbb-43e2-b1da-3cfaa6c5ff9d', 'url': 'https://www.last.fm/music/The+Time', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '160377', 'playcount': '1076016'}, 'similar': {'artist': [{'name': 'Prince', 'url': 'https://www.last.fm/music/Prince', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Sheila E.', 'url': 'https://www.last.fm/music/Sheila+E.', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Jesse Johnson', 'url': 'https://www.last.fm/music/Jesse+Johnson', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Morris Day', 'url': 'https://www.last.fm/music/Morris+Day', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Prince & The Revolution', 'url': 'https://www.last.fm/music/Prince+&+The+Revolution', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'funk', 'url': 'https://www.last.fm/tag/funk'}, {'name': '80s', 'url': 'https://www.last.fm/tag/80s'}, {'name': 'pop', 'url': 'https://www.last.fm/tag/pop'}, {'name': 'Minneapolis funk', 'url': 'https://www.last.fm/tag/Minneapolis+funk'}, {'name': 'prince', 'url': 'https://www.last.fm/tag/prince'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/The+Time/+wiki'}}, 'published': '28 Sep 2006, 04:35', 'summary': 'There are at least two bands called The Time\\n \\n1. The Time is a musical group that was formed in 1981. Featuring a funky sound merging pop with dance music, soul music, and more, they are prominent proteges of Prince and arguably his most successful side project. A version of the outfit called \\'Morris Day and the Time\\' still tour to this day.\\n\\nThe band was assembled under a clause in Prince\\'s contract with Warner Bros. that allowed him to recruit and produce other artists for the label. <a href=\"https://www.last.fm/music/The+Time\">Read more on Last.fm</a>', 'content': 'There are at least two bands called The Time\\n \\n1. The Time is a musical group that was formed in 1981. Featuring a funky sound merging pop with dance music, soul music, and more, they are prominent proteges of Prince and arguably his most successful side project. A version of the outfit called \\'Morris Day and the Time\\' still tour to this day.\\n\\nThe band was assembled under a clause in Prince\\'s contract with Warner Bros. that allowed him to recruit and produce other artists for the label. Inspired by the 1980 film \\'The Idolmaker\\', a work about the life of music promoter and producer Bob Marucci (the svengali behind such 50s/60s teen idols as Fabian and Frankie Avalon), Prince decided to put together a pop-infused funk group that would serve as a pet project and an outlet for further hits and material in the vein of his own early albums. Prince had the intent to explore other musical genres and go for a more avant-garde ethos in his own career.\\n\\nBy 1981, he had built \\'The Time\\' out of an existing Minneapolis funk unit called \\'Flyte Tyme\\' (from the Donald Byrd song), which featured Jellybean Johnson on drums, Jimmy Jam and Monte Moir on keyboards, and Terry Lewis on bass. To this base, musicans Jesse Johnson (on guitar) and Morris Day (on lead vocals) came in. Day was a childhood friend of Prince and was drawn from another local band called \\'Enterprise\\'. Prince had used an Enterprise song, titled \"Partyup\", on his \\'Dirty Mind\\' album, and his selection of Day was essentially a reward; he had originally tapped Alexander O\\'Neal, yet another player in the Minneapolis funk scene, for the vocalist slot yet that had fallen through. \"Valet\" Jerome Benton also became a member of The Time, despite not playing an instrument. His main contributions are backing vocals and various on-stage antics.\\n\\nThe band went on to release four albums during the course of their main career, each being welcomed by man critics as a solid slice of jammy, rock-infused 80s funk. In contrast to the spiritually and ideologically charged nature of much of Prince\\'s work at that time, The Time\\'s albums seemed generally light and humorous in tone, though the first two of which were composed and arranged entirely by Prince. The band scored numerous hits over the years. These include \"The Bird\", \"Jungle Love\", \"777-9311\", \"Get It Up\", \"Gigolos Get Lonely Too\", and \"Cool\".\\n\\nStill, despite burning up the R&B charts in the early 80s, the group never approached true super-stardom. Nor did they develop a reputation for innovation or artistic brilliance in the manner of Prince, with tensions building between the desires of the band members to spread their wings and the heavy-handed control of their famous manager. In terms of raw talent, Prince\\'s associates clearly had much to offer.\\n\\nIn 1983, musicians Jimmy Jam and Terry Lewis, who had begun writing songs and branching out into production work of their own (such as working with SOLAR to produce Klymaxx and with Tabu Records to produce the S.O.S. Band), got stranded in Atlanta by a blizzard and failed to make it to a concert in San Antonio, Texas. The two were fined and then fired. Whether their firing had that much to do with the incident per se or seemed inevitable due to their increasing independence has never been clear, but the musicians went on to successful production careers involving them with multiple soul and funk artists. Monte Moir took the opportunity to leave as well, and he would also work with Jam and Lewis. The three were replaced with Mark Cardenez, Paul Peterson (redubbed St. Paul), and Jerry Hubbard.\\n\\nThis new line-up were featured in Prince\\'s Purple Rain film. The Time rode the wave of popularity created by the movie and hit singles \"Jungle Love\" and \"The Bird\" and were household names in 1984.\\n\\nIt was Day who left next after arguments with Prince, choosing to pursue a solo career in 1985 after a successful acting turn in Purple Rain. Soon thereafter, with Jesse Johnson also opting to go solo, the band disintegrated but several members (Benton, Johnson and Peterson) were reformed into a new short-lived project called The Family. Meanwhile, Jimmy Jam and Terry Lewis went on to become one of the most successful songwriting and production teams of the 80s and 90s.\\n\\nIn 1990, Benton and the original six members of the band reunited for the Graffiti Bridge movie and soundtrack, as well as a new album called Pandemonium. This spawned their highest selling single, \"Jerk Out\" and the album featured more input from the band than any other Time album. The reunion was short-lived, however - infighting within the band caused them to disband once again. Morris and Jerome have since remained a team, with both trying out some small acting roles over the next few years.\\n\\nSeveral members of The Time reunited in 1996, added a few new recruits and have remained together since. This version of the band can be seen in the Kevin Smith film Jay and Silent Bob Strike Back and tours frequently to this day. The band is usually billed as \"Morris Day and The Time\".\\n\\nA fifth Time album is rumored to have been completed in the late 90s, recorded with the new lineup but production and coordination with Prince has prevented its release. The title Old Dogs, New Tricks was the working title. A 2004 album attributed to Morris Day called It\\'s About Time contains a few new tracks written and performed by Day and a number of live performances by The Time.\\n\\nIn 2011, the original version of the band reformed as a new entity, The Original 7ven, in order to release a new album. Issues with Prince stalled out the group\\'s momentum, even though \\'Condensate\\' and its single, \"#Trendin\", both received critical praise. This version of the band had disbanded totally by 2013, Morris Day resumed touring as \"Morris Day and The Time\".\\n\\nFrom late 2014 onward, the band shot back into international attention when genre-hopping British artist Mark Ronson used The Time\\'s work as inspiration for his gigantic hit \"Uptown Funk\" (also known as \"Uptown Funk (Feat. Bruno Mars)\" due to Bruno Mars\\' involvement). After receiving the prestigious best British Single Award at the 2015 BRIT ceremony, Ronson directly thanked Morris Day and The Time alongside artists such as James Brown and others on air for trailblazing the \"Uptown Funk\" sound. In the past several months, a sort of \\'halo effect\\' has allowed The Time to blast back into the mainstream and appear on programs such as \\'Jimmy Kimmel Live\\'.\\n\\n2. The Time was a freakbeat band of the mid-1960s from Southampton, United Kingdom. They released just two rare 45s on Pye Records in 1966, the first and best known one being \\'Take a Bit of Notice\\' b/w \\'Every Now and Then\\'. Personnel: Kevin Scott (vocals), John Glenfield (guitar), Mike Dubiel (bass), Danny Barbour (drums). Frontman Kevin Scott\\'s real name was Kevin Finn. He would move on to become the lead singer in Wishful Thinking and The New Seekers. <a href=\"https://www.last.fm/music/The+Time\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='1EgGVV9cmmlLEsFlunjmvv', url='https://open.spotify.com/artist/1EgGVV9cmmlLEsFlunjmvv', name='The Time', popularity=45, followers=493054, genres=['funk rock', 'post-disco'], images=[{'url': 'https://i.scdn.co/image/ab67616d0000b273c093f4dd308ad9c41e20eee8', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616d00001e02c093f4dd308ad9c41e20eee8', 'height': 300, 'width': 300}, {'url': 'https://i.scdn.co/image/ab67616d00004851c093f4dd308ad9c41e20eee8', 'height': 64, 'width': 64}], external_urls={'spotify': 'https://open.spotify.com/artist/1EgGVV9cmmlLEsFlunjmvv'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/1EgGVV9cmmlLEsFlunjmvv'}, 'followers': {'href': None, 'total': 493054}, 'genres': ['funk rock', 'post-disco'], 'href': 'https://api.spotify.com/v1/artists/1EgGVV9cmmlLEsFlunjmvv', 'id': '1EgGVV9cmmlLEsFlunjmvv', 'images': [{'url': 'https://i.scdn.co/image/ab67616d0000b273c093f4dd308ad9c41e20eee8', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616d00001e02c093f4dd308ad9c41e20eee8', 'height': 300, 'width': 300}, {'url': 'https://i.scdn.co/image/ab67616d00004851c093f4dd308ad9c41e20eee8', 'height': 64, 'width': 64}], 'name': 'The Time', 'popularity': 45, 'type': 'artist', 'uri': 'spotify:artist:1EgGVV9cmmlLEsFlunjmvv'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "Original 7ven",
      "biography_de": null,
      "biography_en": "The Time (now The Original 7ven) is an American funk and dance-pop ensemble formed in Minneapolis in 1981. They are close Prince associates and arguably the most successful artists who have worked with him.\n\nPrince and Formation\n\nThe band was assembled under a clause in Prince's contract with Warner Bros. that allowed him to recruit and produce other artists for the label. Inspired by the 1980 film The Idolmaker, Prince decided to put together a pop-funk group that would serve as an outlet for material in the vein of his own early albums, while he explored other genres and styles in his own career.\n\nBy 1981, he had built The Time out of an existing Minneapolis funk unit, Flyte Time (from the Donald Byrd song), which featured Jellybean Johnson on drums, Jimmy Jam and Monte Moir on keyboards, and Terry Lewis on bass. To this base were added Jesse Johnson on guitar and a lead singer and childhood friend named Morris Day, and Jerome Benton who was a promoter drawn from another local band called \"Enterprise\", who became Day's comic foil. Prince had used an Enterprise song, \"Partyup\", on his Dirty Mind album, and his selection of Day was essentially a reward; he had originally tapped Alexander O'Neal – yet another player in the Minneapolis Uptown funk scene – for the vocalist slot, but O'Neal wanted too much money, himself being quoted as saying, \"I basically didn't see no point in being a superstar with no money.\"\n\nSuccess\n\nThe band went on to release four albums (mostly performed by Prince + singer Morris Day alone) during the course of their main career, each a solid slice of jammy, rock-infused 1980s funk, generally light and humorous in tone, strongly influenced by Parliament, James Brown, Sly – and, of course, Prince. Although they scored numerous hits (including \"The Bird\", \"Jungle Love\", \"777-9311\", \"Get It Up\", \"Gigolos Get Lonely Too\", \"The Walk\" and \"Cool\", mostly on the R&B charts) during the early 1980s, they never approached superstardom. But as good as they were, they weren't allowed to play a note on their debut album. Prince recorded all the music himself, crediting the production to Jamie Starr and Morris Day, who at least was allowed to sing on the record, but was required to follow Prince's guide vocals note-for-note.\n\nA growing rivalry began to develop between the two groups as The Time toured with Prince and his band during his 1982 Controversy Tour. Frustrated with their lack of input on the albums bearing their name and at being underpaid, The Time would take to the stage with the purpose of showing up Prince, in much the same way that Prince and his band had undermined Rick James when they had toured as James' opening act (unlike what happened during Rick James' Light it Up tour, this time people didn't leave before the headliner, Prince, finished his set). The tension came to a head on the final night of the tour in Cincinnati during the Time's set when Prince and some of his band threw eggs at their supporting act from offstage. Things further escalated after The Time's performance when guitarist Jesse Johnson was handcuffed to a wall-mounted coat rack and further humiliated. Prince demanded no interruptions during his performance, but as soon as he left the stage, a food fight erupted. When the battle continued at the hotel, Prince made Morris Day pay for all damages, claiming that he had started the whole thing.\n\nDuring the 1982–83 1999/Triple Threat tour, The Time served as Vanity 6's backing band from behind a curtain, before playing their own hour-long set. They liked the arrangement because the band saw it as free money. As Terry Lewis put it; \"I'll play behind Vanity 6 for thirty minutes for $250. No problem. I was going to have to do the sound check, anyway.\" Jimmy Jam and Terry Lewis, who had begun writing songs and production work of their own (working with SOLAR to produce Klymaxx and with Tabu Records to produce the S.O.S. Band), were stranded in Atlanta by a blizzard and failed to make it to a Time concert in San Antonio, for which Jerome had to mime playing bass guitar on stage while Prince played Lewis' part off stage, and Lisa Coleman stood in for Jimmy Jam. Subsequently, the duo were fined and then fired, although Prince would state in a 1990 Rolling Stone's interview that \"I didn't fire Jimmy Jam and Terry Lewis. Morris asked me what I would do in his situation. Remember, it was his band.\" Whether their firing was due to the incident or to their increasing independence has never been clear. Monte Moir took the opportunity to leave as well, and would also work with Jam and Lewis. The three were replaced with Mark Cardenas and Paul Peterson on keyboards and Rocky Harris on bass. This new line up, except with Jerry Hubbard replacing Rocky Harris, were featured in Prince's Purple Rain film. The Time rode the wave of popularity created by the movie and hit singles \"Jungle Love\" and \"The Bird\" and were household names in 1984.\n\nFirst split\n\nIt was Day who left next after arguments with Prince, choosing to pursue a solo career in 1985 after a successful acting turn in Purple Rain. Soon thereafter, with Jesse Johnson also opting to go solo (taking other Time members Cardenas and Hubbard with him), the band disintegrated; the remaining members (Benton, Jellybean Johnson and Peterson) were reformed into a new short-lived project called The Family. Meanwhile, Jimmy Jam and Terry Lewis went on to become one of the most successful songwriting and production teams of the 1980s and 1990s.\n\nFirst reunion\n\nIn 1990, the original seven members of the band reunited for the Graffiti Bridge movie and soundtrack, as well as a new album, Pandemonium. The project was originally called Corporate World and was set to only feature Morris and Jerome, but Warner Bros. demanded that the original line-up be brought in if Prince wanted the company's backing for the movie. This spawned their highest selling single, \"Jerk Out\" and the album featured more input from the band than any other Time album. \"Nobody really needed to put The Time back together,\" said Lewis, \"but everybody wanted to. That makes it a great experience all round. We take the musicianship and the craft of what we do very seriously but, when the seven of us get together, it's naturally a party, fun kinda situation. We carry that from the record on to the stage.\"\n\nThe reunion was short-lived, however – infighting within the band caused them to disband once again. Morris and Jerome have since remained a team, with both trying out some small acting roles over the next few years.\n\nIn 1995 Morris met a young 22 year old up and coming LA, California music producer through manager David Lombard (Toni Tone Tony/Envoge) named Robert GI' Grissett and the two started producing songs together for a new Morris Day album with the lead single to be a song entitled 'My Baby Boo'! Rumor has it that it was to be released through Scotti Bros. Records, but the deal fell through. In a 2003 LA Weekly Interview with GI' now known as Rob Gi'hana, Rob was quoted as saying, \"man Morris and I recorded a lot of songs and 'work in progress' ideas, and I truly believe at least 4 of them can be hits now or even in the future if they ever get to see the light of day I pray! We became really good friends at the time and it was an experience I will never forget and we still Cool. I believe we will release those songs when the time is right.\" After Rob gives us a sneak listen to a couple of the tracks (which are in my opinion some of the best solo Morris Day jams I've EVER heard not produced by Prince or Jimmy Jam & Terry Lewis) starts to get excited after we ask him what the titles of some of the songs were a \"My favorites are called Sexy Lady & My Baby Boo. Ohhh and the one that should be a classic Morris ala The Bird, The Oak Tree, is a song we did called Drop (ya DRawz)!! Man.. funky classic morris day and he is in classic YeSSSS mode! We acted a fool in the studio that nite man!!!!!... its got to come out!!\n\nSeveral members of The Time reunited in 1995, added a few new recruits, Torri Ruffin on guitar, Chance Howard on Keyboards, Robert GI' Grissett Jr on third Keyboards and Freeze on Bass Guitar. This version of the band can be seen in the Kevin Smith film Jay and Silent Bob Strike Back and tours frequently to this day. The band is usually billed as \"Morris Day and The Time\".\n\nA fifth Time album is rumoured to have been completed in the late 1990s, recorded with the new lineup but production and coordination with Prince has prevented its release. The title Old Dogs, New Tricks was the working title. A 2004 album attributed to Morris Day called It's About Time contains a few new tracks written and performed by Day and a number of live performances by The Time featuring the new members along with Jellybean, Jerome, Monte & Morris.\n\nSecond reunion and The Original 7ven\n\nThe Time reunited at The 50th Grammy Awards on February 10, 2008, performing a medley that included Rihanna and featured \"Jungle Love\".\n\nIn June and July 2008, all of the original members of The Time (Morris Day, Jimmy Jam, Terry Lewis, Jesse Johnson, Jerome Benton, Jellybean Johnson, and Monte Moir) reunited once again for a series of shows at the Flamingo Hotel and Casino in Las Vegas.\n\nA recent interview as of January 2009 mentions that guitarist Jesse Johnson states he is working with The Time on their upcoming album. The Time appeared at The Fox Theater, in Detroit, Michigan on June 11, 2010, with the original lineup to a packed house. Two days later during what Jimmy Jam dubbed \"The Stingy Tour\" on June 13, 2010 the \"magnificent 7\" played a hometown reunion concert in Minneapolis, MN, and, during that concert, announced on stage that a new album was \"90% complete,\" which confirmed information provided in a Billboard profile published a week earlier.\n\nIn September 2011, the band announced a name change to The Original 7ven and a new album Condensate which was released October 18, 2011 with the single \"#Trendin\" released September 20.\n\nAs for why the band decided to call themselves by a new name, Jimmy Jam said that “the decision was made at that point that we could either continue to, shall we say, negotiate or argue or plead or whatever. We decided to go the route of let’s not hold things up because of the name. Let’s embrace the opportunity to move forward in a new era, with a new outlook, with a new album and that’s what we did. We think the name reflects exactly who we are. We are the Original 7even and that basically, for me, covers it.”\n\nOn October 27, 2011, The Original 7ven appeared on The Tonight Show with Jay Leno.\n\nOn November 17, 2011, The Original 7ven opened the Soul Train Music Awards in Atlanta, GA, playing a medley of greatest hits and new single #TRENDIN. The show was broadcast on November 27.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1981",
      "country": "Minneapolis, USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1981",
      "gender": "Male",
      "genre": "Funk",
      "id": "122077",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/qwtsww1440349390.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/wxvwuu1440349423.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xstpuq1454864151.jpg",
          "width": 1920
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/time-the-5ef64a823be4a.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "8",
      "mood": null,
      "music_videos": null,
      "musicbrainz_id": "3bfa8f23-2dbb-43e2-b1da-3cfaa6c5ff9d",
      "name": "The Time",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/3a/b0/ed/3ab0ed2c-b60e-a983-ef86-55759613b134/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "R&B/Soul"
      ],
      "id": "166302",
      "name": "The Time",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/the-time/166302"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "32550",
      "images": [
        {
          "height": 413,
          "resource_url": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/kgGrBIi0J1n0dzWlyik-OrZGB5jWv0fzDgTgcERrYoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
          "width": 528
        },
        {
          "height": 581,
          "resource_url": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/rGY9z4l1Ly578KBp0S-JkgbHRwxEZffZys8OBvO1_O0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
          "width": 459
        },
        {
          "height": 548,
          "resource_url": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/n2I7EBVeFgPjSFr6utFoKdsn9l2MitEP7Z42eemGzzM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 644,
          "resource_url": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/geLcrCJ46lhCOgGbm-tejwV-x5RMIclTUBxRstiq0hE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
          "width": 472
        },
        {
          "height": 540,
          "resource_url": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/jTypyzYpLw2-q81Fq-rnqMytF-m739GpYGoXFaDyLOE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
          "width": 432
        },
        {
          "height": 359,
          "resource_url": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/D4bYdT6ldW7v7AlFLbJji_yyY-r-gOHDGrp8hIesbJQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
          "width": 525
        },
        {
          "height": 368,
          "resource_url": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/GcBSS9YzxpYJ-YXV4Oul3jUagr33r2AakSI1bqE3rEk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/nogko2Ty2OPAQ3BHoFWFvNshb3IxW3llhCp5dpVMBoE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
          "width": 473
        },
        {
          "height": 712,
          "resource_url": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/9Qc12_oBWnDUILBXDipd_cyvxxuSN7YM574qpUoigzo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
          "width": 560
        },
        {
          "height": 436,
          "resource_url": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Qv3eJHbvsztFAQhMwg2WNcp5PPknJwRS2p7Bp1Uk4tE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 659,
          "resource_url": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/wbedxVfaf-CbE2aW7Dz4TlvEWEveGtshjS7ban6QD0g/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
          "width": 492
        },
        {
          "height": 405,
          "resource_url": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/fCzgRNnwO3_KQlnQEBONv-OwctplCopcFct0Y9FIgjM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
          "width": 600
        }
      ],
      "members": [
        {
          "active": false,
          "id": 23446,
          "name": "Alexander O'Neal",
          "resource_url": "https://api.discogs.com/artists/23446",
          "thumbnail_url": "https://i.discogs.com/4kLfDujJ2cPtQSpPYKLYmbdcjh-H8lWOZ1Jr-TaQPVU/rs:fit/g:sm/q:40/h:472/w:533/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzNDQ2/LTE1MTIyMTYzNzYt/NjYzNy5qcGVn.jpeg"
        },
        {
          "active": true,
          "id": 37806,
          "name": "Jesse Johnson",
          "resource_url": "https://api.discogs.com/artists/37806",
          "thumbnail_url": "https://i.discogs.com/faB_cvw7LFBwDjzTbUfC0NKvU_kKQZZs9rObtEbUb5U/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3ODA2/LTE1ODYxMDQ1Nzkt/NjI4OS5qcGVn.jpeg"
        },
        {
          "active": true,
          "id": 55449,
          "name": "Terry Lewis",
          "resource_url": "https://api.discogs.com/artists/55449",
          "thumbnail_url": "https://i.discogs.com/qlM6fd5QPJgpFyKSKX0SgNRxH4iC61RoT3ja1fP9hB8/rs:fit/g:sm/q:40/h:300/w:265/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU1NDQ5/LTEzMjc2MDYwOTEu/anBlZw.jpeg"
        },
        {
          "active": true,
          "id": 100600,
          "name": "Monte Moir",
          "resource_url": "https://api.discogs.com/artists/100600",
          "thumbnail_url": "https://i.discogs.com/oLscQsJpR_NYyQHc5QhlOu_x6V2RfbDsoqvYmudC3Yg/rs:fit/g:sm/q:40/h:408/w:530/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwMDYw/MC0xMjU0NTIyMzA3/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 152882,
          "name": "Morris Day",
          "resource_url": "https://api.discogs.com/artists/152882",
          "thumbnail_url": "https://i.discogs.com/kiNgrSSlXNZPkVwc_HnbtzgON42EvOlQqv8SksOABF0/rs:fit/g:sm/q:40/h:763/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1Mjg4/Mi0xNjA2OTUzMzk3/LTgwMTAuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 241356,
          "name": "James Harris III",
          "resource_url": "https://api.discogs.com/artists/241356",
          "thumbnail_url": "https://i.discogs.com/M_DMStNqES-lQKwZmAbd11IBEzMra0zgiWBElbHUS-I/rs:fit/g:sm/q:40/h:378/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTM1/Ni0xNjg0Mjg5Njcz/LTQ0NzEuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 242702,
          "name": "Paul Peterson",
          "resource_url": "https://api.discogs.com/artists/242702",
          "thumbnail_url": "https://i.discogs.com/o7x1JSRudabRMRJ3ksKjxqrwZevD2ibfVhygQRimFCA/rs:fit/g:sm/q:40/h:376/w:565/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0Mjcw/Mi0xMzU2ODY2MjQz/LTYxMDEuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 354129,
          "name": "Jerome Benton",
          "resource_url": "https://api.discogs.com/artists/354129",
          "thumbnail_url": "https://i.discogs.com/6Yd4Np57BGtIBlFZzNpLfrpfX_K5eaZA4tWyglgiG7U/rs:fit/g:sm/q:40/h:410/w:490/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM1NDEy/OS0xMjgyMTE4ODQ0/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 409502,
          "name": "Mark Cardenas",
          "resource_url": "https://api.discogs.com/artists/409502",
          "thumbnail_url": "https://i.discogs.com/FBet2P-UspvlMUtWThsRhslmGSCRu48c22AR09xc8BE/rs:fit/g:sm/q:40/h:400/w:347/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwOTUw/Mi0xMTU5MDU3MjQz/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 443060,
          "name": "Torrell Ruffin",
          "resource_url": "https://api.discogs.com/artists/443060",
          "thumbnail_url": "https://i.discogs.com/CQVSt0uTUTWQ_yRRxr6UtyQ00zET65FezgYisHYJ6-8/rs:fit/g:sm/q:40/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0MzA2/MC0xNjE1NjEyMjAz/LTI2MjUuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 453969,
          "name": "Jerry Hubbard",
          "resource_url": "https://api.discogs.com/artists/453969",
          "thumbnail_url": "https://i.discogs.com/QVBQadR8HXGs1zMiervJ8heyL4_2YHocUa1B7N_l5eM/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ1Mzk2/OS0xNTUyNDcxMjc3/LTQ0OTUuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 638863,
          "name": "Garry Johnson (2)",
          "resource_url": "https://api.discogs.com/artists/638863",
          "thumbnail_url": "https://i.discogs.com/Ix-VtCVH6ZEf9_Vd7ba-M7pxWJH5_Il-0M_br69FllI/rs:fit/g:sm/q:40/h:255/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYzODg2/My0xNDU3ODEyNTYw/LTQ0NDMuanBlZw.jpeg"
        }
      ],
      "name": "The Time",
      "namevariations": [
        "Morris Day & The Time",
        "The Times",
        "Time",
        "ザ・タイム"
      ],
      "profile": "Born in Minneapolis, the group featured lead-singer [a152882], keyboardist [a55448] Harris, bassist and co-lead vocalist [a55449], keyboardist [a100600], guitarist [a37806], and drummer [a113965], all from two Twin Cities funk units, [a=Flyte Tyme] and \"Enterprise\". \r\n\r\nThe band's first Warner Bros. album, 1981's The Time, was created almost single-handedly by [a=Prince] (who wrote and played on tracks he produced under the early pseudonym [a160852]). \r\n\r\nBy 1982, the year of \"777-9311\", from '82 Warner Bros. album \"What Time Is It?\", the group had already established itself as one of the hottest bands working the live circuit. \r\n\r\nThe original members reunited in 1990 for the album \"Pandemonium\" on Paisley Park label and released the single \"Jerk Out\". Despite expectations, the reunion only brought moderate success.",
      "raw_data": {
        "aliases": [
          {
            "id": 2561672,
            "name": "The Original 7ven",
            "resource_url": "https://api.discogs.com/artists/2561672",
            "thumbnail_url": "https://i.discogs.com/zYTimHLw1r7YbvzPlad1BMjEZgVDH_juKrEQm8q_0oM/rs:fit/g:sm/q:40/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1NjE2/NzItMTM1MjQ5NDc2/Ny0xODY3LmpwZWc.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 32550,
        "images": [
          {
            "height": 413,
            "resource_url": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/h9UCdsTOOylDwvWD_t3Osn6KX8Pps1IhQ_7liaMjRwg/rs:fit/g:sm/q:90/h:413/w:528/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/kgGrBIi0J1n0dzWlyik-OrZGB5jWv0fzDgTgcERrYoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
            "width": 528
          },
          {
            "height": 581,
            "resource_url": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/haGTS23cwO1NMItLFSCs0-cdRQHGPpf0qgLEYOGzZS4/rs:fit/g:sm/q:90/h:581/w:459/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/rGY9z4l1Ly578KBp0S-JkgbHRwxEZffZys8OBvO1_O0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTkwMTUu/anBlZw.jpeg",
            "width": 459
          },
          {
            "height": 548,
            "resource_url": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/3Dy82363XKjnpnkL4RHyl2uQj3EO18AdvzcwB56cRIQ/rs:fit/g:sm/q:90/h:548/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/n2I7EBVeFgPjSFr6utFoKdsn9l2MitEP7Z42eemGzzM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzMjEyNDM2NDcu/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 644,
            "resource_url": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/GEiKVTwMJEwDxLBJE8l3XQaIT5oSuUZyNagFx0n5e-4/rs:fit/g:sm/q:90/h:644/w:472/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/geLcrCJ46lhCOgGbm-tejwV-x5RMIclTUBxRstiq0hE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTk3NzUu/anBlZw.jpeg",
            "width": 472
          },
          {
            "height": 540,
            "resource_url": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/g2CQJ2kG87AQSpMEaHTlGGDWN40v0ArQjL1WuMW0dv4/rs:fit/g:sm/q:90/h:540/w:432/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/jTypyzYpLw2-q81Fq-rnqMytF-m739GpYGoXFaDyLOE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkxNTAu/anBlZw.jpeg",
            "width": 432
          },
          {
            "height": 359,
            "resource_url": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/XfYxO8j2MmZGXB2DcKO6EE1-Yu7npy7yV44Ix0pknew/rs:fit/g:sm/q:90/h:359/w:525/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/D4bYdT6ldW7v7AlFLbJji_yyY-r-gOHDGrp8hIesbJQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTg4ODMu/anBlZw.jpeg",
            "width": 525
          },
          {
            "height": 368,
            "resource_url": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/SJPFIhEe2tAI1_Htw6G2sw_V0TGrEzXMbjaL3cBIDVg/rs:fit/g:sm/q:90/h:368/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/GcBSS9YzxpYJ-YXV4Oul3jUagr33r2AakSI1bqE3rEk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/MzkzMC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/uS5MAIZxafDLLYO07V7HGsU7LuoZmCErcS-YdlDSc08/rs:fit/g:sm/q:90/h:600/w:473/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/nogko2Ty2OPAQ3BHoFWFvNshb3IxW3llhCp5dpVMBoE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEzNTE2MzE4NDUt/NDE3MS5qcGVn.jpeg",
            "width": 473
          },
          {
            "height": 712,
            "resource_url": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/XErCEByrJGaGFYqr3lYQHBMSXbgAEz1I6pDaJlsk-Y4/rs:fit/g:sm/q:90/h:712/w:560/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/9Qc12_oBWnDUILBXDipd_cyvxxuSN7YM574qpUoigzo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/OTcxMi5qcGVn.jpeg",
            "width": 560
          },
          {
            "height": 436,
            "resource_url": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/gyevH7U3w7rVuABsGpYQabaQtSMQ6UEy39410JyvdZ0/rs:fit/g:sm/q:90/h:436/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Qv3eJHbvsztFAQhMwg2WNcp5PPknJwRS2p7Bp1Uk4tE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODQt/MjE4Ni5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 659,
            "resource_url": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/rjrEG7e4_Q23jOyzhyIBABETpMYfGlGfLptVfubrEQQ/rs:fit/g:sm/q:90/h:659/w:492/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/wbedxVfaf-CbE2aW7Dz4TlvEWEveGtshjS7ban6QD0g/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTE2MDExMTQxODUt/NzQzNi5qcGVn.jpeg",
            "width": 492
          },
          {
            "height": 405,
            "resource_url": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/k0tByykxXbEOMOyRHXluNbDsAtfaOA9BJfC7fvfDpKk/rs:fit/g:sm/q:90/h:405/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/fCzgRNnwO3_KQlnQEBONv-OwctplCopcFct0Y9FIgjM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyODIxMTg5OTEu/anBlZw.jpeg",
            "width": 600
          }
        ],
        "members": [
          {
            "active": false,
            "id": 23446,
            "name": "Alexander O'Neal",
            "resource_url": "https://api.discogs.com/artists/23446",
            "thumbnail_url": "https://i.discogs.com/4kLfDujJ2cPtQSpPYKLYmbdcjh-H8lWOZ1Jr-TaQPVU/rs:fit/g:sm/q:40/h:472/w:533/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzNDQ2/LTE1MTIyMTYzNzYt/NjYzNy5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 37806,
            "name": "Jesse Johnson",
            "resource_url": "https://api.discogs.com/artists/37806",
            "thumbnail_url": "https://i.discogs.com/faB_cvw7LFBwDjzTbUfC0NKvU_kKQZZs9rObtEbUb5U/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3ODA2/LTE1ODYxMDQ1Nzkt/NjI4OS5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 55449,
            "name": "Terry Lewis",
            "resource_url": "https://api.discogs.com/artists/55449",
            "thumbnail_url": "https://i.discogs.com/qlM6fd5QPJgpFyKSKX0SgNRxH4iC61RoT3ja1fP9hB8/rs:fit/g:sm/q:40/h:300/w:265/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU1NDQ5/LTEzMjc2MDYwOTEu/anBlZw.jpeg"
          },
          {
            "active": true,
            "id": 100600,
            "name": "Monte Moir",
            "resource_url": "https://api.discogs.com/artists/100600",
            "thumbnail_url": "https://i.discogs.com/oLscQsJpR_NYyQHc5QhlOu_x6V2RfbDsoqvYmudC3Yg/rs:fit/g:sm/q:40/h:408/w:530/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwMDYw/MC0xMjU0NTIyMzA3/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 152882,
            "name": "Morris Day",
            "resource_url": "https://api.discogs.com/artists/152882",
            "thumbnail_url": "https://i.discogs.com/kiNgrSSlXNZPkVwc_HnbtzgON42EvOlQqv8SksOABF0/rs:fit/g:sm/q:40/h:763/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1Mjg4/Mi0xNjA2OTUzMzk3/LTgwMTAuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 241356,
            "name": "James Harris III",
            "resource_url": "https://api.discogs.com/artists/241356",
            "thumbnail_url": "https://i.discogs.com/M_DMStNqES-lQKwZmAbd11IBEzMra0zgiWBElbHUS-I/rs:fit/g:sm/q:40/h:378/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTM1/Ni0xNjg0Mjg5Njcz/LTQ0NzEuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 242702,
            "name": "Paul Peterson",
            "resource_url": "https://api.discogs.com/artists/242702",
            "thumbnail_url": "https://i.discogs.com/o7x1JSRudabRMRJ3ksKjxqrwZevD2ibfVhygQRimFCA/rs:fit/g:sm/q:40/h:376/w:565/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0Mjcw/Mi0xMzU2ODY2MjQz/LTYxMDEuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 354129,
            "name": "Jerome Benton",
            "resource_url": "https://api.discogs.com/artists/354129",
            "thumbnail_url": "https://i.discogs.com/6Yd4Np57BGtIBlFZzNpLfrpfX_K5eaZA4tWyglgiG7U/rs:fit/g:sm/q:40/h:410/w:490/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM1NDEy/OS0xMjgyMTE4ODQ0/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 409502,
            "name": "Mark Cardenas",
            "resource_url": "https://api.discogs.com/artists/409502",
            "thumbnail_url": "https://i.discogs.com/FBet2P-UspvlMUtWThsRhslmGSCRu48c22AR09xc8BE/rs:fit/g:sm/q:40/h:400/w:347/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwOTUw/Mi0xMTU5MDU3MjQz/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 443060,
            "name": "Torrell Ruffin",
            "resource_url": "https://api.discogs.com/artists/443060",
            "thumbnail_url": "https://i.discogs.com/CQVSt0uTUTWQ_yRRxr6UtyQ00zET65FezgYisHYJ6-8/rs:fit/g:sm/q:40/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0MzA2/MC0xNjE1NjEyMjAz/LTI2MjUuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 453969,
            "name": "Jerry Hubbard",
            "resource_url": "https://api.discogs.com/artists/453969",
            "thumbnail_url": "https://i.discogs.com/QVBQadR8HXGs1zMiervJ8heyL4_2YHocUa1B7N_l5eM/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ1Mzk2/OS0xNTUyNDcxMjc3/LTQ0OTUuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 638863,
            "name": "Garry Johnson (2)",
            "resource_url": "https://api.discogs.com/artists/638863",
            "thumbnail_url": "https://i.discogs.com/Ix-VtCVH6ZEf9_Vd7ba-M7pxWJH5_Il-0M_br69FllI/rs:fit/g:sm/q:40/h:255/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYzODg2/My0xNDU3ODEyNTYw/LTQ0NDMuanBlZw.jpeg"
          }
        ],
        "name": "The Time",
        "namevariations": [
          "Morris Day & The Time",
          "The Times",
          "Time",
          "ザ・タイム"
        ],
        "profile": "Born in Minneapolis, the group featured lead-singer [a152882], keyboardist [a55448] Harris, bassist and co-lead vocalist [a55449], keyboardist [a100600], guitarist [a37806], and drummer [a113965], all from two Twin Cities funk units, [a=Flyte Tyme] and \"Enterprise\". \r\n\r\nThe band's first Warner Bros. album, 1981's The Time, was created almost single-handedly by [a=Prince] (who wrote and played on tracks he produced under the early pseudonym [a160852]). \r\n\r\nBy 1982, the year of \"777-9311\", from '82 Warner Bros. album \"What Time Is It?\", the group had already established itself as one of the hottest bands working the live circuit. \r\n\r\nThe original members reunited in 1990 for the album \"Pandemonium\" on Paisley Park label and released the single \"Jerk Out\". Despite expectations, the reunion only brought moderate success.",
        "releases_url": "https://api.discogs.com/artists/32550/releases",
        "resource_url": "https://api.discogs.com/artists/32550",
        "uri": "https://www.discogs.com/artist/32550-The-Time",
        "urls": [
          "http://www.princevault.com/index.php?title=The_Time",
          "http://en.wikipedia.org/wiki/The_Time_(band)",
          "https://twitter.com/theoriginal7ven"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/32550",
      "thumb": "https://i.discogs.com/kgGrBIi0J1n0dzWlyik-OrZGB5jWv0fzDgTgcERrYoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNTUw/LTEyNTQ1MTkwMjIu/anBlZw.jpeg",
      "url": "https://www.discogs.com/artist/32550-The-Time",
      "urls": [
        "http://www.princevault.com/index.php?title=The_Time",
        "http://en.wikipedia.org/wiki/The_Time_(band)",
        "https://twitter.com/theoriginal7ven"
      ]
    },
    "lastfm": {
      "bio_content": "There are at least two bands called The Time\n \n1. The Time is a musical group that was formed in 1981. Featuring a funky sound merging pop with dance music, soul music, and more, they are prominent proteges of Prince and arguably his most successful side project. A version of the outfit called 'Morris Day and the Time' still tour to this day.\n\nThe band was assembled under a clause in Prince's contract with Warner Bros. that allowed him to recruit and produce other artists for the label. Inspired by the 1980 film 'The Idolmaker', a work about the life of music promoter and producer Bob Marucci (the svengali behind such 50s/60s teen idols as Fabian and Frankie Avalon), Prince decided to put together a pop-infused funk group that would serve as a pet project and an outlet for further hits and material in the vein of his own early albums. Prince had the intent to explore other musical genres and go for a more avant-garde ethos in his own career.\n\nBy 1981, he had built 'The Time' out of an existing Minneapolis funk unit called 'Flyte Tyme' (from the Donald Byrd song), which featured Jellybean Johnson on drums, Jimmy Jam and Monte Moir on keyboards, and Terry Lewis on bass. To this base, musicans Jesse Johnson (on guitar) and Morris Day (on lead vocals) came in. Day was a childhood friend of Prince and was drawn from another local band called 'Enterprise'. Prince had used an Enterprise song, titled \"Partyup\", on his 'Dirty Mind' album, and his selection of Day was essentially a reward; he had originally tapped Alexander O'Neal, yet another player in the Minneapolis funk scene, for the vocalist slot yet that had fallen through. \"Valet\" Jerome Benton also became a member of The Time, despite not playing an instrument. His main contributions are backing vocals and various on-stage antics.\n\nThe band went on to release four albums during the course of their main career, each being welcomed by man critics as a solid slice of jammy, rock-infused 80s funk. In contrast to the spiritually and ideologically charged nature of much of Prince's work at that time, The Time's albums seemed generally light and humorous in tone, though the first two of which were composed and arranged entirely by Prince. The band scored numerous hits over the years. These include \"The Bird\", \"Jungle Love\", \"777-9311\", \"Get It Up\", \"Gigolos Get Lonely Too\", and \"Cool\".\n\nStill, despite burning up the R&B charts in the early 80s, the group never approached true super-stardom. Nor did they develop a reputation for innovation or artistic brilliance in the manner of Prince, with tensions building between the desires of the band members to spread their wings and the heavy-handed control of their famous manager. In terms of raw talent, Prince's associates clearly had much to offer.\n\nIn 1983, musicians Jimmy Jam and Terry Lewis, who had begun writing songs and branching out into production work of their own (such as working with SOLAR to produce Klymaxx and with Tabu Records to produce the S.O.S. Band), got stranded in Atlanta by a blizzard and failed to make it to a concert in San Antonio, Texas. The two were fined and then fired. Whether their firing had that much to do with the incident per se or seemed inevitable due to their increasing independence has never been clear, but the musicians went on to successful production careers involving them with multiple soul and funk artists. Monte Moir took the opportunity to leave as well, and he would also work with Jam and Lewis. The three were replaced with Mark Cardenez, Paul Peterson (redubbed St. Paul), and Jerry Hubbard.\n\nThis new line-up were featured in Prince's Purple Rain film. The Time rode the wave of popularity created by the movie and hit singles \"Jungle Love\" and \"The Bird\" and were household names in 1984.\n\nIt was Day who left next after arguments with Prince, choosing to pursue a solo career in 1985 after a successful acting turn in Purple Rain. Soon thereafter, with Jesse Johnson also opting to go solo, the band disintegrated but several members (Benton, Johnson and Peterson) were reformed into a new short-lived project called The Family. Meanwhile, Jimmy Jam and Terry Lewis went on to become one of the most successful songwriting and production teams of the 80s and 90s.\n\nIn 1990, Benton and the original six members of the band reunited for the Graffiti Bridge movie and soundtrack, as well as a new album called Pandemonium. This spawned their highest selling single, \"Jerk Out\" and the album featured more input from the band than any other Time album. The reunion was short-lived, however - infighting within the band caused them to disband once again. Morris and Jerome have since remained a team, with both trying out some small acting roles over the next few years.\n\nSeveral members of The Time reunited in 1996, added a few new recruits and have remained together since. This version of the band can be seen in the Kevin Smith film Jay and Silent Bob Strike Back and tours frequently to this day. The band is usually billed as \"Morris Day and The Time\".\n\nA fifth Time album is rumored to have been completed in the late 90s, recorded with the new lineup but production and coordination with Prince has prevented its release. The title Old Dogs, New Tricks was the working title. A 2004 album attributed to Morris Day called It's About Time contains a few new tracks written and performed by Day and a number of live performances by The Time.\n\nIn 2011, the original version of the band reformed as a new entity, The Original 7ven, in order to release a new album. Issues with Prince stalled out the group's momentum, even though 'Condensate' and its single, \"#Trendin\", both received critical praise. This version of the band had disbanded totally by 2013, Morris Day resumed touring as \"Morris Day and The Time\".\n\nFrom late 2014 onward, the band shot back into international attention when genre-hopping British artist Mark Ronson used The Time's work as inspiration for his gigantic hit \"Uptown Funk\" (also known as \"Uptown Funk (Feat. Bruno Mars)\" due to Bruno Mars' involvement). After receiving the prestigious best British Single Award at the 2015 BRIT ceremony, Ronson directly thanked Morris Day and The Time alongside artists such as James Brown and others on air for trailblazing the \"Uptown Funk\" sound. In the past several months, a sort of 'halo effect' has allowed The Time to blast back into the mainstream and appear on programs such as 'Jimmy Kimmel Live'.\n\n2. The Time was a freakbeat band of the mid-1960s from Southampton, United Kingdom. They released just two rare 45s on Pye Records in 1966, the first and best known one being 'Take a Bit of Notice' b/w 'Every Now and Then'. Personnel: Kevin Scott (vocals), John Glenfield (guitar), Mike Dubiel (bass), Danny Barbour (drums). Frontman Kevin Scott's real name was Kevin Finn. He would move on to become the lead singer in Wishful Thinking and The New Seekers. <a href=\"https://www.last.fm/music/The+Time\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "There are at least two bands called The Time\n \n1. The Time is a musical group that was formed in 1981. Featuring a funky sound merging pop with dance music, soul music, and more, they are prominent proteges of Prince and arguably his most successful side project. A version of the outfit called 'Morris Day and the Time' still tour to this day.\n\nThe band was assembled under a clause in Prince's contract with Warner Bros. that allowed him to recruit and produce other artists for the label. <a href=\"https://www.last.fm/music/The+Time\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 160377,
      "mbid": "3bfa8f23-2dbb-43e2-b1da-3cfaa6c5ff9d",
      "name": "The Time",
      "playcount": 1076016,
      "similar_artists": [
        {
          "name": "Prince",
          "url": "https://www.last.fm/music/Prince"
        },
        {
          "name": "Sheila E.",
          "url": "https://www.last.fm/music/Sheila+E."
        },
        {
          "name": "Jesse Johnson",
          "url": "https://www.last.fm/music/Jesse+Johnson"
        },
        {
          "name": "Morris Day",
          "url": "https://www.last.fm/music/Morris+Day"
        },
        {
          "name": "Prince & The Revolution",
          "url": "https://www.last.fm/music/Prince+&+The+Revolution"
        }
      ],
      "tags": [
        "funk",
        "80s",
        "pop",
        "Minneapolis funk",
        "prince"
      ],
      "url": "https://www.last.fm/music/The+Time"
    },
    "spotify": {
      "followers": 493054,
      "genres": [
        "funk rock",
        "post-disco"
      ],
      "id": "1EgGVV9cmmlLEsFlunjmvv",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b273c093f4dd308ad9c41e20eee8",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e02c093f4dd308ad9c41e20eee8",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d00004851c093f4dd308ad9c41e20eee8",
          "width": 64
        }
      ],
      "name": "The Time",
      "popularity": 45,
      "url": "https://open.spotify.com/artist/1EgGVV9cmmlLEsFlunjmvv"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "Original 7ven",
      "biography_de": null,
      "biography_en": "The Time (now The Original 7ven) is an American funk and dance-pop ensemble formed in Minneapolis in 1981. They are close Prince associates and arguably the most successful artists who have worked with him.\n\nPrince and Formation\n\nThe band was assembled under a clause in Prince's contract with Warner Bros. that allowed him to recruit and produce other artists for the label. Inspired by the 1980 film The Idolmaker, Prince decided to put together a pop-funk group that would serve as an outlet for material in the vein of his own early albums, while he explored other genres and styles in his own career.\n\nBy 1981, he had built The Time out of an existing Minneapolis funk unit, Flyte Time (from the Donald Byrd song), which featured Jellybean Johnson on drums, Jimmy Jam and Monte Moir on keyboards, and Terry Lewis on bass. To this base were added Jesse Johnson on guitar and a lead singer and childhood friend named Morris Day, and Jerome Benton who was a promoter drawn from another local band called \"Enterprise\", who became Day's comic foil. Prince had used an Enterprise song, \"Partyup\", on his Dirty Mind album, and his selection of Day was essentially a reward; he had originally tapped Alexander O'Neal – yet another player in the Minneapolis Uptown funk scene – for the vocalist slot, but O'Neal wanted too much money, himself being quoted as saying, \"I basically didn't see no point in being a superstar with no money.\"\n\nSuccess\n\nThe band went on to release four albums (mostly performed by Prince + singer Morris Day alone) during the course of their main career, each a solid slice of jammy, rock-infused 1980s funk, generally light and humorous in tone, strongly influenced by Parliament, James Brown, Sly – and, of course, Prince. Although they scored numerous hits (including \"The Bird\", \"Jungle Love\", \"777-9311\", \"Get It Up\", \"Gigolos Get Lonely Too\", \"The Walk\" and \"Cool\", mostly on the R&B charts) during the early 1980s, they never approached superstardom. But as good as they were, they weren't allowed to play a note on their debut album. Prince recorded all the music himself, crediting the production to Jamie Starr and Morris Day, who at least was allowed to sing on the record, but was required to follow Prince's guide vocals note-for-note.\n\nA growing rivalry began to develop between the two groups as The Time toured with Prince and his band during his 1982 Controversy Tour. Frustrated with their lack of input on the albums bearing their name and at being underpaid, The Time would take to the stage with the purpose of showing up Prince, in much the same way that Prince and his band had undermined Rick James when they had toured as James' opening act (unlike what happened during Rick James' Light it Up tour, this time people didn't leave before the headliner, Prince, finished his set). The tension came to a head on the final night of the tour in Cincinnati during the Time's set when Prince and some of his band threw eggs at their supporting act from offstage. Things further escalated after The Time's performance when guitarist Jesse Johnson was handcuffed to a wall-mounted coat rack and further humiliated. Prince demanded no interruptions during his performance, but as soon as he left the stage, a food fight erupted. When the battle continued at the hotel, Prince made Morris Day pay for all damages, claiming that he had started the whole thing.\n\nDuring the 1982–83 1999/Triple Threat tour, The Time served as Vanity 6's backing band from behind a curtain, before playing their own hour-long set. They liked the arrangement because the band saw it as free money. As Terry Lewis put it; \"I'll play behind Vanity 6 for thirty minutes for $250. No problem. I was going to have to do the sound check, anyway.\" Jimmy Jam and Terry Lewis, who had begun writing songs and production work of their own (working with SOLAR to produce Klymaxx and with Tabu Records to produce the S.O.S. Band), were stranded in Atlanta by a blizzard and failed to make it to a Time concert in San Antonio, for which Jerome had to mime playing bass guitar on stage while Prince played Lewis' part off stage, and Lisa Coleman stood in for Jimmy Jam. Subsequently, the duo were fined and then fired, although Prince would state in a 1990 Rolling Stone's interview that \"I didn't fire Jimmy Jam and Terry Lewis. Morris asked me what I would do in his situation. Remember, it was his band.\" Whether their firing was due to the incident or to their increasing independence has never been clear. Monte Moir took the opportunity to leave as well, and would also work with Jam and Lewis. The three were replaced with Mark Cardenas and Paul Peterson on keyboards and Rocky Harris on bass. This new line up, except with Jerry Hubbard replacing Rocky Harris, were featured in Prince's Purple Rain film. The Time rode the wave of popularity created by the movie and hit singles \"Jungle Love\" and \"The Bird\" and were household names in 1984.\n\nFirst split\n\nIt was Day who left next after arguments with Prince, choosing to pursue a solo career in 1985 after a successful acting turn in Purple Rain. Soon thereafter, with Jesse Johnson also opting to go solo (taking other Time members Cardenas and Hubbard with him), the band disintegrated; the remaining members (Benton, Jellybean Johnson and Peterson) were reformed into a new short-lived project called The Family. Meanwhile, Jimmy Jam and Terry Lewis went on to become one of the most successful songwriting and production teams of the 1980s and 1990s.\n\nFirst reunion\n\nIn 1990, the original seven members of the band reunited for the Graffiti Bridge movie and soundtrack, as well as a new album, Pandemonium. The project was originally called Corporate World and was set to only feature Morris and Jerome, but Warner Bros. demanded that the original line-up be brought in if Prince wanted the company's backing for the movie. This spawned their highest selling single, \"Jerk Out\" and the album featured more input from the band than any other Time album. \"Nobody really needed to put The Time back together,\" said Lewis, \"but everybody wanted to. That makes it a great experience all round. We take the musicianship and the craft of what we do very seriously but, when the seven of us get together, it's naturally a party, fun kinda situation. We carry that from the record on to the stage.\"\n\nThe reunion was short-lived, however – infighting within the band caused them to disband once again. Morris and Jerome have since remained a team, with both trying out some small acting roles over the next few years.\n\nIn 1995 Morris met a young 22 year old up and coming LA, California music producer through manager David Lombard (Toni Tone Tony/Envoge) named Robert GI' Grissett and the two started producing songs together for a new Morris Day album with the lead single to be a song entitled 'My Baby Boo'! Rumor has it that it was to be released through Scotti Bros. Records, but the deal fell through. In a 2003 LA Weekly Interview with GI' now known as Rob Gi'hana, Rob was quoted as saying, \"man Morris and I recorded a lot of songs and 'work in progress' ideas, and I truly believe at least 4 of them can be hits now or even in the future if they ever get to see the light of day I pray! We became really good friends at the time and it was an experience I will never forget and we still Cool. I believe we will release those songs when the time is right.\" After Rob gives us a sneak listen to a couple of the tracks (which are in my opinion some of the best solo Morris Day jams I've EVER heard not produced by Prince or Jimmy Jam & Terry Lewis) starts to get excited after we ask him what the titles of some of the songs were a \"My favorites are called Sexy Lady & My Baby Boo. Ohhh and the one that should be a classic Morris ala The Bird, The Oak Tree, is a song we did called Drop (ya DRawz)!! Man.. funky classic morris day and he is in classic YeSSSS mode! We acted a fool in the studio that nite man!!!!!... its got to come out!!\n\nSeveral members of The Time reunited in 1995, added a few new recruits, Torri Ruffin on guitar, Chance Howard on Keyboards, Robert GI' Grissett Jr on third Keyboards and Freeze on Bass Guitar. This version of the band can be seen in the Kevin Smith film Jay and Silent Bob Strike Back and tours frequently to this day. The band is usually billed as \"Morris Day and The Time\".\n\nA fifth Time album is rumoured to have been completed in the late 1990s, recorded with the new lineup but production and coordination with Prince has prevented its release. The title Old Dogs, New Tricks was the working title. A 2004 album attributed to Morris Day called It's About Time contains a few new tracks written and performed by Day and a number of live performances by The Time featuring the new members along with Jellybean, Jerome, Monte & Morris.\n\nSecond reunion and The Original 7ven\n\nThe Time reunited at The 50th Grammy Awards on February 10, 2008, performing a medley that included Rihanna and featured \"Jungle Love\".\n\nIn June and July 2008, all of the original members of The Time (Morris Day, Jimmy Jam, Terry Lewis, Jesse Johnson, Jerome Benton, Jellybean Johnson, and Monte Moir) reunited once again for a series of shows at the Flamingo Hotel and Casino in Las Vegas.\n\nA recent interview as of January 2009 mentions that guitarist Jesse Johnson states he is working with The Time on their upcoming album. The Time appeared at The Fox Theater, in Detroit, Michigan on June 11, 2010, with the original lineup to a packed house. Two days later during what Jimmy Jam dubbed \"The Stingy Tour\" on June 13, 2010 the \"magnificent 7\" played a hometown reunion concert in Minneapolis, MN, and, during that concert, announced on stage that a new album was \"90% complete,\" which confirmed information provided in a Billboard profile published a week earlier.\n\nIn September 2011, the band announced a name change to The Original 7ven and a new album Condensate which was released October 18, 2011 with the single \"#Trendin\" released September 20.\n\nAs for why the band decided to call themselves by a new name, Jimmy Jam said that “the decision was made at that point that we could either continue to, shall we say, negotiate or argue or plead or whatever. We decided to go the route of let’s not hold things up because of the name. Let’s embrace the opportunity to move forward in a new era, with a new outlook, with a new album and that’s what we did. We think the name reflects exactly who we are. We are the Original 7even and that basically, for me, covers it.”\n\nOn October 27, 2011, The Original 7ven appeared on The Tonight Show with Jay Leno.\n\nOn November 17, 2011, The Original 7ven opened the Soul Train Music Awards in Atlanta, GA, playing a medley of greatest hits and new single #TRENDIN. The show was broadcast on November 27.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1981",
      "country": "Minneapolis, USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1981",
      "gender": "Male",
      "genre": "Funk",
      "id": "122077",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/qwtsww1440349390.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/wxvwuu1440349423.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xstpuq1454864151.jpg",
          "width": 1920
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/time-the-5ef64a823be4a.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "8",
      "mood": null,
      "music_videos": null,
      "musicbrainz_id": "3bfa8f23-2dbb-43e2-b1da-3cfaa6c5ff9d",
      "name": "The Time",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "spotify_id": "1EgGVV9cmmlLEsFlunjmvv",
  "spotify_url": "https://open.spotify.com/artist/1EgGVV9cmmlLEsFlunjmvv",
  "updated_at": "2025-07-08T20:38:05.439593",
  "wikipedia_url": null
}