{
  "apple_music_id": "1479227321",
  "apple_music_url": "https://music.apple.com/gb/album/van-weezer/1479227321",
  "artists": [
    {
      "apple_music_id": "115234",
      "biography": "Weezer are an American alternative rock band. Formed in 1992, they have released 15 full length albums, 1 cover album, six EPs, and a DVD. Their latest album, titled 'Van Weezer', came out on May 7th, 2021, Although, they released 4 EPs in 2022, known as SZNZ. They've sold over ten million records in the United States to date, and 35 million worldwide. They play music influenced by alternative bands and power pop artists among others.\n\nWeezer started in Los Angeles, California when Rivers Cuomo joined with Patrick Wilson, Matt Sharp, Jason Cropper (who was later replaced by Brian Bell), and their friend  Karl Koch. Five weeks after forming, they had their first gig, opening for Dogstar at Raji's Bar and Ribshack on Hollywood Boulevard. Weezer began playing clubs to small audiences around L.A. and recording homemade demos. The group soon received attention from various A&R reps, and the guys were signed on June 26, 1993 by Todd Sullivan, an A&R rep from Geffen Records. The band became a part of the DGC label (which later turned into Interscope).\n\n\"The Blue Album\"  (1993-1994)\n\nThe self-titled debut, 'Weezer', commonly referred to as 'The Blue Album', came out on May 10, 1994. It picked up considerable acclaim. Tracks \"Undone (The Sweater Song)\" (also known as \"Undone - The Sweater Song\"), \"Buddy Holly\", and \"Say It Ain't So” were released as singles. The album was produced by former The Cars frontman Ric Ocasek. During the recording of the Blue Album, Jason Cropper left the band to take care of his future wife, who was pregnant with their first child. Jason was replaced by Brian Bell, a then bassist from a band called Carnival Art.\n\nThe first single, \"Undone - The Sweater Song\", garnered attention given that Spike Jonze directed the music video for the track. In a single, unbroken take, that video featured Weezer performing the song on a sound stage with various amusing studio antics, including a pack of dogs swarming the set. Jonze also later directed the band's second video, which was made for the single \"Buddy Holly\". Named after the famous 50s rock star, the \"Buddy Holly\" music video featured footage of the television sitcom Happy Days spliced with the band performing in a remade \"Arnold's Diner\", a setting from the series. The video had heavy rotation on MTV. It went on to win Jonze and the band four MTV Video Music Awards (including Breakthrough Video and Best Alternative Music Video) and two Billboard Music Video Awards. This video was also included as a bonus on the Microsoft Windows 95 CD. The success of the video arguably served as the key for pushing the band into the mainstream rock spotlight.\n\nThe video for Weezer's third single, \"Say It Ain't So\", was directed by Sophie Muller. It featured the bandmates playing hacky-sack and performing in the band's original rehearsal space in California. A photo of what the band calls the \"Garage\" is featured on the inside cover of the album.\n\n'The Blue Album' is currently certified three times platinum, making it Weezer's all-time best seller and one of the most popular rock albums of the early 90s. It was re-released and repackaged in 2004 as a \"Deluxe Edition\". That version of the album included a second disc of B-sides along with other previously unreleased rarities.\n\nSongs From The Black Hole & Pinkerton (1995-1997)\n\nIn late December 1994, Weezer took a break from touring for the Christmas holidays. Cuomo traveled back east to his home state of Connecticut. Using an eight-track recorder, he began piecing together demo material for Weezer's next album. Cuomo's original concept for Weezer's sophomore effort was to be a space-themed rock opera, with him mulling over the title 'Songs from the Black Hole'.\n\nThe album was intended to feature songs that flowed together seamlessly, and it was planned to end with a special coda that briefly revisited the major musical elements of the piece (something reminiscent of progressive rock works from the 70s). The band began demoing and working on Cuomo's concept through intermittent recording sessions in the spring and summer of 1995. Ultimately, the 'Songs from the Black Hole' album concept was dropped. The album that actually came out would instead feature some old tunes made from before their first album (which had briefly been incorporated into the space-opera) as well as some new ones written while Cuomo was at Harvard.\n\nAfter the multi-platinum success of their debut album, Weezer's sophomore album was finally released on September 24, 1996. Titled 'Pinkerton', the work peaked at #19 in the U.S. upon its release. It didn't sell as many copies as its predecessor, probably due to its darker, more abrasive nature. Pinkerton was labeled \"one of the worst albums of 1996\" by a Rolling Stone reader poll. Eventually, the album grew into a cult classic, and is viewed by some fans as Weezer's greatest album. In fact, in 2004, the magazine changed their rating to a 5-star rating and inducted it into The Rolling Stone Hall Of Fame.\n\nThree singles were taken from the album: \"El Scorcho\", \"The Good Life\", and \"Pink Triangle\". The video for \"El Scorcho\" featured the band inside a darkened room, sitting in a circle, that would be lit differently throughout parts of the song; it was directed by Mark Romanek. The video for \"The Good Life\" was directed by the team of Jonathan Dayton and Valerie Faris (though no known video was made for \"Pink Triangle\"). However, the singles did not receive as much airtime as the singles from their debut album.\n\nThe title of the album comes from the character Lieutenant Pinkerton in Giacomo Puccini's opera Madame Butterfly. The entire album is heavily influenced by the opera's story line. Madame Butterfly is mentioned under her real name, Cio-Cio San, in \"El Scorcho.\" The song \"Butterfly\" is written from Pinkerton's point of view at the end of the opera.\n\nThe album's title was the source of a legal challenge. Pinkerton Securities of Encino, Calif., filed a temporary restraining order against the band and its Geffen record label for copyright infringement two days before the album was to be released on September 24, 1996. A judge ruled against the security company and the album was finally released.\n\nWeezer completed their touring for Pinkerton in the summer of 1997. The members of the band took a break, with drummer Patrick Wilson returning to his home in Portland, Oregon to work on his side project, The Special Goodness, Matt Sharp left to complete the follow-up album for his group The Rentals, and Brian Bell went to work on his group, Space Twins.\n\nRivers Cuomo returned to Boston, Massachusetts, but dropped out of Harvard to focus on songwriting. He eventually went into seclusion. He painted his walls black, disconnected his phone, and didn't communicate with anyone. Later, he formed a solo group, The Rivers Cuomo Band. Cuomo used the group to try out unreleased material, including possible new songs for the next Weezer album. The band played their first show at T.T. the Bear's on October 8, 1997. Future Weezer bassist Mikey Welsh was part of the solo band's lineup. The Boston songs were later abandoned and not used on the next Weezer album, but live recordings of the Boston shows are openly traded on the internet. In February of 1998, Rivers left Boston and Harvard academia behind and returned to Los Angeles.\n\nPat Wilson and Brian Bell joined Cuomo in L.A. to start work on the next album. Matt Sharp did not rejoin the band and officially left the group in April of 1998. The group decided on Mikey Welsh as Sharp's replacement. Weezer continued rehearsal and cut demos until the fall of 1998. Frustration and creative disagreements led to a decline in rehearsals, and in late fall of 1998, drummer Pat Wilson left for his home in Portland pending renewed productivity from Cuomo.\n\nThe band would not reunite until April of 2000, when the Fuji Festival in Japan offered Weezer a high-paying gig to play in August 2000. The festival served as a catalyst for Weezer's productivity, and from April to May, 2000, the band rehearsed and demoed new songs in Los Angeles. The band returned to live shows in June 2000, but without the Weezer name. Instead the shows featured the group's first use of the pseudonym Goat Punishment.\n\nOn June 23, 2000, the band, now back under the Weezer name, joined the Warped Tour for eight planned dates. Weezer was received well at the festival, leading the band to book more tour dates for the summer.\n\nSS2K - The Summer Sessions (2000)\n\nIn the summer of 2000, Weezer (now consisting of Rivers Cuomo, Mikey Welsh, Pat Wilson, and Brian Bell) went on tour. Weezer's setlist consisted of 14 new songs that fans have labeled the Summer Songs of 2000 (commonly abbreviated, SS2K). When 13 of these songs did not appear on Weezer's next album, fans of the songs started a petition demanding the release of studio demos. Eventually, mp3s were made available on the band's official website for download. Three SS2K songs, \"Hash Pipe\", \"Dope Nose\" and \"Slob,\" have appeared on studio albums (\"Hash Pipe\" on the Green Album and \"Dope Nose\" and \"Slob\" appearing on Maladroit).\n\nGreen Album & Maladroit (2001-2003)\n\nEventually, the band went back into the studio to produce a third album. Weezer (2001) chose to repeat the self-titled name of their first release. This album quickly became known as The Green Album due to its distinctive bright green coloring. Shortly after the release of The Green Album, Weezer went on another American tour. They attracted a new generation of fans thanks to heavy MTV rotation for the videos of their hit singles \"Hash Pipe\" and \"Island in the Sun.\"\n\nThe video for \"Hash Pipe,\" directed by Marcos Siega featured sumo wrestlers and was nominated for Best Rock Video at the 2001 MTV Video Music Awards, but lost out to Limp Bizkit's \"Rollin.\" Two videos were recorded for \"Island in the Sun.\" Marcos Siega directed the first, which focused on a Mexican wedding, and Spike Jonze directed the second, which involved Weezer with animals in a wildlife reserve. Their video for \"Photograph\" was shot and put together by Weezer friend and unofficial \"5th member\" Karl Koch.\n\nAs reported on August 16th, 2001, by MTV, bassist Mikey Welsh was checked into a psychiatric hospital. His whereabouts were previously unknown, as he mysteriously went missing before their second filming of the \"Island in the Sun\" music video, featuring the band with various animals. Weezer was prompted to find a temporary replacement for Welsh. Through a mutual friend, Cuomo received Scott Shriner's number and asked if he was interested to fill in for Welsh. Shriner, at first believing it was a prank phone call, accepted.\n\nMuch to the ire of their recording label, Weezer decided to forgo the industry-preferred waiting period of 2 to 3 years between albums and began recording demos for their fourth album. The band took an experimental approach for the recording process by allowing fans to download the demos from their official website in return for feedback. After the release of the album, the band subsequently stated that the process was somewhat of a failure, as the fans did not supply them with cohesive constructive advice. Only the song \"Slob\" was included on the album due to general fan advice.\n\nThe fourth album, Maladroit, was released in 2002 with Scott Shriner replacing Mikey Welsh on the bass. The album served as a harder-edged version of their trademark catchy pop-influenced music. Although met with generally positive critical reviews (including making many \"Best of '02\" lists), its sales were not as strong as The Green Album and remains their worst-selling album to date.\n\nTwo singles were released from the album. The \"Dope Nose\" music video featured a Japanese motorcycle gang, and was put into regular rotation. The music video for \"Keep Fishin'\" combined Weezer with The Muppets, and had heavy rotation on MTV. Both videos were directed by Marcos Siega.\n\nAs soon as Maladroit had wrapped up, the band immediately began work on their fifth album, recording numerous demos between tours for Maladroit (often recording as many as 24 songs in a day). These songs were eventually scrapped, and Weezer took a break after the release of two albums in quick succession.\n\nMake Believe (2003-2005)\n\nIn March of 2004, Weezer released their first DVD. Titled Video Capture Device, the DVD contains all of their then-current music videos. It also included live concerts and homemade movies. The DVD was certified \"gold\" on November 8, 2004.\n\nFrom December 2003 to the summer and early fall of 2004, the members of Weezer recorded a large amount of material intended for a new album to be released in the spring of 2005 with producer Rick Rubin. The band's early recording efforts became available to the public through the band's website. The demos, entitled the Album Five Demos (or album 4.5), were a big hit with fans but only one song, \"Hold Me\", would be included on the finished album. That album, entitled Make Believe, was released on May 10, 2005. The album was very well received by the public. However, long-time Weezer fans often consider it as a decline from their earlier albums, and has received mixed reviews.\n\nThe album's first single, \"Beverly Hills,\" became a hit in the U.S. and worldwide, staying on the charts for several months after its release. The video for \"Beverly Hills\", directed by Marcos Siega, featured the band and a select choice of fans interacting with Playboy Bunnies and Hugh Hefner at the Playboy Mansion. It became the first Weezer song to hit #1 on the Billboard Modern Rock chart. The song was nominated for Best Rock Song at the 48th Annual Grammy Awards, the first ever Grammy nomination for the band. The video for the song was also nominated for Best Rock Video at the 2005 MTV Video Music Awards.\n\nDuring the \"Make Believe\" tour of 2005, Cuomo allowed other members of the band to step into the spotlight of certain songs:\n\n    * Brian Bell: \"Getchoo\" and \"Why Bother?\" (from Pinkerton), \"Smile\" (from \"The Green Album\"), and \"Keep Fishin'\" (from Maladroit)\n    * Scott Shriner: \"Fall Together\", and \"Dope Nose\", and \"In the Garage\" (from \"The Blue Album\")\n    * Patrick Wilson: \"Photograph\" (from \"The Green Album\"), \"Song 2\" (Blur cover, whilst playing lead guitar)\n\nIn late August 2005, Weezer performed with the rock band The Pixies, which was one of Rivers' influences, at Summerfest and other dates. From September 8 to October 28, 2005, Weezer set out on a tour with the Foo Fighters, which, to many, was simply called Foozer. The Foozer tour was awarded \"Most Creative Tour Package\" at The 17th Annual Concert Industry Awards.\n\nOn December 13th, 2005, Winter Weezerland EP was released on iTunes. The EP was essentially a re-release of the 2000 Weezer christmas CD which featured \"The Christmas Song\" and \"Christmas Celebration\". Also, in late 2005 the band released the second single off Make Believe, called \"We Are All on Drugs\" (for family-oriented purposes, some releases of the song were renamed \"We Are All in Love\"), and the music video was directed by Justin Francis.\n\nIn early 2006, it was announced that Make Believe was certified platinum, and \"Beverly Hills\" was the second most popular download on iTunes for 2005. Also in early 2006, Make Believe's third single, \"Perfect Situation\", spent four weeks in a row at the #1 spot on the Billboard Modern Rock chart, a personal record for Weezer. The Perfect Situation video starred Elisha Cuthbert and was directed by Marc Webb. The only other Weezer track to hit #1 was \"Beverly Hills,\" for one week. \"This is Such a Pity\" is the band's fourth single from the album, but no music video was made for its release.\n\nRivers Cuomo announced a new song called \"Piece of the Pie\" while onstage during the band's October 7th, 2005 show in Detroit (but did not perform it). Cuomo has mentioned other song ideas recently, dropping titles and ideas such as \"East Coast or West Coast,\" \"Pig\" and new songs with lyrics he described as \"bloggy\".\n\nRivers has commented on his myspace blog that his recent comments to mtv.com were 'misquoted' and said that what he meant \"was that the soccer song, \"Our Time will Come\", certainly won't be on a Weezer album.\" and said \"The rest of the songs, though, are definite contenders for a Weezer record.\" A strong hint that the band are in fact only on a break and that a sixth album is on the card.\n\nIn late 2006, Brian Bell began work on a new project called The Relationship which fans can follow on the band's myspace page. Pat Wilson told Keifer Wells and Martin Michalek in a radio interview for Andover High School that he and Scott Shriner had been creating songs together and are trying to get Rivers to sing for when the band has jam sessions. Pat has also been creating a few Special Goodness songs, but said little more on the subject. \n\nThe Red Album (2008)\n\nLead singer Rivers Cuomo released a demo-compilation album entitled Alone: The Home Recordings of Rivers Cuomo on December 18, 2007. The album contains demos of Cuomo's that span from 1992 to 2007, including songs from Weezer's abandoned second album, Songs from the Black Hole. Also included in Alone is a song intended for Weezer's upcoming 6th studio album, entitled \"This is the Way\". The booklet of Alone tells of the band wanting the song for the album, but ultimately choosing \"an epic, 6-minute, symphonic type of art song\" entitled \"Daydreamer\" instead.\n\nWeezer's \"Weezer\" (also referred to as \"The Red Album\") was released in June 2008. Rick Rubin produced the album and Rich Costey mixed it. The record is being described as \"experimental\", and according to Cuomo, includes longer and non-traditional songs, TR-808 drum machines, synthesizers, Southern rap, baroque counterpoint, and band members other than Cuomo writing, singing, and switching instruments. Pat Wilson said that the album cost about a million dollars to make, contrasting it with the $150,000 budget of \"The Blue Album\". The album's singles were produced by Jacknife Lee. Its lead single, \"Pork and Beans\", topped the Billboard Modern Rock Tracks charts for 11 weeks, and its music video won a Grammy for Best Short Form Music Video. The album's second single, \"Troublemaker\", debuted at #39 on the Billboard Hot Modern Rock Tracks chart and peaked at #2. In October 2008, the group announced that the third single would be \"The Greatest Man That Ever Lived (Variations on a Shaker Hymn)\".\n\nRaditude (2009)\n\nIn 2009, the band announced their next album, \"Raditude\", would be released on November 3, 2009, where it debuted as the seventh best-selling album of the week on the Billboard 200 chart. The band scheduled tour dates in December 2009 extending into early 2010 to coincide with the new album's release. On December 6, 2009, Weezer frontman Rivers Cuomo was injured when his tour bus crashed in upstate New York due to black ice. Cuomo suffered three broken ribs, and his assistant broke two ribs. His wife, baby daughter, and their nanny were also on the bus; however, they escaped injury. Weezer cancelled tour dates the following day. The band resumed touring on January 20, 2010.\n\nHurley (2010)\n\nIn December 2009, it was revealed that the band was no longer with Geffen Records. The band stated that they would still release new material, but they are unsure of the means, whether it be self-released, released online, or getting signed by another label. Eventually, the band was signed to the independent label Epitaph.\n\nThe album \"Hurley\" was released in September 2010 through Epitaph Records. The name comes from the character Hugo \"Hurley\" Reyes from the television show \"Lost\". Jorge Garcia, the actor who portrayed Hurley, stated that being featured on the album cover is \"one of the biggest honors of [his] career.\" Weezer used internet streaming service YouTube as a way to promote the album.\n\nOn November 2, 2010, Weezer released another studio album called \"Death to False Metal\". This album was composed of newly re-recorded versions of unused recordings spanning the band's career.\n\nOn October 9, 2011, the band announced on their website that former bassist Mikey Welsh had died.\n\nEcce Homo & Everything Will Be Alright in The End(2011–2015)\n\nRivers Cuomo first mentioned a follow-up to Weezer's eighth album, Hurley, shortly after that album's release. Cuomo told The A.V. Club, \"I was talking to the producer and he was saying 'These songs sound totally different from Hurley. Hurley was kind of dark, and the new songs sound like you’re 16, riding your bicycle to get a Slurpee.' As a writer, I had no idea—I wasn’t shooting for anything different. That’s just what happened to come up.\" It is unknown what happened to these songs, as he was not referring to the songs that were written in-between the years of 2011 and 2013.\n\nIn October of 2013, Cuomo confided with fans that Weezer would begin working with producer Ric Ocasek in January, and as said, in January 2014, the band started to record its ninth studio album with producer Ric Ocasek, who previously worked with the band on its first two self-titled albums. A clip of a new song was posted on the band's official YouTube account on March 19, 2014, which confirmed previous rumors of the band being in the studio. \n\nOn June 12, 2014, it was revealed that the album title would be Everything Will Be Alright in the End. It was released on October 7, 2014 to generally favorable reviews, becoming the band's best-reviewed release since Pinkerton.\n\nThe White Album (2016)\n\nAfter the disappointing sales of the previous album, Everything Will Be Alright in the End, the band left Republic Records and joined Crush Music. A new producer was signed, Jake Sinclair, whom the band met during the recording for Raditude, A self-confessed Weezer fan. When work began for the album, Rivers showed his dropbox account to Jake, which had almost 250 songs and demos. Only one song would make the cut: \"California Kids\", which set the tone and beach theme of the album.\n\nOn October 20, 2015, \"Thank God for Girls\" was played live at a small iHeart Radio show in Burbank, California. On October 26, 2015, the band released a new single, \"Thank God for Girls\", through Apple Music and to radio the same day. The following week, the band released a second single, \"Do You Wanna Get High?\". Cuomo claimed in an interview with Zane Lowe, that the band was not working on a new album. In January of 2016, weezer.com became a blank white screen and the band's Facebook and Twitter pages posted blank white pictures. A video was posted to the band's youtube channel that was a white screen with static in the background. On January 14, 2016, Weezer released a third single, \"King of the World\", and announced that the band's fourth self-titled album, also known as the White Album.\n\nProducer Jake Sinclair revealed himself on allthingsweezer.com as user \"wannabeezer\" and began to share insight on the new album. As a weezer fan himself, his goal was to make a weezer album that would change the third album on people's rankings. Two more songs were released before the album: \"L.A. Girlz\" on February 16th, and \"California Kids\" which leaked on Apple Music for a short amount of time. The latter was a remake of the 2014 Scott & Rivers song \"California.\" The song was officially released on March 9. Bandmate Brian Bell cowrote the former, \"L.A. Girlz\", and \"Endless Bummer\". Much of the album's lyrics come from Cuomo's stream of consciousness diary as well as his experiences living in California. \n\nThe White Album, upon release on April 1, 2016, continued the critical success of the band's previous release. In support of the album, the band performed on the Weezer & Panic! at the Disco Summer Tour 2016 with Panic! at the Disco in 2016. The band later signed to Atlantic Records as part of a joint venture between Warner Music Group and Crush Management. The album was nominated for the Best Rock Album Grammy on December 5, 2016.\n\nOn October 5th, a digital deluxe version was announced to release on the 7th. It contained previously released \"I Love the USA\" as well as the previously announced \"Fake Smiles and Nervous Laughter\" which later received a vinyl release in December. It also includes two new tracks, \"Friend of a Friend\" and a new remix of \"Jacked Up\" featuring Fitz of Fitz and the Tantrums & Nadya of Pussy Riot.\n\nPacific Daydream (2017–2018)\n\nSoon after the release of the White Album, Cuomo discussed plans for Weezer's next album, provisionally titled the Black Album: \"It’s going to maybe be like Beach Boys gone bad [...] I’m thinking of swearing, which is something I’ve never done in songs.” Cuomo also said the album would tackle “more mature topics” and be “less summer day and more winter night”. He suggested the band could return to the recording studio as soon as October 2016. Weezer delayed recording after Cuomo felt his new material was more \"like reveries from a beach at the end of the world [... as if] the Beach Boys and the Clash fell in love by the ocean and had one hell of an amazing baby\".\n\nOn March 16, 2017, the band released a new song titled \"Feels Like Summer\", later revealed to be the lead single of an upcoming album. The song drew a mixed reaction from fans but became their biggest hit on Alternative radio in a decade. \"Feels Like Summer\" was heard on The Weather Channel's local forecast segments on July 4, 2017, and again on August 18, 2017. It was also heard on some of the network's promos that summer. \n\nOn August 16, the band revealed the album title, Pacific Daydream, and scheduled for October 27. The next day, the a promotional single from the album, \"Mexican Fender\", was released. The following months, \"Beach Boys\" was released, and the month after, they released \"Weekend Woman\" to positive reception.\n\nAfrica, The Teal Album, & The Black Album (2018 - 2019)\n\nOn May 29, 2018 Weezer released a cover of Toto's song \"Africa\" which reached number one on the Billboard Alternative Songs chart in August 2018, becoming the band's first number-one single since \"Pork and Beans\" in 2008. On August 10, Toto responded by releasing a cover of Weezer's single \"Hash Pipe\"\n\nOn October 11, 2018, Weezer released \"Can't Knock the Hustle\", the lead single from their upcoming self-titled album, also known as the \"Black Album\". On November 21, they released the second single, \"Zombie Bastards\", and announced the \"Black Album\", produced by Dave Sitek and scheduled for March 1, 2019.\n\nOn January 23rd, 2019 Weezer made a surprise release with a self-titled covers album dubbed \"The Teal Album\".\n\nDuring an interview with Zane Lowe on the DJ's Beats 1 show the day \"The Teal Album\" was released, Weezer revealed they were already mostly done recording their follow-up to the then-unreleased \"Black Album\".\n\nOK Human & Van Weezer (2021)\n\nRivers Cuomo has credited producer Jake Sinclair with planting \"the seed of an idea\" for OK Human in 2017. \"Just you and a piano, and an orchestra, and it's gonna be super-personal, quirky songs that only you could write, not worrying about commercial potential at all.\n\nRivers Cuomo first publicly mentioned the album title Van Weezer while discussing the band's progress on the album OK Human in an interview with Los Angeles Times in February of 2019, indicating that the album was inspired by Van Halen. When asked about Weezer's two upcoming albums in an interview with Billboard published March 1st, Cuomo said: \"One was mostly done before the Black Album. It’s currently called OK Human and was produced by Jake Sinclair, who did our White Album. The other one, I’m depressed thinking about it. I have this huge emotional block. It’s called Van Weezer, and it’s basically a super-rock album. Like the Blue Album, but more guitar riffs.\" Brian Bell acknowledged the album's existence in various interviews throughout 2019. In an August interview with Spanish blog Binaural, Bell suggested that Crush Management would prefer to release Van Weezer before OK Human.\n\nIn August of 2019, a casting call was posted to backstage.com looking for extras to play \"Weezer party goers\" in an upcoming music video. On August 23, musician and producer Tim Pagnotta posted a story to his Instagram page that read \"Jammin’ new @Weezer I worked on :)\". On September 6, 2019, the song \"The End of the Game\" leaked onto the American television music service Music Choice. The song's music video was released alongside the announcement of the album Van Weezer on September 10, 2019.\n\nOn April 9, 2020, it was revealed in a Zoom chat with fans that a single for the album was originally scheduled to be released either that day, or the next, but had been delayed (likely due to the COVID-19 pandemic). Karl Koch posted on the Weezer Fan Club Facebook group asking for footage of people involved in the outbreak, and that a deadline would be on April 15, leading fans to speculate that the footage would be used for an upcoming video. The next day, on April 10, Cuomo mentioned that there would be a Homie song on Van Weezer, as well as a bonus track originally written around 1992. It was also revealed that all the album's tracks were fully mastered, with the only track ordering left to be determined. On April 14, Cuomo sang a small segment of the song, \"Thrown It All Away\", during a webinar with fans hosted by Cuomo on the video platform Zoom, for which co-writer Jason Cropper was present.On September 2, Cuomo confirmed via a Riverpedia entry that the 1992 song \"Thrown It All Away\" had recently been recorded with the band. The article was later updated on September 6 to specify that it would be on the album. On September 3, Cuomo confirmed via another Riverpedia entry that \"Sheila Can Do It\" was the aforementioned Homie song appearing on Van Weezer. On April 17, during a Zoom chat with fans, Cuomo stated that the release of Van Weezer had been postponed (due to the COVID-19 pandemic). The postponement was formally announced alongside the release of the second single, \"Hero\", on May 6, 2020.\n\nAs for OK Human, on April 10, 2020, Cuomo stated on the video conferencing platform Zoom that, at the time, the album was 75% complete. He followed this up by stating the album would likely not be released in 2020. On April 16, he explained the premise to a fan as \"very much a day in the life of [himself], but from a very private place.\" On May 14, Cuomo shared a photo via Snapchat of a studio, with visible sheet music titled \"Dead Roses\". On May 15, Cuomo confirmed in an interview with Mike Jones of the radio station DC101 that the string section was the first to be recorded for the album and that, at the time of the interview, only his piano parts were yet to be completed.\n\nOn August 13, Weezer formally announced that Van Weezer was being postponed until May 2021, simultaneously hinting that OK Human would release in the meantime, tweeting \"More music coming for you Humans real soon, OK?\" On October 1 through the streaming platform TikTok, Cuomo revealed that the band had a photo shoot earlier that day, later confirming it to be \"for the OK Human artwork and the whole album cycle\". On November 16, Cuomo confirmed to users of Riverchat that the album was complete, adding that the radio mix for the first single was in the mixing process.\n\nOn January 18, 2021, a new release-date of May 7, 2021 was confirmed alongside the official announcement of OK Human, with a release date of January 29, with the lead single, \"All My Favorite Songs\" releasing on January 21.\n\nSZNZ: Spring (2022)\n\nSZNZ: Spring is the seventh EP by American rock band Weezer, and the first of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on March 20, 2022, coinciding with the spring equinox. A physical version was released on CD later the same year, and a vinyl release was released in winter 2023. The EP produced one single, titled \"A Little Bit of Love\".\n\nThe SZNZ concept was first revealed by Rivers Cuomo in an interview in January 2021. Cuomo stated that he wanted the Spring album to feature a \"Happy, chill, stress-free\" theme, later expressing a desire for an \"acoustic, breezy\" song in a similar vein to \"Island in the Sun.\"\n\nOn February 2, 2022, Cuomo shared a Google spreadsheet with fans which included the release dates, possible producers, overall emotion, spirituality tone, planned genre, and planned singles for each of the SZNZ EP. Spring's emotion was set to be optimistic sorrow. The spreadsheet also included the band's look and the aesthetic era the clothes and EP are based on. Aesthetically, the band linked SZNZ: Spring to a pre-Christian era with influences from Celts, Paganism, and Wicca.\n\nOn March 16, 2022, Weezer released the lead single, \"A Little Bit Of Love\". On March 16, Cuomo used his game, Weezle (a Weezer-themed spin on the popular web game Wordle), to preview snippets of the forthcoming Spring songs.\n\nSZNZ: Spring was officially released on March 20, 2022, the day of the Spring Equinox. SZNZ: Spring received generally favorable reviews from music critics. \n\nSZNZ: Summer (2022)\n\nSZNZ: Summer is the eighth EP by American rock band Weezer, and the second of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on June 21, 2022, coinciding with the Summer solstice. The EP received its lead single \"Records\" just a few days before its release. Rivers Cuomo described the EP's sound as \"21st century 90s\". Aesthetically, he linked the project to 44 BC at the end of the Roman Republic, with an intended emotion of \"youthful indignation\".\n\nOn June 16, 2022, Weezer released the lead single, \"Records\", on an app called \"Human Record Player\". The app would play the song once the user spins themselves around clockwise like a record player. SZNZ: Summer was officially released on June 21, 2022, the day of the Summer Solstice.\n\nSZNZ: Autumn (2022)\n\nSZNZ: Autumn is the ninth EP by American rock band Weezer, and the third of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on September 22, 2022, coinciding with the September equinox. \n\nAccording to Rivers Cuomo, the record’s sound would reflect 'dance-rock' artists such as Franz Ferdinand and The Strokes. He also mentioned the EP would include synths. Cuomo described the project's overall emotion as anxiety. The album's thematic and aesthetic location was described as being set in \"The Mount of Beatitudes\", with its associated era being passion and the last supper, along with the Salem Witch Trials.\n\nUnlike the other SZNZ releases, Autumn did not have a lead single. Weezer officially released SZNZ: Autumn on September 22, 2022, the day of the autumnal equinox. A music video for \"What Happens After You?\" was released on November 29, 2022. \n\nSZNZ: Winter (2022)\n\nSZNZ: Winter is the tenth EP by American rock band Weezer, and the last of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on December 21, 2022, coinciding with the December solstice. It spawned a single, \"I Want a Dog\", released on December 9, 2022. Rivers Cuomo described the project's overall emotion as sadness. Cuomo said that the songwriting would be stylistically similar to Elliott Smith featuring \"lots of loss and despair\". \n\nWeezer, under their Goat Punishment pseudonym, performed SZNZ: Winter in its entirety at The Troubadour in West Hollywood, California on September 19, 2022. SZNZ: Winter officially released on December 21, 2022 alongside a video for \"Dark Enough to See the Stars\". \n\nAlbum 20 (2022-Present)\n\nThe earliest known mention of Weezer's 20th album was on September 24, 2022, in a forum post by Rivers Cuomo simply titled \"Album 20\". He simply stated he was excited for the album and asked the community what color it should be.\n\nOn April 20th, 2023, Rivers Cuomo brought up the idea of doing a musical for the next Weezer album, eventually, this morphed into being a sequel to the scrapped sophomore album \"Songs From The Black Hole\". The idea of a \"SFTBH II\" as it was referred to was workshopped around for a while before eventually being mostly forgotten about in lieu of a more traditional album 20.\n\nOn August 16th, 2023, Rivers Cuomo posted the names to five demos he was submitting to a potential producer, Klas Åhlund, the songs were entitled: Forget Yesterday, Kids Grow Up, Something Better On TV, CEO, and Black Rain. He described his vision for the album being anti-concept, comparing it to 2010's Hurley and 2021's Van Weezer. \n\nThe release date, track listing, or even title for Weezer's 20th album is still unknown, but as of now, there is a lot to think and speculate about.\n\nMembers\n\nThe band currently consists of the following members:\n\n    * Brian Bell — Guitar, backing vocals (1993-Present)\n    * Rivers Cuomo — Vocals, guitar (1992-Present)\n    * Scott Shriner — Bass guitar, backing vocals (2001-Present)\n    * Patrick Wilson — Drums (1992-Present)\n    * Karl Koch — Historian, webmaster, archivist (1992-Present)\n\nFormer members:\n    * Jason Cropper — Guitar (1992-1993), fired during the recording of The Blue Album in the late summer.\n    * Matt Sharp — Bass guitar, backing vocals (1992-1998) , plays on The Blue Album and Pinkerton, left during the band's hiatus in 1998.\n    * Mikey Welsh — Bass guitar, backing vocals (1998-2001), plays on The Green Album, retired from music after a drug overdose. <a href=\"https://www.last.fm/music/Weezer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "105730",
      "discogs_original_name": "Weezer",
      "id": null,
      "lastfm_mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
      "name": "Weezer",
      "role": "",
      "spotify_id": "3jOstUTkEu2JkjvRdBA5Gu",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Weezer": {
      "biography": "Weezer are an American alternative rock band. Formed in 1992, they have released 15 full length albums, 1 cover album, six EPs, and a DVD. Their latest album, titled 'Van Weezer', came out on May 7th, 2021, Although, they released 4 EPs in 2022, known as SZNZ. They've sold over ten million records in the United States to date, and 35 million worldwide. They play music influenced by alternative bands and power pop artists among others.\n\nWeezer started in Los Angeles, California when Rivers Cuomo joined with Patrick Wilson, Matt Sharp, Jason Cropper (who was later replaced by Brian Bell), and their friend  Karl Koch. Five weeks after forming, they had their first gig, opening for Dogstar at Raji's Bar and Ribshack on Hollywood Boulevard. Weezer began playing clubs to small audiences around L.A. and recording homemade demos. The group soon received attention from various A&R reps, and the guys were signed on June 26, 1993 by Todd Sullivan, an A&R rep from Geffen Records. The band became a part of the DGC label (which later turned into Interscope).\n\n\"The Blue Album\"  (1993-1994)\n\nThe self-titled debut, 'Weezer', commonly referred to as 'The Blue Album', came out on May 10, 1994. It picked up considerable acclaim. Tracks \"Undone (The Sweater Song)\" (also known as \"Undone - The Sweater Song\"), \"Buddy Holly\", and \"Say It Ain't So” were released as singles. The album was produced by former The Cars frontman Ric Ocasek. During the recording of the Blue Album, Jason Cropper left the band to take care of his future wife, who was pregnant with their first child. Jason was replaced by Brian Bell, a then bassist from a band called Carnival Art.\n\nThe first single, \"Undone - The Sweater Song\", garnered attention given that Spike Jonze directed the music video for the track. In a single, unbroken take, that video featured Weezer performing the song on a sound stage with various amusing studio antics, including a pack of dogs swarming the set. Jonze also later directed the band's second video, which was made for the single \"Buddy Holly\". Named after the famous 50s rock star, the \"Buddy Holly\" music video featured footage of the television sitcom Happy Days spliced with the band performing in a remade \"Arnold's Diner\", a setting from the series. The video had heavy rotation on MTV. It went on to win Jonze and the band four MTV Video Music Awards (including Breakthrough Video and Best Alternative Music Video) and two Billboard Music Video Awards. This video was also included as a bonus on the Microsoft Windows 95 CD. The success of the video arguably served as the key for pushing the band into the mainstream rock spotlight.\n\nThe video for Weezer's third single, \"Say It Ain't So\", was directed by Sophie Muller. It featured the bandmates playing hacky-sack and performing in the band's original rehearsal space in California. A photo of what the band calls the \"Garage\" is featured on the inside cover of the album.\n\n'The Blue Album' is currently certified three times platinum, making it Weezer's all-time best seller and one of the most popular rock albums of the early 90s. It was re-released and repackaged in 2004 as a \"Deluxe Edition\". That version of the album included a second disc of B-sides along with other previously unreleased rarities.\n\nSongs From The Black Hole & Pinkerton (1995-1997)\n\nIn late December 1994, Weezer took a break from touring for the Christmas holidays. Cuomo traveled back east to his home state of Connecticut. Using an eight-track recorder, he began piecing together demo material for Weezer's next album. Cuomo's original concept for Weezer's sophomore effort was to be a space-themed rock opera, with him mulling over the title 'Songs from the Black Hole'.\n\nThe album was intended to feature songs that flowed together seamlessly, and it was planned to end with a special coda that briefly revisited the major musical elements of the piece (something reminiscent of progressive rock works from the 70s). The band began demoing and working on Cuomo's concept through intermittent recording sessions in the spring and summer of 1995. Ultimately, the 'Songs from the Black Hole' album concept was dropped. The album that actually came out would instead feature some old tunes made from before their first album (which had briefly been incorporated into the space-opera) as well as some new ones written while Cuomo was at Harvard.\n\nAfter the multi-platinum success of their debut album, Weezer's sophomore album was finally released on September 24, 1996. Titled 'Pinkerton', the work peaked at #19 in the U.S. upon its release. It didn't sell as many copies as its predecessor, probably due to its darker, more abrasive nature. Pinkerton was labeled \"one of the worst albums of 1996\" by a Rolling Stone reader poll. Eventually, the album grew into a cult classic, and is viewed by some fans as Weezer's greatest album. In fact, in 2004, the magazine changed their rating to a 5-star rating and inducted it into The Rolling Stone Hall Of Fame.\n\nThree singles were taken from the album: \"El Scorcho\", \"The Good Life\", and \"Pink Triangle\". The video for \"El Scorcho\" featured the band inside a darkened room, sitting in a circle, that would be lit differently throughout parts of the song; it was directed by Mark Romanek. The video for \"The Good Life\" was directed by the team of Jonathan Dayton and Valerie Faris (though no known video was made for \"Pink Triangle\"). However, the singles did not receive as much airtime as the singles from their debut album.\n\nThe title of the album comes from the character Lieutenant Pinkerton in Giacomo Puccini's opera Madame Butterfly. The entire album is heavily influenced by the opera's story line. Madame Butterfly is mentioned under her real name, Cio-Cio San, in \"El Scorcho.\" The song \"Butterfly\" is written from Pinkerton's point of view at the end of the opera.\n\nThe album's title was the source of a legal challenge. Pinkerton Securities of Encino, Calif., filed a temporary restraining order against the band and its Geffen record label for copyright infringement two days before the album was to be released on September 24, 1996. A judge ruled against the security company and the album was finally released.\n\nWeezer completed their touring for Pinkerton in the summer of 1997. The members of the band took a break, with drummer Patrick Wilson returning to his home in Portland, Oregon to work on his side project, The Special Goodness, Matt Sharp left to complete the follow-up album for his group The Rentals, and Brian Bell went to work on his group, Space Twins.\n\nRivers Cuomo returned to Boston, Massachusetts, but dropped out of Harvard to focus on songwriting. He eventually went into seclusion. He painted his walls black, disconnected his phone, and didn't communicate with anyone. Later, he formed a solo group, The Rivers Cuomo Band. Cuomo used the group to try out unreleased material, including possible new songs for the next Weezer album. The band played their first show at T.T. the Bear's on October 8, 1997. Future Weezer bassist Mikey Welsh was part of the solo band's lineup. The Boston songs were later abandoned and not used on the next Weezer album, but live recordings of the Boston shows are openly traded on the internet. In February of 1998, Rivers left Boston and Harvard academia behind and returned to Los Angeles.\n\nPat Wilson and Brian Bell joined Cuomo in L.A. to start work on the next album. Matt Sharp did not rejoin the band and officially left the group in April of 1998. The group decided on Mikey Welsh as Sharp's replacement. Weezer continued rehearsal and cut demos until the fall of 1998. Frustration and creative disagreements led to a decline in rehearsals, and in late fall of 1998, drummer Pat Wilson left for his home in Portland pending renewed productivity from Cuomo.\n\nThe band would not reunite until April of 2000, when the Fuji Festival in Japan offered Weezer a high-paying gig to play in August 2000. The festival served as a catalyst for Weezer's productivity, and from April to May, 2000, the band rehearsed and demoed new songs in Los Angeles. The band returned to live shows in June 2000, but without the Weezer name. Instead the shows featured the group's first use of the pseudonym Goat Punishment.\n\nOn June 23, 2000, the band, now back under the Weezer name, joined the Warped Tour for eight planned dates. Weezer was received well at the festival, leading the band to book more tour dates for the summer.\n\nSS2K - The Summer Sessions (2000)\n\nIn the summer of 2000, Weezer (now consisting of Rivers Cuomo, Mikey Welsh, Pat Wilson, and Brian Bell) went on tour. Weezer's setlist consisted of 14 new songs that fans have labeled the Summer Songs of 2000 (commonly abbreviated, SS2K). When 13 of these songs did not appear on Weezer's next album, fans of the songs started a petition demanding the release of studio demos. Eventually, mp3s were made available on the band's official website for download. Three SS2K songs, \"Hash Pipe\", \"Dope Nose\" and \"Slob,\" have appeared on studio albums (\"Hash Pipe\" on the Green Album and \"Dope Nose\" and \"Slob\" appearing on Maladroit).\n\nGreen Album & Maladroit (2001-2003)\n\nEventually, the band went back into the studio to produce a third album. Weezer (2001) chose to repeat the self-titled name of their first release. This album quickly became known as The Green Album due to its distinctive bright green coloring. Shortly after the release of The Green Album, Weezer went on another American tour. They attracted a new generation of fans thanks to heavy MTV rotation for the videos of their hit singles \"Hash Pipe\" and \"Island in the Sun.\"\n\nThe video for \"Hash Pipe,\" directed by Marcos Siega featured sumo wrestlers and was nominated for Best Rock Video at the 2001 MTV Video Music Awards, but lost out to Limp Bizkit's \"Rollin.\" Two videos were recorded for \"Island in the Sun.\" Marcos Siega directed the first, which focused on a Mexican wedding, and Spike Jonze directed the second, which involved Weezer with animals in a wildlife reserve. Their video for \"Photograph\" was shot and put together by Weezer friend and unofficial \"5th member\" Karl Koch.\n\nAs reported on August 16th, 2001, by MTV, bassist Mikey Welsh was checked into a psychiatric hospital. His whereabouts were previously unknown, as he mysteriously went missing before their second filming of the \"Island in the Sun\" music video, featuring the band with various animals. Weezer was prompted to find a temporary replacement for Welsh. Through a mutual friend, Cuomo received Scott Shriner's number and asked if he was interested to fill in for Welsh. Shriner, at first believing it was a prank phone call, accepted.\n\nMuch to the ire of their recording label, Weezer decided to forgo the industry-preferred waiting period of 2 to 3 years between albums and began recording demos for their fourth album. The band took an experimental approach for the recording process by allowing fans to download the demos from their official website in return for feedback. After the release of the album, the band subsequently stated that the process was somewhat of a failure, as the fans did not supply them with cohesive constructive advice. Only the song \"Slob\" was included on the album due to general fan advice.\n\nThe fourth album, Maladroit, was released in 2002 with Scott Shriner replacing Mikey Welsh on the bass. The album served as a harder-edged version of their trademark catchy pop-influenced music. Although met with generally positive critical reviews (including making many \"Best of '02\" lists), its sales were not as strong as The Green Album and remains their worst-selling album to date.\n\nTwo singles were released from the album. The \"Dope Nose\" music video featured a Japanese motorcycle gang, and was put into regular rotation. The music video for \"Keep Fishin'\" combined Weezer with The Muppets, and had heavy rotation on MTV. Both videos were directed by Marcos Siega.\n\nAs soon as Maladroit had wrapped up, the band immediately began work on their fifth album, recording numerous demos between tours for Maladroit (often recording as many as 24 songs in a day). These songs were eventually scrapped, and Weezer took a break after the release of two albums in quick succession.\n\nMake Believe (2003-2005)\n\nIn March of 2004, Weezer released their first DVD. Titled Video Capture Device, the DVD contains all of their then-current music videos. It also included live concerts and homemade movies. The DVD was certified \"gold\" on November 8, 2004.\n\nFrom December 2003 to the summer and early fall of 2004, the members of Weezer recorded a large amount of material intended for a new album to be released in the spring of 2005 with producer Rick Rubin. The band's early recording efforts became available to the public through the band's website. The demos, entitled the Album Five Demos (or album 4.5), were a big hit with fans but only one song, \"Hold Me\", would be included on the finished album. That album, entitled Make Believe, was released on May 10, 2005. The album was very well received by the public. However, long-time Weezer fans often consider it as a decline from their earlier albums, and has received mixed reviews.\n\nThe album's first single, \"Beverly Hills,\" became a hit in the U.S. and worldwide, staying on the charts for several months after its release. The video for \"Beverly Hills\", directed by Marcos Siega, featured the band and a select choice of fans interacting with Playboy Bunnies and Hugh Hefner at the Playboy Mansion. It became the first Weezer song to hit #1 on the Billboard Modern Rock chart. The song was nominated for Best Rock Song at the 48th Annual Grammy Awards, the first ever Grammy nomination for the band. The video for the song was also nominated for Best Rock Video at the 2005 MTV Video Music Awards.\n\nDuring the \"Make Believe\" tour of 2005, Cuomo allowed other members of the band to step into the spotlight of certain songs:\n\n    * Brian Bell: \"Getchoo\" and \"Why Bother?\" (from Pinkerton), \"Smile\" (from \"The Green Album\"), and \"Keep Fishin'\" (from Maladroit)\n    * Scott Shriner: \"Fall Together\", and \"Dope Nose\", and \"In the Garage\" (from \"The Blue Album\")\n    * Patrick Wilson: \"Photograph\" (from \"The Green Album\"), \"Song 2\" (Blur cover, whilst playing lead guitar)\n\nIn late August 2005, Weezer performed with the rock band The Pixies, which was one of Rivers' influences, at Summerfest and other dates. From September 8 to October 28, 2005, Weezer set out on a tour with the Foo Fighters, which, to many, was simply called Foozer. The Foozer tour was awarded \"Most Creative Tour Package\" at The 17th Annual Concert Industry Awards.\n\nOn December 13th, 2005, Winter Weezerland EP was released on iTunes. The EP was essentially a re-release of the 2000 Weezer christmas CD which featured \"The Christmas Song\" and \"Christmas Celebration\". Also, in late 2005 the band released the second single off Make Believe, called \"We Are All on Drugs\" (for family-oriented purposes, some releases of the song were renamed \"We Are All in Love\"), and the music video was directed by Justin Francis.\n\nIn early 2006, it was announced that Make Believe was certified platinum, and \"Beverly Hills\" was the second most popular download on iTunes for 2005. Also in early 2006, Make Believe's third single, \"Perfect Situation\", spent four weeks in a row at the #1 spot on the Billboard Modern Rock chart, a personal record for Weezer. The Perfect Situation video starred Elisha Cuthbert and was directed by Marc Webb. The only other Weezer track to hit #1 was \"Beverly Hills,\" for one week. \"This is Such a Pity\" is the band's fourth single from the album, but no music video was made for its release.\n\nRivers Cuomo announced a new song called \"Piece of the Pie\" while onstage during the band's October 7th, 2005 show in Detroit (but did not perform it). Cuomo has mentioned other song ideas recently, dropping titles and ideas such as \"East Coast or West Coast,\" \"Pig\" and new songs with lyrics he described as \"bloggy\".\n\nRivers has commented on his myspace blog that his recent comments to mtv.com were 'misquoted' and said that what he meant \"was that the soccer song, \"Our Time will Come\", certainly won't be on a Weezer album.\" and said \"The rest of the songs, though, are definite contenders for a Weezer record.\" A strong hint that the band are in fact only on a break and that a sixth album is on the card.\n\nIn late 2006, Brian Bell began work on a new project called The Relationship which fans can follow on the band's myspace page. Pat Wilson told Keifer Wells and Martin Michalek in a radio interview for Andover High School that he and Scott Shriner had been creating songs together and are trying to get Rivers to sing for when the band has jam sessions. Pat has also been creating a few Special Goodness songs, but said little more on the subject. \n\nThe Red Album (2008)\n\nLead singer Rivers Cuomo released a demo-compilation album entitled Alone: The Home Recordings of Rivers Cuomo on December 18, 2007. The album contains demos of Cuomo's that span from 1992 to 2007, including songs from Weezer's abandoned second album, Songs from the Black Hole. Also included in Alone is a song intended for Weezer's upcoming 6th studio album, entitled \"This is the Way\". The booklet of Alone tells of the band wanting the song for the album, but ultimately choosing \"an epic, 6-minute, symphonic type of art song\" entitled \"Daydreamer\" instead.\n\nWeezer's \"Weezer\" (also referred to as \"The Red Album\") was released in June 2008. Rick Rubin produced the album and Rich Costey mixed it. The record is being described as \"experimental\", and according to Cuomo, includes longer and non-traditional songs, TR-808 drum machines, synthesizers, Southern rap, baroque counterpoint, and band members other than Cuomo writing, singing, and switching instruments. Pat Wilson said that the album cost about a million dollars to make, contrasting it with the $150,000 budget of \"The Blue Album\". The album's singles were produced by Jacknife Lee. Its lead single, \"Pork and Beans\", topped the Billboard Modern Rock Tracks charts for 11 weeks, and its music video won a Grammy for Best Short Form Music Video. The album's second single, \"Troublemaker\", debuted at #39 on the Billboard Hot Modern Rock Tracks chart and peaked at #2. In October 2008, the group announced that the third single would be \"The Greatest Man That Ever Lived (Variations on a Shaker Hymn)\".\n\nRaditude (2009)\n\nIn 2009, the band announced their next album, \"Raditude\", would be released on November 3, 2009, where it debuted as the seventh best-selling album of the week on the Billboard 200 chart. The band scheduled tour dates in December 2009 extending into early 2010 to coincide with the new album's release. On December 6, 2009, Weezer frontman Rivers Cuomo was injured when his tour bus crashed in upstate New York due to black ice. Cuomo suffered three broken ribs, and his assistant broke two ribs. His wife, baby daughter, and their nanny were also on the bus; however, they escaped injury. Weezer cancelled tour dates the following day. The band resumed touring on January 20, 2010.\n\nHurley (2010)\n\nIn December 2009, it was revealed that the band was no longer with Geffen Records. The band stated that they would still release new material, but they are unsure of the means, whether it be self-released, released online, or getting signed by another label. Eventually, the band was signed to the independent label Epitaph.\n\nThe album \"Hurley\" was released in September 2010 through Epitaph Records. The name comes from the character Hugo \"Hurley\" Reyes from the television show \"Lost\". Jorge Garcia, the actor who portrayed Hurley, stated that being featured on the album cover is \"one of the biggest honors of [his] career.\" Weezer used internet streaming service YouTube as a way to promote the album.\n\nOn November 2, 2010, Weezer released another studio album called \"Death to False Metal\". This album was composed of newly re-recorded versions of unused recordings spanning the band's career.\n\nOn October 9, 2011, the band announced on their website that former bassist Mikey Welsh had died.\n\nEcce Homo & Everything Will Be Alright in The End(2011–2015)\n\nRivers Cuomo first mentioned a follow-up to Weezer's eighth album, Hurley, shortly after that album's release. Cuomo told The A.V. Club, \"I was talking to the producer and he was saying 'These songs sound totally different from Hurley. Hurley was kind of dark, and the new songs sound like you’re 16, riding your bicycle to get a Slurpee.' As a writer, I had no idea—I wasn’t shooting for anything different. That’s just what happened to come up.\" It is unknown what happened to these songs, as he was not referring to the songs that were written in-between the years of 2011 and 2013.\n\nIn October of 2013, Cuomo confided with fans that Weezer would begin working with producer Ric Ocasek in January, and as said, in January 2014, the band started to record its ninth studio album with producer Ric Ocasek, who previously worked with the band on its first two self-titled albums. A clip of a new song was posted on the band's official YouTube account on March 19, 2014, which confirmed previous rumors of the band being in the studio. \n\nOn June 12, 2014, it was revealed that the album title would be Everything Will Be Alright in the End. It was released on October 7, 2014 to generally favorable reviews, becoming the band's best-reviewed release since Pinkerton.\n\nThe White Album (2016)\n\nAfter the disappointing sales of the previous album, Everything Will Be Alright in the End, the band left Republic Records and joined Crush Music. A new producer was signed, Jake Sinclair, whom the band met during the recording for Raditude, A self-confessed Weezer fan. When work began for the album, Rivers showed his dropbox account to Jake, which had almost 250 songs and demos. Only one song would make the cut: \"California Kids\", which set the tone and beach theme of the album.\n\nOn October 20, 2015, \"Thank God for Girls\" was played live at a small iHeart Radio show in Burbank, California. On October 26, 2015, the band released a new single, \"Thank God for Girls\", through Apple Music and to radio the same day. The following week, the band released a second single, \"Do You Wanna Get High?\". Cuomo claimed in an interview with Zane Lowe, that the band was not working on a new album. In January of 2016, weezer.com became a blank white screen and the band's Facebook and Twitter pages posted blank white pictures. A video was posted to the band's youtube channel that was a white screen with static in the background. On January 14, 2016, Weezer released a third single, \"King of the World\", and announced that the band's fourth self-titled album, also known as the White Album.\n\nProducer Jake Sinclair revealed himself on allthingsweezer.com as user \"wannabeezer\" and began to share insight on the new album. As a weezer fan himself, his goal was to make a weezer album that would change the third album on people's rankings. Two more songs were released before the album: \"L.A. Girlz\" on February 16th, and \"California Kids\" which leaked on Apple Music for a short amount of time. The latter was a remake of the 2014 Scott & Rivers song \"California.\" The song was officially released on March 9. Bandmate Brian Bell cowrote the former, \"L.A. Girlz\", and \"Endless Bummer\". Much of the album's lyrics come from Cuomo's stream of consciousness diary as well as his experiences living in California. \n\nThe White Album, upon release on April 1, 2016, continued the critical success of the band's previous release. In support of the album, the band performed on the Weezer & Panic! at the Disco Summer Tour 2016 with Panic! at the Disco in 2016. The band later signed to Atlantic Records as part of a joint venture between Warner Music Group and Crush Management. The album was nominated for the Best Rock Album Grammy on December 5, 2016.\n\nOn October 5th, a digital deluxe version was announced to release on the 7th. It contained previously released \"I Love the USA\" as well as the previously announced \"Fake Smiles and Nervous Laughter\" which later received a vinyl release in December. It also includes two new tracks, \"Friend of a Friend\" and a new remix of \"Jacked Up\" featuring Fitz of Fitz and the Tantrums & Nadya of Pussy Riot.\n\nPacific Daydream (2017–2018)\n\nSoon after the release of the White Album, Cuomo discussed plans for Weezer's next album, provisionally titled the Black Album: \"It’s going to maybe be like Beach Boys gone bad [...] I’m thinking of swearing, which is something I’ve never done in songs.” Cuomo also said the album would tackle “more mature topics” and be “less summer day and more winter night”. He suggested the band could return to the recording studio as soon as October 2016. Weezer delayed recording after Cuomo felt his new material was more \"like reveries from a beach at the end of the world [... as if] the Beach Boys and the Clash fell in love by the ocean and had one hell of an amazing baby\".\n\nOn March 16, 2017, the band released a new song titled \"Feels Like Summer\", later revealed to be the lead single of an upcoming album. The song drew a mixed reaction from fans but became their biggest hit on Alternative radio in a decade. \"Feels Like Summer\" was heard on The Weather Channel's local forecast segments on July 4, 2017, and again on August 18, 2017. It was also heard on some of the network's promos that summer. \n\nOn August 16, the band revealed the album title, Pacific Daydream, and scheduled for October 27. The next day, the a promotional single from the album, \"Mexican Fender\", was released. The following months, \"Beach Boys\" was released, and the month after, they released \"Weekend Woman\" to positive reception.\n\nAfrica, The Teal Album, & The Black Album (2018 - 2019)\n\nOn May 29, 2018 Weezer released a cover of Toto's song \"Africa\" which reached number one on the Billboard Alternative Songs chart in August 2018, becoming the band's first number-one single since \"Pork and Beans\" in 2008. On August 10, Toto responded by releasing a cover of Weezer's single \"Hash Pipe\"\n\nOn October 11, 2018, Weezer released \"Can't Knock the Hustle\", the lead single from their upcoming self-titled album, also known as the \"Black Album\". On November 21, they released the second single, \"Zombie Bastards\", and announced the \"Black Album\", produced by Dave Sitek and scheduled for March 1, 2019.\n\nOn January 23rd, 2019 Weezer made a surprise release with a self-titled covers album dubbed \"The Teal Album\".\n\nDuring an interview with Zane Lowe on the DJ's Beats 1 show the day \"The Teal Album\" was released, Weezer revealed they were already mostly done recording their follow-up to the then-unreleased \"Black Album\".\n\nOK Human & Van Weezer (2021)\n\nRivers Cuomo has credited producer Jake Sinclair with planting \"the seed of an idea\" for OK Human in 2017. \"Just you and a piano, and an orchestra, and it's gonna be super-personal, quirky songs that only you could write, not worrying about commercial potential at all.\n\nRivers Cuomo first publicly mentioned the album title Van Weezer while discussing the band's progress on the album OK Human in an interview with Los Angeles Times in February of 2019, indicating that the album was inspired by Van Halen. When asked about Weezer's two upcoming albums in an interview with Billboard published March 1st, Cuomo said: \"One was mostly done before the Black Album. It’s currently called OK Human and was produced by Jake Sinclair, who did our White Album. The other one, I’m depressed thinking about it. I have this huge emotional block. It’s called Van Weezer, and it’s basically a super-rock album. Like the Blue Album, but more guitar riffs.\" Brian Bell acknowledged the album's existence in various interviews throughout 2019. In an August interview with Spanish blog Binaural, Bell suggested that Crush Management would prefer to release Van Weezer before OK Human.\n\nIn August of 2019, a casting call was posted to backstage.com looking for extras to play \"Weezer party goers\" in an upcoming music video. On August 23, musician and producer Tim Pagnotta posted a story to his Instagram page that read \"Jammin’ new @Weezer I worked on :)\". On September 6, 2019, the song \"The End of the Game\" leaked onto the American television music service Music Choice. The song's music video was released alongside the announcement of the album Van Weezer on September 10, 2019.\n\nOn April 9, 2020, it was revealed in a Zoom chat with fans that a single for the album was originally scheduled to be released either that day, or the next, but had been delayed (likely due to the COVID-19 pandemic). Karl Koch posted on the Weezer Fan Club Facebook group asking for footage of people involved in the outbreak, and that a deadline would be on April 15, leading fans to speculate that the footage would be used for an upcoming video. The next day, on April 10, Cuomo mentioned that there would be a Homie song on Van Weezer, as well as a bonus track originally written around 1992. It was also revealed that all the album's tracks were fully mastered, with the only track ordering left to be determined. On April 14, Cuomo sang a small segment of the song, \"Thrown It All Away\", during a webinar with fans hosted by Cuomo on the video platform Zoom, for which co-writer Jason Cropper was present.On September 2, Cuomo confirmed via a Riverpedia entry that the 1992 song \"Thrown It All Away\" had recently been recorded with the band. The article was later updated on September 6 to specify that it would be on the album. On September 3, Cuomo confirmed via another Riverpedia entry that \"Sheila Can Do It\" was the aforementioned Homie song appearing on Van Weezer. On April 17, during a Zoom chat with fans, Cuomo stated that the release of Van Weezer had been postponed (due to the COVID-19 pandemic). The postponement was formally announced alongside the release of the second single, \"Hero\", on May 6, 2020.\n\nAs for OK Human, on April 10, 2020, Cuomo stated on the video conferencing platform Zoom that, at the time, the album was 75% complete. He followed this up by stating the album would likely not be released in 2020. On April 16, he explained the premise to a fan as \"very much a day in the life of [himself], but from a very private place.\" On May 14, Cuomo shared a photo via Snapchat of a studio, with visible sheet music titled \"Dead Roses\". On May 15, Cuomo confirmed in an interview with Mike Jones of the radio station DC101 that the string section was the first to be recorded for the album and that, at the time of the interview, only his piano parts were yet to be completed.\n\nOn August 13, Weezer formally announced that Van Weezer was being postponed until May 2021, simultaneously hinting that OK Human would release in the meantime, tweeting \"More music coming for you Humans real soon, OK?\" On October 1 through the streaming platform TikTok, Cuomo revealed that the band had a photo shoot earlier that day, later confirming it to be \"for the OK Human artwork and the whole album cycle\". On November 16, Cuomo confirmed to users of Riverchat that the album was complete, adding that the radio mix for the first single was in the mixing process.\n\nOn January 18, 2021, a new release-date of May 7, 2021 was confirmed alongside the official announcement of OK Human, with a release date of January 29, with the lead single, \"All My Favorite Songs\" releasing on January 21.\n\nSZNZ: Spring (2022)\n\nSZNZ: Spring is the seventh EP by American rock band Weezer, and the first of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on March 20, 2022, coinciding with the spring equinox. A physical version was released on CD later the same year, and a vinyl release was released in winter 2023. The EP produced one single, titled \"A Little Bit of Love\".\n\nThe SZNZ concept was first revealed by Rivers Cuomo in an interview in January 2021. Cuomo stated that he wanted the Spring album to feature a \"Happy, chill, stress-free\" theme, later expressing a desire for an \"acoustic, breezy\" song in a similar vein to \"Island in the Sun.\"\n\nOn February 2, 2022, Cuomo shared a Google spreadsheet with fans which included the release dates, possible producers, overall emotion, spirituality tone, planned genre, and planned singles for each of the SZNZ EP. Spring's emotion was set to be optimistic sorrow. The spreadsheet also included the band's look and the aesthetic era the clothes and EP are based on. Aesthetically, the band linked SZNZ: Spring to a pre-Christian era with influences from Celts, Paganism, and Wicca.\n\nOn March 16, 2022, Weezer released the lead single, \"A Little Bit Of Love\". On March 16, Cuomo used his game, Weezle (a Weezer-themed spin on the popular web game Wordle), to preview snippets of the forthcoming Spring songs.\n\nSZNZ: Spring was officially released on March 20, 2022, the day of the Spring Equinox. SZNZ: Spring received generally favorable reviews from music critics. \n\nSZNZ: Summer (2022)\n\nSZNZ: Summer is the eighth EP by American rock band Weezer, and the second of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on June 21, 2022, coinciding with the Summer solstice. The EP received its lead single \"Records\" just a few days before its release. Rivers Cuomo described the EP's sound as \"21st century 90s\". Aesthetically, he linked the project to 44 BC at the end of the Roman Republic, with an intended emotion of \"youthful indignation\".\n\nOn June 16, 2022, Weezer released the lead single, \"Records\", on an app called \"Human Record Player\". The app would play the song once the user spins themselves around clockwise like a record player. SZNZ: Summer was officially released on June 21, 2022, the day of the Summer Solstice.\n\nSZNZ: Autumn (2022)\n\nSZNZ: Autumn is the ninth EP by American rock band Weezer, and the third of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on September 22, 2022, coinciding with the September equinox. \n\nAccording to Rivers Cuomo, the record’s sound would reflect 'dance-rock' artists such as Franz Ferdinand and The Strokes. He also mentioned the EP would include synths. Cuomo described the project's overall emotion as anxiety. The album's thematic and aesthetic location was described as being set in \"The Mount of Beatitudes\", with its associated era being passion and the last supper, along with the Salem Witch Trials.\n\nUnlike the other SZNZ releases, Autumn did not have a lead single. Weezer officially released SZNZ: Autumn on September 22, 2022, the day of the autumnal equinox. A music video for \"What Happens After You?\" was released on November 29, 2022. \n\nSZNZ: Winter (2022)\n\nSZNZ: Winter is the tenth EP by American rock band Weezer, and the last of four EPs in their SZNZ (pronounced \"seasons\") project. It was released digitally on December 21, 2022, coinciding with the December solstice. It spawned a single, \"I Want a Dog\", released on December 9, 2022. Rivers Cuomo described the project's overall emotion as sadness. Cuomo said that the songwriting would be stylistically similar to Elliott Smith featuring \"lots of loss and despair\". \n\nWeezer, under their Goat Punishment pseudonym, performed SZNZ: Winter in its entirety at The Troubadour in West Hollywood, California on September 19, 2022. SZNZ: Winter officially released on December 21, 2022 alongside a video for \"Dark Enough to See the Stars\". \n\nAlbum 20 (2022-Present)\n\nThe earliest known mention of Weezer's 20th album was on September 24, 2022, in a forum post by Rivers Cuomo simply titled \"Album 20\". He simply stated he was excited for the album and asked the community what color it should be.\n\nOn April 20th, 2023, Rivers Cuomo brought up the idea of doing a musical for the next Weezer album, eventually, this morphed into being a sequel to the scrapped sophomore album \"Songs From The Black Hole\". The idea of a \"SFTBH II\" as it was referred to was workshopped around for a while before eventually being mostly forgotten about in lieu of a more traditional album 20.\n\nOn August 16th, 2023, Rivers Cuomo posted the names to five demos he was submitting to a potential producer, Klas Åhlund, the songs were entitled: Forget Yesterday, Kids Grow Up, Something Better On TV, CEO, and Black Rain. He described his vision for the album being anti-concept, comparing it to 2010's Hurley and 2021's Van Weezer. \n\nThe release date, track listing, or even title for Weezer's 20th album is still unknown, but as of now, there is a lot to think and speculate about.\n\nMembers\n\nThe band currently consists of the following members:\n\n    * Brian Bell — Guitar, backing vocals (1993-Present)\n    * Rivers Cuomo — Vocals, guitar (1992-Present)\n    * Scott Shriner — Bass guitar, backing vocals (2001-Present)\n    * Patrick Wilson — Drums (1992-Present)\n    * Karl Koch — Historian, webmaster, archivist (1992-Present)\n\nFormer members:\n    * Jason Cropper — Guitar (1992-1993), fired during the recording of The Blue Album in the late summer.\n    * Matt Sharp — Bass guitar, backing vocals (1992-1998) , plays on The Blue Album and Pinkerton, left during the band's hiatus in 1998.\n    * Mikey Welsh — Bass guitar, backing vocals (1998-2001), plays on The Green Album, retired from music after a drug overdose. <a href=\"https://www.last.fm/music/Weezer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "Europe",
  "created_at": "2025-07-05T15:53:22.949083",
  "date_added": "2021-05-07T05:04:03-07:00",
  "discogs_id": "18600571",
  "discogs_url": "https://www.discogs.com/release/18600571-Weezer-Van-Weezer",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock",
    "rock",
    "power pop",
    "alternative rock",
    "hard rock",
    "2021"
  ],
  "id": "18600571",
  "images": [
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/6m1xhwA4D7r40PVNpSOPu0IFbzoedH3duzPRtbilwwU/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjA3OTU4/MzgtNjI3Mi5qcGVn.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/6m1xhwA4D7r40PVNpSOPu0IFbzoedH3duzPRtbilwwU/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjA3OTU4/MzgtNjI3Mi5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/JwewtATLOtJi_4x4eVL9RB7z_sJxc9T7Kym8GYoDhYQ/rs:fit/g:sm/q:90/h:600/w:581/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjA3OTU4/NzgtMTIwNy5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/JwewtATLOtJi_4x4eVL9RB7z_sJxc9T7Kym8GYoDhYQ/rs:fit/g:sm/q:90/h:600/w:581/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjA3OTU4/NzgtMTIwNy5qcGVn.jpeg",
      "width": 581
    },
    {
      "height": 587,
      "resource_url": "https://i.discogs.com/ONNClh4anT_lFBA8o9DAYnoH2A81sA5H6uaxUOSprC4/rs:fit/g:sm/q:90/h:587/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjAyMjY2/MTEtMjQwNi5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/ONNClh4anT_lFBA8o9DAYnoH2A81sA5H6uaxUOSprC4/rs:fit/g:sm/q:90/h:587/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjAyMjY2/MTEtMjQwNi5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/SrsSNXlpfyCUB22I2g5ihV5Pjp2dV9H5fqPutl48pIM/rs:fit/g:sm/q:90/h:600/w:591/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjAyMjY2/MTYtMTg1My5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/SrsSNXlpfyCUB22I2g5ihV5Pjp2dV9H5fqPutl48pIM/rs:fit/g:sm/q:90/h:600/w:591/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjAyMjY2/MTYtMTg1My5qcGVn.jpeg",
      "width": 591
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/8tBa0JvjIWu0dMb8t3M7rWnf_n3ebRt75XwS6Egco6k/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2Mzk1ODg4/NTItNjEzMC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/8tBa0JvjIWu0dMb8t3M7rWnf_n3ebRt75XwS6Egco6k/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2Mzk1ODg4/NTItNjEzMC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/NZMGqsgOEMTDH9rcrqlKZHlJEN-tc_A_IniK_r7iKjA/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2Mzk1ODg4/NTUtNDg0Ny5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/NZMGqsgOEMTDH9rcrqlKZHlJEN-tc_A_IniK_r7iKjA/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2Mzk1ODg4/NTUtNDg0Ny5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/HONfjuix2SHsC7AuDldyZBDAyieoEmn__RL9efYuIUA/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2Mzk1ODg4/NTItNzM4Ny5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/HONfjuix2SHsC7AuDldyZBDAyieoEmn__RL9efYuIUA/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2Mzk1ODg4/NTItNzM4Ny5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 317,
      "resource_url": "https://i.discogs.com/BxYVDXfWAu56oxGR-UY83KWs2yh0ks6SJeK2r7RhWKo/rs:fit/g:sm/q:90/h:317/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjE0NTQw/NzgtOTYwMi5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/BxYVDXfWAu56oxGR-UY83KWs2yh0ks6SJeK2r7RhWKo/rs:fit/g:sm/q:90/h:317/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE4NjAw/NTcxLTE2MjE0NTQw/NzgtOTYwMi5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/37/23/05/3723050b-583f-38db-0406-060fbd9dfb43/075679836861.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "Crush Music (2)",
    "Atlantic"
  ],
  "lastfm_mbid": null,
  "lastfm_url": "https://www.last.fm/music/Weezer/Van+Weezer",
  "local_images": {
    "hi-res": "public/album/van-weezer-18600571/van-weezer-18600571-hi-res.jpg",
    "medium": "public/album/van-weezer-18600571/van-weezer-18600571-medium.jpg",
    "small": "public/album/van-weezer-18600571/van-weezer-18600571-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T15:53:27.403148",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "Van Weezer",
  "release_name_discogs": "Van Weezer",
  "release_name_spotify": "Van Weezer",
  "released": "2021-05-07",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/37/23/05/3723050b-583f-38db-0406-060fbd9dfb43/075679836861.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "under exclusive license to Crush Music / Atlantic Recording Corporation for the United States and Crush Music / WEA International Inc. for the world excluding the United States. A Warner Music Company., ℗ 2021 Weezer",
      "editorial_notes": "In early 2020, Weezer were forced to put the release of the guitar-driven <i>Van Weezer</i> on hold when the stadium tour Hella Mega, on which they would share the bill with Green Day and Fall Out Boy, was postponed due to the COVID-19 pandemic. The veteran pop-rockers turned inward and decided to release <i>OK Human</i> instead—an unplugged orchestral album centred around themes of isolation and feeling alienated that felt more appropriate during lockdown. With the possibility of live shows ever-so-slightly looming on the horizon, they crank the Marshall stack back up and serve fun, gnarly riffs on their second album of 2021. Inspired by their shared love of hard rock and heavy metal bands of the ’70s and ’80s—after all, the album’s title is an obvious nod to Van Halen—the band’s 15th LP offers a nostalgic whiff of guitar histrionics (“Beginning of the End”), stomp-clap anthems à la “Beverly Hills” with more punch (“All the Good Ones”) and palm-muted power chords (“1 More Hit”).<br />\nClocking in at a snappy 30 minutes, the 10 tracks here are all killer, no filler—recalling the catchy immediacy of the Green Album, even if, sonically, it’s the equivalent of wearing spandex and lace rather than baggy khakis. But as it is with every Weezer album, they also embrace their pop side regardless of whatever gimmick they pursue. There are sparkling odes to the underdog (“Hero”), anecdotes about overcoming stage fright (“Beginning of the End”) and adolescent memories about raging to Aerosmith (“I Need Some of That”), each guided by frontman Rivers Cuomo’s dewy-eyed ruminations and tightly crafted power-pop hooks. And for the long-time faithful, Cuomo even throws in some fan service with “Sheila Can Do It”—converting an old demo he wrote in the mid-’90s into a revved-up rocker with bubblegum New Wave flourishes.",
      "id": "1479227321",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Weezer",
        "artwork": {
          "bgColor": "370400",
          "height": 1425,
          "textColor1": "fcfcfc",
          "textColor2": "f502a8",
          "textColor3": "d4cac9",
          "textColor4": "cf0286",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/37/23/05/3723050b-583f-38db-0406-060fbd9dfb43/075679836861.jpg/{w}x{h}bb.jpg",
          "width": 1425
        },
        "copyright": "under exclusive license to Crush Music / Atlantic Recording Corporation for the United States and Crush Music / WEA International Inc. for the world excluding the United States. A Warner Music Company., ℗ 2021 Weezer",
        "editorialNotes": {
          "short": "On their 15th LP, the mercurial band revere the classic-rock greats.",
          "standard": "In early 2020, Weezer were forced to put the release of the guitar-driven <i>Van Weezer</i> on hold when the stadium tour Hella Mega, on which they would share the bill with Green Day and Fall Out Boy, was postponed due to the COVID-19 pandemic. The veteran pop-rockers turned inward and decided to release <i>OK Human</i> instead—an unplugged orchestral album centred around themes of isolation and feeling alienated that felt more appropriate during lockdown. With the possibility of live shows ever-so-slightly looming on the horizon, they crank the Marshall stack back up and serve fun, gnarly riffs on their second album of 2021. Inspired by their shared love of hard rock and heavy metal bands of the ’70s and ’80s—after all, the album’s title is an obvious nod to Van Halen—the band’s 15th LP offers a nostalgic whiff of guitar histrionics (“Beginning of the End”), stomp-clap anthems à la “Beverly Hills” with more punch (“All the Good Ones”) and palm-muted power chords (“1 More Hit”).<br />\nClocking in at a snappy 30 minutes, the 10 tracks here are all killer, no filler—recalling the catchy immediacy of the Green Album, even if, sonically, it’s the equivalent of wearing spandex and lace rather than baggy khakis. But as it is with every Weezer album, they also embrace their pop side regardless of whatever gimmick they pursue. There are sparkling odes to the underdog (“Hero”), anecdotes about overcoming stage fright (“Beginning of the End”) and adolescent memories about raging to Aerosmith (“I Need Some of That”), each guided by frontman Rivers Cuomo’s dewy-eyed ruminations and tightly crafted power-pop hooks. And for the long-time faithful, Cuomo even throws in some fan service with “Sheila Can Do It”—converting an old demo he wrote in the mid-’90s into a revved-up rocker with bubblegum New Wave flourishes."
        },
        "genreNames": [
          "Alternative",
          "Music"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": true,
        "isSingle": false,
        "name": "Van Weezer",
        "playParams": {
          "id": "1479227321",
          "kind": "album"
        },
        "recordLabel": "Crush Music/Atlantic",
        "releaseDate": "2021-05-07",
        "trackCount": 10,
        "upc": "075679836861",
        "url": "https://music.apple.com/gb/album/van-weezer/1479227321"
      },
      "url": "https://music.apple.com/gb/album/van-weezer/1479227321"
    },
    "lastfm": {
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/9a821a8a8a2588fab140287de1e41863.jpg"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/9a821a8a8a2588fab140287de1e41863.jpg"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/9a821a8a8a2588fab140287de1e41863.jpg"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/9a821a8a8a2588fab140287de1e41863.jpg"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/9a821a8a8a2588fab140287de1e41863.jpg"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/9a821a8a8a2588fab140287de1e41863.jpg"
        }
      ],
      "listeners": 82523,
      "mbid": "45af87c6-349a-4afd-a7c0-fff9e71aaace",
      "playcount": 1523809,
      "raw_data": {
        "album": {
          "artist": "Weezer",
          "image": [
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/34s/9a821a8a8a2588fab140287de1e41863.jpg",
              "size": "small"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/64s/9a821a8a8a2588fab140287de1e41863.jpg",
              "size": "medium"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/174s/9a821a8a8a2588fab140287de1e41863.jpg",
              "size": "large"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/9a821a8a8a2588fab140287de1e41863.jpg",
              "size": "extralarge"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/9a821a8a8a2588fab140287de1e41863.jpg",
              "size": "mega"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/9a821a8a8a2588fab140287de1e41863.jpg",
              "size": ""
            }
          ],
          "listeners": "82523",
          "mbid": "45af87c6-349a-4afd-a7c0-fff9e71aaace",
          "name": "Van Weezer",
          "playcount": "1523809",
          "tags": {
            "tag": [
              {
                "name": "rock",
                "url": "https://www.last.fm/tag/rock"
              },
              {
                "name": "power pop",
                "url": "https://www.last.fm/tag/power+pop"
              },
              {
                "name": "alternative rock",
                "url": "https://www.last.fm/tag/alternative+rock"
              },
              {
                "name": "hard rock",
                "url": "https://www.last.fm/tag/hard+rock"
              },
              {
                "name": "2021",
                "url": "https://www.last.fm/tag/2021"
              }
            ]
          },
          "tracks": {
            "track": [
              {
                "@attr": {
                  "rank": 1
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 236,
                "name": "Hero",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/Hero"
              },
              {
                "@attr": {
                  "rank": 2
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 164,
                "name": "All the Good Ones",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/All+the+Good+Ones"
              },
              {
                "@attr": {
                  "rank": 3
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 181,
                "name": "The End of the Game",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/The+End+of+the+Game"
              },
              {
                "@attr": {
                  "rank": 4
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": null,
                "name": "I Need Some of That",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/I+Need+Some+of+That"
              },
              {
                "@attr": {
                  "rank": 5
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 195,
                "name": "Beginning of the End",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/Beginning+of+the+End"
              },
              {
                "@attr": {
                  "rank": 6
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 170,
                "name": "Blue Dream",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/Blue+Dream"
              },
              {
                "@attr": {
                  "rank": 7
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 185,
                "name": "1 More Hit",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/1+More+Hit"
              },
              {
                "@attr": {
                  "rank": 8
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 177,
                "name": "Sheila Can Do It",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/Sheila+Can+Do+It"
              },
              {
                "@attr": {
                  "rank": 9
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 172,
                "name": "She Needs Me",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/She+Needs+Me"
              },
              {
                "@attr": {
                  "rank": 10
                },
                "artist": {
                  "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04",
                  "name": "Weezer",
                  "url": "https://www.last.fm/music/Weezer"
                },
                "duration": 170,
                "name": "Precious Metal Girl",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Weezer/Van+Weezer/Precious+Metal+Girl"
              }
            ]
          },
          "url": "https://www.last.fm/music/Weezer/Van+Weezer",
          "wiki": {
            "content": "Van Weezer is the fifteenth studio album by American rock band Weezer, released on May 7, 2021 by Crush Music and Atlantic Records. Featuring a classic rock and hard rock inspired sound, the album was announced in September 2019 with an original release date of May 2020, coinciding with announcement of the band's participation in the Hella Mega Tour alongside Green Day and Fall Out Boy. However, due to the COVID-19 pandemic, the tour was delayed indefinitely and Van Weezer's release was delayed until May 2021, almost four months after the release of the band's previous album OK Human.\n\nFour singles were released ahead of the album's release; \"The End of the Game\", \"Hero\", \"Beginning of the End\" and \"I Need Some of That\". The album received generally positive reviews from critics. It debuted at number 22 on the US Billboard 200 chart with first week sales of 18,600. It reached its peaked at number 11 on the chart.\n\nIn February 2019, Weezer frontman Rivers Cuomo began working on new songs with a hard rock influence, in contrast to the pop rock and electropop sound that had been featured on the band's previous albums Pacific Daydream, the Teal Album, and the then-upcoming Black Album. In an interview that month with Entertainment Weekly, Cuomo mentioned that an album tentatively titled Van Weezer was in the works, and that it would take the band \"back to big guitars\". He remarked that when the band would perform \"Beverly Hills\" live in concert, he would perform a guitar solo that was not present on the recorded version of the song. \"We noticed that, recently, the crowd just goes crazy when I do that. So it feels like maybe the audience is ready for some shredding again.\"\n\nThe album has been compared to their fourth studio album Maladroit (2002), and is inspired by 1970s and 1980s hard rock and heavy metal bands such as Kiss, Black Sabbath, Metallica and Van Halen (the last of whom inspired the album's title). Cuomo would also state that the album is \"Blue Album-ish, but a little more riffy.\"\n\nOn September 10, 2019, the first single from Van Weezer, \"The End of the Game\" was released along with an announcement that the album would be released on May 15, 2020. The announcement coincided with the revelation of the Hella Mega Tour, a 2020 concert tour featuring Weezer, Green Day, and Fall Out Boy. On May 6, 2020, the second single \"Hero\" was released onto streaming services; while Weezer announced that the album release would be delayed due to the COVID-19 pandemic, stating that despite this fans would receive \"surprises\" within the next week. A short snippet of \"Blue Dream\" debuted on The Simpsons episode \"The Hateful Eight-Year-Olds\", on which Weezer guest starred as themselves. On August 14, 2020, the band announced that the album had been delayed to May 2021 in order to coincide with the rescheduled Hella Mega Tour. That same day, the third single, \"Beginning of the End\" was released as a part of the soundtrack for Bill & Ted Face the Music. \n\nOn October 6, 2020, after Eddie Van Halen died, the album was dedicated to him. The track listing was announced on April 20, 2021, and the fourth single, \"I Need Some of That\" was released the following day.\n\nVan Weezer was released just three-and-a-half months after its predecessor OK Human.\n\nVan Weezer received generally favorable reviews from music critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream publications, the album received an average score of 67 based on 17 reviews, indicating \"generally favorable reviews\". <a href=\"https://www.last.fm/music/Weezer/Van+Weezer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
            "published": "06 Jun 2021, 13:07",
            "summary": "Van Weezer is the fifteenth studio album by American rock band Weezer, released on May 7, 2021 by Crush Music and Atlantic Records. Featuring a classic rock and hard rock inspired sound, the album was announced in September 2019 with an original release date of May 2020, coinciding with announcement of the band's participation in the Hella Mega Tour alongside Green Day and Fall Out Boy. However, due to the COVID-19 pandemic, the tour was delayed indefinitely and Van Weezer's release was delayed until May 2021, almost four months after the release of the band's previous album OK Human. Four <a href=\"https://www.last.fm/music/Weezer/Van+Weezer\">Read more on Last.fm</a>."
          }
        }
      },
      "similar_artists": [],
      "tags": [
        "rock",
        "power pop",
        "alternative rock",
        "hard rock",
        "2021"
      ],
      "top_albums": [],
      "top_tracks": [],
      "url": "https://www.last.fm/music/Weezer/Van+Weezer",
      "wiki_content": "Van Weezer is the fifteenth studio album by American rock band Weezer, released on May 7, 2021 by Crush Music and Atlantic Records. Featuring a classic rock and hard rock inspired sound, the album was announced in September 2019 with an original release date of May 2020, coinciding with announcement of the band's participation in the Hella Mega Tour alongside Green Day and Fall Out Boy. However, due to the COVID-19 pandemic, the tour was delayed indefinitely and Van Weezer's release was delayed until May 2021, almost four months after the release of the band's previous album OK Human.\n\nFour singles were released ahead of the album's release; \"The End of the Game\", \"Hero\", \"Beginning of the End\" and \"I Need Some of That\". The album received generally positive reviews from critics. It debuted at number 22 on the US Billboard 200 chart with first week sales of 18,600. It reached its peaked at number 11 on the chart.\n\nIn February 2019, Weezer frontman Rivers Cuomo began working on new songs with a hard rock influence, in contrast to the pop rock and electropop sound that had been featured on the band's previous albums Pacific Daydream, the Teal Album, and the then-upcoming Black Album. In an interview that month with Entertainment Weekly, Cuomo mentioned that an album tentatively titled Van Weezer was in the works, and that it would take the band \"back to big guitars\". He remarked that when the band would perform \"Beverly Hills\" live in concert, he would perform a guitar solo that was not present on the recorded version of the song. \"We noticed that, recently, the crowd just goes crazy when I do that. So it feels like maybe the audience is ready for some shredding again.\"\n\nThe album has been compared to their fourth studio album Maladroit (2002), and is inspired by 1970s and 1980s hard rock and heavy metal bands such as Kiss, Black Sabbath, Metallica and Van Halen (the last of whom inspired the album's title). Cuomo would also state that the album is \"Blue Album-ish, but a little more riffy.\"\n\nOn September 10, 2019, the first single from Van Weezer, \"The End of the Game\" was released along with an announcement that the album would be released on May 15, 2020. The announcement coincided with the revelation of the Hella Mega Tour, a 2020 concert tour featuring Weezer, Green Day, and Fall Out Boy. On May 6, 2020, the second single \"Hero\" was released onto streaming services; while Weezer announced that the album release would be delayed due to the COVID-19 pandemic, stating that despite this fans would receive \"surprises\" within the next week. A short snippet of \"Blue Dream\" debuted on The Simpsons episode \"The Hateful Eight-Year-Olds\", on which Weezer guest starred as themselves. On August 14, 2020, the band announced that the album had been delayed to May 2021 in order to coincide with the rescheduled Hella Mega Tour. That same day, the third single, \"Beginning of the End\" was released as a part of the soundtrack for Bill & Ted Face the Music. \n\nOn October 6, 2020, after Eddie Van Halen died, the album was dedicated to him. The track listing was announced on April 20, 2021, and the fourth single, \"I Need Some of That\" was released the following day.\n\nVan Weezer was released just three-and-a-half months after its predecessor OK Human.\n\nVan Weezer received generally favorable reviews from music critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream publications, the album received an average score of 67 based on 17 reviews, indicating \"generally favorable reviews\". <a href=\"https://www.last.fm/music/Weezer/Van+Weezer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wiki_summary": "Van Weezer is the fifteenth studio album by American rock band Weezer, released on May 7, 2021 by Crush Music and Atlantic Records. Featuring a classic rock and hard rock inspired sound, the album was announced in September 2019 with an original release date of May 2020, coinciding with announcement of the band's participation in the Hella Mega Tour alongside Green Day and Fall Out Boy. However, due to the COVID-19 pandemic, the tour was delayed indefinitely and Van Weezer's release was delayed until May 2021, almost four months after the release of the band's previous album OK Human. Four <a href=\"https://www.last.fm/music/Weezer/Van+Weezer\">Read more on Last.fm</a>."
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "under exclusive license to Crush Music / Atlantic Recording Corporation, © 2021 Weezer",
          "type": "C"
        },
        {
          "text": "under exclusive license to Crush Music / Atlantic Recording Corporation, ℗ 2021 Weezer",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "075679784377"
      },
      "id": "4QIZtPbEAQTu1smtYyDHXz",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b2738ee3e0ea4b258f7ad5b6499c",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e028ee3e0ea4b258f7ad5b6499c",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d000048518ee3e0ea4b258f7ad5b6499c",
          "width": 64
        }
      ],
      "label": "Crush Music/Atlantic",
      "popularity": 43,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
            },
            "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
            "id": "3jOstUTkEu2JkjvRdBA5Gu",
            "name": "Weezer",
            "type": "artist",
            "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
          }
        ],
        "copyrights": [
          {
            "text": "under exclusive license to Crush Music / Atlantic Recording Corporation, © 2021 Weezer",
            "type": "C"
          },
          {
            "text": "under exclusive license to Crush Music / Atlantic Recording Corporation, ℗ 2021 Weezer",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "075679784377"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/4QIZtPbEAQTu1smtYyDHXz"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/4QIZtPbEAQTu1smtYyDHXz?market=US",
        "id": "4QIZtPbEAQTu1smtYyDHXz",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b2738ee3e0ea4b258f7ad5b6499c",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e028ee3e0ea4b258f7ad5b6499c",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d000048518ee3e0ea4b258f7ad5b6499c",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "Crush Music/Atlantic",
        "name": "Van Weezer",
        "popularity": 43,
        "release_date": "2021-05-07",
        "release_date_precision": "day",
        "total_tracks": 10,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/4QIZtPbEAQTu1smtYyDHXz/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 236346,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5AprQMAX0PtpG923NUgZN6"
              },
              "href": "https://api.spotify.com/v1/tracks/5AprQMAX0PtpG923NUgZN6",
              "id": "5AprQMAX0PtpG923NUgZN6",
              "is_local": false,
              "is_playable": true,
              "name": "Hero",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:5AprQMAX0PtpG923NUgZN6"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 164253,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5jbF98Etpr6mBTwEZ5efyW"
              },
              "href": "https://api.spotify.com/v1/tracks/5jbF98Etpr6mBTwEZ5efyW",
              "id": "5jbF98Etpr6mBTwEZ5efyW",
              "is_local": false,
              "is_playable": true,
              "name": "All the Good Ones",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:5jbF98Etpr6mBTwEZ5efyW"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 181706,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5U6oyWNi4UztMFktgujaea"
              },
              "href": "https://api.spotify.com/v1/tracks/5U6oyWNi4UztMFktgujaea",
              "id": "5U6oyWNi4UztMFktgujaea",
              "is_local": false,
              "is_playable": true,
              "name": "The End of the Game",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:5U6oyWNi4UztMFktgujaea"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 199666,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1fDFIckfX373VPKvpIzFAl"
              },
              "href": "https://api.spotify.com/v1/tracks/1fDFIckfX373VPKvpIzFAl",
              "id": "1fDFIckfX373VPKvpIzFAl",
              "is_local": false,
              "is_playable": true,
              "name": "I Need Some of That",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:1fDFIckfX373VPKvpIzFAl"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 195466,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7bFi3zxYEvIPgGvcK7FmEI"
              },
              "href": "https://api.spotify.com/v1/tracks/7bFi3zxYEvIPgGvcK7FmEI",
              "id": "7bFi3zxYEvIPgGvcK7FmEI",
              "is_local": false,
              "is_playable": true,
              "name": "Beginning of the End",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:7bFi3zxYEvIPgGvcK7FmEI"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 170186,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/113AASAeW22mgmvpsnDItE"
              },
              "href": "https://api.spotify.com/v1/tracks/113AASAeW22mgmvpsnDItE",
              "id": "113AASAeW22mgmvpsnDItE",
              "is_local": false,
              "is_playable": true,
              "name": "Blue Dream",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:113AASAeW22mgmvpsnDItE"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 185680,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/29s8uc1ZOR3yAWCA2O1mR4"
              },
              "href": "https://api.spotify.com/v1/tracks/29s8uc1ZOR3yAWCA2O1mR4",
              "id": "29s8uc1ZOR3yAWCA2O1mR4",
              "is_local": false,
              "is_playable": true,
              "name": "1 More Hit",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:29s8uc1ZOR3yAWCA2O1mR4"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 177733,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5gRmklK2jRKvtZDza9h2pS"
              },
              "href": "https://api.spotify.com/v1/tracks/5gRmklK2jRKvtZDza9h2pS",
              "id": "5gRmklK2jRKvtZDza9h2pS",
              "is_local": false,
              "is_playable": true,
              "name": "Sheila Can Do It",
              "preview_url": null,
              "track_number": 8,
              "type": "track",
              "uri": "spotify:track:5gRmklK2jRKvtZDza9h2pS"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 172120,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/56uVz029OKaETe2mOItQXy"
              },
              "href": "https://api.spotify.com/v1/tracks/56uVz029OKaETe2mOItQXy",
              "id": "56uVz029OKaETe2mOItQXy",
              "is_local": false,
              "is_playable": true,
              "name": "She Needs Me",
              "preview_url": null,
              "track_number": 9,
              "type": "track",
              "uri": "spotify:track:56uVz029OKaETe2mOItQXy"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3jOstUTkEu2JkjvRdBA5Gu"
                  },
                  "href": "https://api.spotify.com/v1/artists/3jOstUTkEu2JkjvRdBA5Gu",
                  "id": "3jOstUTkEu2JkjvRdBA5Gu",
                  "name": "Weezer",
                  "type": "artist",
                  "uri": "spotify:artist:3jOstUTkEu2JkjvRdBA5Gu"
                }
              ],
              "disc_number": 1,
              "duration_ms": 170613,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2l93yFy5Rb7egNz9yzdNIt"
              },
              "href": "https://api.spotify.com/v1/tracks/2l93yFy5Rb7egNz9yzdNIt",
              "id": "2l93yFy5Rb7egNz9yzdNIt",
              "is_local": false,
              "is_playable": true,
              "name": "Precious Metal Girl",
              "preview_url": null,
              "track_number": 10,
              "type": "track",
              "uri": "spotify:track:2l93yFy5Rb7egNz9yzdNIt"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 10
        },
        "type": "album",
        "uri": "spotify:album:4QIZtPbEAQTu1smtYyDHXz"
      },
      "release_date": "2021-05-07",
      "release_date_precision": "day",
      "total_tracks": 10,
      "tracks": [
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 236346,
          "explicit": false,
          "id": "5AprQMAX0PtpG923NUgZN6",
          "name": "Hero",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 164253,
          "explicit": false,
          "id": "5jbF98Etpr6mBTwEZ5efyW",
          "name": "All the Good Ones",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 181706,
          "explicit": false,
          "id": "5U6oyWNi4UztMFktgujaea",
          "name": "The End of the Game",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 199666,
          "explicit": false,
          "id": "1fDFIckfX373VPKvpIzFAl",
          "name": "I Need Some of That",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 195466,
          "explicit": false,
          "id": "7bFi3zxYEvIPgGvcK7FmEI",
          "name": "Beginning of the End",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 170186,
          "explicit": false,
          "id": "113AASAeW22mgmvpsnDItE",
          "name": "Blue Dream",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 185680,
          "explicit": false,
          "id": "29s8uc1ZOR3yAWCA2O1mR4",
          "name": "1 More Hit",
          "preview_url": null,
          "track_number": 7
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 177733,
          "explicit": false,
          "id": "5gRmklK2jRKvtZDza9h2pS",
          "name": "Sheila Can Do It",
          "preview_url": null,
          "track_number": 8
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 172120,
          "explicit": false,
          "id": "56uVz029OKaETe2mOItQXy",
          "name": "She Needs Me",
          "preview_url": null,
          "track_number": 9
        },
        {
          "artists": [
            {
              "id": "3jOstUTkEu2JkjvRdBA5Gu",
              "name": "Weezer"
            }
          ],
          "duration_ms": 170613,
          "explicit": false,
          "id": "2l93yFy5Rb7egNz9yzdNIt",
          "name": "Precious Metal Girl",
          "preview_url": null,
          "track_number": 10
        }
      ],
      "url": "https://open.spotify.com/album/4QIZtPbEAQTu1smtYyDHXz"
    }
  },
  "spotify_id": "4QIZtPbEAQTu1smtYyDHXz",
  "spotify_url": "https://open.spotify.com/album/4QIZtPbEAQTu1smtYyDHXz",
  "styles": [
    "Alternative Rock"
  ],
  "title": "Van Weezer",
  "tracklist": [
    {
      "artists": [],
      "duration": "3:56",
      "position": "A1",
      "title": "Hero"
    },
    {
      "artists": [],
      "duration": "2:44",
      "position": "A2",
      "title": "All The Good Ones"
    },
    {
      "artists": [],
      "duration": "3:01",
      "position": "A3",
      "title": "The End Of The Game"
    },
    {
      "artists": [],
      "duration": "3:19",
      "position": "A4",
      "title": "I Need Some Of That"
    },
    {
      "artists": [],
      "duration": "3:15",
      "position": "A5",
      "title": "Beginning Of The End"
    },
    {
      "artists": [],
      "duration": "2:50",
      "position": "B1",
      "title": "Blue Dream"
    },
    {
      "artists": [],
      "duration": "3:05",
      "position": "B2",
      "title": "1 More Hit"
    },
    {
      "artists": [],
      "duration": "2:57",
      "position": "B3",
      "title": "Sheila Can Do It"
    },
    {
      "artists": [],
      "duration": "2:52",
      "position": "B4",
      "title": "She Needs Me"
    },
    {
      "artists": [],
      "duration": "2:50",
      "position": "B5a",
      "title": "Precious Metal Girl"
    },
    {
      "artists": [],
      "duration": "1:00",
      "position": "B5b",
      "title": "[Non Audio]"
    },
    {
      "artists": [],
      "duration": "3:23",
      "position": "B6a",
      "title": "I've Thrown It All Away"
    },
    {
      "artists": [],
      "duration": "0:56",
      "position": "B6b",
      "title": "I Need Some Of That [Reprise]"
    }
  ],
  "updated_at": "2025-07-05T15:53:25.941008",
  "year": 2021
}