{
  "apple_music_id": "489758",
  "apple_music_url": "https://music.apple.com/gb/artist/dr-hook/489758",
  "biography": "Dr. Hook & the Medicine Show was an American rock band formed in Union City, New Jersey, USA in 1968. They enjoyed considerable commercial success in the 1970s with hit singles including \"Sylvia's Mother\", \"The Cover of 'Rolling Stone'\" (both 1972), \"Only Sixteen\" (1975), \"A Little Bit More\" (1976), \"Sharing the Night Together\" (1978), \"When You're in Love with a Beautiful Woman\" (1979), \"Better Love Next Time\" (1979), and \"Sexy Eyes\" (1980). In addition to their own material, Dr. Hook and the Medicine Show performed songs written by the poet Shel Silverstein.\n\nThe band had eight years of regular chart hits, in both the United States, where their music was played on top-40, easy listening, and country music outlets, and throughout the English-speaking world including the UK, Canada and South Africa. Their music spanned several genres, mostly novelty songs and acoustic ballads in their early years; their greatest success came with their later material, mostly consisting of disco-influenced soft rock, which the band recorded under the shortened name Dr. Hook.\n\nThe founding core of the band consisted of three Southerners, George Cummings, Ray Sawyer, (from Alabama) and Billy Francis, who had worked together in a band called The Chocolate Papers. They had played the South, up and down the East Coast, and into the Midwest before breaking up. Cummings, who moved to New Jersey with the plan of forming a new band, brought back Sawyer to rejoin him. They then took on future primary vocalist, New Jersey native Dennis Locorriere, at first as a bass player. Francis, who had returned south after the Chocolate Papers broke up, returned to be the new band's keyboardist.\n\nWhen told by a club owner that they needed a name to put on a poster in the window of his establishment, Cummings made a sign: \"Dr. Hook and the Medicine Show: Tonic for the Soul.\" The \"Hook\" name was inspired by Sawyer's eyepatch and a reference to Captain Hook of the Peter Pan fairy tale, although, humorously, because Captain Hook was neither a doctor nor wore an eyepatch. Ray Sawyer had lost his right eye in a near-fatal car crash in Oregon in 1967, and thereafter always wore an eyepatch. The eyepatch would mistakenly lead some people to believe that Sawyer was 'Dr. Hook'. When anyone asked the band which one of them was 'Dr Hook' they always directed everyone to the bus driver.\n\nThe band played for a few years in New Jersey, first with drummer Popeye Phillips (who had also been in The Chocolate Papers), who went on to be a session drummer on The Flying Burrito Brothers' first album, The Gilded Palace of Sin. Citing musical differences, Popeye returned home to his native Alabama, and was replaced by local drummer Joseph Olivier. When the band began recording their first album, Olivier left in order to spend more time with his family, and was replaced by session player, John \"Jay\" David, who was asked to join the band full-time in 1968.\n\nIn 1970, their demo tapes were heard by Ron Haffkine, musical director on the planned Herb Gardner movie, Who Is Harry Kellerman and Why Is He Saying Those Terrible Things About Me? The songs for the film were written by the cartoonist and poet/songwriter Shel Silverstein. Haffkine determined that Dr. Hook was the ideal group for the soundtrack. With the help of producer Haffkine, the group recorded two songs for the film: Locorriere sang the lead on both \"The Last Morning\", the movie's theme song, later re-recorded for their second album Sloppy Seconds, and \"Bunky and Lucille\", which the band can be seen performing in the film. The film, released in 1971 by National General Pictures, received mixed critical reviews and did only modestly at the box office, but it helped Dr. Hook and The Medicine Show secure their first recording contract.\n\nRon Haffkine arranged a meeting with Clive Davis, CBS Records described in Davis's autobiography. Drummer David used a wastepaper basket to keep the beat, and while Sawyer, Locorriere, and Cummings played and sang a few songs, Francis hopped up and danced on the mogul's desk. This meeting secured the band their first record deal. Subsequently, the band went on to international success over the next twelve years, with Haffkine as the group's manager, as well as producer of all the Dr. Hook recordings.\n\nSilverstein and Dr. Hook & the Medicine Show became a great combination. Haffkine, having a knack for picking songs, quickly became Dr. Hook’s #1 A&R man, as well as their producer and manager. Silverstein wrote all the songs for their self-titled debut album, released in 1972. Doctor Hook featured lead vocals, guitar, bass and harmonica by Locorriere, guitarist Cummings, and singer Sawyer, plus drummer David and singer/guitarist/keyboard player Billy Francis. The album sold over one million copies, and was awarded a gold disc by the RIAA on August 2, 1972. It has been released 20 times in the US, UK, Netherlands, Italy, Yugoslavia, Canada, Europe, Spain, and Greece.\n\nThe single \"Sylvia's Mother\", a subtle parody of teen-heartbreak weepers, flopped on first release, but with some more promotional muscle became the band's first million-seller, and hit the top five in the summer of 1972. Other titles on the album included \"Marie Lavaux\", \"Sing Me A Rainbow\", \"Hey Lady Godiva\", \"Four Years Older Than Me\", \"Kiss It Away\", \"Makin' It Natural\", \"I Call That True Love\", \"When She Cries\", \"Judy\", and \"Mama, I'll Sing One Song For You\".\n\nSilverstein continued to write songs for Dr. Hook, including their entire second album, Sloppy Seconds, now released 16 times in the US, Australia, UK, Netherlands, Europe, and Canada. It featured some of their most popular songs, including \"Freakin' at the Freaker's Ball\" and \"The Cover of Rolling Stone\". Other titles on the album were \"If I'd Only Come And Gone\", \"The Things I Didn't Say\", \"Carry Me Carrie\", \"Get My Rocks Off\", \"Last Mornin'\", \"I Can't Touch The Sun\", \"Queen Of The Silver Dollar\", \"Turn On The World\", and \"Stayin' Song\". The album was listed in the Billboard 200 in 1973. In 1972, the band added a full-time bassist, Jance Garfat, and another guitarist, Rik Elswit.\n\nThe band's second single, Silverstein’s \"The Cover of 'Rolling Stone'\" (1972) from Sloppy Seconds, was another million-selling disc, poking fun at the idea that a musician had \"made it\" if they had been pictured on the cover of Rolling Stone.\n\nHaffkine visited Jann Wenner, one of the founders of Rolling Stone, proclaiming \"I’ve just given you guys the best commercial for this rag that you’ll ever get.\" Wenner then sent Cameron Crowe (who later wrote and directed Jerry Maguire), then 16 years old, to interview the band for issue 131 (March 1973). Dr. Hook and the Medicine Show appeared on the cover, albeit in caricature rather than in a photograph.\n\nIn the United Kingdom, the BBC Radio network refused to play \"The Cover of 'Rolling Stone'\", because it considered doing so would be advertising a trademark name, which was against the BBC's policy (previously, the Kinks had to change \"Coca-Cola\" to \"Cherry Cola\" in their song \"Lola\" to get around the rule). CBS Records responded by setting up a phone line that would play the song to anyone willing to dial in, which helped build the buzz. The BBC only found itself able to play the song after some of its DJs edited themselves shouting the words \"Radio Times\" (at the time, a BBC-owned magazine) over \"Rolling Stone\".\n\nIn 1973, all was not well for Haffkine and Dr. Hook & The Medicine Show. The group had a difficult time meeting the high expectations created by Sloppy Seconds, and the result was Belly Up! which Huey noted \"was unfortunately prophetic\". Belly Up! included \"Acapulco Goldie\", \"Penicillin Penny\", \"Life Ain't Easy\", \"When Lily Was Queen\", \"Monterey Jack\", \"You Ain't Got The Right\", \"Put A Little Bit On Me\", \"Ballad Of....\", \"Roland The Roadie Gertrude The Groupie\", \"Come On In\", and \"The Wonderful Soup Stone\". The album was sold in the US, UK, Europe, and Canada. Dr. Hook was just as famed for their crazed stage antics, which ranged from surreal banter to impersonating their own opening acts, but it was the group's nonchalance about business matters that led to bankruptcy. \"If we were in the black when we finished a tour, we'd party into the red,\" says Locorriere. They were forced to file bankruptcy in 1974, although they continued to tour incessantly.\n\nThe Medicine Show's lineup changed a few more times over the years. When David left the group in 1973, he was replaced by John Wolters. The next to depart was founding band member Cummings, who left in 1975 due to personal and musical differences. The band did not initially replace him. When Elswit was diagnosed with cancer a couple of years later, the band added Bob \"Willard\" Henke (formerly of Goose Creek Symphony). Elswit recovered and returned to the lineup, but they kept Henke on as well for a while. When Henke left in 1980, they added Rod Smarr.\nIn 1974 Dr. Hook recorded an album that was to be titled Fried Face; it went unreleased and was never issued by Columbia.\n\nThe band shortened its name to Dr. Hook in 1975. They signed with Capitol Records in 1975, releasing the aptly titled album Bankrupt. Unlike previous projects, this album included original material written by the group. The hit from the project was a reworked version of Sam Cooke's \"Only Sixteen\" (US number 6), revitalizing their career and charted in the top ten in 1976. It was when Haffkine discovered a song called \"A Little Bit More\", written and originally performed by Bobby Gosh and released on his 1973 album Sitting in the Quiet, on a vinyl record costing 35 cents at a flea market in San Francisco, that things exploded for Dr. Hook. It charted at number 11 on the US Billboard Hot 100 and spent two weeks at number nine on the Cash Box Top 100. It also reached number two on the UK Singles Chart and was Dr. Hook's joint second-best UK chart placing, matching \"Sylvia's Mother\".\n\nFollow-ups to \"A Little Bit More\" included \"Sharing the Night Together\" (number 6), \"When You're in Love with a Beautiful Woman\" (number 6), \"Better Love Next Time\", and \"Sexy Eyes\" (number 5), which featured prominent female backup singers. Save for \"A Little Bit More\" (number 11), all the singles mentioned above were certified million-sellers. \"When You're in Love with a Beautiful Woman\" reached number 1 for several weeks in 1979 in the UK and they had another UK hit single with \"Better Love Next Time\" (number 12). Though the band toured constantly, they never managed to turn their success with singles into album sales.\n\nPleasure & Pain(1978) was Dr. Hook's first gold album. According to Steve Huey, of All Music Guide, it solidified their reputation as \"disco-tinged balladeers\". But Sawyer was increasingly upset at the commercial direction the group's sound was taking. The band had changed labels again, to Casablanca Records in 1980, but could not replicate earlier successes. In late 1980, Dr. Hook released \"Girls Can Get It\" (number 34) and had their final hit (which peaked at number 25) with \"Baby Makes Her Blue-Jeans Talk\" in 1982.\n\nRay Sawyer left in 1983 to pursue a solo career, while the band continued to tour successfully for another couple of years, ending with Dr. Hook's One and Only Farewell Tour in 1985, with Locorriere as the sole frontman.\n\nDennis Locorriere retained ownership of the Dr. Hook name. He released several solo albums and did concert tours under the names Voice of Dr. Hook and Dennis Locorriere Celebrates Dr. Hook Hits and History tour. In 2019 he will start the Dr Hook 50th Anniversary World Tour.\n\nFrom 1988 to 2015, Sawyer was granted a license to tour separately as \"Ray Sawyer of Dr. Hook\" or \"Dr. Hook featuring Ray Sawyer\" (joined for a time in 2001 by Billy Francis); Sawyer did not perform publicly after his last tour ended in October 2015. Sawyer died on 28 December 2018.\n\nMembers\n\nDennis Locorriere - vocals, guitar, bass, harmonica (1968-1985)\nRay Sawyer - vocals, guitar, percussion, congas, maracas (1967-1983, died 2018)\nBilly Francis - keyboards (1968-1985; died 2010)\nGeorge Cummings - lead and steel guitars, vocals (1968-1975)\nJohn \"Jay\" David - drums (1968-1973)\nRik Elswit - lead guitar (1972-1985)\nJance Garfat - bass (1972-1985; died 2006)\nJohn Wolters - drums (1973-1982, 1983-1985; died 1997)\nBob 'Willard' Henke - guitar (1976-1980)\nRod Smarr - guitar (1980-1985; died 2012)\nWalter Hartman - drums (1982-1983)\nLeonard Wolfe - keyboards (early 80s)\nJoseph Olivier - drums (1968)\n\nDiscography\n\nStudio and live albums\n(for the 1975 Bankrupt album the band name was shortened to Dr. Hook)\n\nYear\tAlbum\tPeak chart positions\nUS\tUS Country\tCAN\tUK\tDEN\n1971\tDoctor Hook\t45\t—\t38\t—\t5[6]\n1973\tSloppy Seconds\t41\t—\t16\t—\t—\n1973\tBelly Up!\t141\t—\t—\t—\t7[7]\n1974\tFried Face (Unreleased)\t—\t—\t—\t—\t—\n1975\tBankrupt\t141\t—\t—\t—\t2[8]\n1976\tA Little Bit More\t62\t18\t69\t5\t1[9]\n1977\tMakin' Love and Music\t—\t—\t—\t39\t—\n1978\tPleasure and Pain\t66\t17\t93\t47\t—\n1979\tSometimes You Win\t71\t—\t59\t14\t—\n1980\tRising\t175\t—\t—\t44\t—\n1981\tLive in the U.K. (US title: Dr. Hook Live)\t—\t—\t—\t90\t—\n1982\tPlayers in the Dark\t118\t—\t—\t—\t—\n1983\tLet Me Drink From Your Well\t—\t—\t—\t—\t—\n\nCompilation albums\nYear\tAlbum\tPeak chart positions\nUS\tAUS\tCAN\tUK\n1976\tDr. Hook Revisited\t—\t—\t—\t—\n1980\tGreatest Hits\t142\t—\t32\t2\n1984\tThe Rest of Dr. Hook\t—\t—\t—\t—\n1987\tGreatest Hits (And More)\t—\t2\t—\t—\n1992\tCompletely Hooked - The Best of Dr. Hook\t—\t—\t—\t3\n1995\tDr. Hook and the Medicine Show - Greatest Hits\t—\t—\t—\t—\n1996\tSharing the Night Together - The Best Of Dr. Hook\t—\t—\t—\t—\n1999\tLove Songs\t—\t—\t—\t8\n2007\tHits and History\t—\t—\t—\t14\n2007\tGreatest Hooks\t—\t—\t—\t—\n2014\tTimeless\t—\t36\t—\t9\n2016\tCollected\t—\t—\t—\t—\n\nSingles\nYear\tSingle\tPeak chart positions\tAlbum\nUS\tUS Country\tUS AC\tAUS\tCAN\tCAN Country\tCAN AC\tIRE\tNZ\tSA\tUK\n1971\t\"Last Morning\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\tWho Is Harry Kellerman And Why Is He Saying Those Terrible Things About Me?\n1972\t\"Sylvia's Mother\"\t5\t—\t—\t1\t2\t—\t—\t1\t1\t1\t2\tDr. Hook\n\"Carry Me Carrie\"\t71\t—\t—\t—\t82\t—\t—\t—\t—\t—\t—\tSloppy Seconds\n\"The Cover of Rolling Stone\"\t6\t—\t—\t32\t2\t—\t—\t—\t3\t—\n1973\t\"Roland the Roadie and Gertrude the Groupie\"\t83\t—\t—\t—\t74\t—\t—\t—\t—\t—\t—\tBelly Up!\n\"Life Ain't Easy\"\t68\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\n1974\t\"Cops And Robbers\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\tSingles Only\n\"The Ballad of Lucy Jordan\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\n1975\t\"The Stimu Dr. Hook\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\tPromo Only\n\"The Millionaire\"\t95\t—\t—\t8\t—\t—\t—\t—\t—\t—\t—\tBankrupt\n\"Everybody's Makin' It Big But Me\"\t—\t—\t—\t—\t—\t—\t—\t—\t36\t—\t—\n\"Only Sixteen\"\t6\t55\t14\t8\t3\t—\t9\t—\t—\t—\t—\n1976\t\"A Little Bit More\"\t11\t—\t15\t10\t4\t—\t6\t2\t13\t—\t2\tA Little Bit More\n\"A Couple More Years\"\t—\t51\t—\t—\t—\t—\t—\t—\t—\t—\t—\n\"If Not You\"\t55\t26\t21\t69\t56\t—\t9\t3\t—\t—\t5\n1977\t\"Walk Right In\"\t46\t92\t39\t1\t77\t—\t30\t—\t—\t—\t—\tMakin' Love and Music\n1978\t\"More Like the Movies\"\t—\t—\t—\t93\t—\t—\t—\t4\t—\t—\t14\tA Little Bit More\n\"Sharing the Night Together\"\t6\t50\t18\t10\t3\t40\t4\t—\t12\t—\t43\tPleasure and Pain\n1979\t\"All the Time in the World\"\t54\t82\t41\t—\t60\t64\t12\t—\t—\t—\t—\n\"When You're in Love with a Beautiful Woman\"\t6\t68\t5\t20\t4\t22\t7\t1\t2\t—\t1\n\"Better Love Next Time\"\t12\t91\t3\t24\t39\t—\t10\t6\t7\t—\t8\tSometimes You Win\n1980\t\"Sexy Eyes\"\t5\t—\t6\t41\t8\t—\t1\t3\t1\t20\t4\n\"Years From Now\"\t51\t—\t17\t72\t63\t—\t3\t—\t—\t—\t47\n\"Girls Can Get It\"\t34\t—\t—\t3\t—\t—\t—\t—\t—\t5\t40\tRising\n1981\t\"That Didn't Hurt Too Bad\"\t69\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\n\"Body Talking\"\t—\t—\t—\t—\t—\t—\t—\t—\t36\t—\t—\n\"The Wild Colonial Boy\"[10]\t—\t—\t—\t4\t—\t—\t—\t—\t—\t—\t—\tSingle Only [A]\n1982\t\"Baby Makes Her Blue Jeans Talk\" \t25\t—\t—\t11\t17\t—\t—\t—\t4\t1\t—\tPlayers in the Dark\n\"Loveline\"\t60\t—\t19\t—\t—\t—\t—\t—\t—\t—\t— <a href=\"https://www.last.fm/music/Dr.+Hook\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T15:25:46.366008",
  "discogs_id": "206325",
  "discogs_url": "https://www.discogs.com/artist/206325-Dr-Hook",
  "followers": 676706,
  "formed_date": null,
  "genres": [
    "Rock",
    "yacht rock",
    "classic rock",
    "70s",
    "rock",
    "soft rock",
    "oldies"
  ],
  "id": "dr.-hook-1751725548",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/12/47/38/1247389f-cdec-7c6e-ac2f-2f28f388f4b4/mzl.cxkhtidd.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 1000,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/db8117c5757ee73c402eda5dd52c29cdcc3cfbbd",
      "width": 1000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/1b2c27a5d31ff24a955cc557758d56b640cd030b",
      "width": 640
    },
    {
      "height": 200,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/8c7ec3169e8f2459c9ab889dc3548da1991363ba",
      "width": 200
    },
    {
      "height": 64,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/41d38f474cad96d0e8f98cfd015bb743b3bb22ca",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/5l1vrxWDE2wMsXE4loHT18G35AZKb5bS4ss5PoiPOQc/rs:fit/g:sm/q:90/h:600/w:384/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/NiupUKNLTAT-8HWTJcbQAcWN95ND6eaFa1AHjVN4p5Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "1c893468-37a9-4fb7-909f-929751a8ebed",
  "lastfm_url": "https://www.last.fm/music/Dr.+Hook",
  "local_images": {
    "hi-res": "../public/artist/dr-hook/dr-hook-hi-res.jpg",
    "medium": "../public/artist/dr-hook/dr-hook-medium.jpg",
    "small": "../public/artist/dr-hook/dr-hook-small.jpg"
  },
  "name": "Dr. Hook",
  "popularity": 62,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/12/47/38/1247389f-cdec-7c6e-ac2f-2f28f388f4b4/mzl.cxkhtidd.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "489758",
      "name": "Dr. Hook",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/dr-hook/489758"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/5l1vrxWDE2wMsXE4loHT18G35AZKb5bS4ss5PoiPOQc/rs:fit/g:sm/q:90/h:600/w:384/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "206325",
      "images": [
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/5l1vrxWDE2wMsXE4loHT18G35AZKb5bS4ss5PoiPOQc/rs:fit/g:sm/q:90/h:600/w:384/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/5l1vrxWDE2wMsXE4loHT18G35AZKb5bS4ss5PoiPOQc/rs:fit/g:sm/q:90/h:600/w:384/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/NiupUKNLTAT-8HWTJcbQAcWN95ND6eaFa1AHjVN4p5Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
          "width": 384
        },
        {
          "height": 159,
          "resource_url": "https://i.discogs.com/6oVwt2BAkG8iVBnAaAjs3X0Q_0AvcKxrSCiKwwC6CUI/rs:fit/g:sm/q:90/h:159/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMTEzNjcyOTI3/LmpwZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/6oVwt2BAkG8iVBnAaAjs3X0Q_0AvcKxrSCiKwwC6CUI/rs:fit/g:sm/q:90/h:159/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMTEzNjcyOTI3/LmpwZw.jpeg",
          "uri150": "https://i.discogs.com/U2HaYh6QSt7Rp46IttKAT_Ghah8ckic6Cg8n-sG4OWU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMTEzNjcyOTI3/LmpwZw.jpeg",
          "width": 240
        },
        {
          "height": 271,
          "resource_url": "https://i.discogs.com/RCnvPiLSYhs3Qgpcq6BZQ97JsnuaZar917QXJqb1Apk/rs:fit/g:sm/q:90/h:271/w:390/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjkwNjcwOTE4/LnBuZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/RCnvPiLSYhs3Qgpcq6BZQ97JsnuaZar917QXJqb1Apk/rs:fit/g:sm/q:90/h:271/w:390/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjkwNjcwOTE4/LnBuZw.jpeg",
          "uri150": "https://i.discogs.com/z8oyg8oZuKVgpBI00A9Zrrv3JwJ31jj5xkhzZlLSqoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjkwNjcwOTE4/LnBuZw.jpeg",
          "width": 390
        },
        {
          "height": 552,
          "resource_url": "https://i.discogs.com/ksJGHrjA5JVOCnzjfVy_3F4CzD0g9oczckT8bWM_ddo/rs:fit/g:sm/q:90/h:552/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzM3NzExNzg1/LTQ2NjguanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/ksJGHrjA5JVOCnzjfVy_3F4CzD0g9oczckT8bWM_ddo/rs:fit/g:sm/q:90/h:552/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzM3NzExNzg1/LTQ2NjguanBlZw.jpeg",
          "uri150": "https://i.discogs.com/3vOsf73zWwzWztx8upQzo25tL43Id3vgLMoxosqjvZk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzM3NzExNzg1/LTQ2NjguanBlZw.jpeg",
          "width": 450
        },
        {
          "height": 403,
          "resource_url": "https://i.discogs.com/1iLGLYE9cm2Lx5gnGHm-neG6gS_DkdKTRhgAQx4p7bw/rs:fit/g:sm/q:90/h:403/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzczMjMyMzY2/LTg5MTcuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/1iLGLYE9cm2Lx5gnGHm-neG6gS_DkdKTRhgAQx4p7bw/rs:fit/g:sm/q:90/h:403/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzczMjMyMzY2/LTg5MTcuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/JZpqHOj0h7U2O3DmrGRpdYxDPr2ZB0VewFYRAT39glY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzczMjMyMzY2/LTg5MTcuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 452,
          "resource_url": "https://i.discogs.com/M_f1cxSnY-iWE4YG-1t8-xDhK_IImv8eacMX3mwvgBo/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc0NjEy/LTI1NDcuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/M_f1cxSnY-iWE4YG-1t8-xDhK_IImv8eacMX3mwvgBo/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc0NjEy/LTI1NDcuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/sy_7fzPe_MrxlKeKzIAS3Gq02q_a71Mtjl0uZMxh0p8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc0NjEy/LTI1NDcuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 518,
          "resource_url": "https://i.discogs.com/BugVK_Lw3QZSWrbrtuRVZ9ZXLfa7Ussdi-cHGX8uwsI/rs:fit/g:sm/q:90/h:518/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc1MTYy/LTM3MzAuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/BugVK_Lw3QZSWrbrtuRVZ9ZXLfa7Ussdi-cHGX8uwsI/rs:fit/g:sm/q:90/h:518/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc1MTYy/LTM3MzAuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/7MGzTi2dgn50pASJyqRVg9E1qG83AHs_YzXXqrYcAao/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc1MTYy/LTM3MzAuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 419,
          "resource_url": "https://i.discogs.com/EscuyKd-kflFvDovuscPZSplHyNAxavcSOIiyHBBxpE/rs:fit/g:sm/q:90/h:419/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNjM5NTIxMTU4/LTczNDEuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/EscuyKd-kflFvDovuscPZSplHyNAxavcSOIiyHBBxpE/rs:fit/g:sm/q:90/h:419/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNjM5NTIxMTU4/LTczNDEuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/baJprzzA-3vtUurdyrsTb5qF-NOtPG07W3-ExpsCzY8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNjM5NTIxMTU4/LTczNDEuanBlZw.jpeg",
          "width": 600
        }
      ],
      "members": [
        {
          "active": true,
          "id": 305379,
          "name": "Rik Elswit",
          "resource_url": "https://api.discogs.com/artists/305379",
          "thumbnail_url": "https://i.discogs.com/-V-1Ux8KazY_dJfl9K2Wd3u1v7nWk7q2KwR5XGo-NrM/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTM3/OS0xNDM4NDE3NDc3/LTE4NTQuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 572874,
          "name": "Rod Smarr",
          "resource_url": "https://api.discogs.com/artists/572874",
          "thumbnail_url": "https://i.discogs.com/iyi3NjrmsKExx2il2BLctHm4E0zdgDPc682MmELWZ58/rs:fit/g:sm/q:40/h:320/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU3Mjg3/NC0xNDM4NDE3NTcz/LTYzNzQuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 641236,
          "name": "Jance Garfat",
          "resource_url": "https://api.discogs.com/artists/641236",
          "thumbnail_url": "https://i.discogs.com/aBk-X7KN2oVaESQuTmSkeLmezWOcUpkRs0-XNY1wGiU/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTIz/Ni0xNDM4NDE3MzQ1/LTc0NjEuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 641237,
          "name": "John Wolters",
          "resource_url": "https://api.discogs.com/artists/641237",
          "thumbnail_url": "https://i.discogs.com/xFY-c0PrCZEGTigAUwcBG1jdPQIIPGqBNYBUizokGqA/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTIz/Ny0xNDM4NDE3NDA1/LTIzMjQuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 641240,
          "name": "Dennis Locorriere",
          "resource_url": "https://api.discogs.com/artists/641240",
          "thumbnail_url": "https://i.discogs.com/aWpxther0pXVqZylVNsXMqri6YtTFlH3DW1NLmrlA6Q/rs:fit/g:sm/q:40/h:376/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTI0/MC0xMzAyMDM3NTQx/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 641243,
          "name": "Billy Francis",
          "resource_url": "https://api.discogs.com/artists/641243",
          "thumbnail_url": "https://i.discogs.com/ancuPMfOy5bA3dpFBEIx3uyiOZ0gsEOxMfid736u-Yw/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTI0/My0xNDM4NDE2OTMz/LTYxNjMuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 641247,
          "name": "Ray Sawyer",
          "resource_url": "https://api.discogs.com/artists/641247",
          "thumbnail_url": "https://i.discogs.com/tn_BXfrY01HWWAu6oEM9ItBK-zaeW3OCBr32lJH5YGM/rs:fit/g:sm/q:40/h:610/w:568/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTI0/Ny0xNTQ2Mjk5Mzk3/LTgwMzUuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 904947,
          "name": "Bob Henke",
          "resource_url": "https://api.discogs.com/artists/904947",
          "thumbnail_url": "https://i.discogs.com/kFw-hvfKLp7TeuPppsHar5fBqj1YpSCD-zdNJA26rPA/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkwNDk0/Ny0xNDM4NDE3MDA2/LTIwMDcuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 1061278,
          "name": "George Cummings",
          "resource_url": "https://api.discogs.com/artists/1061278",
          "thumbnail_url": "https://i.discogs.com/B_spfFizYlSnci6NXYvPw9KLCHMuAcvXQbKFVfY0Jpo/rs:fit/g:sm/q:40/h:640/w:497/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwNjEy/NzgtMTQ1NDA2MDA0/MS0yOTkzLmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 1131575,
          "name": "Keith Austin",
          "resource_url": "https://api.discogs.com/artists/1131575",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 3291865,
          "name": "Morgan Thaxton",
          "resource_url": "https://api.discogs.com/artists/3291865",
          "thumbnail_url": "https://i.discogs.com/28y2hFJlmhM5rBorjGcELbsD011N2R9qh2yY2MtvdgQ/rs:fit/g:sm/q:40/h:721/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyOTE4/NjUtMTY5MDc0ODc5/OC00MjYzLnBuZw.jpeg"
        }
      ],
      "name": "Dr. Hook",
      "namevariations": [
        "DR. Hook",
        "Doctor Hook",
        "Dr Hook",
        "Dr.Hook",
        "DrHook",
        "닥터 훅"
      ],
      "profile": "Formed 1968 in New Jersey as [a636855]. Their name was shortened in 1975 to Dr. Hook, disbanded in 1985.",
      "raw_data": {
        "aliases": [
          {
            "id": 636855,
            "name": "Dr. Hook & The Medicine Show",
            "resource_url": "https://api.discogs.com/artists/636855",
            "thumbnail_url": "https://i.discogs.com/u30vVdGjVfk6GNTWd2Vatli0M7q8riZYqQgZZbwHBwY/rs:fit/g:sm/q:40/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYzNjg1/NS0xNjYyMTIzOTkw/LTI0MDguanBlZw.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 206325,
        "images": [
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/5l1vrxWDE2wMsXE4loHT18G35AZKb5bS4ss5PoiPOQc/rs:fit/g:sm/q:90/h:600/w:384/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/5l1vrxWDE2wMsXE4loHT18G35AZKb5bS4ss5PoiPOQc/rs:fit/g:sm/q:90/h:600/w:384/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/NiupUKNLTAT-8HWTJcbQAcWN95ND6eaFa1AHjVN4p5Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
            "width": 384
          },
          {
            "height": 159,
            "resource_url": "https://i.discogs.com/6oVwt2BAkG8iVBnAaAjs3X0Q_0AvcKxrSCiKwwC6CUI/rs:fit/g:sm/q:90/h:159/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMTEzNjcyOTI3/LmpwZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/6oVwt2BAkG8iVBnAaAjs3X0Q_0AvcKxrSCiKwwC6CUI/rs:fit/g:sm/q:90/h:159/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMTEzNjcyOTI3/LmpwZw.jpeg",
            "uri150": "https://i.discogs.com/U2HaYh6QSt7Rp46IttKAT_Ghah8ckic6Cg8n-sG4OWU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMTEzNjcyOTI3/LmpwZw.jpeg",
            "width": 240
          },
          {
            "height": 271,
            "resource_url": "https://i.discogs.com/RCnvPiLSYhs3Qgpcq6BZQ97JsnuaZar917QXJqb1Apk/rs:fit/g:sm/q:90/h:271/w:390/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjkwNjcwOTE4/LnBuZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/RCnvPiLSYhs3Qgpcq6BZQ97JsnuaZar917QXJqb1Apk/rs:fit/g:sm/q:90/h:271/w:390/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjkwNjcwOTE4/LnBuZw.jpeg",
            "uri150": "https://i.discogs.com/z8oyg8oZuKVgpBI00A9Zrrv3JwJ31jj5xkhzZlLSqoY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjkwNjcwOTE4/LnBuZw.jpeg",
            "width": 390
          },
          {
            "height": 552,
            "resource_url": "https://i.discogs.com/ksJGHrjA5JVOCnzjfVy_3F4CzD0g9oczckT8bWM_ddo/rs:fit/g:sm/q:90/h:552/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzM3NzExNzg1/LTQ2NjguanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/ksJGHrjA5JVOCnzjfVy_3F4CzD0g9oczckT8bWM_ddo/rs:fit/g:sm/q:90/h:552/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzM3NzExNzg1/LTQ2NjguanBlZw.jpeg",
            "uri150": "https://i.discogs.com/3vOsf73zWwzWztx8upQzo25tL43Id3vgLMoxosqjvZk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzM3NzExNzg1/LTQ2NjguanBlZw.jpeg",
            "width": 450
          },
          {
            "height": 403,
            "resource_url": "https://i.discogs.com/1iLGLYE9cm2Lx5gnGHm-neG6gS_DkdKTRhgAQx4p7bw/rs:fit/g:sm/q:90/h:403/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzczMjMyMzY2/LTg5MTcuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/1iLGLYE9cm2Lx5gnGHm-neG6gS_DkdKTRhgAQx4p7bw/rs:fit/g:sm/q:90/h:403/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzczMjMyMzY2/LTg5MTcuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/JZpqHOj0h7U2O3DmrGRpdYxDPr2ZB0VewFYRAT39glY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMzczMjMyMzY2/LTg5MTcuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 452,
            "resource_url": "https://i.discogs.com/M_f1cxSnY-iWE4YG-1t8-xDhK_IImv8eacMX3mwvgBo/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc0NjEy/LTI1NDcuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/M_f1cxSnY-iWE4YG-1t8-xDhK_IImv8eacMX3mwvgBo/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc0NjEy/LTI1NDcuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/sy_7fzPe_MrxlKeKzIAS3Gq02q_a71Mtjl0uZMxh0p8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc0NjEy/LTI1NDcuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 518,
            "resource_url": "https://i.discogs.com/BugVK_Lw3QZSWrbrtuRVZ9ZXLfa7Ussdi-cHGX8uwsI/rs:fit/g:sm/q:90/h:518/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc1MTYy/LTM3MzAuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/BugVK_Lw3QZSWrbrtuRVZ9ZXLfa7Ussdi-cHGX8uwsI/rs:fit/g:sm/q:90/h:518/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc1MTYy/LTM3MzAuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/7MGzTi2dgn50pASJyqRVg9E1qG83AHs_YzXXqrYcAao/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNTcyMDc1MTYy/LTM3MzAuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 419,
            "resource_url": "https://i.discogs.com/EscuyKd-kflFvDovuscPZSplHyNAxavcSOIiyHBBxpE/rs:fit/g:sm/q:90/h:419/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNjM5NTIxMTU4/LTczNDEuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/EscuyKd-kflFvDovuscPZSplHyNAxavcSOIiyHBBxpE/rs:fit/g:sm/q:90/h:419/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNjM5NTIxMTU4/LTczNDEuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/baJprzzA-3vtUurdyrsTb5qF-NOtPG07W3-ExpsCzY8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xNjM5NTIxMTU4/LTczNDEuanBlZw.jpeg",
            "width": 600
          }
        ],
        "members": [
          {
            "active": true,
            "id": 305379,
            "name": "Rik Elswit",
            "resource_url": "https://api.discogs.com/artists/305379",
            "thumbnail_url": "https://i.discogs.com/-V-1Ux8KazY_dJfl9K2Wd3u1v7nWk7q2KwR5XGo-NrM/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTM3/OS0xNDM4NDE3NDc3/LTE4NTQuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 572874,
            "name": "Rod Smarr",
            "resource_url": "https://api.discogs.com/artists/572874",
            "thumbnail_url": "https://i.discogs.com/iyi3NjrmsKExx2il2BLctHm4E0zdgDPc682MmELWZ58/rs:fit/g:sm/q:40/h:320/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU3Mjg3/NC0xNDM4NDE3NTcz/LTYzNzQuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 641236,
            "name": "Jance Garfat",
            "resource_url": "https://api.discogs.com/artists/641236",
            "thumbnail_url": "https://i.discogs.com/aBk-X7KN2oVaESQuTmSkeLmezWOcUpkRs0-XNY1wGiU/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTIz/Ni0xNDM4NDE3MzQ1/LTc0NjEuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 641237,
            "name": "John Wolters",
            "resource_url": "https://api.discogs.com/artists/641237",
            "thumbnail_url": "https://i.discogs.com/xFY-c0PrCZEGTigAUwcBG1jdPQIIPGqBNYBUizokGqA/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTIz/Ny0xNDM4NDE3NDA1/LTIzMjQuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 641240,
            "name": "Dennis Locorriere",
            "resource_url": "https://api.discogs.com/artists/641240",
            "thumbnail_url": "https://i.discogs.com/aWpxther0pXVqZylVNsXMqri6YtTFlH3DW1NLmrlA6Q/rs:fit/g:sm/q:40/h:376/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTI0/MC0xMzAyMDM3NTQx/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 641243,
            "name": "Billy Francis",
            "resource_url": "https://api.discogs.com/artists/641243",
            "thumbnail_url": "https://i.discogs.com/ancuPMfOy5bA3dpFBEIx3uyiOZ0gsEOxMfid736u-Yw/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTI0/My0xNDM4NDE2OTMz/LTYxNjMuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 641247,
            "name": "Ray Sawyer",
            "resource_url": "https://api.discogs.com/artists/641247",
            "thumbnail_url": "https://i.discogs.com/tn_BXfrY01HWWAu6oEM9ItBK-zaeW3OCBr32lJH5YGM/rs:fit/g:sm/q:40/h:610/w:568/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0MTI0/Ny0xNTQ2Mjk5Mzk3/LTgwMzUuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 904947,
            "name": "Bob Henke",
            "resource_url": "https://api.discogs.com/artists/904947",
            "thumbnail_url": "https://i.discogs.com/kFw-hvfKLp7TeuPppsHar5fBqj1YpSCD-zdNJA26rPA/rs:fit/g:sm/q:40/h:237/w:178/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkwNDk0/Ny0xNDM4NDE3MDA2/LTIwMDcuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 1061278,
            "name": "George Cummings",
            "resource_url": "https://api.discogs.com/artists/1061278",
            "thumbnail_url": "https://i.discogs.com/B_spfFizYlSnci6NXYvPw9KLCHMuAcvXQbKFVfY0Jpo/rs:fit/g:sm/q:40/h:640/w:497/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwNjEy/NzgtMTQ1NDA2MDA0/MS0yOTkzLmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 1131575,
            "name": "Keith Austin",
            "resource_url": "https://api.discogs.com/artists/1131575",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 3291865,
            "name": "Morgan Thaxton",
            "resource_url": "https://api.discogs.com/artists/3291865",
            "thumbnail_url": "https://i.discogs.com/28y2hFJlmhM5rBorjGcELbsD011N2R9qh2yY2MtvdgQ/rs:fit/g:sm/q:40/h:721/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyOTE4/NjUtMTY5MDc0ODc5/OC00MjYzLnBuZw.jpeg"
          }
        ],
        "name": "Dr. Hook",
        "namevariations": [
          "DR. Hook",
          "Doctor Hook",
          "Dr Hook",
          "Dr.Hook",
          "DrHook",
          "닥터 훅"
        ],
        "profile": "Formed 1968 in New Jersey as [a636855]. Their name was shortened in 1975 to Dr. Hook, disbanded in 1985.",
        "releases_url": "https://api.discogs.com/artists/206325/releases",
        "resource_url": "https://api.discogs.com/artists/206325",
        "uri": "https://www.discogs.com/artist/206325-Dr-Hook",
        "urls": [
          "https://drhookofficial.com/",
          "https://www.facebook.com/DrHookOfficial",
          "https://twitter.com/DrHookOfficial",
          "https://twitter.com/TeamDrHook/",
          "https://www.instagram.com/drhookofficial/",
          "https://www.youtube.com/DrHookOfficial/",
          "https://www.last.fm/music/Dr.+Hook",
          "https://en.wikipedia.org/wiki/Dr._Hook_%26_the_Medicine_Show"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/206325",
      "thumb": "https://i.discogs.com/NiupUKNLTAT-8HWTJcbQAcWN95ND6eaFa1AHjVN4p5Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjMy/NS0xMjE0MzE1NTc4/LmpwZWc.jpeg",
      "url": "https://www.discogs.com/artist/206325-Dr-Hook",
      "urls": [
        "https://drhookofficial.com/",
        "https://www.facebook.com/DrHookOfficial",
        "https://twitter.com/DrHookOfficial",
        "https://twitter.com/TeamDrHook/",
        "https://www.instagram.com/drhookofficial/",
        "https://www.youtube.com/DrHookOfficial/",
        "https://www.last.fm/music/Dr.+Hook",
        "https://en.wikipedia.org/wiki/Dr._Hook_%26_the_Medicine_Show"
      ]
    },
    "lastfm": {
      "bio_content": "Dr. Hook & the Medicine Show was an American rock band formed in Union City, New Jersey, USA in 1968. They enjoyed considerable commercial success in the 1970s with hit singles including \"Sylvia's Mother\", \"The Cover of 'Rolling Stone'\" (both 1972), \"Only Sixteen\" (1975), \"A Little Bit More\" (1976), \"Sharing the Night Together\" (1978), \"When You're in Love with a Beautiful Woman\" (1979), \"Better Love Next Time\" (1979), and \"Sexy Eyes\" (1980). In addition to their own material, Dr. Hook and the Medicine Show performed songs written by the poet Shel Silverstein.\n\nThe band had eight years of regular chart hits, in both the United States, where their music was played on top-40, easy listening, and country music outlets, and throughout the English-speaking world including the UK, Canada and South Africa. Their music spanned several genres, mostly novelty songs and acoustic ballads in their early years; their greatest success came with their later material, mostly consisting of disco-influenced soft rock, which the band recorded under the shortened name Dr. Hook.\n\nThe founding core of the band consisted of three Southerners, George Cummings, Ray Sawyer, (from Alabama) and Billy Francis, who had worked together in a band called The Chocolate Papers. They had played the South, up and down the East Coast, and into the Midwest before breaking up. Cummings, who moved to New Jersey with the plan of forming a new band, brought back Sawyer to rejoin him. They then took on future primary vocalist, New Jersey native Dennis Locorriere, at first as a bass player. Francis, who had returned south after the Chocolate Papers broke up, returned to be the new band's keyboardist.\n\nWhen told by a club owner that they needed a name to put on a poster in the window of his establishment, Cummings made a sign: \"Dr. Hook and the Medicine Show: Tonic for the Soul.\" The \"Hook\" name was inspired by Sawyer's eyepatch and a reference to Captain Hook of the Peter Pan fairy tale, although, humorously, because Captain Hook was neither a doctor nor wore an eyepatch. Ray Sawyer had lost his right eye in a near-fatal car crash in Oregon in 1967, and thereafter always wore an eyepatch. The eyepatch would mistakenly lead some people to believe that Sawyer was 'Dr. Hook'. When anyone asked the band which one of them was 'Dr Hook' they always directed everyone to the bus driver.\n\nThe band played for a few years in New Jersey, first with drummer Popeye Phillips (who had also been in The Chocolate Papers), who went on to be a session drummer on The Flying Burrito Brothers' first album, The Gilded Palace of Sin. Citing musical differences, Popeye returned home to his native Alabama, and was replaced by local drummer Joseph Olivier. When the band began recording their first album, Olivier left in order to spend more time with his family, and was replaced by session player, John \"Jay\" David, who was asked to join the band full-time in 1968.\n\nIn 1970, their demo tapes were heard by Ron Haffkine, musical director on the planned Herb Gardner movie, Who Is Harry Kellerman and Why Is He Saying Those Terrible Things About Me? The songs for the film were written by the cartoonist and poet/songwriter Shel Silverstein. Haffkine determined that Dr. Hook was the ideal group for the soundtrack. With the help of producer Haffkine, the group recorded two songs for the film: Locorriere sang the lead on both \"The Last Morning\", the movie's theme song, later re-recorded for their second album Sloppy Seconds, and \"Bunky and Lucille\", which the band can be seen performing in the film. The film, released in 1971 by National General Pictures, received mixed critical reviews and did only modestly at the box office, but it helped Dr. Hook and The Medicine Show secure their first recording contract.\n\nRon Haffkine arranged a meeting with Clive Davis, CBS Records described in Davis's autobiography. Drummer David used a wastepaper basket to keep the beat, and while Sawyer, Locorriere, and Cummings played and sang a few songs, Francis hopped up and danced on the mogul's desk. This meeting secured the band their first record deal. Subsequently, the band went on to international success over the next twelve years, with Haffkine as the group's manager, as well as producer of all the Dr. Hook recordings.\n\nSilverstein and Dr. Hook & the Medicine Show became a great combination. Haffkine, having a knack for picking songs, quickly became Dr. Hook’s #1 A&R man, as well as their producer and manager. Silverstein wrote all the songs for their self-titled debut album, released in 1972. Doctor Hook featured lead vocals, guitar, bass and harmonica by Locorriere, guitarist Cummings, and singer Sawyer, plus drummer David and singer/guitarist/keyboard player Billy Francis. The album sold over one million copies, and was awarded a gold disc by the RIAA on August 2, 1972. It has been released 20 times in the US, UK, Netherlands, Italy, Yugoslavia, Canada, Europe, Spain, and Greece.\n\nThe single \"Sylvia's Mother\", a subtle parody of teen-heartbreak weepers, flopped on first release, but with some more promotional muscle became the band's first million-seller, and hit the top five in the summer of 1972. Other titles on the album included \"Marie Lavaux\", \"Sing Me A Rainbow\", \"Hey Lady Godiva\", \"Four Years Older Than Me\", \"Kiss It Away\", \"Makin' It Natural\", \"I Call That True Love\", \"When She Cries\", \"Judy\", and \"Mama, I'll Sing One Song For You\".\n\nSilverstein continued to write songs for Dr. Hook, including their entire second album, Sloppy Seconds, now released 16 times in the US, Australia, UK, Netherlands, Europe, and Canada. It featured some of their most popular songs, including \"Freakin' at the Freaker's Ball\" and \"The Cover of Rolling Stone\". Other titles on the album were \"If I'd Only Come And Gone\", \"The Things I Didn't Say\", \"Carry Me Carrie\", \"Get My Rocks Off\", \"Last Mornin'\", \"I Can't Touch The Sun\", \"Queen Of The Silver Dollar\", \"Turn On The World\", and \"Stayin' Song\". The album was listed in the Billboard 200 in 1973. In 1972, the band added a full-time bassist, Jance Garfat, and another guitarist, Rik Elswit.\n\nThe band's second single, Silverstein’s \"The Cover of 'Rolling Stone'\" (1972) from Sloppy Seconds, was another million-selling disc, poking fun at the idea that a musician had \"made it\" if they had been pictured on the cover of Rolling Stone.\n\nHaffkine visited Jann Wenner, one of the founders of Rolling Stone, proclaiming \"I’ve just given you guys the best commercial for this rag that you’ll ever get.\" Wenner then sent Cameron Crowe (who later wrote and directed Jerry Maguire), then 16 years old, to interview the band for issue 131 (March 1973). Dr. Hook and the Medicine Show appeared on the cover, albeit in caricature rather than in a photograph.\n\nIn the United Kingdom, the BBC Radio network refused to play \"The Cover of 'Rolling Stone'\", because it considered doing so would be advertising a trademark name, which was against the BBC's policy (previously, the Kinks had to change \"Coca-Cola\" to \"Cherry Cola\" in their song \"Lola\" to get around the rule). CBS Records responded by setting up a phone line that would play the song to anyone willing to dial in, which helped build the buzz. The BBC only found itself able to play the song after some of its DJs edited themselves shouting the words \"Radio Times\" (at the time, a BBC-owned magazine) over \"Rolling Stone\".\n\nIn 1973, all was not well for Haffkine and Dr. Hook & The Medicine Show. The group had a difficult time meeting the high expectations created by Sloppy Seconds, and the result was Belly Up! which Huey noted \"was unfortunately prophetic\". Belly Up! included \"Acapulco Goldie\", \"Penicillin Penny\", \"Life Ain't Easy\", \"When Lily Was Queen\", \"Monterey Jack\", \"You Ain't Got The Right\", \"Put A Little Bit On Me\", \"Ballad Of....\", \"Roland The Roadie Gertrude The Groupie\", \"Come On In\", and \"The Wonderful Soup Stone\". The album was sold in the US, UK, Europe, and Canada. Dr. Hook was just as famed for their crazed stage antics, which ranged from surreal banter to impersonating their own opening acts, but it was the group's nonchalance about business matters that led to bankruptcy. \"If we were in the black when we finished a tour, we'd party into the red,\" says Locorriere. They were forced to file bankruptcy in 1974, although they continued to tour incessantly.\n\nThe Medicine Show's lineup changed a few more times over the years. When David left the group in 1973, he was replaced by John Wolters. The next to depart was founding band member Cummings, who left in 1975 due to personal and musical differences. The band did not initially replace him. When Elswit was diagnosed with cancer a couple of years later, the band added Bob \"Willard\" Henke (formerly of Goose Creek Symphony). Elswit recovered and returned to the lineup, but they kept Henke on as well for a while. When Henke left in 1980, they added Rod Smarr.\nIn 1974 Dr. Hook recorded an album that was to be titled Fried Face; it went unreleased and was never issued by Columbia.\n\nThe band shortened its name to Dr. Hook in 1975. They signed with Capitol Records in 1975, releasing the aptly titled album Bankrupt. Unlike previous projects, this album included original material written by the group. The hit from the project was a reworked version of Sam Cooke's \"Only Sixteen\" (US number 6), revitalizing their career and charted in the top ten in 1976. It was when Haffkine discovered a song called \"A Little Bit More\", written and originally performed by Bobby Gosh and released on his 1973 album Sitting in the Quiet, on a vinyl record costing 35 cents at a flea market in San Francisco, that things exploded for Dr. Hook. It charted at number 11 on the US Billboard Hot 100 and spent two weeks at number nine on the Cash Box Top 100. It also reached number two on the UK Singles Chart and was Dr. Hook's joint second-best UK chart placing, matching \"Sylvia's Mother\".\n\nFollow-ups to \"A Little Bit More\" included \"Sharing the Night Together\" (number 6), \"When You're in Love with a Beautiful Woman\" (number 6), \"Better Love Next Time\", and \"Sexy Eyes\" (number 5), which featured prominent female backup singers. Save for \"A Little Bit More\" (number 11), all the singles mentioned above were certified million-sellers. \"When You're in Love with a Beautiful Woman\" reached number 1 for several weeks in 1979 in the UK and they had another UK hit single with \"Better Love Next Time\" (number 12). Though the band toured constantly, they never managed to turn their success with singles into album sales.\n\nPleasure & Pain(1978) was Dr. Hook's first gold album. According to Steve Huey, of All Music Guide, it solidified their reputation as \"disco-tinged balladeers\". But Sawyer was increasingly upset at the commercial direction the group's sound was taking. The band had changed labels again, to Casablanca Records in 1980, but could not replicate earlier successes. In late 1980, Dr. Hook released \"Girls Can Get It\" (number 34) and had their final hit (which peaked at number 25) with \"Baby Makes Her Blue-Jeans Talk\" in 1982.\n\nRay Sawyer left in 1983 to pursue a solo career, while the band continued to tour successfully for another couple of years, ending with Dr. Hook's One and Only Farewell Tour in 1985, with Locorriere as the sole frontman.\n\nDennis Locorriere retained ownership of the Dr. Hook name. He released several solo albums and did concert tours under the names Voice of Dr. Hook and Dennis Locorriere Celebrates Dr. Hook Hits and History tour. In 2019 he will start the Dr Hook 50th Anniversary World Tour.\n\nFrom 1988 to 2015, Sawyer was granted a license to tour separately as \"Ray Sawyer of Dr. Hook\" or \"Dr. Hook featuring Ray Sawyer\" (joined for a time in 2001 by Billy Francis); Sawyer did not perform publicly after his last tour ended in October 2015. Sawyer died on 28 December 2018.\n\nMembers\n\nDennis Locorriere - vocals, guitar, bass, harmonica (1968-1985)\nRay Sawyer - vocals, guitar, percussion, congas, maracas (1967-1983, died 2018)\nBilly Francis - keyboards (1968-1985; died 2010)\nGeorge Cummings - lead and steel guitars, vocals (1968-1975)\nJohn \"Jay\" David - drums (1968-1973)\nRik Elswit - lead guitar (1972-1985)\nJance Garfat - bass (1972-1985; died 2006)\nJohn Wolters - drums (1973-1982, 1983-1985; died 1997)\nBob 'Willard' Henke - guitar (1976-1980)\nRod Smarr - guitar (1980-1985; died 2012)\nWalter Hartman - drums (1982-1983)\nLeonard Wolfe - keyboards (early 80s)\nJoseph Olivier - drums (1968)\n\nDiscography\n\nStudio and live albums\n(for the 1975 Bankrupt album the band name was shortened to Dr. Hook)\n\nYear\tAlbum\tPeak chart positions\nUS\tUS Country\tCAN\tUK\tDEN\n1971\tDoctor Hook\t45\t—\t38\t—\t5[6]\n1973\tSloppy Seconds\t41\t—\t16\t—\t—\n1973\tBelly Up!\t141\t—\t—\t—\t7[7]\n1974\tFried Face (Unreleased)\t—\t—\t—\t—\t—\n1975\tBankrupt\t141\t—\t—\t—\t2[8]\n1976\tA Little Bit More\t62\t18\t69\t5\t1[9]\n1977\tMakin' Love and Music\t—\t—\t—\t39\t—\n1978\tPleasure and Pain\t66\t17\t93\t47\t—\n1979\tSometimes You Win\t71\t—\t59\t14\t—\n1980\tRising\t175\t—\t—\t44\t—\n1981\tLive in the U.K. (US title: Dr. Hook Live)\t—\t—\t—\t90\t—\n1982\tPlayers in the Dark\t118\t—\t—\t—\t—\n1983\tLet Me Drink From Your Well\t—\t—\t—\t—\t—\n\nCompilation albums\nYear\tAlbum\tPeak chart positions\nUS\tAUS\tCAN\tUK\n1976\tDr. Hook Revisited\t—\t—\t—\t—\n1980\tGreatest Hits\t142\t—\t32\t2\n1984\tThe Rest of Dr. Hook\t—\t—\t—\t—\n1987\tGreatest Hits (And More)\t—\t2\t—\t—\n1992\tCompletely Hooked - The Best of Dr. Hook\t—\t—\t—\t3\n1995\tDr. Hook and the Medicine Show - Greatest Hits\t—\t—\t—\t—\n1996\tSharing the Night Together - The Best Of Dr. Hook\t—\t—\t—\t—\n1999\tLove Songs\t—\t—\t—\t8\n2007\tHits and History\t—\t—\t—\t14\n2007\tGreatest Hooks\t—\t—\t—\t—\n2014\tTimeless\t—\t36\t—\t9\n2016\tCollected\t—\t—\t—\t—\n\nSingles\nYear\tSingle\tPeak chart positions\tAlbum\nUS\tUS Country\tUS AC\tAUS\tCAN\tCAN Country\tCAN AC\tIRE\tNZ\tSA\tUK\n1971\t\"Last Morning\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\tWho Is Harry Kellerman And Why Is He Saying Those Terrible Things About Me?\n1972\t\"Sylvia's Mother\"\t5\t—\t—\t1\t2\t—\t—\t1\t1\t1\t2\tDr. Hook\n\"Carry Me Carrie\"\t71\t—\t—\t—\t82\t—\t—\t—\t—\t—\t—\tSloppy Seconds\n\"The Cover of Rolling Stone\"\t6\t—\t—\t32\t2\t—\t—\t—\t3\t—\n1973\t\"Roland the Roadie and Gertrude the Groupie\"\t83\t—\t—\t—\t74\t—\t—\t—\t—\t—\t—\tBelly Up!\n\"Life Ain't Easy\"\t68\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\n1974\t\"Cops And Robbers\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\tSingles Only\n\"The Ballad of Lucy Jordan\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\n1975\t\"The Stimu Dr. Hook\"\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\tPromo Only\n\"The Millionaire\"\t95\t—\t—\t8\t—\t—\t—\t—\t—\t—\t—\tBankrupt\n\"Everybody's Makin' It Big But Me\"\t—\t—\t—\t—\t—\t—\t—\t—\t36\t—\t—\n\"Only Sixteen\"\t6\t55\t14\t8\t3\t—\t9\t—\t—\t—\t—\n1976\t\"A Little Bit More\"\t11\t—\t15\t10\t4\t—\t6\t2\t13\t—\t2\tA Little Bit More\n\"A Couple More Years\"\t—\t51\t—\t—\t—\t—\t—\t—\t—\t—\t—\n\"If Not You\"\t55\t26\t21\t69\t56\t—\t9\t3\t—\t—\t5\n1977\t\"Walk Right In\"\t46\t92\t39\t1\t77\t—\t30\t—\t—\t—\t—\tMakin' Love and Music\n1978\t\"More Like the Movies\"\t—\t—\t—\t93\t—\t—\t—\t4\t—\t—\t14\tA Little Bit More\n\"Sharing the Night Together\"\t6\t50\t18\t10\t3\t40\t4\t—\t12\t—\t43\tPleasure and Pain\n1979\t\"All the Time in the World\"\t54\t82\t41\t—\t60\t64\t12\t—\t—\t—\t—\n\"When You're in Love with a Beautiful Woman\"\t6\t68\t5\t20\t4\t22\t7\t1\t2\t—\t1\n\"Better Love Next Time\"\t12\t91\t3\t24\t39\t—\t10\t6\t7\t—\t8\tSometimes You Win\n1980\t\"Sexy Eyes\"\t5\t—\t6\t41\t8\t—\t1\t3\t1\t20\t4\n\"Years From Now\"\t51\t—\t17\t72\t63\t—\t3\t—\t—\t—\t47\n\"Girls Can Get It\"\t34\t—\t—\t3\t—\t—\t—\t—\t—\t5\t40\tRising\n1981\t\"That Didn't Hurt Too Bad\"\t69\t—\t—\t—\t—\t—\t—\t—\t—\t—\t—\n\"Body Talking\"\t—\t—\t—\t—\t—\t—\t—\t—\t36\t—\t—\n\"The Wild Colonial Boy\"[10]\t—\t—\t—\t4\t—\t—\t—\t—\t—\t—\t—\tSingle Only [A]\n1982\t\"Baby Makes Her Blue Jeans Talk\" \t25\t—\t—\t11\t17\t—\t—\t—\t4\t1\t—\tPlayers in the Dark\n\"Loveline\"\t60\t—\t19\t—\t—\t—\t—\t—\t—\t—\t— <a href=\"https://www.last.fm/music/Dr.+Hook\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Dr. Hook & the Medicine Show was an American rock band formed in Union City, New Jersey, USA in 1968. They enjoyed considerable commercial success in the 1970s with hit singles including \"Sylvia's Mother\", \"The Cover of 'Rolling Stone'\" (both 1972), \"Only Sixteen\" (1975), \"A Little Bit More\" (1976), \"Sharing the Night Together\" (1978), \"When You're in Love with a Beautiful Woman\" (1979), \"Better Love Next Time\" (1979), and \"Sexy Eyes\" (1980). In addition to their own material, Dr. <a href=\"https://www.last.fm/music/Dr.+Hook\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 450488,
      "mbid": "1c893468-37a9-4fb7-909f-929751a8ebed",
      "name": "Dr. Hook",
      "playcount": 3981433,
      "similar_artists": [
        {
          "name": "Orleans",
          "url": "https://www.last.fm/music/Orleans"
        },
        {
          "name": "Little River Band",
          "url": "https://www.last.fm/music/Little+River+Band"
        },
        {
          "name": "Firefall",
          "url": "https://www.last.fm/music/Firefall"
        },
        {
          "name": "Leo Sayer",
          "url": "https://www.last.fm/music/Leo+Sayer"
        },
        {
          "name": "Ambrosia",
          "url": "https://www.last.fm/music/Ambrosia"
        }
      ],
      "tags": [
        "classic rock",
        "70s",
        "rock",
        "soft rock",
        "oldies"
      ],
      "url": "https://www.last.fm/music/Dr.+Hook"
    },
    "spotify": {
      "followers": 676706,
      "genres": [
        "yacht rock"
      ],
      "id": "2Mhi3jfuRSdbVZPdjqsnnN",
      "images": [
        {
          "height": 1000,
          "url": "https://i.scdn.co/image/db8117c5757ee73c402eda5dd52c29cdcc3cfbbd",
          "width": 1000
        },
        {
          "height": 640,
          "url": "https://i.scdn.co/image/1b2c27a5d31ff24a955cc557758d56b640cd030b",
          "width": 640
        },
        {
          "height": 200,
          "url": "https://i.scdn.co/image/8c7ec3169e8f2459c9ab889dc3548da1991363ba",
          "width": 200
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/41d38f474cad96d0e8f98cfd015bb743b3bb22ca",
          "width": 64
        }
      ],
      "name": "Dr. Hook",
      "popularity": 62,
      "url": "https://open.spotify.com/artist/2Mhi3jfuRSdbVZPdjqsnnN"
    }
  },
  "spotify_id": "2Mhi3jfuRSdbVZPdjqsnnN",
  "spotify_url": "https://open.spotify.com/artist/2Mhi3jfuRSdbVZPdjqsnnN",
  "updated_at": "2025-07-08T09:53:17.607707",
  "wikipedia_url": null
}