{
  "apple_music_id": "45392916",
  "apple_music_url": "https://music.apple.com/gb/artist/sharon-jones-the-dap-kings/45392916",
  "biography": "Sharon Jones & the Dap-Kings, aka Sharon Jones and the Dap-Kings, are a funk/soul band, founded in Brooklyn, NY, USA (1996). They are signed to Daptone Records, where the Dap-Kings are the house band. They are widely thought to be spearheads of a revivalist movement that aims to capture the essence of funk/soul music as it was at its height in the mid-1960s to mid-1970s. Part of the way this is achieved is to shun modern digital recording methods in favour of using traditional analogue recording equipment. The type of instruments used by the band may also be considered limited to those that would have been available up until the mid seventies.\n\nSharon Jones was born Sheron Lafaye Jones, in Augusta, Georgia (4 May 1956).  Her mother moved to Brooklyn, soon thereafter, however Jones was sent down south for a few months every year to stay with her family.  As a child, she and her brothers would imitate the songs and dances of James Brown, who shared their home-town.  Like many rhythm and blues entertainers, she began performing in church at a very young age.  As a teenager in the early nineteen seventies, she began singing outside of the church in talent shows and with local funk groups.  Later she would make her living with a combination of sporadic session work as a mostly anonymous voice on various dance records (sometimes credited as Lafaye Jones), singing with wedding bands, and a handful of day jobs which included stints as both a prison guard at New York’s notorious Riker’s Island, and an armored car guard for Wells Fargo Bank.  In 1996 she was called in to sing back-up at a Desco Records studio session for 70’s soul legend Lee Fields.\n\nThe original incarnation of the band, the Soul Providers, were formed in the mid nineties by Philip Lehman and Gabriel Roth AKA Bosco Mann. The Soul Providers began recording an album consisting of James Brown inspired instrumentals and vocal collaborations with Deep Funk legend Lee Fields. It was during these sessions that Roth and Lehman discovered vocalist Sharon Jones after she recorded backing vocals for one of the Lee Fields tracks. They were impressed enough to record a solo track with Jones entitled \"Switchblade\", a track that had originally been intended for a man to record. This track along with another Jones solo, \"The Landlord\", were included on the Soul Providers debut release Soul Tequila, released circa 1996 on the French label Pure Records (defunct). Lehman and Roth then started a new label in Brooklyn, New York. Desco Records was born taking its name from Desco Vacuum, a vacuum cleaner store in West 41st Street underneath which they utilised the basement as studio space and an office to administer and distribute the label. Sugarman 3 organist Adam Scone just happened to live upstairs in the same building. The Soul Tequila album was then reissued as a vinyl only LP renamed Gimme The Paw. The record, which featured Lehman's pet dog Spike on the cover, only kept one of the Sharon Jones collaborations, \"Switchblade\", omitting \"The Landlord\".\n\nHaving established a scene in New York of performers, Desco aimed to showcase a stable of artists with revue style shows and concentrated on releasing vinyl 45 records by a number of artists including Sugarman 3, The Daktaris, The Mighty Imperials, Naomi Davis & The Knights of 41st Street, Lee Fields, Joseph Henry and Sharon Jones, who backed by the Soul Providers who had become the Desco house band, released three 45's on the label. Desco Records were gaining intrigue and reputation for quality amongst soul/funk collectors and enthusiasts. Many people who bought the early records were unsure that they were modern recordings as recording dates were deliberately omitted from the labels and were often marketed as being released in the 1970s. Two other Soul Providers albums were released, an instrumental soundtrack to a mysterious Sam Lung Kung-Fu film, The Revenge Of Mr Mopoji, credited to Mike Jackson And The Soul Providers and a Lee Fields solo album Let's Get A Groove On where the Soul Providers provided the backing.\n\nIn 2000, due to a growing difference of opinion, Lehman and Roth decided to go separate ways and both set up new labels. Philip Lehman set up Soul Fire Records (now defunct, the back catalogue is handled by Truth & Soul Records). Gabriel Roth went on to start Daptone Records with Sugarman 3 saxophonist Neal Sugarman. The Soul Providers split and a new band, the Dap-Kings formed. The band was consisted of label owners Roth AKA Bosco Mann on bass and Neal Sugarman on Saxophone, plus original Soul Providers: guitarist Binky Griptite, organist Earl Maxton, percussionist Fernando Velez and trumpeter Anda Szilagyi. Joining them were original members of the Mighty Imperials whose album, Thunder Chicken, was the last release on the Desco label: tenor saxophonist Leon Michels and drummer Homer Steinwess.\n\nHaving secured a summer residency at The Boite, a club in Barcelona, Spain, the band recorded an LP, Dap Dippin' with Sharon Jones and the Dap-Kings in 2001. A few hundred copies were pressed, so that sales during the residency would provide financial backing on what would have otherwise been a financially disastrous trip. With promotional copies reaching notable funk DJs and reviewers, the album gained a significant reputation and was officially released as the first LP and CD on Daptone Records in 2002 to universal acclaim amongst enthusiasts. \n\nAn exhausting schedule of international shows then followed to promote the album and it quickly became clear that promotion of Sharon Jones would be key to the success of the Daptone label. Whilst trying to build upon the revue style stable showcasing and trying to record other groups and artists on the label, other projects have to a certain extent been sidelined in favour of building on the success of Sharon Jones. Expected albums from Lee Fields and Naomi Davis have so far been victim to a lack of time, funds and energy a small independent label has. Neal Sugarman's own band Sugarman 3 who have themselves released several popular albums including one on the Daptone label, Pure Cane Sugar, have also been somewhat sidelined.\n\nFollowing the album, three 45's of note, not included on the album where also released. \"What If We all Stopped Paying Taxes\", released in 2002 just ahead of the U.S. Election, was a militant anti-war statement denouncing the Iraq War. \"Genuine (parts 1 & 2)\" in 2004 was an uncompromisingly hard funk record which firmly kept the interest of enthusiasts and their cover of \"Just Dropped In (To See What Condition My Condition Was In)\", released in 2005 but which was apparently recorded for a KFC commercial in 2002 but was never used.\n\nBy this time there were a few personnel changes, as organist Earl Maxton and trumpeter Anda Szilagyi officially became members of Antibalas, a New York based afrobeat band. Whilst Maxton was not replaced on organ, Trumpeter David Guy was recruited on trumpet. Also from the Budos Band, Thomas Brenneck, a second guitarist was added. In 2003 the Daptone Recording Studio, complete with a sixteen track analogue tape machine was open for business. It was originally intended to record two albums back-to-back to speed up the next release process. However during the final sessions of the first of these albums, Gabriel Roth suffered serious eye injuries in a car crash on his way home from the studio. This led to a break in the recording process and ultimately plans to limit the sessions to only one album. Their second LP and CD, Naturally, was then released in 2005. This album was a more broad based album than the first (which almost completely consisted of funk numbers) and included a mix of both soul and funk influences. The sleeve notes, written by Gabriel Roth, provided some insight into the vision behind the music, \"Somewhere between banging on logs and the invention of M.I.D.I. technology we have made a terrible wrong turn. We must have ridden right past our stop. We should have stepped down off the train at that moment when rhythm and harmony and technology all culminated to a single Otis Redding whine. That moment of the truest, most genuine expression of what it means to be human.\" The production and recording values of this album were also noticeably crisper than that of the first - attaining a sound similar to the kind of production standard achieved by James Brown at his height, rather than the slightly duller \"scratchy 45\" sound of the original album. With, again, international acclaim amongst enthusiasts and a steadily growing base of both fans and now imitators, the band embarked on more extensive international tours and promotion of the album.\n\nLeon Michels left the band soon after the release of Naturally to help start a new label Truth & Soul Records on the back of a solo LP that was originally intended to be released on Daptone, Sounding Out The City, credited to El Michels Affair. The label would also fill the void left when Philip Lehman closed the Soul Fire label and moved to the Bahamas, leaving the scene altogether. The back catalogue of Soul Fire would then be handled by Truth & Soul Records who, along with Soul Fire often used many of the same artists in their stable, such as Lee Fields, Homer Steinweiss and Thomas Brenneck but of whom Leon Michels had been the biggest collaborator. Michels replacement in the Dap-kings came as Ian Hendrickson-Smith, a local saxophone player who has released several jazz albums under his own name.\n\nThe Dap-Kings were then hired as session musicians on a number of projects associated with New York based DJ/producer/recording artist Mark Ronson. Most notable of these is their extensive inclusion and somewhat unheralded contribution to Amy Winehouse's album Back to Black (2006). Six of the album's eleven tracks feature various members of the Dap-Kings with two notable hits from the album, Rehab and You Know I'm No Good, extensively featuring the Dap-Kings. A further engineering credit goes to Gabriel Roth and several tracks recorded at Daptone Studios are mis-credited as \"Dapking Studios\". Again various members of the band feature on Ronson's second album, Version (2007), providing contributions on all but one of the album's fourteen tracks. The Dap-Kings then became the backing band used on Amy Winehouse's first U.S. tour. In 2007 the Dap-Kings worked with British singer Ben Westbeech to record a new version of his song \"So Good Today\"; it was released to mark the first anniversary of Brownswood recordings, the label Westbeech is signed to in the UK. Sharon Jones lends her vocals on one song \"The Way We Lived\", on Wax Tailor's second album \"Hope & Sorrow\", released in April 2007.\n\nIn late 2006, the band recorded a third studio album, entitled 100 Days, 100 Nights, it was released on 2007-10-02. A single, which is not included on the album, entitled \"I'm Not Gonna Cry\" was released in April 2007 and featured the same uncompromised funk style of the earlier single, \"Genuine\". <a href=\"https://www.last.fm/music/+noredirect/Sharon+Jones+&+The+Dap-Kings\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T14:35:08.805710",
  "discogs_id": "83816",
  "discogs_url": "https://www.discogs.com/artist/83816-Sharon-Jones-The-Dap-Kings",
  "followers": 310269,
  "formed_date": null,
  "genres": [
    "R&B/Soul",
    "retro soul",
    "soul",
    "funk",
    "rhythm and blues",
    "female vocalists",
    "seen live"
  ],
  "id": "sharon-jones-&-the-dap-kings-1751722509",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/1c/45/86/1c45863e-aa8d-b853-ba8c-61967cc3385c/mzl.tlzcniom.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 1000,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/cd0f5585d478bbb91cff3e0b723ed91c6d2046d7",
      "width": 1000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/2882183a98e1e3db187e81de77ca01980a7566c0",
      "width": 640
    },
    {
      "height": 200,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/294d9b05f873f5b86bdb77975b08d16939e5d053",
      "width": 200
    },
    {
      "height": 64,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/c42fa67786a9b2dfd0d4cbaabfd0a57b3f5a6736",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/cl3keWQjWUL5MoETDaxEHJqNtGi3aUrJflL6EaGoeZg/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/GSMLcMW2RreNKn3STrMyZ2vDdyRi9Wdu4080zIXvw9Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "8d50cd20-34f2-4abe-ba16-0759ee0fb9f5",
  "lastfm_url": "https://www.last.fm/music/+noredirect/Sharon+Jones+&+The+Dap-Kings",
  "local_images": {
    "hi-res": "../public/artist/sharon-jones-the-dap-kings/sharon-jones-the-dap-kings-hi-res.jpg",
    "medium": "../public/artist/sharon-jones-the-dap-kings/sharon-jones-the-dap-kings-medium.jpg",
    "small": "../public/artist/sharon-jones-the-dap-kings/sharon-jones-the-dap-kings-small.jpg"
  },
  "name": "Sharon Jones & The Dap-Kings",
  "popularity": 59,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/1c/45/86/1c45863e-aa8d-b853-ba8c-61967cc3385c/mzl.tlzcniom.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "R&B/Soul"
      ],
      "id": "45392916",
      "name": "Sharon Jones & The Dap-Kings",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/sharon-jones-the-dap-kings/45392916"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/cl3keWQjWUL5MoETDaxEHJqNtGi3aUrJflL6EaGoeZg/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "83816",
      "images": [
        {
          "height": 500,
          "resource_url": "https://i.discogs.com/cl3keWQjWUL5MoETDaxEHJqNtGi3aUrJflL6EaGoeZg/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/cl3keWQjWUL5MoETDaxEHJqNtGi3aUrJflL6EaGoeZg/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/GSMLcMW2RreNKn3STrMyZ2vDdyRi9Wdu4080zIXvw9Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
          "width": 500
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/87VKdT98nu_hA7mdDccPkSRTDuRjQmq2WRatnsI08L8/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NjYxMzM1Nzgt/NTgxMy5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/87VKdT98nu_hA7mdDccPkSRTDuRjQmq2WRatnsI08L8/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NjYxMzM1Nzgt/NTgxMy5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/FQ6BAA_NbvRRw_HkmZJa9PX0If_Cn0JJYm6eUmA4wWU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NjYxMzM1Nzgt/NTgxMy5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 540,
          "resource_url": "https://i.discogs.com/ZlQa_HTNEIcn-16srMa_kRxsX2isZGePprwe2PdqxMw/rs:fit/g:sm/q:90/h:540/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2MDE1MDUxMjEt/MzQxMy5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/ZlQa_HTNEIcn-16srMa_kRxsX2isZGePprwe2PdqxMw/rs:fit/g:sm/q:90/h:540/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2MDE1MDUxMjEt/MzQxMy5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/iYzwQKkMu25tem5eIFr9L6wJVhFnV3U5eh-AvJWrQpg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2MDE1MDUxMjEt/MzQxMy5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 331,
          "resource_url": "https://i.discogs.com/0Sk7rwa3TG2SnQyimcBLEAKeU1DRI5DuiRkkw41CTOU/rs:fit/g:sm/q:90/h:331/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTEyNzA0MTE1ODUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/0Sk7rwa3TG2SnQyimcBLEAKeU1DRI5DuiRkkw41CTOU/rs:fit/g:sm/q:90/h:331/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTEyNzA0MTE1ODUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/RAS6XzzsJZzajIL78E8EPLCMMgI8i9DqYbRwETyjXk0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTEyNzA0MTE1ODUu/anBlZw.jpeg",
          "width": 590
        },
        {
          "height": 225,
          "resource_url": "https://i.discogs.com/ylxwJIit-asl9ZewLws-N-nWRBkk3KXPzQPR6Ftay9c/rs:fit/g:sm/q:90/h:225/w:439/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTExOTQ0NzYwODAu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/ylxwJIit-asl9ZewLws-N-nWRBkk3KXPzQPR6Ftay9c/rs:fit/g:sm/q:90/h:225/w:439/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTExOTQ0NzYwODAu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/oT1teEdlLRZZ725WuhCQznuc-qgPiJUAJO-QmPIiulw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTExOTQ0NzYwODAu/anBlZw.jpeg",
          "width": 439
        },
        {
          "height": 339,
          "resource_url": "https://i.discogs.com/3WckknjHqMygpg5WVTjAZshxgCcSmQAVF8jP14ESJgI/rs:fit/g:sm/q:90/h:339/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NDM1MDQ4ODIt/NzQzMC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/3WckknjHqMygpg5WVTjAZshxgCcSmQAVF8jP14ESJgI/rs:fit/g:sm/q:90/h:339/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NDM1MDQ4ODIt/NzQzMC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/STh4BHnFluAm7BysSLGn75_BFyFgjd-8oDEFKLQWmRM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NDM1MDQ4ODIt/NzQzMC5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [
        {
          "active": true,
          "id": 10883,
          "name": "Sharon Jones",
          "resource_url": "https://api.discogs.com/artists/10883",
          "thumbnail_url": "https://i.discogs.com/kHoR9MmC3cmVKh_I-VB43-0gk8Q-bhfR7qfItDVCUGc/rs:fit/g:sm/q:40/h:435/w:463/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwODgz/LTE1OTk2Njk5NDEt/ODUwMS5qcGVn.jpeg"
        },
        {
          "active": true,
          "id": 189109,
          "name": "Martin Perna",
          "resource_url": "https://api.discogs.com/artists/189109",
          "thumbnail_url": "https://i.discogs.com/-dH0lIVd9Gvr1yrsu6G8ZjCMuNjcnWEC47oufcUDgOA/rs:fit/g:sm/q:40/h:453/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE4OTEw/OS0xMjk0MDg4NzE5/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 297831,
          "name": "Cochemea Gastelum",
          "resource_url": "https://api.discogs.com/artists/297831",
          "thumbnail_url": "https://i.discogs.com/hPEGAdi8EbuTqNk_DukFmNZ2WsF2wXvY_F4zf4H7nIQ/rs:fit/g:sm/q:40/h:751/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5Nzgz/MS0xNDMzMjgwNTA1/LTcyMTUuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 307872,
          "name": "Dave Guy",
          "resource_url": "https://api.discogs.com/artists/307872",
          "thumbnail_url": "https://i.discogs.com/xP2A9iBu-_NOOS5zZiQOTOST4j5VDEaovHyZvTKwq4M/rs:fit/g:sm/q:40/h:284/w:324/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg3/Mi0xNTQ5MzUxNTMz/LTg5NTMuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 307875,
          "name": "Neal Sugarman",
          "resource_url": "https://api.discogs.com/artists/307875",
          "thumbnail_url": "https://i.discogs.com/vYg99dwvmxcZxeDP9ctXeBqOuRXfkekZ36D_munbxW0/rs:fit/g:sm/q:40/h:909/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg3/NS0xMjE3NDExMTYx/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 307876,
          "name": "Homer Steinweiss",
          "resource_url": "https://api.discogs.com/artists/307876",
          "thumbnail_url": "https://i.discogs.com/kvFMa8v7WCxr2TBTru3jH2y2cvSk5kt1ye-M54E6PnE/rs:fit/g:sm/q:40/h:505/w:350/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg3/Ni0xNDMxMDA5MDUw/LTg0MDMuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 307881,
          "name": "Gabriel Roth",
          "resource_url": "https://api.discogs.com/artists/307881",
          "thumbnail_url": "https://i.discogs.com/-1pal17pmXtiVf9GJ-zEwgrVhTlEhp-Y6VZeu6tB7eE/rs:fit/g:sm/q:40/h:523/w:392/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg4/MS0xMjQxODU4MDc5/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 308964,
          "name": "Leon Michels",
          "resource_url": "https://api.discogs.com/artists/308964",
          "thumbnail_url": "https://i.discogs.com/YqbTwouti2PycjLqiLkpxJ43YDPMmylFUoT5ukIYnk4/rs:fit/g:sm/q:40/h:758/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwODk2/NC0xNzEyNDMwMDY4/LTgxNzAucG5n.jpeg"
        },
        {
          "active": false,
          "id": 309992,
          "name": "Victor Axelrod",
          "resource_url": "https://api.discogs.com/artists/309992",
          "thumbnail_url": "https://i.discogs.com/yjbDh3FktJu-lhtQKzZKfyEXhHgEUovAXxclk86Yup8/rs:fit/g:sm/q:40/h:362/w:332/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwOTk5/Mi0xMTkzNjkxMDMx/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 392670,
          "name": "Thomas Brenneck",
          "resource_url": "https://api.discogs.com/artists/392670",
          "thumbnail_url": "https://i.discogs.com/8KoJqJsBnEVXM7LOnGznD0J-Q2oHq-UQQFq8hfOD_ks/rs:fit/g:sm/q:40/h:335/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MjY3/MC0xMjQxNjIzMTQ3/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 649064,
          "name": "Ian Hendrickson-Smith",
          "resource_url": "https://api.discogs.com/artists/649064",
          "thumbnail_url": "https://i.discogs.com/uqfRQjTGO03u1OizYIh1CX_9e_hI8ehV4WzQUjA_4xQ/rs:fit/g:sm/q:40/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0OTA2/NC0xNjg3NTYzMjUx/LTI0ODUuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 917231,
          "name": "Frank Stribling",
          "resource_url": "https://api.discogs.com/artists/917231",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 1248665,
          "name": "Fernando Velez",
          "resource_url": "https://api.discogs.com/artists/1248665",
          "thumbnail_url": "https://i.discogs.com/aT2o6q0UDPKlJu1C8cLXZg7Yr9HUuvsaYwPx9TNElEA/rs:fit/g:sm/q:40/h:442/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNDg2/NjUtMTMzNTIwNjI0/My5qcGVn.jpeg"
        },
        {
          "active": true,
          "id": 2831626,
          "name": "Brian Wolfe (2)",
          "resource_url": "https://api.discogs.com/artists/2831626",
          "thumbnail_url": "https://i.discogs.com/JxzxmRrwIgoGS4OYCnF2jUX2tPKQEmmfoFHYu8R_7hk/rs:fit/g:sm/q:40/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MzE2/MjYtMTM3ODcxOTEx/Ni0zMjk3LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 3210097,
          "name": "Joe Crispiano",
          "resource_url": "https://api.discogs.com/artists/3210097",
          "thumbnail_url": "https://i.discogs.com/DQNcxEqUO2mcl4_alAeyFTF0XDZQx6UPdm4E7PhShKA/rs:fit/g:sm/q:40/h:800/w:534/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyMTAw/OTctMTU1NjU0NzU3/NS00MTM3LmpwZWc.jpeg"
        }
      ],
      "name": "Sharon Jones & The Dap-Kings",
      "namevariations": [
        "Sharon Jones",
        "Sharon Jones & Dap Kings",
        "Sharon Jones & Dap-Kings",
        "Sharon Jones & The Dap Kings",
        "Sharon Jones & The Dapkings",
        "Sharon Jones And The Dap Kings",
        "Sharon Jones And The Dap-Kings",
        "Sharon Jones And The-Dap-Kings",
        "Sharon Jones The The Dap Kings",
        "Sharon Jones With The Dap-Kings"
      ],
      "profile": "The Dap Kings are made up of musicians from [a390992] and [a220479], both of which gained recognition for laying the music behind [l=Desco Records]' catalogue of funk 45s and LPs. [a=Sharon Jones] joins them on vocals. She has been described as \"A fire-breathing soul survivor, an old school R&B dynamo, who intoxicates her charges with lickin' stick [a=James Brown] style\" (Pulse Magazine). Perhaps no surprise then to find out that Sharon was born and raised in [a=James Brown]'s hometown of Augusta, Georgia (USA). \r\n\r\n[i]Lead singer[/i]: Sharon Jones (Vocals). [i]Band members[/i]: Homer \"Funky-Foot\" Steinweiss (Drums), Binky Griptite (Guitar), Boogaloo Velez [aka Bugaloo Velez] (Congas, Tambourine), Dave Guy (Trumpet), Tommy 'TNT' Brenneck (Guitar), Bosco Mann (Bass, Bandleader), Neal Sugarman (Tenor Saxophone), Ian Hendickson-Smith (Baritone Saxophone).",
      "raw_data": {
        "data_quality": "Needs Vote",
        "id": 83816,
        "images": [
          {
            "height": 500,
            "resource_url": "https://i.discogs.com/cl3keWQjWUL5MoETDaxEHJqNtGi3aUrJflL6EaGoeZg/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/cl3keWQjWUL5MoETDaxEHJqNtGi3aUrJflL6EaGoeZg/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/GSMLcMW2RreNKn3STrMyZ2vDdyRi9Wdu4080zIXvw9Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
            "width": 500
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/87VKdT98nu_hA7mdDccPkSRTDuRjQmq2WRatnsI08L8/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NjYxMzM1Nzgt/NTgxMy5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/87VKdT98nu_hA7mdDccPkSRTDuRjQmq2WRatnsI08L8/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NjYxMzM1Nzgt/NTgxMy5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/FQ6BAA_NbvRRw_HkmZJa9PX0If_Cn0JJYm6eUmA4wWU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NjYxMzM1Nzgt/NTgxMy5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 540,
            "resource_url": "https://i.discogs.com/ZlQa_HTNEIcn-16srMa_kRxsX2isZGePprwe2PdqxMw/rs:fit/g:sm/q:90/h:540/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2MDE1MDUxMjEt/MzQxMy5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/ZlQa_HTNEIcn-16srMa_kRxsX2isZGePprwe2PdqxMw/rs:fit/g:sm/q:90/h:540/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2MDE1MDUxMjEt/MzQxMy5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/iYzwQKkMu25tem5eIFr9L6wJVhFnV3U5eh-AvJWrQpg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2MDE1MDUxMjEt/MzQxMy5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 331,
            "resource_url": "https://i.discogs.com/0Sk7rwa3TG2SnQyimcBLEAKeU1DRI5DuiRkkw41CTOU/rs:fit/g:sm/q:90/h:331/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTEyNzA0MTE1ODUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/0Sk7rwa3TG2SnQyimcBLEAKeU1DRI5DuiRkkw41CTOU/rs:fit/g:sm/q:90/h:331/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTEyNzA0MTE1ODUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/RAS6XzzsJZzajIL78E8EPLCMMgI8i9DqYbRwETyjXk0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTEyNzA0MTE1ODUu/anBlZw.jpeg",
            "width": 590
          },
          {
            "height": 225,
            "resource_url": "https://i.discogs.com/ylxwJIit-asl9ZewLws-N-nWRBkk3KXPzQPR6Ftay9c/rs:fit/g:sm/q:90/h:225/w:439/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTExOTQ0NzYwODAu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/ylxwJIit-asl9ZewLws-N-nWRBkk3KXPzQPR6Ftay9c/rs:fit/g:sm/q:90/h:225/w:439/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTExOTQ0NzYwODAu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/oT1teEdlLRZZ725WuhCQznuc-qgPiJUAJO-QmPIiulw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTExOTQ0NzYwODAu/anBlZw.jpeg",
            "width": 439
          },
          {
            "height": 339,
            "resource_url": "https://i.discogs.com/3WckknjHqMygpg5WVTjAZshxgCcSmQAVF8jP14ESJgI/rs:fit/g:sm/q:90/h:339/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NDM1MDQ4ODIt/NzQzMC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/3WckknjHqMygpg5WVTjAZshxgCcSmQAVF8jP14ESJgI/rs:fit/g:sm/q:90/h:339/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NDM1MDQ4ODIt/NzQzMC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/STh4BHnFluAm7BysSLGn75_BFyFgjd-8oDEFKLQWmRM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE1NDM1MDQ4ODIt/NzQzMC5qcGVn.jpeg",
            "width": 600
          }
        ],
        "members": [
          {
            "active": true,
            "id": 10883,
            "name": "Sharon Jones",
            "resource_url": "https://api.discogs.com/artists/10883",
            "thumbnail_url": "https://i.discogs.com/kHoR9MmC3cmVKh_I-VB43-0gk8Q-bhfR7qfItDVCUGc/rs:fit/g:sm/q:40/h:435/w:463/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwODgz/LTE1OTk2Njk5NDEt/ODUwMS5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 189109,
            "name": "Martin Perna",
            "resource_url": "https://api.discogs.com/artists/189109",
            "thumbnail_url": "https://i.discogs.com/-dH0lIVd9Gvr1yrsu6G8ZjCMuNjcnWEC47oufcUDgOA/rs:fit/g:sm/q:40/h:453/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE4OTEw/OS0xMjk0MDg4NzE5/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 297831,
            "name": "Cochemea Gastelum",
            "resource_url": "https://api.discogs.com/artists/297831",
            "thumbnail_url": "https://i.discogs.com/hPEGAdi8EbuTqNk_DukFmNZ2WsF2wXvY_F4zf4H7nIQ/rs:fit/g:sm/q:40/h:751/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5Nzgz/MS0xNDMzMjgwNTA1/LTcyMTUuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 307872,
            "name": "Dave Guy",
            "resource_url": "https://api.discogs.com/artists/307872",
            "thumbnail_url": "https://i.discogs.com/xP2A9iBu-_NOOS5zZiQOTOST4j5VDEaovHyZvTKwq4M/rs:fit/g:sm/q:40/h:284/w:324/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg3/Mi0xNTQ5MzUxNTMz/LTg5NTMuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 307875,
            "name": "Neal Sugarman",
            "resource_url": "https://api.discogs.com/artists/307875",
            "thumbnail_url": "https://i.discogs.com/vYg99dwvmxcZxeDP9ctXeBqOuRXfkekZ36D_munbxW0/rs:fit/g:sm/q:40/h:909/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg3/NS0xMjE3NDExMTYx/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 307876,
            "name": "Homer Steinweiss",
            "resource_url": "https://api.discogs.com/artists/307876",
            "thumbnail_url": "https://i.discogs.com/kvFMa8v7WCxr2TBTru3jH2y2cvSk5kt1ye-M54E6PnE/rs:fit/g:sm/q:40/h:505/w:350/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg3/Ni0xNDMxMDA5MDUw/LTg0MDMuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 307881,
            "name": "Gabriel Roth",
            "resource_url": "https://api.discogs.com/artists/307881",
            "thumbnail_url": "https://i.discogs.com/-1pal17pmXtiVf9GJ-zEwgrVhTlEhp-Y6VZeu6tB7eE/rs:fit/g:sm/q:40/h:523/w:392/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNzg4/MS0xMjQxODU4MDc5/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 308964,
            "name": "Leon Michels",
            "resource_url": "https://api.discogs.com/artists/308964",
            "thumbnail_url": "https://i.discogs.com/YqbTwouti2PycjLqiLkpxJ43YDPMmylFUoT5ukIYnk4/rs:fit/g:sm/q:40/h:758/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwODk2/NC0xNzEyNDMwMDY4/LTgxNzAucG5n.jpeg"
          },
          {
            "active": false,
            "id": 309992,
            "name": "Victor Axelrod",
            "resource_url": "https://api.discogs.com/artists/309992",
            "thumbnail_url": "https://i.discogs.com/yjbDh3FktJu-lhtQKzZKfyEXhHgEUovAXxclk86Yup8/rs:fit/g:sm/q:40/h:362/w:332/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwOTk5/Mi0xMTkzNjkxMDMx/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 392670,
            "name": "Thomas Brenneck",
            "resource_url": "https://api.discogs.com/artists/392670",
            "thumbnail_url": "https://i.discogs.com/8KoJqJsBnEVXM7LOnGznD0J-Q2oHq-UQQFq8hfOD_ks/rs:fit/g:sm/q:40/h:335/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MjY3/MC0xMjQxNjIzMTQ3/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 649064,
            "name": "Ian Hendrickson-Smith",
            "resource_url": "https://api.discogs.com/artists/649064",
            "thumbnail_url": "https://i.discogs.com/uqfRQjTGO03u1OizYIh1CX_9e_hI8ehV4WzQUjA_4xQ/rs:fit/g:sm/q:40/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY0OTA2/NC0xNjg3NTYzMjUx/LTI0ODUuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 917231,
            "name": "Frank Stribling",
            "resource_url": "https://api.discogs.com/artists/917231",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 1248665,
            "name": "Fernando Velez",
            "resource_url": "https://api.discogs.com/artists/1248665",
            "thumbnail_url": "https://i.discogs.com/aT2o6q0UDPKlJu1C8cLXZg7Yr9HUuvsaYwPx9TNElEA/rs:fit/g:sm/q:40/h:442/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNDg2/NjUtMTMzNTIwNjI0/My5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 2831626,
            "name": "Brian Wolfe (2)",
            "resource_url": "https://api.discogs.com/artists/2831626",
            "thumbnail_url": "https://i.discogs.com/JxzxmRrwIgoGS4OYCnF2jUX2tPKQEmmfoFHYu8R_7hk/rs:fit/g:sm/q:40/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MzE2/MjYtMTM3ODcxOTEx/Ni0zMjk3LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 3210097,
            "name": "Joe Crispiano",
            "resource_url": "https://api.discogs.com/artists/3210097",
            "thumbnail_url": "https://i.discogs.com/DQNcxEqUO2mcl4_alAeyFTF0XDZQx6UPdm4E7PhShKA/rs:fit/g:sm/q:40/h:800/w:534/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyMTAw/OTctMTU1NjU0NzU3/NS00MTM3LmpwZWc.jpeg"
          }
        ],
        "name": "Sharon Jones & The Dap-Kings",
        "namevariations": [
          "Sharon Jones",
          "Sharon Jones & Dap Kings",
          "Sharon Jones & Dap-Kings",
          "Sharon Jones & The Dap Kings",
          "Sharon Jones & The Dapkings",
          "Sharon Jones And The Dap Kings",
          "Sharon Jones And The Dap-Kings",
          "Sharon Jones And The-Dap-Kings",
          "Sharon Jones The The Dap Kings",
          "Sharon Jones With The Dap-Kings"
        ],
        "profile": "The Dap Kings are made up of musicians from [a390992] and [a220479], both of which gained recognition for laying the music behind [l=Desco Records]' catalogue of funk 45s and LPs. [a=Sharon Jones] joins them on vocals. She has been described as \"A fire-breathing soul survivor, an old school R&B dynamo, who intoxicates her charges with lickin' stick [a=James Brown] style\" (Pulse Magazine). Perhaps no surprise then to find out that Sharon was born and raised in [a=James Brown]'s hometown of Augusta, Georgia (USA). \r\n\r\n[i]Lead singer[/i]: Sharon Jones (Vocals). [i]Band members[/i]: Homer \"Funky-Foot\" Steinweiss (Drums), Binky Griptite (Guitar), Boogaloo Velez [aka Bugaloo Velez] (Congas, Tambourine), Dave Guy (Trumpet), Tommy 'TNT' Brenneck (Guitar), Bosco Mann (Bass, Bandleader), Neal Sugarman (Tenor Saxophone), Ian Hendickson-Smith (Baritone Saxophone).",
        "releases_url": "https://api.discogs.com/artists/83816/releases",
        "resource_url": "https://api.discogs.com/artists/83816",
        "uri": "https://www.discogs.com/artist/83816-Sharon-Jones-The-Dap-Kings",
        "urls": [
          "https://www.facebook.com/sharonjonesandthedapkings",
          "https://sharonjonesandthedapkings.bandcamp.com/",
          "http://en.wikipedia.org/wiki/Sharon_Jones_%26_The_Dap-Kings"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/83816",
      "thumb": "https://i.discogs.com/GSMLcMW2RreNKn3STrMyZ2vDdyRi9Wdu4080zIXvw9Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgzODE2/LTE2NTc3MjI4MDMt/NTc3NC5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/83816-Sharon-Jones-The-Dap-Kings",
      "urls": [
        "https://www.facebook.com/sharonjonesandthedapkings",
        "https://sharonjonesandthedapkings.bandcamp.com/",
        "http://en.wikipedia.org/wiki/Sharon_Jones_%26_The_Dap-Kings"
      ]
    },
    "lastfm": {
      "bio_content": "Sharon Jones & the Dap-Kings, aka Sharon Jones and the Dap-Kings, are a funk/soul band, founded in Brooklyn, NY, USA (1996). They are signed to Daptone Records, where the Dap-Kings are the house band. They are widely thought to be spearheads of a revivalist movement that aims to capture the essence of funk/soul music as it was at its height in the mid-1960s to mid-1970s. Part of the way this is achieved is to shun modern digital recording methods in favour of using traditional analogue recording equipment. The type of instruments used by the band may also be considered limited to those that would have been available up until the mid seventies.\n\nSharon Jones was born Sheron Lafaye Jones, in Augusta, Georgia (4 May 1956).  Her mother moved to Brooklyn, soon thereafter, however Jones was sent down south for a few months every year to stay with her family.  As a child, she and her brothers would imitate the songs and dances of James Brown, who shared their home-town.  Like many rhythm and blues entertainers, she began performing in church at a very young age.  As a teenager in the early nineteen seventies, she began singing outside of the church in talent shows and with local funk groups.  Later she would make her living with a combination of sporadic session work as a mostly anonymous voice on various dance records (sometimes credited as Lafaye Jones), singing with wedding bands, and a handful of day jobs which included stints as both a prison guard at New York’s notorious Riker’s Island, and an armored car guard for Wells Fargo Bank.  In 1996 she was called in to sing back-up at a Desco Records studio session for 70’s soul legend Lee Fields.\n\nThe original incarnation of the band, the Soul Providers, were formed in the mid nineties by Philip Lehman and Gabriel Roth AKA Bosco Mann. The Soul Providers began recording an album consisting of James Brown inspired instrumentals and vocal collaborations with Deep Funk legend Lee Fields. It was during these sessions that Roth and Lehman discovered vocalist Sharon Jones after she recorded backing vocals for one of the Lee Fields tracks. They were impressed enough to record a solo track with Jones entitled \"Switchblade\", a track that had originally been intended for a man to record. This track along with another Jones solo, \"The Landlord\", were included on the Soul Providers debut release Soul Tequila, released circa 1996 on the French label Pure Records (defunct). Lehman and Roth then started a new label in Brooklyn, New York. Desco Records was born taking its name from Desco Vacuum, a vacuum cleaner store in West 41st Street underneath which they utilised the basement as studio space and an office to administer and distribute the label. Sugarman 3 organist Adam Scone just happened to live upstairs in the same building. The Soul Tequila album was then reissued as a vinyl only LP renamed Gimme The Paw. The record, which featured Lehman's pet dog Spike on the cover, only kept one of the Sharon Jones collaborations, \"Switchblade\", omitting \"The Landlord\".\n\nHaving established a scene in New York of performers, Desco aimed to showcase a stable of artists with revue style shows and concentrated on releasing vinyl 45 records by a number of artists including Sugarman 3, The Daktaris, The Mighty Imperials, Naomi Davis & The Knights of 41st Street, Lee Fields, Joseph Henry and Sharon Jones, who backed by the Soul Providers who had become the Desco house band, released three 45's on the label. Desco Records were gaining intrigue and reputation for quality amongst soul/funk collectors and enthusiasts. Many people who bought the early records were unsure that they were modern recordings as recording dates were deliberately omitted from the labels and were often marketed as being released in the 1970s. Two other Soul Providers albums were released, an instrumental soundtrack to a mysterious Sam Lung Kung-Fu film, The Revenge Of Mr Mopoji, credited to Mike Jackson And The Soul Providers and a Lee Fields solo album Let's Get A Groove On where the Soul Providers provided the backing.\n\nIn 2000, due to a growing difference of opinion, Lehman and Roth decided to go separate ways and both set up new labels. Philip Lehman set up Soul Fire Records (now defunct, the back catalogue is handled by Truth & Soul Records). Gabriel Roth went on to start Daptone Records with Sugarman 3 saxophonist Neal Sugarman. The Soul Providers split and a new band, the Dap-Kings formed. The band was consisted of label owners Roth AKA Bosco Mann on bass and Neal Sugarman on Saxophone, plus original Soul Providers: guitarist Binky Griptite, organist Earl Maxton, percussionist Fernando Velez and trumpeter Anda Szilagyi. Joining them were original members of the Mighty Imperials whose album, Thunder Chicken, was the last release on the Desco label: tenor saxophonist Leon Michels and drummer Homer Steinwess.\n\nHaving secured a summer residency at The Boite, a club in Barcelona, Spain, the band recorded an LP, Dap Dippin' with Sharon Jones and the Dap-Kings in 2001. A few hundred copies were pressed, so that sales during the residency would provide financial backing on what would have otherwise been a financially disastrous trip. With promotional copies reaching notable funk DJs and reviewers, the album gained a significant reputation and was officially released as the first LP and CD on Daptone Records in 2002 to universal acclaim amongst enthusiasts. \n\nAn exhausting schedule of international shows then followed to promote the album and it quickly became clear that promotion of Sharon Jones would be key to the success of the Daptone label. Whilst trying to build upon the revue style stable showcasing and trying to record other groups and artists on the label, other projects have to a certain extent been sidelined in favour of building on the success of Sharon Jones. Expected albums from Lee Fields and Naomi Davis have so far been victim to a lack of time, funds and energy a small independent label has. Neal Sugarman's own band Sugarman 3 who have themselves released several popular albums including one on the Daptone label, Pure Cane Sugar, have also been somewhat sidelined.\n\nFollowing the album, three 45's of note, not included on the album where also released. \"What If We all Stopped Paying Taxes\", released in 2002 just ahead of the U.S. Election, was a militant anti-war statement denouncing the Iraq War. \"Genuine (parts 1 & 2)\" in 2004 was an uncompromisingly hard funk record which firmly kept the interest of enthusiasts and their cover of \"Just Dropped In (To See What Condition My Condition Was In)\", released in 2005 but which was apparently recorded for a KFC commercial in 2002 but was never used.\n\nBy this time there were a few personnel changes, as organist Earl Maxton and trumpeter Anda Szilagyi officially became members of Antibalas, a New York based afrobeat band. Whilst Maxton was not replaced on organ, Trumpeter David Guy was recruited on trumpet. Also from the Budos Band, Thomas Brenneck, a second guitarist was added. In 2003 the Daptone Recording Studio, complete with a sixteen track analogue tape machine was open for business. It was originally intended to record two albums back-to-back to speed up the next release process. However during the final sessions of the first of these albums, Gabriel Roth suffered serious eye injuries in a car crash on his way home from the studio. This led to a break in the recording process and ultimately plans to limit the sessions to only one album. Their second LP and CD, Naturally, was then released in 2005. This album was a more broad based album than the first (which almost completely consisted of funk numbers) and included a mix of both soul and funk influences. The sleeve notes, written by Gabriel Roth, provided some insight into the vision behind the music, \"Somewhere between banging on logs and the invention of M.I.D.I. technology we have made a terrible wrong turn. We must have ridden right past our stop. We should have stepped down off the train at that moment when rhythm and harmony and technology all culminated to a single Otis Redding whine. That moment of the truest, most genuine expression of what it means to be human.\" The production and recording values of this album were also noticeably crisper than that of the first - attaining a sound similar to the kind of production standard achieved by James Brown at his height, rather than the slightly duller \"scratchy 45\" sound of the original album. With, again, international acclaim amongst enthusiasts and a steadily growing base of both fans and now imitators, the band embarked on more extensive international tours and promotion of the album.\n\nLeon Michels left the band soon after the release of Naturally to help start a new label Truth & Soul Records on the back of a solo LP that was originally intended to be released on Daptone, Sounding Out The City, credited to El Michels Affair. The label would also fill the void left when Philip Lehman closed the Soul Fire label and moved to the Bahamas, leaving the scene altogether. The back catalogue of Soul Fire would then be handled by Truth & Soul Records who, along with Soul Fire often used many of the same artists in their stable, such as Lee Fields, Homer Steinweiss and Thomas Brenneck but of whom Leon Michels had been the biggest collaborator. Michels replacement in the Dap-kings came as Ian Hendrickson-Smith, a local saxophone player who has released several jazz albums under his own name.\n\nThe Dap-Kings were then hired as session musicians on a number of projects associated with New York based DJ/producer/recording artist Mark Ronson. Most notable of these is their extensive inclusion and somewhat unheralded contribution to Amy Winehouse's album Back to Black (2006). Six of the album's eleven tracks feature various members of the Dap-Kings with two notable hits from the album, Rehab and You Know I'm No Good, extensively featuring the Dap-Kings. A further engineering credit goes to Gabriel Roth and several tracks recorded at Daptone Studios are mis-credited as \"Dapking Studios\". Again various members of the band feature on Ronson's second album, Version (2007), providing contributions on all but one of the album's fourteen tracks. The Dap-Kings then became the backing band used on Amy Winehouse's first U.S. tour. In 2007 the Dap-Kings worked with British singer Ben Westbeech to record a new version of his song \"So Good Today\"; it was released to mark the first anniversary of Brownswood recordings, the label Westbeech is signed to in the UK. Sharon Jones lends her vocals on one song \"The Way We Lived\", on Wax Tailor's second album \"Hope & Sorrow\", released in April 2007.\n\nIn late 2006, the band recorded a third studio album, entitled 100 Days, 100 Nights, it was released on 2007-10-02. A single, which is not included on the album, entitled \"I'm Not Gonna Cry\" was released in April 2007 and featured the same uncompromised funk style of the earlier single, \"Genuine\". <a href=\"https://www.last.fm/music/+noredirect/Sharon+Jones+&+The+Dap-Kings\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Sharon Jones & the Dap-Kings, aka Sharon Jones and the Dap-Kings, are a funk/soul band, founded in Brooklyn, NY, USA (1996). They are signed to Daptone Records, where the Dap-Kings are the house band. They are widely thought to be spearheads of a revivalist movement that aims to capture the essence of funk/soul music as it was at its height in the mid-1960s to mid-1970s. Part of the way this is achieved is to shun modern digital recording methods in favour of using traditional analogue recording equipment. <a href=\"https://www.last.fm/music/+noredirect/Sharon+Jones+&+The+Dap-Kings\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 396445,
      "mbid": "8d50cd20-34f2-4abe-ba16-0759ee0fb9f5",
      "name": "Sharon Jones & The Dap-Kings",
      "playcount": 3678835,
      "similar_artists": [],
      "tags": [
        "soul",
        "funk",
        "rhythm and blues",
        "female vocalists",
        "seen live"
      ],
      "url": "https://www.last.fm/music/+noredirect/Sharon+Jones+&+The+Dap-Kings"
    },
    "spotify": {
      "followers": 310269,
      "genres": [
        "retro soul",
        "soul",
        "funk"
      ],
      "id": "6LufpoVlIYKQCu9Gjpk8B7",
      "images": [
        {
          "height": 1000,
          "url": "https://i.scdn.co/image/cd0f5585d478bbb91cff3e0b723ed91c6d2046d7",
          "width": 1000
        },
        {
          "height": 640,
          "url": "https://i.scdn.co/image/2882183a98e1e3db187e81de77ca01980a7566c0",
          "width": 640
        },
        {
          "height": 200,
          "url": "https://i.scdn.co/image/294d9b05f873f5b86bdb77975b08d16939e5d053",
          "width": 200
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/c42fa67786a9b2dfd0d4cbaabfd0a57b3f5a6736",
          "width": 64
        }
      ],
      "name": "Sharon Jones & The Dap-Kings",
      "popularity": 59,
      "url": "https://open.spotify.com/artist/6LufpoVlIYKQCu9Gjpk8B7"
    }
  },
  "spotify_id": "6LufpoVlIYKQCu9Gjpk8B7",
  "spotify_url": "https://open.spotify.com/artist/6LufpoVlIYKQCu9Gjpk8B7",
  "updated_at": "2025-07-08T09:23:44.730160",
  "wikipedia_url": null
}