{
  "apple_music_id": "304907551",
  "apple_music_url": "https://music.apple.com/gb/album/grievous-angel/304907551",
  "artists": [
    {
      "apple_music_id": "718175",
      "biography": "Gram Parsons (November 5, 1946 – September 19, 1973) was an American singer, songwriter, guitarist and pianist born Ingram Cecil Connor, III. A solo artist as well as a member of The International Submarine Band, The Byrds and The Flying Burrito Brothers, he is best known for a series of recordings which anticipate the country rock of the 1970s and the alt-country movement that began in the 80s. Parsons was a close friend of  Keith Richards and is also credited for turning the Rolling Stones onto country music in their 'Let it Bleed'-era. \nParsons described his records as \"Cosmic American Music\". He died of a drug overdose, at the age of 26, on September 19, 1973. Parsons' body was stolen from the airport and cremated on a makeshift outdoor funeral pyre (coffin and five gallons of gas) at Cap Rock,Joshua Tree by his road manager, Phil Kaufmann. \n\nCecil Ingram Connor III (November 5, 1946 – September 19, 1973), known professionally as Gram Parsons, was an American singer, songwriter, guitarist, and pianist. Parsons is best known for his work within the country music genre; he also popularized what he called \"Cosmic American Music\", a hybrid of country, rhythm and blues, soul, folk, and rock.[1][2] Besides recording as a solo artist, he also worked in several notable bands, including the International Submarine Band, The Byrds, and The Flying Burrito Brothers. His relatively short career is described by Allmusic as \"enormously influential\" for both country and rock, \"blending the two genres to the point that they became indistinguishable from each other.\"[3]\nParsons was born in Winter Haven, Florida and developed an interest in country music while attending Harvard University. He founded the International Submarine Band in 1966, and after several months of delay their debut, Safe at Home, was released in 1968, by which time the group had disbanded. Parsons joined The Byrds in early 1968, and played a pivotal role in the making of the seminal Sweetheart of the Rodeo album. After leaving the group in late 1968, Parsons and fellow Byrd Chris Hillman formed The Flying Burrito Brothers in 1969, releasing their debut, The Gilded Palace of Sin, the same year. The album was well received but failed commercially; after a sloppy cross-country tour, they hastily recorded Burrito Deluxe. Parsons was fired from the band before its release in early 1970. He soon signed with A&M Records, but after several unproductive sessions he canceled his intended solo debut in early 1971. Parsons moved to France, where he lived for a short period at Villa Nellcôte with his friend Keith Richards of The Rolling Stones. Returning to America, Parsons befriended Emmylou Harris, who assisted him on vocals for his first solo record, GP, released in 1973. Although it received enthusiastic reviews, the release failed to chart; his next album, Grievous Angel met with a similar reception, and peaked at number 195 on Billboard. Recreational drug abuse severely deteriorated his health, and he died in September 1973 at the age of 26.\nSince his death, Parsons has been recognized as an extremely influential artist, credited with helping to found both country rock and alt-country.[3] His posthumous honors include the Americana Music Association \"President's Award\" for 2003, and a ranking at No. 87 on Rolling Stone's list of the \"100 Greatest Artists of All Time.\"[4]\nContents  [hide] \n1 Life and career\n1.1 Early years (1946–67)\n1.2 The Byrds (1968)\n1.3 The Flying Burrito Brothers (1969–70)\n1.4 Solo career and touring with Emmylou Harris (1970–73)\n1.5 Death\n2 Legacy\n3 Discography\n3.1 Tribute albums\n4 Notes\n5 References\n5.1 Bibliography\n6 External links\nLife and career[edit]\n\nEarly years (1946–67)[edit]\nCecil Ingram Connor III was born on November 5, 1946, in Winter Haven, Florida, to Major Cecil Ingram (\"Coon Dog\") and Avis (née Snively) Connor.[5] The Connors normally resided at their main residence in Waycross, Georgia, but Avis traveled to her hometown in Florida to give birth.[5] She was the daughter of citrus fruit magnate John A. Snively, who held extensive properties both in Winter Haven and in Waycross; Parsons' father was a famous World War II flying ace, decorated with the Air Medal, who was present at the 1941 attack on Pearl Harbor.[6] Biographer David Meyer characterized Coon Dog and Avis as loving parents: he writes in Twenty Thousand Roads that they are \"remembered as affectionate parents and a loving couple\".[5] He also notes, however, that \"unhappiness was eating away at the Connor family\": Avis suffered from depression, and both parents were alcoholics.[7] Coon Dog committed suicide two days before Christmas Day, 1958, devastating the young Gram and the rest of the Connor family.[8] Avis subsequently married Robert Parsons, whose surname was adopted by Cecil Ingram (henceforth he would be known as Gram Parsons). Gram attended the prestigious Bolles School in Jacksonville, Florida. For a time, the family found a stability of sorts. They were soon torn apart in early 1965, when Robert became embroiled in an extramarital affair and Avis' heavy drinking led to her death from cirrhosis on July 5, 1965, the day of Gram's graduation from Bolles.[9]\nAs his family disintegrated around him, Parsons developed strong musical interests, particularly after seeing Elvis Presley perform in concert on February 22, 1956, in Waycross.[10] Five years later, while barely in his teens, he played in rock and roll cover bands such as the Pacers and the Legends, headlining in clubs owned by his stepfather in the Winter Haven/Polk County area. By the age of 16 he graduated to folk music, and in 1963 he teamed with his first professional outfit, the Shilos, in Greenville, SC. Heavily influenced by The Kingston Trio and the Journeymen,[11] the band played hootenannies, coffee houses and high school auditoriums. Forays into New York City's Greenwich Village included appearances at The Bitter End.\nAfter The Shilos broke up, Parsons attended Harvard University, where he studied theology but departed after one semester. Despite being from the South, he did not become seriously interested in country music until his time at Harvard, where he heard Merle Haggard for the first time. In 1966, he and other musicians from the Boston folk scene formed a group called the International Submarine Band. They relocated to Los Angeles the following year, and after several lineup changes signed to Lee Hazlewood's LHI Records, where they spent late 1967 recording Safe at Home. The album contains one of Parsons' best-known songs, \"Luxury Liner\", and an early version of \"Do You Know How It Feels\", which he revisited later on in his career. Safe at Home would remain unreleased until mid 1968, by which time the International Submarine Band had broken up.\nThe Byrds (1968)[edit]\nBy 1968 Parsons had come to the attention of The Byrds' bassist, Chris Hillman, via Larry Spector (The Byrds' business manager), as a possible replacement band member following the departures of David Crosby and Michael Clarke from the group in late 1967.[12][13] Parsons had been acquainted with Hillman since the pair had met in a bank during 1967 and in February 1968 he passed an audition for the band, being initially recruited as a jazz pianist but soon switching to rhythm guitar and vocals.[12][14]\nAlthough Parsons was an equal contributor to the band, he was not regarded as a full member of The Byrds by the band's record label, Columbia Records.[15] Consequently, when The Byrds' Columbia recording contract was renewed on February 29, 1968, it was only original members Roger McGuinn and Chris Hillman who signed it.[15] Parsons, like fellow new recruit Kevin Kelley, was hired as a sideman and received a salary from McGuinn and Hillman.[16] In later years, this led Hillman to state \"Gram was hired. He was not a member of The Byrds, ever — he was on salary, that was the only way we could get him to turn up.\"[17] However, these comments overlook the fact that Parsons, like Kelley, was considered a bona fide member of the band during 1968 and as such, was given equal billing alongside McGuinn, Hillman, and Kelley on the Sweetheart of the Rodeo album and in contemporary press coverage of the band.[18]\n\"Being with The Byrds confused me a little. I couldn't find my place. I didn't have enough say-so; I really wasn't one of The Byrds. I was originally hired because they wanted a keyboard player. But I had experience being a frontman and that came out immediately. And [Roger McGuinn] being a very perceptive fellow saw that it would help the act, and he started sticking me out front.\"\n—Gram Parsons reflecting on his time with The Byrds[19]\nSweetheart of the Rodeo was originally conceived by band leader Roger McGuinn as a sprawling, double album history of American popular music.[20] It was to begin with bluegrass music, then move through country and western, jazz, rhythm and blues, and rock music, before finally ending with the most advanced (for the time) form of electronic music.[14] However, as recording plans were made, Parsons exerted a controlling influence over the group, persuading the other members to leave Los Angeles and record the album in Nashville, Tennessee.[15] Along the way, McGuinn's original album concept was jettisoned in favor of a fully fledged country project, which included Parsons' songs such as \"One Hundred Years from Now\" and \"Hickory Wind\", along with compositions by Bob Dylan, Woody Guthrie, Merle Haggard, and others.[21]\nRecording sessions for Sweetheart of the Rodeo commenced at Columbia Records' recording studios in the Music Row area of Nashville on March 9, 1968.[14] Mid-way through, the sessions moved to Columbia Studios, Hollywood, Los Angeles. They finally came to a close on May 27, 1968.[14][22] However, Parsons was still under contract to LHI Records and consequently, Hazlewood contested Parsons' appearance on the album and threatened legal action.[20] As a result, McGuinn ended up replacing three of Parsons' lead vocals with his own singing on the finished album, a move that was still rankling Parsons as late as 1973, when he told Cameron Crowe in an interview that McGuinn \"erased it and did the vocals himself and fucked it up.\"[23] However, Parsons is still featured as lead vocalist on the songs \"You're Still on My Mind\", \"Life in Prison\", and \"Hickory Wind\".[21]\nWhile in England with The Byrds in the summer of 1968, Parsons left the band due to his concerns over a planned concert tour of South Africa, citing opposition to that country's apartheid policies.[14] There has been some doubt expressed by Hillman over the sincerity of Parsons' protest.[24] It appears that Parsons was mostly apolitical, although he did refer to one of the younger African-American butlers in the Connor household as being \"like a brother\" to him in an interview.[citation needed] During this period, Parsons became acquainted with Mick Jagger and Keith Richards of The Rolling Stones.[25] Before Parsons' departure from The Byrds, he had accompanied the two Rolling Stones to Stonehenge (along with McGuinn and Hillman) in the English county of Wiltshire, where Richards had a house near the ancient site.[26] Immediately after leaving the band, Parsons stayed at Richards' house and the pair developed a close friendship over the next few years, with Parsons reintroducing the guitarist to country music.[27] According to Stones' confidant and close friend of Parsons, Phil Kaufman, the twosome would sit around for hours, playing obscure country records and trading off on various songs with their guitars.[28]\nThe Flying Burrito Brothers (1969–70)[edit]\nReturning to Los Angeles, Parsons sought out Hillman, and the two formed The Flying Burrito Brothers with bassist Chris Ethridge and pedal steel player Sneaky Pete Kleinow. Their 1969 album The Gilded Palace of Sin was a modernized version of the Bakersfield style of country music made popular by Buck Owens, and the band appeared on the album cover wearing Nudie suits emblazoned with all sorts of hippie accoutrements. Along with the Parsons-Hillman originals \"Christine's Tune\" and \"Sin City\" were versions of the soul music classics \"The Dark End of the Street\" and \"Do Right Woman\", the latter featuring David Crosby on high harmony. The album's original songs were the result of a very productive songwriting partnership between Parsons and Hillman, who were sharing a bachelor pad in LA during this period. The atypically pronounced (for Parsons) gospel soul influence on this album likely comes from his frequent jamming with Delaney & Bonnie and Richards.\nThough not a commercial success, Gilded was measured by rock critic Robert Christgau as \"an ominous, obsessive, tongue-in-cheek country-rock synthesis, absorbing rural and urban, traditional and contemporary, at point of impact.\" The album was recorded without a permanent drummer, but the group soon added original Byrd Michael Clarke on drums. Embarking on a cross-country tour via train, as Parsons suffered from periodic bouts of fear of flying, the group squandered most of their money in a perpetual poker game and received bewildered reactions in most cities. Parsons was frequently indulging in massive quantities of psilocybin and cocaine, so his performances were erratic at best, while much of the band's repertoire consisted of vintage honky-tonk and soul standards with few originals. Perhaps the most successful appearance occurred in Philadelphia, where the group opened for the reconstituted Byrds. Midway through their set, Parsons joined the headline act and fronted his former group on renditions of \"Hickory Wind\" and \"You Don't Miss Your Water\". The other Burritos surfaced with the exception of Clarke, and the joint aggregation played several songs, including \"Long Black Veil\" and \"Goin' Back\".\nAfter returning to Los Angeles the group recorded \"The Train Song\", written during an increasingly infrequent songwriting session on the train and produced by 1950s R&B legends Larry Williams and Johnny \"Guitar\" Watson. Despite a request from the Burritos that the remnants of their publicity budget be diverted to promotion of the single, it also flopped. Ethridge departed shortly thereafter. He was replaced by lead guitarist Bernie Leadon, while Hillman reverted to bass.\nBy this time, Parsons's own use of drugs had increased to the extent that new songs were rare and much of his time was diverted to partying with the Stones, who briefly relocated to America in the summer of 1969 to finish their forthcoming Let It Bleed album and prepare for an autumn cross-country tour, their first series of regular live engagements since 1967. As they prepared to play the nation's largest sports arenas, the Burritos played to dwindling nightclub audiences; one night Jagger had to literally order Parsons to fulfill an obligation to his group.\nThe singer's dedication to the Rolling Stones was rewarded when the Burrito Brothers were booked as the opening act of the infamous Altamont Music Festival. Playing a short set including \"Six Days on the Road\" and \"Bony Moronie\", Parsons left on one of the final helicopters and attempted to pick up Michelle Phillips. \"Six Days...\" was included in Gimme Shelter, a documentary of the event.\nWith mounting debt incurred, A&M hoped to recoup some of their losses by marketing the Burritos as a straight country group. To this end, manager Jim Dickson instigated a loose session where the band recorded several honky tonk staples from their live act, contemporary pop covers in a countrified vein (\"To Love Somebody\", \"Lodi\", \"I Shall Be Released\", \"Honky Tonk Women\"), and Larry Williams' \"Bony Moronie\". This was soon scrapped in favor of a second album of originals on an extremely reduced budget. Faced with a dearth of new material, most of the material was hastily written in the studio by Leadon, Hillman, and Parsons, with two Gilded Palace of Sin outtakes thrown into the mix. The resulting album, entitled Burrito Deluxe, was released in April 1970.\nThe album is considered less inspired than its predecessor, but it is notable for the Parsons-Hillman-Leadon song \"Older Guys\" and for its take on Jagger and Richards' \"Wild Horses\"—the first recording released of this famous song. Parsons was inspired to cover the song after hearing an advance tape of the Sticky Fingers album sent to Kleinow, who was scheduled to overdub a part on the song (Kleinow's part was not included on the released Rolling Stones version, though it is available on bootlegs). Jagger consented to the cover version, so long as the Flying Burrito Brothers did not issue it as a single.\nBurrito Deluxe, like its predecessor, underperformed commercially but faced the double whammy of being lambasted by critics. Disenchanted with the band, Parsons left the Burritos in mutual agreement with Hillman, who was at his wits end after two years of babysitting Gram. Under Hillman's direction, the group recorded two further LPs.\nIn a recent interview with American Songwriter Chris Hillman explained that, “The greatest legacy of the Flying Burrito Brothers and Gram is we were the alternative country band. We couldn’t get on country radio and we couldn’t get on rock radio! We were the outlaw country band for a brief period,” says Hillman.\"[29]\nSolo career and touring with Emmylou Harris (1970–73)[edit]\nParsons signed a solo deal with A&M Records and moved in with producer Terry Melcher in early 1970.[30] Melcher (who had worked with The Byrds and The Beach Boys and had rejected producing an unknown singer/songwriter by the name of Charles Manson) was a member of the successful duo Bruce & Terry, also known as The Rip Chords. The two shared a mutual penchant for cocaine and heroin, and as a result, the sessions were largely unproductive, with Parsons eventually losing interest in the project. \"Terry loved Gram and wanted to produce him ... But neither of them could get anything done,\" recalled Eve Babitz.[31] \"Long lost, the tapes from this session have gathered a legendary patina,\" writes David Meyer.[32] The recording stalled, and the master tapes were checked out, but there is conflict as to whether \"Gram ... or Melcher took them\".[33] He accompanied the Rolling Stones on their 1971 U.K. tour in the hope of being signed to the newly formed Rolling Stones Records, intending to record a duo album with Richards. Moving into Villa Nellcôte with the guitarist during the sessions for Exile on Main Street, Parsons remained in a consistently incapacitated state and frequently quarreled with his much younger girlfriend, aspiring actress Gretchen Burrell. Eventually, Parsons was asked to leave by Anita Pallenberg, Richards' longtime domestic partner. Keith suggests in his autobiography \"Life\" that Mick Jagger may have been the real driver for Parson' departure given that Keith spent so much time playing music with Gram. Rumors have persisted that he appears somewhere on the legendary album, and while Richards concedes that it is very likely he is among the chorus of singers on \"Sweet Virginia\", to this day nothing has been substantiated. Parsons attempted to rekindle his relationship with the band on their 1972 tour to no avail.\nAfter leaving the Stones' camp, Parsons married Burrell in 1971 at his stepfather's New Orleans estate. Allegedly, the relationship was far from stable, with Burrell cutting a needy and jealous figure while Parsons quashed her burgeoning film career. Many of the singer's closest associates and friends claim that Parsons was preparing to commence divorce proceedings at the time of his death; the couple had already separated by this point.\n\n\nParsons in 1972\nParsons and Burrell enjoyed the most idyllic time of their relationship, visiting old cohorts like Ian Dunlop and Family/Blind Faith/Traffic member Ric Grech in England. With the assistance of Grech and one of the bassist's friends, a doctor who also dabbled in country music and is now known as Hank Wangford,[34] Parsons eventually stopped taking heroin (a treatment suggested by William Burroughs proved unsuccessful).\nHe returned to the U.S. for a one-off concert with the Burritos, and at Hillman's request went to hear Emmylou Harris sing in a small club in Washington, D.C. They befriended each other and, within a year, he asked her to join him in Los Angeles for another attempt to record his first solo album.\nHaving gained thirty pounds since his Burrito days from Southern food and excessive alcohol consumption, it came as a surprise to many when Parsons was enthusiastically signed to Reprise Records by Mo Ostin in mid-1972. GP, released in 1973, featured Elvis Presley's lead guitarist James Burton, and featured new songs from a creatively revitalized Parsons such as \"Big Mouth Blues\" and \"Kiss the Children,\" as well as a cover of Tompall Glaser's \"Streets of Baltimore\".\nParsons, by now featuring Harris as his duet partner, played dates across the United States as Gram Parsons and the Fallen Angels. Unable to afford the services of Presley's band for a month, the band featured the talents of Colorado-based rock guitarist Jock Bartley (soon to skyrocket to fame with Firefall), veteran Nashville session musician Neil Flanz on pedal steel, Kyle Tullis on bass and former Mountain drummer N.D. Smart (once described by Canadian folksinger Ian Tyson as \"a psychotic redneck\"). The touring party also included Gretchen Parsons—by this point extremely envious of Harris—and Harris' young daughter. Coordinating the spectacle as road manager was Phil Kaufman, who had served time with Charles Manson on Terminal Island in the mid-sixties and first met Parsons while working for the Stones in 1968. Kaufman ensured that the performer stayed away from substance abuse, limiting his alcohol intake during shows and throwing out any drugs smuggled into hotel rooms. At first, the band was under-rehearsed and played poorly, but improved markedly with steady gigging and received rapturous responses at the Armadillo World Headquarters in Austin, Texas and at a filmed concert at Liberty Hall in Houston (with Neil Young and Linda Ronstadt sitting in) and Max's Kansas City in New York City. According to a number of sources, it was Emmylou who forced the band to practice and work up an actual set list. Nevertheless, the tour did absolutely nothing for record sales. While he had been in the vanguard with The Byrds and the Burrito Brothers, Parsons was now perceived as being too authentic and traditional in an era dominated by the stylings of the Eagles,[citation needed] whose sound Parsons disliked (although he did maintain cordial relations with Bernie Leadon, a former member of the Eagles who left the group in 1975).\nFor his next and final album, 1974's posthumously released Grievous Angel, he again used Harris and Burton for the sessions. The record received even more enthusiastic reviews than had GP, and has since attained classic status. Its most celebrated song is a Parsons-Harris duet cover of \"Love Hurts,\" a song that long remained in Harris' solo repertoire. Notable Parsons-penned songs included \"$1000 Wedding,\" a holdover from the Burrito Brothers era, and \"Brass Buttons,\" a 1965 opus which addresses his mother's alcoholism. Also included was a new version of \"Hickory Wind\" and \"Ooh Las Vegas,\" co-written with Grech and dating from the GP sessions. Despite the fact that Parsons only contributed two new songs to the album (\"In My Hour of Darkness\", \"Return of the Grievous Angel\"), Parsons was highly enthused with his new sound and seemed to have finally adopted a serious, diligent mindset to his musical career, eschewing most drugs and alcohol during the sessions.\nBefore recording, Parsons and Harris played a preliminary three show mini-tour as the headline act in a Warner Brothers country-rock package. The backing band included Clarence White, Pete Kleinow, and Chris Etheridge. On July 14, 1973, White was killed by a drunk driver in Palmdale, California while loading equipment in his car for a concert with the New Kentucky Colonels. At White's funeral, Parsons and Bernie Leadon launched into an impromptu touching rendition of \"Farther Along\"; that evening, Parsons reportedly informed Phil Kaufman of his final wish: to be cremated in Joshua Tree. Despite the almost insurmountable setback, Parsons, Harris, and the other musicians decided to continue with plans for a fall tour.\nIn the summer of 1973, Parsons' Topanga Canyon home burned to the ground, the result of a stray cigarette. Nearly all of his possessions were destroyed with the exception of a guitar and a prized Jaguar automobile. The fire proved to be the last straw in the relationship between Burrell and Parsons, who moved into a spare room in Kaufman's house. While not recording, he frequently hung out and jammed with members of New Jersey–based country rockers Quacky Duck and His Barnyard Friends (whose members included Tony Bennett's sons, Danny and Dae Bennett as well as future Dylan sideman and member of the Alpha Band, multi-instrumentalist David Mansfield) and the proto-punk Jonathan Richman & the Modern Lovers, who were being managed by Kaufman. Richman credits Parsons with introducing him to acoustic-based music[citation needed]. Parsons is credited as producer on Quacky Duck's only album, Media Push, released by Warner Bros. in 1974. According to the road manager of Quacky Duck, Parsons was, despite being frequently drunk, a kind soul who provided business and musical guidance to the younger band.\nBefore formally breaking up with Burrell, Parsons already had a woman waiting in the wings. While recording, he saw a photo of a beautiful woman at a friend's home and was instantly smitten. The woman turned out to be Margaret Fisher, a high school sweetheart of the singer from his Waycross, Georgia days. Like Parsons, Fisher had drifted west and became established in the Bay Area rock scene. A meeting was arranged and the two instantly rekindled their relationship, with Fisher dividing her weeks between Los Angeles and San Francisco at Parsons' expense.\nDeath[edit]\nIn the late 1960s, Parsons became enamored with Joshua Tree National Monument (now Joshua Tree National Park) in southeastern California. After splitting from Burrell, Parsons would frequently spend his weekends in the area with Margaret Fisher and Phil Kaufman. Parsons was scheduled to begin another tour in October 1973. Parsons decided to go on one more excursion before this tour. Accompanying him were Fisher, personal assistant Michael Martin, and Dale McElroy, Martin's girlfriend.\nLess than two days after arriving, Parsons was discovered unresponsive in his bedroom. Attempts to revive him failed and death was officially pronounced at 12:15 am on September 19, 1973 at Hi-Desert Memorial Hospital.[35] Parsons was 26 years old at the time of his death and the official cause of death was an overdose of morphine and alcohol.[36][37] According to Fisher in the 2005 biography Grievous Angel: An Intimate Biography of Gram Parsons, the amount of morphine consumed by Parsons would be lethal to three regular users and thus he had likely overestimated his tolerance considering his experience with opiates. Fisher and McElroy were returned to Los Angeles by Kaufman, who dispersed the remnants of Parsons' stash in the desert.\nParsons' body disappeared from the Los Angeles International Airport where it was being readied to be shipped to Louisiana for burial. Before his death, Parsons stated that he wanted his body cremated at Joshua Tree and his ashes spread over Cap Rock, a prominent natural feature there; however, Parsons' stepfather organized private ceremony back in New Orleans and neglected to invite any of his friends from the music industry.[37] Two accounts state that Bob Parsons stood to inherit Gram's share of his grandfather's estate if he could prove that Gram was a resident of Louisiana, explaining his eagerness to have him buried there.[38][39]\n\n\nParsons' makeshift memorial in Joshua Tree, California\nTo fulfill Parsons' funeral wishes, Kaufman and a friend stole his body from the airport and in a borrowed hearse drove it to Joshua Tree. Upon reaching the Cap Rock section of the park, they attempted to cremate Parsons' corpse by pouring five gallons of gasoline into the open coffin and throwing a lit match inside. What resulted was an enormous fireball. The police gave chase but, as one account puts it, \"were encumbered by sobriety,\" and the men escaped.[37] The two were arrested several days later. Since there was no law against stealing a dead body, they were only fined $750[40] for stealing the coffin and were not prosecuted for leaving 35 pounds (16 kg) of his charred remains in the desert. Parsons's body was eventually buried in Garden of Memories Cemetery in Metairie, Louisiana.\nThe site of Parsons' cremation was marked by a small concrete slab and was presided over by a large rock flake known to rock climbers as The Gram Parsons Memorial Hand Traverse.[41] The slab has since been removed by the U.S. National Park Service, and relocated to the Joshua Tree Inn. There is no monument at Cap Rock noting Parsons' cremation at the site.[42] Joshua Tree park guides are given the option to tell the story of Parsons' cremation during tours, but there is no mention of the act in official maps or brochures.[42] Fans regularly assemble simple rock structures and writings on the rock, which the park service sand blasts to remove from time to time.[42]\nLegacy[edit]\n\nStephen Thomas Erlewine of Allmusic describes Parsons as \"enormously influential\" for both country and rock, \"blending the two genres to the point that they became indistinguishable from each other. ... His influence could still be heard well into the next millennium.\"[3] In his essay on Parsons for Rolling Stone magazine's \"100 Greatest Artist\" list, Keith Richards notes that Parsons' recorded music output was \"pretty minimal.\" But nevertheless, Richards claims that Parsons \"effect on country music is enormous[, t]his is why we're talking about him now.\"[4]\nThe 2003 film Grand Theft Parsons stars Johnny Knoxville as Phil Kaufman and chronicles a farcical version of the theft of Parsons' corpse. In 2006, Gandulf Hennig directed documentary film titled Gram Parsons: Fallen Angel was released.\nEmmylou Harris has continued to champion Parsons' work throughout her career, covering a number of his songs over the years, including \"Hickory Wind\", \"Wheels\", \"Sin City\", \"Luxury Liner\", and \"Hot Burrito No. 2\". Harris' songs \"Boulder to Birmingham\", from her 1975 album Pieces of the Sky, and \"The Road\", from her 2011 album Hard Bargain, are tributes to Parsons.[citation needed] In addition, her 1985 album The Ballad of Sally Rose is an original concept album that includes many allusions to Parsons in its narrative.[citation needed] The song \"My Man\", written by Bernie Leadon and performed by the Eagles on their album On the Border, is a tribute to Gram Parsons.[43] Both Leadon and Parsons were members of the Flying Burrito Brothers during the late 1960s and early 1970s.[44]\nThe 1973 album \"Crazy Eyes\" by Poco pays homage to Parsons, as Richie Furay composed the title track in honor of him, and sings one of Parsons' own compositions, \"Brass Buttons.\" The album was released four days before Parsons died.\nA music festival called Gram Fest or the Cosmic American Music Festival was held annually in honor of Parsons in Joshua Tree, California, between 1996 and 2006. The show featured tunes written by Gram Parsons and Gene Clark as well as influential songs and musical styles from other artists that were part of that era. Performers were also encouraged to showcase their own material. The underlying theme of the event is to inspire the performers to take these musical styles to the next level of the creative process. Past concerts have featured such notable artists as Sneaky Pete Kleinow, Chris Ethridge, Spooner Oldham, John Molo, Jack Royerton, Gib Guilbeau, Counting Crows, Bob Warford, Rosie Flores, David Lowery, Barry & Holly Tashian, George Tomsco, Jann Browne, Lucinda Williams, Polly Parsons, The \"Road Mangler\"- Phil Kaufman, Ben Fong-Torres, Victoria Williams & Mark Olson, Sid Griffin, as well as a variety of many other bands that had played over the 2 or 3 day event. In addition, the Gram Parsons Tribute, in Waycross, Georgia, is a music festival remembering Parsons in the town in which he grew up. Additional tributes spring up every year, the latest being the Southern California \"Gram On!\" celebration by The Rickenbastards in July, 2013, celebrating the life and legacy of a simple country boy with a dream, Gram Parsons.\nIn 2007, La Maison Tellier released their album Second souffle which contained a song entitled \"The Last Days of Gram Parson\".\nIn February 2008, Gram's protégée, Emmylou Harris, was inducted into the Country Music Hall of Fame. Despite his influence, however, Parsons has yet to be inducted. Radley Balko has written that \"Parsons may be the most influential artist yet to be inducted to either the Rock and Roll or Country Music Hall(s) of Fame. And it's a damned shame.\"[45] The Gram Parsons Petition Project (now Gram InterNational)[46] was begun in May 2008 in support of an ongoing drive to induct Parsons into the Country Music Hall of Fame. On September 19, 2008, the 35th anniversary of Parsons' death, it was first presented to the Country Music Association (CMA) and Hall as a \"List of Supporters\" together with the official Nomination Proposal.[47] The online List of Supporters reached 10,000 on the 40th anniversary of his death, with 11,400 currently listed. Annual Gram InterNational concerts in Nashville and various other cities support the petition cause as do other such tribute events.\nIn November 2009, the musical theatre production Grievous Angel: The Legend of Gram Parsons premiered, starring Anders Drerup as Gram Parsons and Kelly Prescott as Emmylou Harris.[48] Directed by Micheal Bate and co-written by Bate and David McDonald, the production was inspired by a March 1973 interview that Bate conducted with Parsons, which became Parsons' last recorded conversation.[49]\nIn 2012, Swedish folk duo First Aid Kit released the single \"Emmylou\" from the album The Lion's Roar. The song's chorus is a lyrical acknowledgment of the Gram Parsons and Emmylou Harris singing partnership,[50] and to the romantic relationship between them that never fully developed before his death.[51][52]\nDiscography[edit]\n\nYear\tAlbum\tChart Positions[3]\nUS\tUS Country\n1968\tSafe at Home (International Submarine Band)\t—\t—\nSweetheart of the Rodeo (The Byrds)\t77\t—\n1969\tThe Gilded Palace of Sin (Flying Burrito Brothers)\t164\t—\n1970\tBurrito Deluxe (Flying Burrito Brothers)\t—\t—\n1973\tGP\t—\t—\n1974\tGrievous Angel\t195\t—\n1976\tSleepless Nights (Gram Parsons & the Flying Burrito Brothers)\t185\t—\n1979\tEarly Years (1963–1965)\t—\t—\n1982\tLive 1973 (Gram Parsons and the Fallen Angels)\t—\t—\n1987\tDim Lights, Thick Smoke and Loud Loud Music (Flying Burrito Brothers)\t—\t—\n1995\tCosmic American Music\t—\t—\n2001\tAnother Side of This Life: The Lost Recordings of Gram Parsons\t—\t—\n2001\tSacred Hearts & Fallen Angels: The Gram Parsons Anthology\t—\t—\n2006\tThe Complete Reprise Sessions\t—\t—\n2007\tGram Parsons Archives Vol.1: Live at the Avalon Ballroom 1969\n(Gram Parsons with the Flying Burrito Brothers)\t—\t45\n\"—\" denotes the release failed to chart.\nTribute albums[edit]\nConmemorativo: A Tribute to Gram Parsons (1993)\nReturn of the Grievous Angel: A Tribute to Gram Parsons (1999) <a href=\"https://www.last.fm/music/Gram+Parsons\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "270757",
      "discogs_original_name": "Gram Parsons",
      "id": null,
      "lastfm_mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
      "name": "Gram Parsons",
      "role": "",
      "spotify_id": "1KA3WXYMPLxomNuoE22LYd",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Gram Parsons": {
      "biography": "Gram Parsons (November 5, 1946 – September 19, 1973) was an American singer, songwriter, guitarist and pianist born Ingram Cecil Connor, III. A solo artist as well as a member of The International Submarine Band, The Byrds and The Flying Burrito Brothers, he is best known for a series of recordings which anticipate the country rock of the 1970s and the alt-country movement that began in the 80s. Parsons was a close friend of  Keith Richards and is also credited for turning the Rolling Stones onto country music in their 'Let it Bleed'-era. \nParsons described his records as \"Cosmic American Music\". He died of a drug overdose, at the age of 26, on September 19, 1973. Parsons' body was stolen from the airport and cremated on a makeshift outdoor funeral pyre (coffin and five gallons of gas) at Cap Rock,Joshua Tree by his road manager, Phil Kaufmann. \n\nCecil Ingram Connor III (November 5, 1946 – September 19, 1973), known professionally as Gram Parsons, was an American singer, songwriter, guitarist, and pianist. Parsons is best known for his work within the country music genre; he also popularized what he called \"Cosmic American Music\", a hybrid of country, rhythm and blues, soul, folk, and rock.[1][2] Besides recording as a solo artist, he also worked in several notable bands, including the International Submarine Band, The Byrds, and The Flying Burrito Brothers. His relatively short career is described by Allmusic as \"enormously influential\" for both country and rock, \"blending the two genres to the point that they became indistinguishable from each other.\"[3]\nParsons was born in Winter Haven, Florida and developed an interest in country music while attending Harvard University. He founded the International Submarine Band in 1966, and after several months of delay their debut, Safe at Home, was released in 1968, by which time the group had disbanded. Parsons joined The Byrds in early 1968, and played a pivotal role in the making of the seminal Sweetheart of the Rodeo album. After leaving the group in late 1968, Parsons and fellow Byrd Chris Hillman formed The Flying Burrito Brothers in 1969, releasing their debut, The Gilded Palace of Sin, the same year. The album was well received but failed commercially; after a sloppy cross-country tour, they hastily recorded Burrito Deluxe. Parsons was fired from the band before its release in early 1970. He soon signed with A&M Records, but after several unproductive sessions he canceled his intended solo debut in early 1971. Parsons moved to France, where he lived for a short period at Villa Nellcôte with his friend Keith Richards of The Rolling Stones. Returning to America, Parsons befriended Emmylou Harris, who assisted him on vocals for his first solo record, GP, released in 1973. Although it received enthusiastic reviews, the release failed to chart; his next album, Grievous Angel met with a similar reception, and peaked at number 195 on Billboard. Recreational drug abuse severely deteriorated his health, and he died in September 1973 at the age of 26.\nSince his death, Parsons has been recognized as an extremely influential artist, credited with helping to found both country rock and alt-country.[3] His posthumous honors include the Americana Music Association \"President's Award\" for 2003, and a ranking at No. 87 on Rolling Stone's list of the \"100 Greatest Artists of All Time.\"[4]\nContents  [hide] \n1 Life and career\n1.1 Early years (1946–67)\n1.2 The Byrds (1968)\n1.3 The Flying Burrito Brothers (1969–70)\n1.4 Solo career and touring with Emmylou Harris (1970–73)\n1.5 Death\n2 Legacy\n3 Discography\n3.1 Tribute albums\n4 Notes\n5 References\n5.1 Bibliography\n6 External links\nLife and career[edit]\n\nEarly years (1946–67)[edit]\nCecil Ingram Connor III was born on November 5, 1946, in Winter Haven, Florida, to Major Cecil Ingram (\"Coon Dog\") and Avis (née Snively) Connor.[5] The Connors normally resided at their main residence in Waycross, Georgia, but Avis traveled to her hometown in Florida to give birth.[5] She was the daughter of citrus fruit magnate John A. Snively, who held extensive properties both in Winter Haven and in Waycross; Parsons' father was a famous World War II flying ace, decorated with the Air Medal, who was present at the 1941 attack on Pearl Harbor.[6] Biographer David Meyer characterized Coon Dog and Avis as loving parents: he writes in Twenty Thousand Roads that they are \"remembered as affectionate parents and a loving couple\".[5] He also notes, however, that \"unhappiness was eating away at the Connor family\": Avis suffered from depression, and both parents were alcoholics.[7] Coon Dog committed suicide two days before Christmas Day, 1958, devastating the young Gram and the rest of the Connor family.[8] Avis subsequently married Robert Parsons, whose surname was adopted by Cecil Ingram (henceforth he would be known as Gram Parsons). Gram attended the prestigious Bolles School in Jacksonville, Florida. For a time, the family found a stability of sorts. They were soon torn apart in early 1965, when Robert became embroiled in an extramarital affair and Avis' heavy drinking led to her death from cirrhosis on July 5, 1965, the day of Gram's graduation from Bolles.[9]\nAs his family disintegrated around him, Parsons developed strong musical interests, particularly after seeing Elvis Presley perform in concert on February 22, 1956, in Waycross.[10] Five years later, while barely in his teens, he played in rock and roll cover bands such as the Pacers and the Legends, headlining in clubs owned by his stepfather in the Winter Haven/Polk County area. By the age of 16 he graduated to folk music, and in 1963 he teamed with his first professional outfit, the Shilos, in Greenville, SC. Heavily influenced by The Kingston Trio and the Journeymen,[11] the band played hootenannies, coffee houses and high school auditoriums. Forays into New York City's Greenwich Village included appearances at The Bitter End.\nAfter The Shilos broke up, Parsons attended Harvard University, where he studied theology but departed after one semester. Despite being from the South, he did not become seriously interested in country music until his time at Harvard, where he heard Merle Haggard for the first time. In 1966, he and other musicians from the Boston folk scene formed a group called the International Submarine Band. They relocated to Los Angeles the following year, and after several lineup changes signed to Lee Hazlewood's LHI Records, where they spent late 1967 recording Safe at Home. The album contains one of Parsons' best-known songs, \"Luxury Liner\", and an early version of \"Do You Know How It Feels\", which he revisited later on in his career. Safe at Home would remain unreleased until mid 1968, by which time the International Submarine Band had broken up.\nThe Byrds (1968)[edit]\nBy 1968 Parsons had come to the attention of The Byrds' bassist, Chris Hillman, via Larry Spector (The Byrds' business manager), as a possible replacement band member following the departures of David Crosby and Michael Clarke from the group in late 1967.[12][13] Parsons had been acquainted with Hillman since the pair had met in a bank during 1967 and in February 1968 he passed an audition for the band, being initially recruited as a jazz pianist but soon switching to rhythm guitar and vocals.[12][14]\nAlthough Parsons was an equal contributor to the band, he was not regarded as a full member of The Byrds by the band's record label, Columbia Records.[15] Consequently, when The Byrds' Columbia recording contract was renewed on February 29, 1968, it was only original members Roger McGuinn and Chris Hillman who signed it.[15] Parsons, like fellow new recruit Kevin Kelley, was hired as a sideman and received a salary from McGuinn and Hillman.[16] In later years, this led Hillman to state \"Gram was hired. He was not a member of The Byrds, ever — he was on salary, that was the only way we could get him to turn up.\"[17] However, these comments overlook the fact that Parsons, like Kelley, was considered a bona fide member of the band during 1968 and as such, was given equal billing alongside McGuinn, Hillman, and Kelley on the Sweetheart of the Rodeo album and in contemporary press coverage of the band.[18]\n\"Being with The Byrds confused me a little. I couldn't find my place. I didn't have enough say-so; I really wasn't one of The Byrds. I was originally hired because they wanted a keyboard player. But I had experience being a frontman and that came out immediately. And [Roger McGuinn] being a very perceptive fellow saw that it would help the act, and he started sticking me out front.\"\n—Gram Parsons reflecting on his time with The Byrds[19]\nSweetheart of the Rodeo was originally conceived by band leader Roger McGuinn as a sprawling, double album history of American popular music.[20] It was to begin with bluegrass music, then move through country and western, jazz, rhythm and blues, and rock music, before finally ending with the most advanced (for the time) form of electronic music.[14] However, as recording plans were made, Parsons exerted a controlling influence over the group, persuading the other members to leave Los Angeles and record the album in Nashville, Tennessee.[15] Along the way, McGuinn's original album concept was jettisoned in favor of a fully fledged country project, which included Parsons' songs such as \"One Hundred Years from Now\" and \"Hickory Wind\", along with compositions by Bob Dylan, Woody Guthrie, Merle Haggard, and others.[21]\nRecording sessions for Sweetheart of the Rodeo commenced at Columbia Records' recording studios in the Music Row area of Nashville on March 9, 1968.[14] Mid-way through, the sessions moved to Columbia Studios, Hollywood, Los Angeles. They finally came to a close on May 27, 1968.[14][22] However, Parsons was still under contract to LHI Records and consequently, Hazlewood contested Parsons' appearance on the album and threatened legal action.[20] As a result, McGuinn ended up replacing three of Parsons' lead vocals with his own singing on the finished album, a move that was still rankling Parsons as late as 1973, when he told Cameron Crowe in an interview that McGuinn \"erased it and did the vocals himself and fucked it up.\"[23] However, Parsons is still featured as lead vocalist on the songs \"You're Still on My Mind\", \"Life in Prison\", and \"Hickory Wind\".[21]\nWhile in England with The Byrds in the summer of 1968, Parsons left the band due to his concerns over a planned concert tour of South Africa, citing opposition to that country's apartheid policies.[14] There has been some doubt expressed by Hillman over the sincerity of Parsons' protest.[24] It appears that Parsons was mostly apolitical, although he did refer to one of the younger African-American butlers in the Connor household as being \"like a brother\" to him in an interview.[citation needed] During this period, Parsons became acquainted with Mick Jagger and Keith Richards of The Rolling Stones.[25] Before Parsons' departure from The Byrds, he had accompanied the two Rolling Stones to Stonehenge (along with McGuinn and Hillman) in the English county of Wiltshire, where Richards had a house near the ancient site.[26] Immediately after leaving the band, Parsons stayed at Richards' house and the pair developed a close friendship over the next few years, with Parsons reintroducing the guitarist to country music.[27] According to Stones' confidant and close friend of Parsons, Phil Kaufman, the twosome would sit around for hours, playing obscure country records and trading off on various songs with their guitars.[28]\nThe Flying Burrito Brothers (1969–70)[edit]\nReturning to Los Angeles, Parsons sought out Hillman, and the two formed The Flying Burrito Brothers with bassist Chris Ethridge and pedal steel player Sneaky Pete Kleinow. Their 1969 album The Gilded Palace of Sin was a modernized version of the Bakersfield style of country music made popular by Buck Owens, and the band appeared on the album cover wearing Nudie suits emblazoned with all sorts of hippie accoutrements. Along with the Parsons-Hillman originals \"Christine's Tune\" and \"Sin City\" were versions of the soul music classics \"The Dark End of the Street\" and \"Do Right Woman\", the latter featuring David Crosby on high harmony. The album's original songs were the result of a very productive songwriting partnership between Parsons and Hillman, who were sharing a bachelor pad in LA during this period. The atypically pronounced (for Parsons) gospel soul influence on this album likely comes from his frequent jamming with Delaney & Bonnie and Richards.\nThough not a commercial success, Gilded was measured by rock critic Robert Christgau as \"an ominous, obsessive, tongue-in-cheek country-rock synthesis, absorbing rural and urban, traditional and contemporary, at point of impact.\" The album was recorded without a permanent drummer, but the group soon added original Byrd Michael Clarke on drums. Embarking on a cross-country tour via train, as Parsons suffered from periodic bouts of fear of flying, the group squandered most of their money in a perpetual poker game and received bewildered reactions in most cities. Parsons was frequently indulging in massive quantities of psilocybin and cocaine, so his performances were erratic at best, while much of the band's repertoire consisted of vintage honky-tonk and soul standards with few originals. Perhaps the most successful appearance occurred in Philadelphia, where the group opened for the reconstituted Byrds. Midway through their set, Parsons joined the headline act and fronted his former group on renditions of \"Hickory Wind\" and \"You Don't Miss Your Water\". The other Burritos surfaced with the exception of Clarke, and the joint aggregation played several songs, including \"Long Black Veil\" and \"Goin' Back\".\nAfter returning to Los Angeles the group recorded \"The Train Song\", written during an increasingly infrequent songwriting session on the train and produced by 1950s R&B legends Larry Williams and Johnny \"Guitar\" Watson. Despite a request from the Burritos that the remnants of their publicity budget be diverted to promotion of the single, it also flopped. Ethridge departed shortly thereafter. He was replaced by lead guitarist Bernie Leadon, while Hillman reverted to bass.\nBy this time, Parsons's own use of drugs had increased to the extent that new songs were rare and much of his time was diverted to partying with the Stones, who briefly relocated to America in the summer of 1969 to finish their forthcoming Let It Bleed album and prepare for an autumn cross-country tour, their first series of regular live engagements since 1967. As they prepared to play the nation's largest sports arenas, the Burritos played to dwindling nightclub audiences; one night Jagger had to literally order Parsons to fulfill an obligation to his group.\nThe singer's dedication to the Rolling Stones was rewarded when the Burrito Brothers were booked as the opening act of the infamous Altamont Music Festival. Playing a short set including \"Six Days on the Road\" and \"Bony Moronie\", Parsons left on one of the final helicopters and attempted to pick up Michelle Phillips. \"Six Days...\" was included in Gimme Shelter, a documentary of the event.\nWith mounting debt incurred, A&M hoped to recoup some of their losses by marketing the Burritos as a straight country group. To this end, manager Jim Dickson instigated a loose session where the band recorded several honky tonk staples from their live act, contemporary pop covers in a countrified vein (\"To Love Somebody\", \"Lodi\", \"I Shall Be Released\", \"Honky Tonk Women\"), and Larry Williams' \"Bony Moronie\". This was soon scrapped in favor of a second album of originals on an extremely reduced budget. Faced with a dearth of new material, most of the material was hastily written in the studio by Leadon, Hillman, and Parsons, with two Gilded Palace of Sin outtakes thrown into the mix. The resulting album, entitled Burrito Deluxe, was released in April 1970.\nThe album is considered less inspired than its predecessor, but it is notable for the Parsons-Hillman-Leadon song \"Older Guys\" and for its take on Jagger and Richards' \"Wild Horses\"—the first recording released of this famous song. Parsons was inspired to cover the song after hearing an advance tape of the Sticky Fingers album sent to Kleinow, who was scheduled to overdub a part on the song (Kleinow's part was not included on the released Rolling Stones version, though it is available on bootlegs). Jagger consented to the cover version, so long as the Flying Burrito Brothers did not issue it as a single.\nBurrito Deluxe, like its predecessor, underperformed commercially but faced the double whammy of being lambasted by critics. Disenchanted with the band, Parsons left the Burritos in mutual agreement with Hillman, who was at his wits end after two years of babysitting Gram. Under Hillman's direction, the group recorded two further LPs.\nIn a recent interview with American Songwriter Chris Hillman explained that, “The greatest legacy of the Flying Burrito Brothers and Gram is we were the alternative country band. We couldn’t get on country radio and we couldn’t get on rock radio! We were the outlaw country band for a brief period,” says Hillman.\"[29]\nSolo career and touring with Emmylou Harris (1970–73)[edit]\nParsons signed a solo deal with A&M Records and moved in with producer Terry Melcher in early 1970.[30] Melcher (who had worked with The Byrds and The Beach Boys and had rejected producing an unknown singer/songwriter by the name of Charles Manson) was a member of the successful duo Bruce & Terry, also known as The Rip Chords. The two shared a mutual penchant for cocaine and heroin, and as a result, the sessions were largely unproductive, with Parsons eventually losing interest in the project. \"Terry loved Gram and wanted to produce him ... But neither of them could get anything done,\" recalled Eve Babitz.[31] \"Long lost, the tapes from this session have gathered a legendary patina,\" writes David Meyer.[32] The recording stalled, and the master tapes were checked out, but there is conflict as to whether \"Gram ... or Melcher took them\".[33] He accompanied the Rolling Stones on their 1971 U.K. tour in the hope of being signed to the newly formed Rolling Stones Records, intending to record a duo album with Richards. Moving into Villa Nellcôte with the guitarist during the sessions for Exile on Main Street, Parsons remained in a consistently incapacitated state and frequently quarreled with his much younger girlfriend, aspiring actress Gretchen Burrell. Eventually, Parsons was asked to leave by Anita Pallenberg, Richards' longtime domestic partner. Keith suggests in his autobiography \"Life\" that Mick Jagger may have been the real driver for Parson' departure given that Keith spent so much time playing music with Gram. Rumors have persisted that he appears somewhere on the legendary album, and while Richards concedes that it is very likely he is among the chorus of singers on \"Sweet Virginia\", to this day nothing has been substantiated. Parsons attempted to rekindle his relationship with the band on their 1972 tour to no avail.\nAfter leaving the Stones' camp, Parsons married Burrell in 1971 at his stepfather's New Orleans estate. Allegedly, the relationship was far from stable, with Burrell cutting a needy and jealous figure while Parsons quashed her burgeoning film career. Many of the singer's closest associates and friends claim that Parsons was preparing to commence divorce proceedings at the time of his death; the couple had already separated by this point.\n\n\nParsons in 1972\nParsons and Burrell enjoyed the most idyllic time of their relationship, visiting old cohorts like Ian Dunlop and Family/Blind Faith/Traffic member Ric Grech in England. With the assistance of Grech and one of the bassist's friends, a doctor who also dabbled in country music and is now known as Hank Wangford,[34] Parsons eventually stopped taking heroin (a treatment suggested by William Burroughs proved unsuccessful).\nHe returned to the U.S. for a one-off concert with the Burritos, and at Hillman's request went to hear Emmylou Harris sing in a small club in Washington, D.C. They befriended each other and, within a year, he asked her to join him in Los Angeles for another attempt to record his first solo album.\nHaving gained thirty pounds since his Burrito days from Southern food and excessive alcohol consumption, it came as a surprise to many when Parsons was enthusiastically signed to Reprise Records by Mo Ostin in mid-1972. GP, released in 1973, featured Elvis Presley's lead guitarist James Burton, and featured new songs from a creatively revitalized Parsons such as \"Big Mouth Blues\" and \"Kiss the Children,\" as well as a cover of Tompall Glaser's \"Streets of Baltimore\".\nParsons, by now featuring Harris as his duet partner, played dates across the United States as Gram Parsons and the Fallen Angels. Unable to afford the services of Presley's band for a month, the band featured the talents of Colorado-based rock guitarist Jock Bartley (soon to skyrocket to fame with Firefall), veteran Nashville session musician Neil Flanz on pedal steel, Kyle Tullis on bass and former Mountain drummer N.D. Smart (once described by Canadian folksinger Ian Tyson as \"a psychotic redneck\"). The touring party also included Gretchen Parsons—by this point extremely envious of Harris—and Harris' young daughter. Coordinating the spectacle as road manager was Phil Kaufman, who had served time with Charles Manson on Terminal Island in the mid-sixties and first met Parsons while working for the Stones in 1968. Kaufman ensured that the performer stayed away from substance abuse, limiting his alcohol intake during shows and throwing out any drugs smuggled into hotel rooms. At first, the band was under-rehearsed and played poorly, but improved markedly with steady gigging and received rapturous responses at the Armadillo World Headquarters in Austin, Texas and at a filmed concert at Liberty Hall in Houston (with Neil Young and Linda Ronstadt sitting in) and Max's Kansas City in New York City. According to a number of sources, it was Emmylou who forced the band to practice and work up an actual set list. Nevertheless, the tour did absolutely nothing for record sales. While he had been in the vanguard with The Byrds and the Burrito Brothers, Parsons was now perceived as being too authentic and traditional in an era dominated by the stylings of the Eagles,[citation needed] whose sound Parsons disliked (although he did maintain cordial relations with Bernie Leadon, a former member of the Eagles who left the group in 1975).\nFor his next and final album, 1974's posthumously released Grievous Angel, he again used Harris and Burton for the sessions. The record received even more enthusiastic reviews than had GP, and has since attained classic status. Its most celebrated song is a Parsons-Harris duet cover of \"Love Hurts,\" a song that long remained in Harris' solo repertoire. Notable Parsons-penned songs included \"$1000 Wedding,\" a holdover from the Burrito Brothers era, and \"Brass Buttons,\" a 1965 opus which addresses his mother's alcoholism. Also included was a new version of \"Hickory Wind\" and \"Ooh Las Vegas,\" co-written with Grech and dating from the GP sessions. Despite the fact that Parsons only contributed two new songs to the album (\"In My Hour of Darkness\", \"Return of the Grievous Angel\"), Parsons was highly enthused with his new sound and seemed to have finally adopted a serious, diligent mindset to his musical career, eschewing most drugs and alcohol during the sessions.\nBefore recording, Parsons and Harris played a preliminary three show mini-tour as the headline act in a Warner Brothers country-rock package. The backing band included Clarence White, Pete Kleinow, and Chris Etheridge. On July 14, 1973, White was killed by a drunk driver in Palmdale, California while loading equipment in his car for a concert with the New Kentucky Colonels. At White's funeral, Parsons and Bernie Leadon launched into an impromptu touching rendition of \"Farther Along\"; that evening, Parsons reportedly informed Phil Kaufman of his final wish: to be cremated in Joshua Tree. Despite the almost insurmountable setback, Parsons, Harris, and the other musicians decided to continue with plans for a fall tour.\nIn the summer of 1973, Parsons' Topanga Canyon home burned to the ground, the result of a stray cigarette. Nearly all of his possessions were destroyed with the exception of a guitar and a prized Jaguar automobile. The fire proved to be the last straw in the relationship between Burrell and Parsons, who moved into a spare room in Kaufman's house. While not recording, he frequently hung out and jammed with members of New Jersey–based country rockers Quacky Duck and His Barnyard Friends (whose members included Tony Bennett's sons, Danny and Dae Bennett as well as future Dylan sideman and member of the Alpha Band, multi-instrumentalist David Mansfield) and the proto-punk Jonathan Richman & the Modern Lovers, who were being managed by Kaufman. Richman credits Parsons with introducing him to acoustic-based music[citation needed]. Parsons is credited as producer on Quacky Duck's only album, Media Push, released by Warner Bros. in 1974. According to the road manager of Quacky Duck, Parsons was, despite being frequently drunk, a kind soul who provided business and musical guidance to the younger band.\nBefore formally breaking up with Burrell, Parsons already had a woman waiting in the wings. While recording, he saw a photo of a beautiful woman at a friend's home and was instantly smitten. The woman turned out to be Margaret Fisher, a high school sweetheart of the singer from his Waycross, Georgia days. Like Parsons, Fisher had drifted west and became established in the Bay Area rock scene. A meeting was arranged and the two instantly rekindled their relationship, with Fisher dividing her weeks between Los Angeles and San Francisco at Parsons' expense.\nDeath[edit]\nIn the late 1960s, Parsons became enamored with Joshua Tree National Monument (now Joshua Tree National Park) in southeastern California. After splitting from Burrell, Parsons would frequently spend his weekends in the area with Margaret Fisher and Phil Kaufman. Parsons was scheduled to begin another tour in October 1973. Parsons decided to go on one more excursion before this tour. Accompanying him were Fisher, personal assistant Michael Martin, and Dale McElroy, Martin's girlfriend.\nLess than two days after arriving, Parsons was discovered unresponsive in his bedroom. Attempts to revive him failed and death was officially pronounced at 12:15 am on September 19, 1973 at Hi-Desert Memorial Hospital.[35] Parsons was 26 years old at the time of his death and the official cause of death was an overdose of morphine and alcohol.[36][37] According to Fisher in the 2005 biography Grievous Angel: An Intimate Biography of Gram Parsons, the amount of morphine consumed by Parsons would be lethal to three regular users and thus he had likely overestimated his tolerance considering his experience with opiates. Fisher and McElroy were returned to Los Angeles by Kaufman, who dispersed the remnants of Parsons' stash in the desert.\nParsons' body disappeared from the Los Angeles International Airport where it was being readied to be shipped to Louisiana for burial. Before his death, Parsons stated that he wanted his body cremated at Joshua Tree and his ashes spread over Cap Rock, a prominent natural feature there; however, Parsons' stepfather organized private ceremony back in New Orleans and neglected to invite any of his friends from the music industry.[37] Two accounts state that Bob Parsons stood to inherit Gram's share of his grandfather's estate if he could prove that Gram was a resident of Louisiana, explaining his eagerness to have him buried there.[38][39]\n\n\nParsons' makeshift memorial in Joshua Tree, California\nTo fulfill Parsons' funeral wishes, Kaufman and a friend stole his body from the airport and in a borrowed hearse drove it to Joshua Tree. Upon reaching the Cap Rock section of the park, they attempted to cremate Parsons' corpse by pouring five gallons of gasoline into the open coffin and throwing a lit match inside. What resulted was an enormous fireball. The police gave chase but, as one account puts it, \"were encumbered by sobriety,\" and the men escaped.[37] The two were arrested several days later. Since there was no law against stealing a dead body, they were only fined $750[40] for stealing the coffin and were not prosecuted for leaving 35 pounds (16 kg) of his charred remains in the desert. Parsons's body was eventually buried in Garden of Memories Cemetery in Metairie, Louisiana.\nThe site of Parsons' cremation was marked by a small concrete slab and was presided over by a large rock flake known to rock climbers as The Gram Parsons Memorial Hand Traverse.[41] The slab has since been removed by the U.S. National Park Service, and relocated to the Joshua Tree Inn. There is no monument at Cap Rock noting Parsons' cremation at the site.[42] Joshua Tree park guides are given the option to tell the story of Parsons' cremation during tours, but there is no mention of the act in official maps or brochures.[42] Fans regularly assemble simple rock structures and writings on the rock, which the park service sand blasts to remove from time to time.[42]\nLegacy[edit]\n\nStephen Thomas Erlewine of Allmusic describes Parsons as \"enormously influential\" for both country and rock, \"blending the two genres to the point that they became indistinguishable from each other. ... His influence could still be heard well into the next millennium.\"[3] In his essay on Parsons for Rolling Stone magazine's \"100 Greatest Artist\" list, Keith Richards notes that Parsons' recorded music output was \"pretty minimal.\" But nevertheless, Richards claims that Parsons \"effect on country music is enormous[, t]his is why we're talking about him now.\"[4]\nThe 2003 film Grand Theft Parsons stars Johnny Knoxville as Phil Kaufman and chronicles a farcical version of the theft of Parsons' corpse. In 2006, Gandulf Hennig directed documentary film titled Gram Parsons: Fallen Angel was released.\nEmmylou Harris has continued to champion Parsons' work throughout her career, covering a number of his songs over the years, including \"Hickory Wind\", \"Wheels\", \"Sin City\", \"Luxury Liner\", and \"Hot Burrito No. 2\". Harris' songs \"Boulder to Birmingham\", from her 1975 album Pieces of the Sky, and \"The Road\", from her 2011 album Hard Bargain, are tributes to Parsons.[citation needed] In addition, her 1985 album The Ballad of Sally Rose is an original concept album that includes many allusions to Parsons in its narrative.[citation needed] The song \"My Man\", written by Bernie Leadon and performed by the Eagles on their album On the Border, is a tribute to Gram Parsons.[43] Both Leadon and Parsons were members of the Flying Burrito Brothers during the late 1960s and early 1970s.[44]\nThe 1973 album \"Crazy Eyes\" by Poco pays homage to Parsons, as Richie Furay composed the title track in honor of him, and sings one of Parsons' own compositions, \"Brass Buttons.\" The album was released four days before Parsons died.\nA music festival called Gram Fest or the Cosmic American Music Festival was held annually in honor of Parsons in Joshua Tree, California, between 1996 and 2006. The show featured tunes written by Gram Parsons and Gene Clark as well as influential songs and musical styles from other artists that were part of that era. Performers were also encouraged to showcase their own material. The underlying theme of the event is to inspire the performers to take these musical styles to the next level of the creative process. Past concerts have featured such notable artists as Sneaky Pete Kleinow, Chris Ethridge, Spooner Oldham, John Molo, Jack Royerton, Gib Guilbeau, Counting Crows, Bob Warford, Rosie Flores, David Lowery, Barry & Holly Tashian, George Tomsco, Jann Browne, Lucinda Williams, Polly Parsons, The \"Road Mangler\"- Phil Kaufman, Ben Fong-Torres, Victoria Williams & Mark Olson, Sid Griffin, as well as a variety of many other bands that had played over the 2 or 3 day event. In addition, the Gram Parsons Tribute, in Waycross, Georgia, is a music festival remembering Parsons in the town in which he grew up. Additional tributes spring up every year, the latest being the Southern California \"Gram On!\" celebration by The Rickenbastards in July, 2013, celebrating the life and legacy of a simple country boy with a dream, Gram Parsons.\nIn 2007, La Maison Tellier released their album Second souffle which contained a song entitled \"The Last Days of Gram Parson\".\nIn February 2008, Gram's protégée, Emmylou Harris, was inducted into the Country Music Hall of Fame. Despite his influence, however, Parsons has yet to be inducted. Radley Balko has written that \"Parsons may be the most influential artist yet to be inducted to either the Rock and Roll or Country Music Hall(s) of Fame. And it's a damned shame.\"[45] The Gram Parsons Petition Project (now Gram InterNational)[46] was begun in May 2008 in support of an ongoing drive to induct Parsons into the Country Music Hall of Fame. On September 19, 2008, the 35th anniversary of Parsons' death, it was first presented to the Country Music Association (CMA) and Hall as a \"List of Supporters\" together with the official Nomination Proposal.[47] The online List of Supporters reached 10,000 on the 40th anniversary of his death, with 11,400 currently listed. Annual Gram InterNational concerts in Nashville and various other cities support the petition cause as do other such tribute events.\nIn November 2009, the musical theatre production Grievous Angel: The Legend of Gram Parsons premiered, starring Anders Drerup as Gram Parsons and Kelly Prescott as Emmylou Harris.[48] Directed by Micheal Bate and co-written by Bate and David McDonald, the production was inspired by a March 1973 interview that Bate conducted with Parsons, which became Parsons' last recorded conversation.[49]\nIn 2012, Swedish folk duo First Aid Kit released the single \"Emmylou\" from the album The Lion's Roar. The song's chorus is a lyrical acknowledgment of the Gram Parsons and Emmylou Harris singing partnership,[50] and to the romantic relationship between them that never fully developed before his death.[51][52]\nDiscography[edit]\n\nYear\tAlbum\tChart Positions[3]\nUS\tUS Country\n1968\tSafe at Home (International Submarine Band)\t—\t—\nSweetheart of the Rodeo (The Byrds)\t77\t—\n1969\tThe Gilded Palace of Sin (Flying Burrito Brothers)\t164\t—\n1970\tBurrito Deluxe (Flying Burrito Brothers)\t—\t—\n1973\tGP\t—\t—\n1974\tGrievous Angel\t195\t—\n1976\tSleepless Nights (Gram Parsons & the Flying Burrito Brothers)\t185\t—\n1979\tEarly Years (1963–1965)\t—\t—\n1982\tLive 1973 (Gram Parsons and the Fallen Angels)\t—\t—\n1987\tDim Lights, Thick Smoke and Loud Loud Music (Flying Burrito Brothers)\t—\t—\n1995\tCosmic American Music\t—\t—\n2001\tAnother Side of This Life: The Lost Recordings of Gram Parsons\t—\t—\n2001\tSacred Hearts & Fallen Angels: The Gram Parsons Anthology\t—\t—\n2006\tThe Complete Reprise Sessions\t—\t—\n2007\tGram Parsons Archives Vol.1: Live at the Avalon Ballroom 1969\n(Gram Parsons with the Flying Burrito Brothers)\t—\t45\n\"—\" denotes the release failed to chart.\nTribute albums[edit]\nConmemorativo: A Tribute to Gram Parsons (1993)\nReturn of the Grievous Angel: A Tribute to Gram Parsons (1999) <a href=\"https://www.last.fm/music/Gram+Parsons\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "UK, Europe & US",
  "created_at": "2025-07-05T18:05:36.270423",
  "date_added": "2015-08-10T18:28:52-07:00",
  "discogs_id": "5886670",
  "discogs_url": "https://www.discogs.com/release/5886670-Gram-Parsons-Grievous-Angel",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock",
    "Folk, World, & Country",
    "1974",
    "country",
    "country rock",
    "singer-songwriter",
    "singing songwriters"
  ],
  "id": "5886670",
  "images": [
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/ql2hTOhc6dte9MDgDAD6PfZuGo-aoLj60TWBe9r8tIQ/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTQwNTQ3NTUx/Ny03MTk2LmpwZWc.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/ql2hTOhc6dte9MDgDAD6PfZuGo-aoLj60TWBe9r8tIQ/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTQwNTQ3NTUx/Ny03MTk2LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 595,
      "resource_url": "https://i.discogs.com/iuePtlpVDWG4-ILN9UkN1vBKKJQwRc-w5ZjxbdMJszc/rs:fit/g:sm/q:90/h:595/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTYxOTYxODk0/NC02MjQ3LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/iuePtlpVDWG4-ILN9UkN1vBKKJQwRc-w5ZjxbdMJszc/rs:fit/g:sm/q:90/h:595/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTYxOTYxODk0/NC02MjQ3LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/dMG4mTlvY0v67ypaPkkC33gEQ2EAo2cK-MPpjHJWiww/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTYxOTYxODk0/NC0yNTE3LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/dMG4mTlvY0v67ypaPkkC33gEQ2EAo2cK-MPpjHJWiww/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTYxOTYxODk0/NC0yNTE3LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/pB7mJ2qSFIxGxYKvivXhG2bsnAMbTmgEX2niIBRlMjE/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTYxOTYxODk0/My0xMDYzLmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/pB7mJ2qSFIxGxYKvivXhG2bsnAMbTmgEX2niIBRlMjE/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTYxOTYxODk0/My0xMDYzLmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/KarMChc3cwjtFW1j1HlaCE6_3ToxJk-Us4srtt0x5LY/rs:fit/g:sm/q:90/h:600/w:362/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTQwNTQ3NTUy/My0yNDEyLmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/KarMChc3cwjtFW1j1HlaCE6_3ToxJk-Us4srtt0x5LY/rs:fit/g:sm/q:90/h:600/w:362/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTU4ODY2/NzAtMTQwNTQ3NTUy/My0yNDEyLmpwZWc.jpeg",
      "width": 362
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/d2/60/71/d26071ab-2aaf-3c39-010a-48b4c761c37c/mzi.frxdfvyk.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "Reprise Records",
    "Rhino Records (2)",
    "Rhino Records (2)"
  ],
  "lastfm_mbid": null,
  "lastfm_url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel",
  "local_images": {
    "hi-res": "public/album/grievous-angel-5886670/grievous-angel-5886670-hi-res.jpg",
    "medium": "public/album/grievous-angel-5886670/grievous-angel-5886670-medium.jpg",
    "small": "public/album/grievous-angel-5886670/grievous-angel-5886670-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T18:05:38.182740",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "Grievous Angel",
  "release_name_discogs": "Grievous Angel",
  "release_name_spotify": "Grievous Angel",
  "released": "2014",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/d2/60/71/d26071ab-2aaf-3c39-010a-48b4c761c37c/mzi.frxdfvyk.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 1974 Warner Records Inc. Marketed by Rhino Entertainment Company, a Warner Music Group Company",
      "editorial_notes": "The smartest move in the making of Gram Parson's posthumously released 1974 sophomore album is Emmylou Harris' promotion from backing singer to full-fledged duet partner—with the deliciously painful \"Love Hurts\" and \"Hearts on Fire\" immortalising their rapport. Elvis Presley bandmembers add a barroom kick to \"Ooh Las Vegas\", while \"Return of the Grievous Angel\" and \"In My Hour of Darkness\" best manifest the country rocker's tragic magic.",
      "id": "304907551",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Gram Parsons",
        "artwork": {
          "bgColor": "204b88",
          "height": 1500,
          "textColor1": "9beee3",
          "textColor2": "5fc5e2",
          "textColor3": "82cdd1",
          "textColor4": "52acd0",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/d2/60/71/d26071ab-2aaf-3c39-010a-48b4c761c37c/mzi.frxdfvyk.jpg/{w}x{h}bb.jpg",
          "width": 1500
        },
        "copyright": "℗ 1974 Warner Records Inc. Marketed by Rhino Entertainment Company, a Warner Music Group Company",
        "editorialNotes": {
          "short": "The ill-fated country-rocker's final fandango.",
          "standard": "The smartest move in the making of Gram Parson's posthumously released 1974 sophomore album is Emmylou Harris' promotion from backing singer to full-fledged duet partner—with the deliciously painful \"Love Hurts\" and \"Hearts on Fire\" immortalising their rapport. Elvis Presley bandmembers add a barroom kick to \"Ooh Las Vegas\", while \"Return of the Grievous Angel\" and \"In My Hour of Darkness\" best manifest the country rocker's tragic magic."
        },
        "genreNames": [
          "Country",
          "Music",
          "Rock",
          "Southern Rock",
          "Honky Tonk",
          "Folk",
          "Outlaw Country"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "Grievous Angel",
        "playParams": {
          "id": "304907551",
          "kind": "album"
        },
        "recordLabel": "Rhino/Warner Records",
        "releaseDate": "1974-01-01",
        "trackCount": 9,
        "upc": "603497979899",
        "url": "https://music.apple.com/gb/album/grievous-angel/304907551"
      },
      "url": "https://music.apple.com/gb/album/grievous-angel/304907551"
    },
    "lastfm": {
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/bf106f6b3f404768c764e02b08476f36.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/bf106f6b3f404768c764e02b08476f36.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/bf106f6b3f404768c764e02b08476f36.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/bf106f6b3f404768c764e02b08476f36.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/bf106f6b3f404768c764e02b08476f36.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/bf106f6b3f404768c764e02b08476f36.png"
        }
      ],
      "listeners": 120840,
      "mbid": "2fdf1fb4-607f-3276-b6b1-7d7d169ad5bc",
      "playcount": 976708,
      "raw_data": {
        "album": {
          "artist": "Gram Parsons",
          "image": [
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/34s/bf106f6b3f404768c764e02b08476f36.png",
              "size": "small"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/64s/bf106f6b3f404768c764e02b08476f36.png",
              "size": "medium"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/174s/bf106f6b3f404768c764e02b08476f36.png",
              "size": "large"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/bf106f6b3f404768c764e02b08476f36.png",
              "size": "extralarge"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/bf106f6b3f404768c764e02b08476f36.png",
              "size": "mega"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/bf106f6b3f404768c764e02b08476f36.png",
              "size": ""
            }
          ],
          "listeners": "120840",
          "mbid": "2fdf1fb4-607f-3276-b6b1-7d7d169ad5bc",
          "name": "Grievous Angel",
          "playcount": "976708",
          "tags": {
            "tag": [
              {
                "name": "1974",
                "url": "https://www.last.fm/tag/1974"
              },
              {
                "name": "country",
                "url": "https://www.last.fm/tag/country"
              },
              {
                "name": "country rock",
                "url": "https://www.last.fm/tag/country+rock"
              },
              {
                "name": "singer-songwriter",
                "url": "https://www.last.fm/tag/singer-songwriter"
              },
              {
                "name": "singing songwriters",
                "url": "https://www.last.fm/tag/singing+songwriters"
              }
            ]
          },
          "tracks": {
            "track": [
              {
                "@attr": {
                  "rank": 1
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 262,
                "name": "Return of the Grievous Angel",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/Return+of+the+Grievous+Angel"
              },
              {
                "@attr": {
                  "rank": 2
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 232,
                "name": "Hearts on Fire",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/Hearts+on+Fire"
              },
              {
                "@attr": {
                  "rank": 3
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 144,
                "name": "I Can't Dance",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/I+Can%27t+Dance"
              },
              {
                "@attr": {
                  "rank": 4
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 209,
                "name": "Brass Buttons",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/Brass+Buttons"
              },
              {
                "@attr": {
                  "rank": 5
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 305,
                "name": "$1000 Wedding",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/$1000+Wedding"
              },
              {
                "@attr": {
                  "rank": 6
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 220,
                "name": "Love Hurts",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/Love+Hurts"
              },
              {
                "@attr": {
                  "rank": 7
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 212,
                "name": "Ooh Las Vegas",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/Ooh+Las+Vegas"
              },
              {
                "@attr": {
                  "rank": 8
                },
                "artist": {
                  "mbid": "cbc83fb1-2c23-4ad1-9187-594b30da3f21",
                  "name": "Gram Parsons",
                  "url": "https://www.last.fm/music/Gram+Parsons"
                },
                "duration": 229,
                "name": "In My Hour of Darkness",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel/In+My+Hour+of+Darkness"
              }
            ]
          },
          "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel",
          "wiki": {
            "content": "Grievous Angel is the second solo album by American singer, songwriter, guitarist and pianist Gram Parsons, compiled from summer 1973 sessions and released four months after his death  in September 1973 from a morphine and alcohol overdose. It received great critical acclaim upon release, but failed to find commercial success, a fate shared with his previous efforts solo and with The Flying Burrito Brothers. The album peaked at number 195 on the Billboard charts. Despite its modest sales, it continues to be viewed as a successful example of the hybrid between country and rock and roll Parsons called \"Cosmic American Music\". In 2012, the album was ranked number 425 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nParsons' fondness for drugs and high living are said to have been catching up with him while he was recording Grievous Angel, and sadly he wouldn't live long enough to see it reach record stores, dying from a drug overdose in the fall of 1973. This album is a less ambitious and unified set than his solo debut, but that's to say that G.P. was a great album while Grievous Angel was instead a very, very good one. Much of the same band that played on his solo debut were brought back for this set, and they perform with the same effortless grace and authority (especially guitarist James Burton and fiddler Byron Berline). If Parsons was slowing down a bit as a songwriter, he still had plenty of gems on hand from more productive days, such as \"Brass Buttons\" and \"Hickory Wind (which wasn't really recorded live in Northern Quebec; that's just Gram and the band ripping it up live in the studio, with a handful of friends whooping it up to create honky-tonk atmosphere). He also proved to be a shrewd judge of other folks material as always; Tom T. Hall's \"I Can't Dance\" is a strong barroom rocker, and everyone seems to be having a great time on The Louvin Brothers's \"Cash on the Barrelhead.\" As a vocal duo, Parsons and Emmylou Harris only improved on this set, turning in a version of \"Love Hurts\" so quietly impassioned and delicately beautiful that it's enough to make you forget Roy Orbison ever recorded it. And while he didn't plan on it, Parsons could hardly have picked a better closing gesture than \"In My Hour of Darkness.\" Grievous Angel may not have been the finest work of his career, but one would be hard pressed to name an artist who made an album this strong only a few weeks before their death -- or at any time of their life, for that matter. <a href=\"https://www.last.fm/music/Gram+Parsons/Grievous+Angel\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
            "published": "10 Oct 2018, 10:09",
            "summary": "Grievous Angel is the second solo album by American singer, songwriter, guitarist and pianist Gram Parsons, compiled from summer 1973 sessions and released four months after his death in September 1973 from a morphine and alcohol overdose. It received great critical acclaim upon release, but failed to find commercial success, a fate shared with his previous efforts solo and with The Flying Burrito Brothers. The album peaked at number 195 on the Billboard charts. Despite its modest sales, it continues to be viewed as a successful example of the hybrid between country and rock and roll Parsons called \"Cosmic American <a href=\"https://www.last.fm/music/Gram+Parsons/Grievous+Angel\">Read more on Last.fm</a>."
          }
        }
      },
      "similar_artists": [],
      "tags": [
        "1974",
        "country",
        "country rock",
        "singer-songwriter",
        "singing songwriters"
      ],
      "top_albums": [],
      "top_tracks": [],
      "url": "https://www.last.fm/music/Gram+Parsons/Grievous+Angel",
      "wiki_content": "Grievous Angel is the second solo album by American singer, songwriter, guitarist and pianist Gram Parsons, compiled from summer 1973 sessions and released four months after his death  in September 1973 from a morphine and alcohol overdose. It received great critical acclaim upon release, but failed to find commercial success, a fate shared with his previous efforts solo and with The Flying Burrito Brothers. The album peaked at number 195 on the Billboard charts. Despite its modest sales, it continues to be viewed as a successful example of the hybrid between country and rock and roll Parsons called \"Cosmic American Music\". In 2012, the album was ranked number 425 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nParsons' fondness for drugs and high living are said to have been catching up with him while he was recording Grievous Angel, and sadly he wouldn't live long enough to see it reach record stores, dying from a drug overdose in the fall of 1973. This album is a less ambitious and unified set than his solo debut, but that's to say that G.P. was a great album while Grievous Angel was instead a very, very good one. Much of the same band that played on his solo debut were brought back for this set, and they perform with the same effortless grace and authority (especially guitarist James Burton and fiddler Byron Berline). If Parsons was slowing down a bit as a songwriter, he still had plenty of gems on hand from more productive days, such as \"Brass Buttons\" and \"Hickory Wind (which wasn't really recorded live in Northern Quebec; that's just Gram and the band ripping it up live in the studio, with a handful of friends whooping it up to create honky-tonk atmosphere). He also proved to be a shrewd judge of other folks material as always; Tom T. Hall's \"I Can't Dance\" is a strong barroom rocker, and everyone seems to be having a great time on The Louvin Brothers's \"Cash on the Barrelhead.\" As a vocal duo, Parsons and Emmylou Harris only improved on this set, turning in a version of \"Love Hurts\" so quietly impassioned and delicately beautiful that it's enough to make you forget Roy Orbison ever recorded it. And while he didn't plan on it, Parsons could hardly have picked a better closing gesture than \"In My Hour of Darkness.\" Grievous Angel may not have been the finest work of his career, but one would be hard pressed to name an artist who made an album this strong only a few weeks before their death -- or at any time of their life, for that matter. <a href=\"https://www.last.fm/music/Gram+Parsons/Grievous+Angel\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wiki_summary": "Grievous Angel is the second solo album by American singer, songwriter, guitarist and pianist Gram Parsons, compiled from summer 1973 sessions and released four months after his death in September 1973 from a morphine and alcohol overdose. It received great critical acclaim upon release, but failed to find commercial success, a fate shared with his previous efforts solo and with The Flying Burrito Brothers. The album peaked at number 195 on the Billboard charts. Despite its modest sales, it continues to be viewed as a successful example of the hybrid between country and rock and roll Parsons called \"Cosmic American <a href=\"https://www.last.fm/music/Gram+Parsons/Grievous+Angel\">Read more on Last.fm</a>."
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "2008 © 1974 Warner Records Inc.",
          "type": "C"
        },
        {
          "text": "2008 ℗ 1974 Warner Records Inc. Marketed by Rhino Entertainment Company, a Warner Music Group Company",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "603497979899"
      },
      "id": "6UQujMGmR5MbFsML9amCuN",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b2734c5fedbe6cf1a65f70d5c30e",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e024c5fedbe6cf1a65f70d5c30e",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d000048514c5fedbe6cf1a65f70d5c30e",
          "width": 64
        }
      ],
      "label": "Rhino/Warner Records",
      "popularity": 47,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
            },
            "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
            "id": "1KA3WXYMPLxomNuoE22LYd",
            "name": "Gram Parsons",
            "type": "artist",
            "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
          }
        ],
        "copyrights": [
          {
            "text": "2008 © 1974 Warner Records Inc.",
            "type": "C"
          },
          {
            "text": "2008 ℗ 1974 Warner Records Inc. Marketed by Rhino Entertainment Company, a Warner Music Group Company",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "603497979899"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/6UQujMGmR5MbFsML9amCuN"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/6UQujMGmR5MbFsML9amCuN?market=US",
        "id": "6UQujMGmR5MbFsML9amCuN",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b2734c5fedbe6cf1a65f70d5c30e",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e024c5fedbe6cf1a65f70d5c30e",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d000048514c5fedbe6cf1a65f70d5c30e",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "Rhino/Warner Records",
        "name": "Grievous Angel",
        "popularity": 47,
        "release_date": "1974",
        "release_date_precision": "year",
        "total_tracks": 9,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/6UQujMGmR5MbFsML9amCuN/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 266226,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7vOYp7KJ8gVmVbcatSVf9J"
              },
              "href": "https://api.spotify.com/v1/tracks/7vOYp7KJ8gVmVbcatSVf9J",
              "id": "7vOYp7KJ8gVmVbcatSVf9J",
              "is_local": false,
              "is_playable": true,
              "name": "Return of the Grievous Angel - 2006 Remaster",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:7vOYp7KJ8gVmVbcatSVf9J"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 232693,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3THXntC8T110BDg3X8OaOf"
              },
              "href": "https://api.spotify.com/v1/tracks/3THXntC8T110BDg3X8OaOf",
              "id": "3THXntC8T110BDg3X8OaOf",
              "is_local": false,
              "is_playable": true,
              "name": "Hearts on Fire - 2002 Remaster",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:3THXntC8T110BDg3X8OaOf"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 144426,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2NY6C7Eo5YNUsOK6y9Nxk1"
              },
              "href": "https://api.spotify.com/v1/tracks/2NY6C7Eo5YNUsOK6y9Nxk1",
              "id": "2NY6C7Eo5YNUsOK6y9Nxk1",
              "is_local": false,
              "is_playable": true,
              "name": "I Can't Dance - 2006 Remaster",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:2NY6C7Eo5YNUsOK6y9Nxk1"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 210786,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6Bijmp2RULR8SgmpqRe7tx"
              },
              "href": "https://api.spotify.com/v1/tracks/6Bijmp2RULR8SgmpqRe7tx",
              "id": "6Bijmp2RULR8SgmpqRe7tx",
              "is_local": false,
              "is_playable": true,
              "name": "Brass Buttons - 2006 Remaster",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:6Bijmp2RULR8SgmpqRe7tx"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 305306,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/67nZEOZ5re0q0IueyF1dKc"
              },
              "href": "https://api.spotify.com/v1/tracks/67nZEOZ5re0q0IueyF1dKc",
              "id": "67nZEOZ5re0q0IueyF1dKc",
              "is_local": false,
              "is_playable": true,
              "name": "$1000 Wedding - 2002 Remaster",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:67nZEOZ5re0q0IueyF1dKc"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 388906,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1J4VSGnisSb9ECF8z7pCPQ"
              },
              "href": "https://api.spotify.com/v1/tracks/1J4VSGnisSb9ECF8z7pCPQ",
              "id": "1J4VSGnisSb9ECF8z7pCPQ",
              "is_local": false,
              "is_playable": true,
              "name": "Medley Live from Northern Quebec (A) Cash on the Barrelhead (B) Hickory Wind - 2006 Remaster",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:1J4VSGnisSb9ECF8z7pCPQ"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 222293,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/72DefuF22C6aPKrWhRFCBS"
              },
              "href": "https://api.spotify.com/v1/tracks/72DefuF22C6aPKrWhRFCBS",
              "id": "72DefuF22C6aPKrWhRFCBS",
              "is_local": false,
              "is_playable": true,
              "name": "Love Hurts - 2007 Remaster",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:72DefuF22C6aPKrWhRFCBS"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                },
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/5s6TJEuHTr9GR894wc6VfP"
                  },
                  "href": "https://api.spotify.com/v1/artists/5s6TJEuHTr9GR894wc6VfP",
                  "id": "5s6TJEuHTr9GR894wc6VfP",
                  "name": "Emmylou Harris",
                  "type": "artist",
                  "uri": "spotify:artist:5s6TJEuHTr9GR894wc6VfP"
                }
              ],
              "disc_number": 1,
              "duration_ms": 212893,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7kJpAkJSFMCkM6T4plsRLd"
              },
              "href": "https://api.spotify.com/v1/tracks/7kJpAkJSFMCkM6T4plsRLd",
              "id": "7kJpAkJSFMCkM6T4plsRLd",
              "is_local": false,
              "is_playable": true,
              "name": "Ooh Las Vegas (feat. Emmylou Harris) - 2007 Remaster",
              "preview_url": null,
              "track_number": 8,
              "type": "track",
              "uri": "spotify:track:7kJpAkJSFMCkM6T4plsRLd"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1KA3WXYMPLxomNuoE22LYd"
                  },
                  "href": "https://api.spotify.com/v1/artists/1KA3WXYMPLxomNuoE22LYd",
                  "id": "1KA3WXYMPLxomNuoE22LYd",
                  "name": "Gram Parsons",
                  "type": "artist",
                  "uri": "spotify:artist:1KA3WXYMPLxomNuoE22LYd"
                }
              ],
              "disc_number": 1,
              "duration_ms": 229066,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/28xYsYblby21yWGCRcF5Cm"
              },
              "href": "https://api.spotify.com/v1/tracks/28xYsYblby21yWGCRcF5Cm",
              "id": "28xYsYblby21yWGCRcF5Cm",
              "is_local": false,
              "is_playable": true,
              "name": "In My Hour of Darkness - 2002 Remaster",
              "preview_url": null,
              "track_number": 9,
              "type": "track",
              "uri": "spotify:track:28xYsYblby21yWGCRcF5Cm"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 9
        },
        "type": "album",
        "uri": "spotify:album:6UQujMGmR5MbFsML9amCuN"
      },
      "release_date": "1974",
      "release_date_precision": "year",
      "total_tracks": 9,
      "tracks": [
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 266226,
          "explicit": false,
          "id": "7vOYp7KJ8gVmVbcatSVf9J",
          "name": "Return of the Grievous Angel - 2006 Remaster",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 232693,
          "explicit": false,
          "id": "3THXntC8T110BDg3X8OaOf",
          "name": "Hearts on Fire - 2002 Remaster",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 144426,
          "explicit": false,
          "id": "2NY6C7Eo5YNUsOK6y9Nxk1",
          "name": "I Can't Dance - 2006 Remaster",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 210786,
          "explicit": false,
          "id": "6Bijmp2RULR8SgmpqRe7tx",
          "name": "Brass Buttons - 2006 Remaster",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 305306,
          "explicit": false,
          "id": "67nZEOZ5re0q0IueyF1dKc",
          "name": "$1000 Wedding - 2002 Remaster",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 388906,
          "explicit": false,
          "id": "1J4VSGnisSb9ECF8z7pCPQ",
          "name": "Medley Live from Northern Quebec (A) Cash on the Barrelhead (B) Hickory Wind - 2006 Remaster",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 222293,
          "explicit": false,
          "id": "72DefuF22C6aPKrWhRFCBS",
          "name": "Love Hurts - 2007 Remaster",
          "preview_url": null,
          "track_number": 7
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            },
            {
              "id": "5s6TJEuHTr9GR894wc6VfP",
              "name": "Emmylou Harris"
            }
          ],
          "duration_ms": 212893,
          "explicit": false,
          "id": "7kJpAkJSFMCkM6T4plsRLd",
          "name": "Ooh Las Vegas (feat. Emmylou Harris) - 2007 Remaster",
          "preview_url": null,
          "track_number": 8
        },
        {
          "artists": [
            {
              "id": "1KA3WXYMPLxomNuoE22LYd",
              "name": "Gram Parsons"
            }
          ],
          "duration_ms": 229066,
          "explicit": false,
          "id": "28xYsYblby21yWGCRcF5Cm",
          "name": "In My Hour of Darkness - 2002 Remaster",
          "preview_url": null,
          "track_number": 9
        }
      ],
      "url": "https://open.spotify.com/album/6UQujMGmR5MbFsML9amCuN"
    }
  },
  "spotify_id": "6UQujMGmR5MbFsML9amCuN",
  "spotify_url": "https://open.spotify.com/album/6UQujMGmR5MbFsML9amCuN",
  "styles": [
    "Country Rock",
    "Country"
  ],
  "title": "Grievous Angel",
  "tracklist": [
    {
      "artists": [],
      "duration": "4:19",
      "position": "A1",
      "title": "Return Of The Grievous Angel"
    },
    {
      "artists": [],
      "duration": "3:50",
      "position": "A2",
      "title": "Hearts On Fire"
    },
    {
      "artists": [],
      "duration": "2:20",
      "position": "A3",
      "title": "I Can't Dance"
    },
    {
      "artists": [],
      "duration": "3:27",
      "position": "A4",
      "title": "Brass Buttons"
    },
    {
      "artists": [],
      "duration": "5:00",
      "position": "A5",
      "title": "$1000 Wedding"
    },
    {
      "artists": [],
      "duration": "",
      "position": "",
      "title": "Medley Live From Northern Quebec"
    },
    {
      "artists": [],
      "duration": "3:40",
      "position": "B2",
      "title": "Love Hurts"
    },
    {
      "artists": [],
      "duration": "3:29",
      "position": "B3",
      "title": "Las Vegas"
    },
    {
      "artists": [],
      "duration": "3:42",
      "position": "B4",
      "title": "In My Hour Of Darkness"
    }
  ],
  "updated_at": "2025-07-05T18:05:37.482367",
  "year": 2014
}