{
  "apple_music_id": "1780566501",
  "apple_music_url": "https://music.apple.com/gb/artist/airhead-sam/1780566501",
  "biography": "London producer Rob McAndrews who goes by the name Airhead and whose spacious, abstract compositions are reminiscent of James Blake's early work, and the comparison runs more than skin-deep: before the former even released a single solo track to his name, the pair put out a solid 10\" single \"Pembroke\" in 2010 on Brainmath. Airhead has largely flown under the radar since. He followed up with the  \"Paper Street\" album later that year, backed with an equally lovely Nick Höppner version. Signing to R&S Records seems to be one of the main affirmations of a breakthrough producer these days, and so it was no great surprise when it was announced earlier this year that he would release \"Wait / South Congress\" as a 10\" single through the label. During the summer of 2013, he released For Years on R&S.\n\nThere are other artists with the same name:\n\n2) Airhead is a metal band of four formed in 2003 at Tampere, Finland. The music is versatile and obviously influences are picked up from various musical genres. In short its a mix of lowtuned guitaring, distinctive rhythms uncommon to the genre and catchy melodies topped with sarcastic yet fun lyrics. This self-assured group would get bored by sticking to one type of music so they constantly need to evolve and develop their unique style, which today could be labeled as Street Metal.\n\n3) Airhead (formerly Jefferson Airhead) is a British indie-pop band that achieved some success in the early 1990s, at the tail end of the Madchester music movement.\nThey are likened to The Wonder Stuff, Flowered Up, The Mock Turtles and early Blur. Forced to change their name from Jefferson Airhead due to its (deliberate) similarity to Jefferson Airplane, Maidstone-based band Airhead achieved minor UK Singles Chart success with singles \"Funny How\" and \"Counting Sheep\". After releasing one album and a handful of singles, they were dropped by their record label Korova and released their final record, the That's Enough EP on Mother Tongue. They are probably best remembered for \"Funny How\", which although not their highest-charting single was played heavily on BBC Radio 1 at the time of its release.\nIn 1996, Airhead made a brief return to the live scene, when they supported Kula Shaker, at the Tunbridge Wells Forum.\n\n- please do not delete information for artists listed, as per the Last.fm FAQ. <a href=\"https://www.last.fm/music/Airhead\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T17:52:05.039942",
  "discogs_id": "1206719",
  "discogs_url": "https://www.discogs.com/artist/1206719",
  "followers": 10889,
  "formed_date": null,
  "genres": [
    "Electronic",
    "dubstep",
    "electronic",
    "future garage",
    "experimental",
    "indie",
    "Alternative"
  ],
  "id": "airhead-1751734327",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music221/v4/0c/54/ac/0c54acca-3211-6aac-90dd-5ac44658d0bb/198846996059.jpg/2000x2000ac.jpg",
      "width": 2000
    },
    {
      "height": 2000,
      "type": "custom_artist_image",
      "url": "https://www.russ.fm/artist/airhead/airhead.jpg",
      "width": 2000
    }
  ],
  "lastfm_mbid": "d8b056a6-5ce0-4b26-9094-5cb6a8e2418b",
  "lastfm_url": "https://www.last.fm/music/Airhead",
  "local_images": {
    "hi-res": "../public/artist/airhead/airhead-hi-res.jpg",
    "medium": "../public/artist/airhead/airhead-medium.jpg",
    "small": "../public/artist/airhead/airhead-small.jpg"
  },
  "name": "Airhead",
  "popularity": 21,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music221/v4/0c/54/ac/0c54acca-3211-6aac-90dd-5ac44658d0bb/198846996059.jpg/2000x2000ac.jpg",
      "editorial_notes": null,
      "genres": [
        "Alternative"
      ],
      "id": "1780566501",
      "name": "Airhead Sam",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/airhead-sam/1780566501"
    },
    "discogs": {
      "id": 1206719,
      "original_name": "Airhead (3)",
      "role": ""
    },
    "lastfm": {},
    "spotify": {}
  },
  "spotify_id": "4eGpmrqhS3o2e80Bs1841W",
  "spotify_url": "https://open.spotify.com/artist/4eGpmrqhS3o2e80Bs1841W",
  "updated_at": "2025-07-06T13:20:48.656095",
  "wikipedia_url": null
}