{
  "apple_music_id": "313040471",
  "apple_music_url": "https://music.apple.com/gb/artist/valerie-june/313040471",
  "biography": "Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.  If June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today's myriad retro troubadours, hers a stunningly emotive amalgamation of blues, folk, gospel, soul, Appalachian and bluegrass (including irresistible banjo). She exists, however, today, an artist as modern as an iPod Shuffle, a musician for the generation which carries the entire history of recorded music so casually inside its phone.  Like a potent distillation bubbling on a Prohibition-era porch, Valerie June makes self-styled \"organic moonshine roots music\", music for the porch parties of today, a party where she strums her guitar, plucks her banjo, opens her mouth and delta-blues-country stridently sashays out, a stunning peal somewhere between Dolly Parton and Billie Holiday. Or is it more Wanda Jackson and Shirley Goodman, you know, from Shirley & Co, who sang Shame Shame Shame so disco friskily in 1974? Valerie June does this to you: reaches inside your musical brain and shakes it, unleashing ghosts, emotions and memories, all fluttering like countless musical flakes inside the snowglobe of your mind.  A self-taught musician, singer and song-writer from small-town Humboldt, Tennessee (population 8,000), she honed her astonishing sound in the vibrant Memphis atmosphere, her spectrum of influences the history of music itself: Elizabeth Cotten, Leadbelly, The Carter Family, Whitney Houston, Van Morrison, Dolly Parton, Roscoe Holcomb, Woody Guthrie, Nico, Junior Kimbrough, Nina Simone, Bob Dylan, The Beatles, Nick Drake, Leonard Cohen, Joni Mitchell, Tracey Chapman, Billie Holiday, The Rolling Stones, Blind Lemon Jefferson, Mississippi John Hurt, Gillian Welch, Townes Van Zandt, Elmore James, Skip James, Blind Willie McTell, Memphis Minnie...   \"Being from Jackson and Humboldt, Tennessee, I was raised one hour from Memphis and two hours from Nashville,\" lilts Valerie June, in her sing-song, southern belle way. \"It was and still is hard to go anywhere without hearing  country and blues music. It always reminds me of home. It's the place in art where the colour lines of the South seem to blend.\"Her debut album, though, is that most rare of contemporary concepts: unique.  Pushin' Against A Stone, released on Rob da Bank's stellar boutique label Sunday Best, was mostly recorded at The Black Key's Easy Eye studio in Nashville. Produced by Dan Auerbach (The Black Keys) and Kevin Augunas (Edward Sharpe & The Magnetic Zeros, Florence & The Machine) it's a sonic postcard from the universe, where the atoms of history live.   \"I just love old records,\" she smiles, a beautiful woman with old-school dreadlocks spiraling out towards freedom. \"I like the crackle, the gritty sound. So do a lotta other people! I think we just wanna hear real music. Alongside the modern beat-machine music. For a while it was only moving in a new direction and people started missing the old stuff. I think it's something people long for.\"   The debut single, Workin' Woman Blues, is a riot, a brand new bona-fide blues-pop anthem, as if Bobbie Gentry fronted a Stax soul-revue, those mesmerising vocals telling it how it is: \"I ain't fit to be no mother, I ain't fit to be no wife, yeah, I been workin' like a man, y'all, I've been working all my life.\" Elsewhere, there's the delicate yet rousing triumph of Somebody To Love (featuring the iconic Booker T. Jones), the traditional folk-gospel charm of Trials, Troubles, Tribulations, the spectral, swampy wooziness of Pushin' Against A Stone (The Specials meets Phil Spector) and the dizzy, harmonised, Shangri-La sashay of Wanna Be On Your Mind, Valerie June's voice sounding, somehow, both as old and wise as mother nature and as playfully naïve as a schoolgirl skipping home. Staggeringly, she'd never worked with a producer before, the experience opening her up to infinite new atmospheric possibilities.    \"It was different,\" she says. \"  I'd been holding on to a particular image of what I wanted to be as a folk musician, a country musician, a southern roots musician. But when I heard the producers' ideas I thought, 'think bigger'. I looked at the careers of Joni Mitchell, Van Morrison, Joan Baez and they've put out all kinds of  music over the course of their careers so far. If I wanna put out a punk rock record next week, that's me. It's all coming from me.  Even if I have to continue juggling jobs, I am a career artist.\"  We don't hear so much, these days, from the old-school working class girls, the ones who can't afford the freedom to pursue their most daring dreams. Valerie June, the eldest girl of five kids (who'd often pretend to be the Jackson Five), first learned to sing in church, both a black church and later, a white church, when her family moved to the country. People sang in church, \"even when they couldn't sing\" and she'd mimic them all, \"from homeless people to wealthy people until my own voice just started coming out, a mixture of everyone\". She had her first jobs as a teen, helping her dad, both a promoter for local gospel singers and in the construction business (she'd hang posters in town and then head to the demolition sites). Soon she was constantly singing, writing songs, a freedom-seeking spirit who went travelling as a wandering songbird up and down the American west coast, then the east coast, a gypsy nightingale and holistic craftswoman who'd sing for tips in subway stations and sell her own handmade soap. By the time she moved back to Memphis in 2000, she had a plethora of songs written and finally taught herself guitar and banjo, as neighbourhood eyes were raised. \"Black people aren't supposed to play the banjo,\" she laughs, \"it's seen as country and bluegrass but it's an African instrument. I love it.\" Soon, she was testing out her tentative musical skills in Memphis bars and restaurants, \"which was more teaching myself in front of people,\" she notes. \"Memphis is a good town for being born as an artist. If you make a mistake people are like, 'we heard the good part'. They nurture you. You can take your time.\"   With a dream to make a studio album and no cash to fund it, \"it's hard to think about making a record when you've gotta pay rent\", she went to work full-time, now tunneling her way to freedom like Andy Dufresne in the Shawshank Redemption through daily, determined graft. She took on numerous service jobs: housekeeper, dog-walker, babysitter, vegetarian meal cooker, house sitter and personal assistant to the wealthy. And that was just the morning. \"In the  afternoon, I'd work in a herb shop, Maggie's Pharm. Then I would go play a gig, just me and my guitar.\"  She began to musically emerge, playing the Memphis Music & Heritage Festival, the International Folk Alliance Conference, the Cooper-Young Festival, the King Biscuit Blues Festival in Helena, AR, finally making enough money for three lo-fi recordings which she sold as CDs on tour: the raw, acoustic The Way Of The Weeping Willow (recorded in an 1800s farmhouse), the vocally mesmerising Mountain Of Rose Quartz and the haunting Valerie June And The Tennessee Express, a collaboration with Nashville bluegrass troupe The Old Crow Medicine Show (who've toured with Mumford & Sons). \"They're very successful at what they do, they loved my music and said 'hey, don't worry about money just come and record a few songs with us'.\"  In 2009 she was a featured artist on MTV's online series $5 Cover (following the lives of Memphis musicians attempting to make ends meet) and eventually raised $15,000 through crowd-funding website Kickstarter to record a debut album proper. Then, the universe intervened: through word-of-mouth, the manager for producer Kevin Augunas heard Valerie's music, sent it to Augunas, who loved it so much he flew into Memphis the following day. He asked who she'd like to write with and she suggested Dan Auerbach, whose solo work she'd loved (and who had recently moved to Nashville). Valerie, deliberately, had never signed to a record label before, although there had been no shortage of offers from both major and independent US-based labels, and was spotted playing in France by Sunday Best's label partner Sarah Bolshi. \"I never signed a label deal because it didn't feel right,\" she says.  \"I need to be with people who not only like this record but my stripped down stuff too. People will tell you, 'you can do whatever you wanna do with our label'. I didn't trust anybody telling me that until I met Sarah! And it's more me, a speciality label.\"   Pushin' Against A Stone is so-called because that's the story of her life - and the story of her forebears, too.  \"I feel I've spent my life pushing against a stone,\" she says. \"And the jobs I've had have been fitting for getting a true feel for how  the traditional artists I loved came home after a hard day to sit on the porch and play tunes until bedtime. That's one reason why they were older before anybody cared. When I first started playing instruments I thought, OK, I'm probably not gonna be the next Beyonce, this is not gonna happen for me until I'm very very old. Like...Seasick Steve! Who I love. And then maybe somebody will come see me play in my shack in Mississippi. That's kinda how it is for many artists who make roots music. So I'm just really happy it's happening now and I'm not up there with my cane.\"   Good things come to those who wait and Valerie June's time is now, the last year bringing rave reviews at SXSW, a collaboration with Grammy-nominated Fugees producer John Forte (on the hip-hop-blues song Give Me Water) as the word-of-mouth whisper has gradually grown into a collective global holler. This September, one of her friends sent her a Facebook message saying she'd seen a video of her glorious Bestival Performance.  \"And she said, 'you're gonna be a huge star',\" smiles the captivating Valerie June. \"A while ago I would've been like, I dunno about being a huge star. But now I'm like, you know what? If I can get a break? I will take it. I deserve it. I have paid my dues! I can't work on Maggie's Pharm no more. If you wanna bring me a coffee, yeah, I'll let you bring it. Because I have been the person bringing the coffee. I don't need any more experience in that. Now, being a queen? M'Kay! I think I can use a little spoiling. Bring it on.\"",
  "country": null,
  "created_at": "2025-07-05T17:23:04.050629",
  "discogs_id": "2959182",
  "discogs_url": "https://www.discogs.com/artist/2959182-Valerie-June",
  "followers": 184061,
  "formed_date": null,
  "genres": [
    "Singer/Songwriter",
    "folk",
    "americana",
    "blues",
    "country",
    "Alt-country",
    "female vocalists",
    "Folk",
    "Blues"
  ],
  "id": "valerie-june-1751732586",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/54/5f/c8/545fc8d3-7a54-8478-6002-a08f6606b08d/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eba4d591c3d5009ceddb94c822",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174a4d591c3d5009ceddb94c822",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178a4d591c3d5009ceddb94c822",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/june-valerie-52a4c828246c2.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xxxqpt1489159797.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/twvvys1489159815.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/y06s401615626890.jpg",
      "width": 1920
    },
    {
      "height": 185,
      "type": "banner",
      "url": "https://www.theaudiodb.com/images/media/artist/banner/xwqsww1489159828.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/qtuxtp1489159778.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/31xgOCoAQ5cGq21ajQNuEMYWqPVOpOZMLkwLP8KSdbg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "b76c1bf7-f33b-460c-bfc3-f140d023fc94",
  "lastfm_url": "https://www.last.fm/music/Valerie+June",
  "local_images": {
    "hi-res": "../public/artist/valerie-june/valerie-june-hi-res.jpg",
    "medium": "../public/artist/valerie-june/valerie-june-medium.jpg",
    "small": "../public/artist/valerie-june/valerie-june-small.jpg"
  },
  "name": "Valerie June",
  "popularity": 49,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='313040471', url='https://music.apple.com/gb/artist/valerie-june/313040471', name='Valerie June', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/54/5f/c8/545fc8d3-7a54-8478-6002-a08f6606b08d/pr_source.png/2000x2000bb.jpg', genres=['Singer/Songwriter'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '313040471', 'type': 'artists', 'href': '/v1/catalog/gb/artists/313040471', 'attributes': {'name': 'Valerie June', 'genreNames': ['Singer/Songwriter'], 'artwork': {'width': 1097, 'height': 1097, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/54/5f/c8/545fc8d3-7a54-8478-6002-a08f6606b08d/pr_source.png/{w}x{h}bb.jpg', 'bgColor': 'dddfde', 'textColor1': '090a0a', 'textColor2': '212223', 'textColor3': '343534', 'textColor4': '474748'}, 'url': 'https://music.apple.com/gb/artist/valerie-june/313040471'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/313040471/albums', 'next': '/v1/catalog/gb/artists/313040471/albums?offset=25', 'data': [{'id': '1440948460', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1440948460'}, {'id': '1544143084', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1544143084'}, {'id': '1451639307', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1451639307'}, {'id': '1629104607', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1629104607'}, {'id': '1790347369', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1790347369'}, {'id': '1608335293', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1608335293'}, {'id': '1603730202', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1603730202'}, {'id': '1458535547', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1458535547'}, {'id': '1621776917', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1621776917'}, {'id': '1474715393', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1474715393'}, {'id': '1656325000', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1656325000'}, {'id': '1612737586', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1612737586'}, {'id': '591788765', 'type': 'albums', 'href': '/v1/catalog/gb/albums/591788765'}, {'id': '1536974025', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1536974025'}, {'id': '1716817811', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1716817811'}, {'id': '1445300915', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1445300915'}, {'id': '1442294425', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1442294425'}, {'id': '1545418322', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1545418322'}, {'id': '1454265746', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1454265746'}, {'id': '1682530670', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1682530670'}, {'id': '1717849117', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1717849117'}, {'id': '1444860089', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1444860089'}, {'id': '1752025315', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1752025315'}, {'id': '1747794954', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1747794954'}, {'id': '1607713162', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1607713162'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "2959182",
      "images": [
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/31xgOCoAQ5cGq21ajQNuEMYWqPVOpOZMLkwLP8KSdbg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 316,
          "resource_url": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/tt6gKdLBgqTFRnTHELT8PoNpAiTrKMO8NHbmz1yONq8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
          "width": 400
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/n_VbzfgSgGh9LVoHPAESBmxCIduhcohQtk_jHW6NWRY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 228,
          "resource_url": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/n2f52YV7GudSxjUkTIm7obpT50BD4KuHAks9VGkOTDc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
          "width": 400
        },
        {
          "height": 472,
          "resource_url": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/mhhOQELn8zxg9Lq-YsfyObOG3Y4VfRx0l0kvW7qHCXk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 399,
          "resource_url": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/mTC9PGw0MJSWfQF1kdwsEN4oBgmfVPEsq3E8b3WGFiM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 475,
          "resource_url": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/yoSnPRgIStKHbiTiLpNAzMKw0lbVMnKcw89zWQvOE4w/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 900,
          "resource_url": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/SuITuPNo2-f9DBAO786inpW5JAY9FEj2TWLN-3x2QDI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/5gR1Lapq_Hshlw16KvI8pjL5vcfgmhzsXLumQUOFgQA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "Valerie June",
      "namevariations": [
        "V. June",
        "Valerie June Hockett"
      ],
      "profile": "American singer, songwriter and multi-instrumentalist from Memphis, Tennessee, USA.\r\nDaughter of [a5616183], sister of [a5616184] and [a5616182].",
      "raw_data": {
        "aliases": [
          {
            "id": 4156583,
            "name": "Valerie Joyner",
            "resource_url": "https://api.discogs.com/artists/4156583",
            "thumbnail_url": "https://i.discogs.com/WnMx7eHjCMAg93pz8Cmh2wb6wYzsgin4ZAqP3EaxELE/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxNTY1/ODMtMTQxOTEwOTI2/OC0yMjQ1LmpwZWc.jpeg"
          }
        ],
        "data_quality": "Correct",
        "groups": [
          {
            "active": true,
            "id": 3681163,
            "name": "The Wandering",
            "resource_url": "https://api.discogs.com/artists/3681163",
            "thumbnail_url": ""
          }
        ],
        "id": 2959182,
        "images": [
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/31xgOCoAQ5cGq21ajQNuEMYWqPVOpOZMLkwLP8KSdbg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 316,
            "resource_url": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/tt6gKdLBgqTFRnTHELT8PoNpAiTrKMO8NHbmz1yONq8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
            "width": 400
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/n_VbzfgSgGh9LVoHPAESBmxCIduhcohQtk_jHW6NWRY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 228,
            "resource_url": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/n2f52YV7GudSxjUkTIm7obpT50BD4KuHAks9VGkOTDc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
            "width": 400
          },
          {
            "height": 472,
            "resource_url": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/mhhOQELn8zxg9Lq-YsfyObOG3Y4VfRx0l0kvW7qHCXk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 399,
            "resource_url": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/mTC9PGw0MJSWfQF1kdwsEN4oBgmfVPEsq3E8b3WGFiM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 475,
            "resource_url": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/yoSnPRgIStKHbiTiLpNAzMKw0lbVMnKcw89zWQvOE4w/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 900,
            "resource_url": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/SuITuPNo2-f9DBAO786inpW5JAY9FEj2TWLN-3x2QDI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/5gR1Lapq_Hshlw16KvI8pjL5vcfgmhzsXLumQUOFgQA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
            "width": 600
          }
        ],
        "name": "Valerie June",
        "namevariations": [
          "V. June",
          "Valerie June Hockett"
        ],
        "profile": "American singer, songwriter and multi-instrumentalist from Memphis, Tennessee, USA.\r\nDaughter of [a5616183], sister of [a5616184] and [a5616182].",
        "realname": "Valerie June Hockett",
        "releases_url": "https://api.discogs.com/artists/2959182/releases",
        "resource_url": "https://api.discogs.com/artists/2959182",
        "uri": "https://www.discogs.com/artist/2959182-Valerie-June",
        "urls": [
          "http://www.valeriejune.com/",
          "https://soundcloud.com/valeriejune",
          "http://www.myspace.com/valeriejune",
          "https://www.facebook.com/valeriejunemusic",
          "https://twitter.com/thevaleriejune",
          "http://thevaleriejune.tumblr.com/",
          "http://en.wikipedia.org/wiki/Valerie_June"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/2959182",
      "thumb": "https://i.discogs.com/31xgOCoAQ5cGq21ajQNuEMYWqPVOpOZMLkwLP8KSdbg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
      "url": "https://www.discogs.com/artist/2959182-Valerie-June",
      "urls": [
        "http://www.valeriejune.com/",
        "https://soundcloud.com/valeriejune",
        "http://www.myspace.com/valeriejune",
        "https://www.facebook.com/valeriejunemusic",
        "https://twitter.com/thevaleriejune",
        "http://thevaleriejune.tumblr.com/",
        "http://en.wikipedia.org/wiki/Valerie_June"
      ]
    },
    "lastfm": "ArtistLastFmData(name='Valerie June', url='https://www.last.fm/music/Valerie+June', mbid='b76c1bf7-f33b-460c-bfc3-f140d023fc94', listeners=219431, playcount=2399047, bio_summary='Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.\\n\\nIf June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today\\'s myriad retro troubadours <a href=\"https://www.last.fm/music/Valerie+June\">Read more on Last.fm</a>', bio_content='Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.\\n\\nIf June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today\\'s myriad retro troubadours, hers a stunningly emotive amalgamation of blues, folk, gospel, soul, Appalachian and bluegrass (including irresistible banjo). She exists, however, today, an artist as modern as an iPod Shuffle, a musician for the generation which carries the entire history of recorded music so casually inside its phone.\\n\\nLike a potent distillation bubbling on a Prohibition-era porch, Valerie June makes self-styled “organic moonshine roots music”, music for the porch parties of today, a party where she strums her guitar, plucks her banjo, opens her mouth and delta-blues-country stridently sashays out, a stunning peal somewhere between Dolly Parton and Billie Holiday. Or is it more Wanda Jackson and Shirley Goodman, you know, from Shirley & Co, who sang Shame Shame Shame so disco friskily in 1974? Valerie June does this to you: reaches inside your musical brain and shakes it, unleashing ghosts, emotions and memories, all fluttering like countless musical flakes inside the snowglobe of your mind.\\n\\nA self-taught musician, singer and song-writer from small-town Humboldt, Tennessee (population 8,000), she honed her astonishing sound in the vibrant Memphis atmosphere, her spectrum of influences the history of music itself: Elizabeth Cotten, Leadbelly, The Carter Family, Whitney Houston, Van Morrison, Dolly Parton, Roscoe Holcomb, Woody Guthrie, Nico, Junior Kimbrough, Nina Simone, Bob Dylan, The Beatles, Nick Drake, Leonard Cohen, Joni Mitchell, Tracey Chapman, Billie Holiday, The Rolling Stones, Blind Lemon Jefferson, Mississippi John Hurt, Gillian Welch, Townes Van Zandt, Elmore James, Skip James, Blind Willie McTell, Memphis Minnie...\\n\\n\\n“Being from Jackson and Humboldt, Tennessee, I was raised one hour from Memphis and two hours from Nashville,” lilts Valerie June, in her sing-song, southern belle way. “It was and still is hard to go anywhere without hearing\\n\\ncountry and blues music. It always reminds me of home. It\\'s the place in art where the colour lines of the South seem to blend.”Her debut album, though, is that most rare of contemporary concepts: unique.\\n\\nPushin\\' Against A Stone, released on Rob da Bank\\'s stellar boutique label Sunday Best, was mostly recorded at The Black Key\\'s Easy Eye studio in Nashville. Produced by Dan Auerbach (The Black Keys) and Kevin Augunas (Edward Sharpe & The Magnetic Zeros, Florence & The Machine) it\\'s a sonic postcard from the universe, where the atoms of history live.\\n\\n\\n“I just love old records,” she smiles, a beautiful woman with old-school dreadlocks spiraling out towards freedom. “I like the crackle, the gritty sound. So do a lotta other people! I think we just wanna hear real music. Alongside the modern beat-machine music. For a while it was only moving in a new direction and people started missing the old stuff. I think it\\'s something people long for.”\\n\\n\\nThe debut single, Workin’ Woman Blues, is a riot, a brand new bona-fide blues-pop anthem, as if Bobbie Gentry fronted a Stax soul-revue, those mesmerising vocals telling it how it is: “I ain\\'t fit to be no mother, I ain\\'t fit to be no wife, yeah, I been workin\\' like a man, y\\'all, I\\'ve been working all my life.” Elsewhere, there\\'s the delicate yet rousing triumph of Somebody To Love (featuring the iconic Booker T. Jones), the traditional folk-gospel charm of Trials, Troubles, Tribulations, the spectral, swampy wooziness of Pushin\\' Against A Stone (The Specials meets Phil Spector) and the dizzy, harmonised, Shangri-La sashay of Wanna Be On Your Mind, Valerie June\\'s voice sounding, somehow, both as old and wise as mother nature and as playfully naïve as a schoolgirl skipping home. Staggeringly, she\\'d never worked with a producer before, the experience opening her up to infinite new atmospheric possibilities.  \\n\\n“It was different,” she says. “  I\\'d been holding on to a particular image of what I wanted to be as a folk musician, a country musician, a southern roots musician. But when I heard the producers\\' ideas I thought, \\'think bigger\\'. I looked at the careers of Joni Mitchell, Van Morrison, Joan Baez and they’ve put out all kinds of\\n\\nmusic over the course of their careers so far. If I wanna put out a punk rock record next week, that\\'s me. It\\'s all coming from me.  Even if I have to continue juggling jobs, I am a career artist.”\\n\\nWe don\\'t hear so much, these days, from the old-school working class girls, the ones who can\\'t afford the freedom to pursue their most daring dreams. Valerie June, the eldest girl of five kids (who\\'d often pretend to be the Jackson Five), first learned to sing in church, both a black church and later, a white church, when her family moved to the country. People sang in church, “even when they couldn\\'t sing” and she\\'d mimic them all, “from homeless people to wealthy people until my own voice just started coming out, a mixture of everyone”. She had her first jobs as a teen, helping her dad, both a promoter for local gospel singers and in the construction business (she\\'d hang posters in town and then head to the demolition sites). Soon she was constantly singing, writing songs, a freedom-seeking spirit who went travelling as a wandering songbird up and down the American west coast, then the east coast, a gypsy nightingale and holistic craftswoman who\\'d sing for tips in subway stations and sell her own handmade soap. By the time she moved back to Memphis in 2000, she had a plethora of songs written and finally taught herself guitar and banjo, as neighbourhood eyes were raised. “Black people aren\\'t supposed to play the banjo,” she laughs, “it\\'s seen as country and bluegrass but it\\'s an African instrument. I love it.” Soon, she was testing out her tentative musical skills in Memphis bars and restaurants, “which was more teaching myself in front of people,” she notes. “Memphis is a good town for being born as an artist. If you make a mistake people are like, \\'we heard the good part\\'. They nurture you. You can take your time.”\\n\\n\\nWith a dream to make a studio album and no cash to fund it, “it\\'s hard to think about making a record when you\\'ve gotta pay rent”, she went to work full-time, now tunneling her way to freedom like Andy Dufresne in the Shawshank Redemption through daily, determined graft. She took on numerous service jobs: housekeeper, dog-walker, babysitter, vegetarian meal cooker, house sitter and personal assistant to the wealthy. And that was just the morning. “In the\\n\\nafternoon, I\\'d work in a herb shop, Maggie\\'s Pharm. Then I would go play a gig, just me and my guitar.”\\n\\nShe began to musically emerge, playing the Memphis Music & Heritage Festival, the International Folk Alliance Conference, the Cooper-Young Festival, the King Biscuit Blues Festival in Helena, AR, finally making enough money for three lo-fi recordings which she sold as CDs on tour: the raw, acoustic The Way Of The Weeping Willow (recorded in an 1800s farmhouse), the vocally mesmerising Mountain Of Rose Quartz and the haunting Valerie June And The Tennessee Express, a collaboration with Nashville bluegrass troupe The Old Crow Medicine Show (who\\'ve toured with Mumford & Sons). “They\\'re very successful at what they do, they loved my music and said \\'hey, don\\'t worry about money just come and record a few songs with us\\'.”\\n\\nIn 2009 she was a featured artist on MTV\\'s online series $5 Cover (following the lives of Memphis musicians attempting to make ends meet) and eventually raised $15,000 through crowd-funding website Kickstarter to record a debut album proper. Then, the universe intervened: through word-of-mouth, the manager for producer Kevin Augunas heard Valerie\\'s music, sent it to Augunas, who loved it so much he flew into Memphis the following day. He asked who she\\'d like to write with and she suggested Dan Auerbach, whose solo work she\\'d loved (and who had recently moved to Nashville). Valerie, deliberately, had never signed to a record label before, although there had been no shortage of offers from both major and independent US-based labels, and was spotted playing in France by Sunday Best\\'s label partner Sarah Bolshi. “I never signed a label deal because it didn\\'t feel right,” she says.  “I need to be with people who not only like this record but my stripped down stuff too. People will tell you, \\'you can do whatever you wanna do with our label\\'. I didn\\'t trust anybody telling me that until I met Sarah! And it\\'s more me, a speciality label.”\\n\\n\\nPushin\\' Against A Stone is so-called because that\\'s the story of her life - and the story of her forebears, too.  “I feel I\\'ve spent my life pushing against a stone,” she says. “And the jobs I\\'ve had have been fitting for getting a true feel for how\\n\\nthe traditional artists I loved came home after a hard day to sit on the porch and play tunes until bedtime. That’s one reason why they were older before anybody cared. When I first started playing instruments I thought, OK, I\\'m probably not gonna be the next Beyonce, this is not gonna happen for me until I\\'m very very old. Like...Seasick Steve! Who I love. And then maybe somebody will come see me play in my shack in Mississippi. That\\'s kinda how it is for many artists who make roots music. So I\\'m just really happy it\\'s happening now and I\\'m not up there with my cane.”\\n\\n\\nGood things come to those who wait and Valerie June\\'s time is now, the last year bringing rave reviews at SXSW, a collaboration with Grammy-nominated Fugees producer John Forte (on the hip-hop-blues song Give Me Water) as the word-of-mouth whisper has gradually grown into a collective global holler. This September, one of her friends sent her a Facebook message saying she\\'d seen a video of her glorious Bestival Performance.  “And she said, \\'you\\'re gonna be a huge star\\',” smiles the captivating Valerie June. “A while ago I would\\'ve been like, I dunno about being a huge star. But now I\\'m like, you know what? If I can get a break? I will take it. I deserve it. I have paid my dues! I can\\'t work on Maggie\\'s Pharm no more. If you wanna bring me a coffee, yeah, I\\'ll let you bring it. Because I have been the person bringing the coffee. I don\\'t need any more experience in that. Now, being a queen? M\\'Kay! I think I can use a little spoiling. Bring it on.”\\n <a href=\"https://www.last.fm/music/Valerie+June\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['folk', 'blues', 'country', 'Alt-country', 'female vocalists'], similar_artists=[{'name': 'S.G. Goodman', 'url': 'https://www.last.fm/music/S.G.+Goodman'}, {'name': 'Rhiannon Giddens', 'url': 'https://www.last.fm/music/Rhiannon+Giddens'}, {'name': 'Amythyst Kiah', 'url': 'https://www.last.fm/music/Amythyst+Kiah'}, {'name': 'Allison Russell', 'url': 'https://www.last.fm/music/Allison+Russell'}, {'name': 'Sunny War', 'url': 'https://www.last.fm/music/Sunny+War'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Valerie June', 'mbid': 'b76c1bf7-f33b-460c-bfc3-f140d023fc94', 'url': 'https://www.last.fm/music/Valerie+June', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '219431', 'playcount': '2399047'}, 'similar': {'artist': [{'name': 'S.G. Goodman', 'url': 'https://www.last.fm/music/S.G.+Goodman', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Rhiannon Giddens', 'url': 'https://www.last.fm/music/Rhiannon+Giddens', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Amythyst Kiah', 'url': 'https://www.last.fm/music/Amythyst+Kiah', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Allison Russell', 'url': 'https://www.last.fm/music/Allison+Russell', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Sunny War', 'url': 'https://www.last.fm/music/Sunny+War', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'folk', 'url': 'https://www.last.fm/tag/folk'}, {'name': 'blues', 'url': 'https://www.last.fm/tag/blues'}, {'name': 'country', 'url': 'https://www.last.fm/tag/country'}, {'name': 'Alt-country', 'url': 'https://www.last.fm/tag/Alt-country'}, {'name': 'female vocalists', 'url': 'https://www.last.fm/tag/female+vocalists'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Valerie+June/+wiki'}}, 'published': '27 Mar 2009, 09:54', 'summary': 'Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.\\n\\nIf June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today\\'s myriad retro troubadours <a href=\"https://www.last.fm/music/Valerie+June\">Read more on Last.fm</a>', 'content': 'Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.\\n\\nIf June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today\\'s myriad retro troubadours, hers a stunningly emotive amalgamation of blues, folk, gospel, soul, Appalachian and bluegrass (including irresistible banjo). She exists, however, today, an artist as modern as an iPod Shuffle, a musician for the generation which carries the entire history of recorded music so casually inside its phone.\\n\\nLike a potent distillation bubbling on a Prohibition-era porch, Valerie June makes self-styled “organic moonshine roots music”, music for the porch parties of today, a party where she strums her guitar, plucks her banjo, opens her mouth and delta-blues-country stridently sashays out, a stunning peal somewhere between Dolly Parton and Billie Holiday. Or is it more Wanda Jackson and Shirley Goodman, you know, from Shirley & Co, who sang Shame Shame Shame so disco friskily in 1974? Valerie June does this to you: reaches inside your musical brain and shakes it, unleashing ghosts, emotions and memories, all fluttering like countless musical flakes inside the snowglobe of your mind.\\n\\nA self-taught musician, singer and song-writer from small-town Humboldt, Tennessee (population 8,000), she honed her astonishing sound in the vibrant Memphis atmosphere, her spectrum of influences the history of music itself: Elizabeth Cotten, Leadbelly, The Carter Family, Whitney Houston, Van Morrison, Dolly Parton, Roscoe Holcomb, Woody Guthrie, Nico, Junior Kimbrough, Nina Simone, Bob Dylan, The Beatles, Nick Drake, Leonard Cohen, Joni Mitchell, Tracey Chapman, Billie Holiday, The Rolling Stones, Blind Lemon Jefferson, Mississippi John Hurt, Gillian Welch, Townes Van Zandt, Elmore James, Skip James, Blind Willie McTell, Memphis Minnie...\\n\\n\\n“Being from Jackson and Humboldt, Tennessee, I was raised one hour from Memphis and two hours from Nashville,” lilts Valerie June, in her sing-song, southern belle way. “It was and still is hard to go anywhere without hearing\\n\\ncountry and blues music. It always reminds me of home. It\\'s the place in art where the colour lines of the South seem to blend.”Her debut album, though, is that most rare of contemporary concepts: unique.\\n\\nPushin\\' Against A Stone, released on Rob da Bank\\'s stellar boutique label Sunday Best, was mostly recorded at The Black Key\\'s Easy Eye studio in Nashville. Produced by Dan Auerbach (The Black Keys) and Kevin Augunas (Edward Sharpe & The Magnetic Zeros, Florence & The Machine) it\\'s a sonic postcard from the universe, where the atoms of history live.\\n\\n\\n“I just love old records,” she smiles, a beautiful woman with old-school dreadlocks spiraling out towards freedom. “I like the crackle, the gritty sound. So do a lotta other people! I think we just wanna hear real music. Alongside the modern beat-machine music. For a while it was only moving in a new direction and people started missing the old stuff. I think it\\'s something people long for.”\\n\\n\\nThe debut single, Workin’ Woman Blues, is a riot, a brand new bona-fide blues-pop anthem, as if Bobbie Gentry fronted a Stax soul-revue, those mesmerising vocals telling it how it is: “I ain\\'t fit to be no mother, I ain\\'t fit to be no wife, yeah, I been workin\\' like a man, y\\'all, I\\'ve been working all my life.” Elsewhere, there\\'s the delicate yet rousing triumph of Somebody To Love (featuring the iconic Booker T. Jones), the traditional folk-gospel charm of Trials, Troubles, Tribulations, the spectral, swampy wooziness of Pushin\\' Against A Stone (The Specials meets Phil Spector) and the dizzy, harmonised, Shangri-La sashay of Wanna Be On Your Mind, Valerie June\\'s voice sounding, somehow, both as old and wise as mother nature and as playfully naïve as a schoolgirl skipping home. Staggeringly, she\\'d never worked with a producer before, the experience opening her up to infinite new atmospheric possibilities.  \\n\\n“It was different,” she says. “  I\\'d been holding on to a particular image of what I wanted to be as a folk musician, a country musician, a southern roots musician. But when I heard the producers\\' ideas I thought, \\'think bigger\\'. I looked at the careers of Joni Mitchell, Van Morrison, Joan Baez and they’ve put out all kinds of\\n\\nmusic over the course of their careers so far. If I wanna put out a punk rock record next week, that\\'s me. It\\'s all coming from me.  Even if I have to continue juggling jobs, I am a career artist.”\\n\\nWe don\\'t hear so much, these days, from the old-school working class girls, the ones who can\\'t afford the freedom to pursue their most daring dreams. Valerie June, the eldest girl of five kids (who\\'d often pretend to be the Jackson Five), first learned to sing in church, both a black church and later, a white church, when her family moved to the country. People sang in church, “even when they couldn\\'t sing” and she\\'d mimic them all, “from homeless people to wealthy people until my own voice just started coming out, a mixture of everyone”. She had her first jobs as a teen, helping her dad, both a promoter for local gospel singers and in the construction business (she\\'d hang posters in town and then head to the demolition sites). Soon she was constantly singing, writing songs, a freedom-seeking spirit who went travelling as a wandering songbird up and down the American west coast, then the east coast, a gypsy nightingale and holistic craftswoman who\\'d sing for tips in subway stations and sell her own handmade soap. By the time she moved back to Memphis in 2000, she had a plethora of songs written and finally taught herself guitar and banjo, as neighbourhood eyes were raised. “Black people aren\\'t supposed to play the banjo,” she laughs, “it\\'s seen as country and bluegrass but it\\'s an African instrument. I love it.” Soon, she was testing out her tentative musical skills in Memphis bars and restaurants, “which was more teaching myself in front of people,” she notes. “Memphis is a good town for being born as an artist. If you make a mistake people are like, \\'we heard the good part\\'. They nurture you. You can take your time.”\\n\\n\\nWith a dream to make a studio album and no cash to fund it, “it\\'s hard to think about making a record when you\\'ve gotta pay rent”, she went to work full-time, now tunneling her way to freedom like Andy Dufresne in the Shawshank Redemption through daily, determined graft. She took on numerous service jobs: housekeeper, dog-walker, babysitter, vegetarian meal cooker, house sitter and personal assistant to the wealthy. And that was just the morning. “In the\\n\\nafternoon, I\\'d work in a herb shop, Maggie\\'s Pharm. Then I would go play a gig, just me and my guitar.”\\n\\nShe began to musically emerge, playing the Memphis Music & Heritage Festival, the International Folk Alliance Conference, the Cooper-Young Festival, the King Biscuit Blues Festival in Helena, AR, finally making enough money for three lo-fi recordings which she sold as CDs on tour: the raw, acoustic The Way Of The Weeping Willow (recorded in an 1800s farmhouse), the vocally mesmerising Mountain Of Rose Quartz and the haunting Valerie June And The Tennessee Express, a collaboration with Nashville bluegrass troupe The Old Crow Medicine Show (who\\'ve toured with Mumford & Sons). “They\\'re very successful at what they do, they loved my music and said \\'hey, don\\'t worry about money just come and record a few songs with us\\'.”\\n\\nIn 2009 she was a featured artist on MTV\\'s online series $5 Cover (following the lives of Memphis musicians attempting to make ends meet) and eventually raised $15,000 through crowd-funding website Kickstarter to record a debut album proper. Then, the universe intervened: through word-of-mouth, the manager for producer Kevin Augunas heard Valerie\\'s music, sent it to Augunas, who loved it so much he flew into Memphis the following day. He asked who she\\'d like to write with and she suggested Dan Auerbach, whose solo work she\\'d loved (and who had recently moved to Nashville). Valerie, deliberately, had never signed to a record label before, although there had been no shortage of offers from both major and independent US-based labels, and was spotted playing in France by Sunday Best\\'s label partner Sarah Bolshi. “I never signed a label deal because it didn\\'t feel right,” she says.  “I need to be with people who not only like this record but my stripped down stuff too. People will tell you, \\'you can do whatever you wanna do with our label\\'. I didn\\'t trust anybody telling me that until I met Sarah! And it\\'s more me, a speciality label.”\\n\\n\\nPushin\\' Against A Stone is so-called because that\\'s the story of her life - and the story of her forebears, too.  “I feel I\\'ve spent my life pushing against a stone,” she says. “And the jobs I\\'ve had have been fitting for getting a true feel for how\\n\\nthe traditional artists I loved came home after a hard day to sit on the porch and play tunes until bedtime. That’s one reason why they were older before anybody cared. When I first started playing instruments I thought, OK, I\\'m probably not gonna be the next Beyonce, this is not gonna happen for me until I\\'m very very old. Like...Seasick Steve! Who I love. And then maybe somebody will come see me play in my shack in Mississippi. That\\'s kinda how it is for many artists who make roots music. So I\\'m just really happy it\\'s happening now and I\\'m not up there with my cane.”\\n\\n\\nGood things come to those who wait and Valerie June\\'s time is now, the last year bringing rave reviews at SXSW, a collaboration with Grammy-nominated Fugees producer John Forte (on the hip-hop-blues song Give Me Water) as the word-of-mouth whisper has gradually grown into a collective global holler. This September, one of her friends sent her a Facebook message saying she\\'d seen a video of her glorious Bestival Performance.  “And she said, \\'you\\'re gonna be a huge star\\',” smiles the captivating Valerie June. “A while ago I would\\'ve been like, I dunno about being a huge star. But now I\\'m like, you know what? If I can get a break? I will take it. I deserve it. I have paid my dues! I can\\'t work on Maggie\\'s Pharm no more. If you wanna bring me a coffee, yeah, I\\'ll let you bring it. Because I have been the person bringing the coffee. I don\\'t need any more experience in that. Now, being a queen? M\\'Kay! I think I can use a little spoiling. Bring it on.”\\n <a href=\"https://www.last.fm/music/Valerie+June\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='4QZdOCb3UacKbQ1ybDFAKM', url='https://open.spotify.com/artist/4QZdOCb3UacKbQ1ybDFAKM', name='Valerie June', popularity=49, followers=184061, genres=['folk', 'americana'], images=[{'url': 'https://i.scdn.co/image/ab6761610000e5eba4d591c3d5009ceddb94c822', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174a4d591c3d5009ceddb94c822', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178a4d591c3d5009ceddb94c822', 'height': 160, 'width': 160}], external_urls={'spotify': 'https://open.spotify.com/artist/4QZdOCb3UacKbQ1ybDFAKM'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/4QZdOCb3UacKbQ1ybDFAKM'}, 'followers': {'href': None, 'total': 184061}, 'genres': ['folk', 'americana'], 'href': 'https://api.spotify.com/v1/artists/4QZdOCb3UacKbQ1ybDFAKM', 'id': '4QZdOCb3UacKbQ1ybDFAKM', 'images': [{'url': 'https://i.scdn.co/image/ab6761610000e5eba4d591c3d5009ceddb94c822', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174a4d591c3d5009ceddb94c822', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178a4d591c3d5009ceddb94c822', 'height': 160, 'width': 160}], 'name': 'Valerie June', 'popularity': 49, 'type': 'artist', 'uri': 'spotify:artist:4QZdOCb3UacKbQ1ybDFAKM'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.  If June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today's myriad retro troubadours, hers a stunningly emotive amalgamation of blues, folk, gospel, soul, Appalachian and bluegrass (including irresistible banjo). She exists, however, today, an artist as modern as an iPod Shuffle, a musician for the generation which carries the entire history of recorded music so casually inside its phone.  Like a potent distillation bubbling on a Prohibition-era porch, Valerie June makes self-styled \"organic moonshine roots music\", music for the porch parties of today, a party where she strums her guitar, plucks her banjo, opens her mouth and delta-blues-country stridently sashays out, a stunning peal somewhere between Dolly Parton and Billie Holiday. Or is it more Wanda Jackson and Shirley Goodman, you know, from Shirley & Co, who sang Shame Shame Shame so disco friskily in 1974? Valerie June does this to you: reaches inside your musical brain and shakes it, unleashing ghosts, emotions and memories, all fluttering like countless musical flakes inside the snowglobe of your mind.  A self-taught musician, singer and song-writer from small-town Humboldt, Tennessee (population 8,000), she honed her astonishing sound in the vibrant Memphis atmosphere, her spectrum of influences the history of music itself: Elizabeth Cotten, Leadbelly, The Carter Family, Whitney Houston, Van Morrison, Dolly Parton, Roscoe Holcomb, Woody Guthrie, Nico, Junior Kimbrough, Nina Simone, Bob Dylan, The Beatles, Nick Drake, Leonard Cohen, Joni Mitchell, Tracey Chapman, Billie Holiday, The Rolling Stones, Blind Lemon Jefferson, Mississippi John Hurt, Gillian Welch, Townes Van Zandt, Elmore James, Skip James, Blind Willie McTell, Memphis Minnie...   \"Being from Jackson and Humboldt, Tennessee, I was raised one hour from Memphis and two hours from Nashville,\" lilts Valerie June, in her sing-song, southern belle way. \"It was and still is hard to go anywhere without hearing  country and blues music. It always reminds me of home. It's the place in art where the colour lines of the South seem to blend.\"Her debut album, though, is that most rare of contemporary concepts: unique.  Pushin' Against A Stone, released on Rob da Bank's stellar boutique label Sunday Best, was mostly recorded at The Black Key's Easy Eye studio in Nashville. Produced by Dan Auerbach (The Black Keys) and Kevin Augunas (Edward Sharpe & The Magnetic Zeros, Florence & The Machine) it's a sonic postcard from the universe, where the atoms of history live.   \"I just love old records,\" she smiles, a beautiful woman with old-school dreadlocks spiraling out towards freedom. \"I like the crackle, the gritty sound. So do a lotta other people! I think we just wanna hear real music. Alongside the modern beat-machine music. For a while it was only moving in a new direction and people started missing the old stuff. I think it's something people long for.\"   The debut single, Workin' Woman Blues, is a riot, a brand new bona-fide blues-pop anthem, as if Bobbie Gentry fronted a Stax soul-revue, those mesmerising vocals telling it how it is: \"I ain't fit to be no mother, I ain't fit to be no wife, yeah, I been workin' like a man, y'all, I've been working all my life.\" Elsewhere, there's the delicate yet rousing triumph of Somebody To Love (featuring the iconic Booker T. Jones), the traditional folk-gospel charm of Trials, Troubles, Tribulations, the spectral, swampy wooziness of Pushin' Against A Stone (The Specials meets Phil Spector) and the dizzy, harmonised, Shangri-La sashay of Wanna Be On Your Mind, Valerie June's voice sounding, somehow, both as old and wise as mother nature and as playfully naïve as a schoolgirl skipping home. Staggeringly, she'd never worked with a producer before, the experience opening her up to infinite new atmospheric possibilities.    \"It was different,\" she says. \"  I'd been holding on to a particular image of what I wanted to be as a folk musician, a country musician, a southern roots musician. But when I heard the producers' ideas I thought, 'think bigger'. I looked at the careers of Joni Mitchell, Van Morrison, Joan Baez and they've put out all kinds of  music over the course of their careers so far. If I wanna put out a punk rock record next week, that's me. It's all coming from me.  Even if I have to continue juggling jobs, I am a career artist.\"  We don't hear so much, these days, from the old-school working class girls, the ones who can't afford the freedom to pursue their most daring dreams. Valerie June, the eldest girl of five kids (who'd often pretend to be the Jackson Five), first learned to sing in church, both a black church and later, a white church, when her family moved to the country. People sang in church, \"even when they couldn't sing\" and she'd mimic them all, \"from homeless people to wealthy people until my own voice just started coming out, a mixture of everyone\". She had her first jobs as a teen, helping her dad, both a promoter for local gospel singers and in the construction business (she'd hang posters in town and then head to the demolition sites). Soon she was constantly singing, writing songs, a freedom-seeking spirit who went travelling as a wandering songbird up and down the American west coast, then the east coast, a gypsy nightingale and holistic craftswoman who'd sing for tips in subway stations and sell her own handmade soap. By the time she moved back to Memphis in 2000, she had a plethora of songs written and finally taught herself guitar and banjo, as neighbourhood eyes were raised. \"Black people aren't supposed to play the banjo,\" she laughs, \"it's seen as country and bluegrass but it's an African instrument. I love it.\" Soon, she was testing out her tentative musical skills in Memphis bars and restaurants, \"which was more teaching myself in front of people,\" she notes. \"Memphis is a good town for being born as an artist. If you make a mistake people are like, 'we heard the good part'. They nurture you. You can take your time.\"   With a dream to make a studio album and no cash to fund it, \"it's hard to think about making a record when you've gotta pay rent\", she went to work full-time, now tunneling her way to freedom like Andy Dufresne in the Shawshank Redemption through daily, determined graft. She took on numerous service jobs: housekeeper, dog-walker, babysitter, vegetarian meal cooker, house sitter and personal assistant to the wealthy. And that was just the morning. \"In the  afternoon, I'd work in a herb shop, Maggie's Pharm. Then I would go play a gig, just me and my guitar.\"  She began to musically emerge, playing the Memphis Music & Heritage Festival, the International Folk Alliance Conference, the Cooper-Young Festival, the King Biscuit Blues Festival in Helena, AR, finally making enough money for three lo-fi recordings which she sold as CDs on tour: the raw, acoustic The Way Of The Weeping Willow (recorded in an 1800s farmhouse), the vocally mesmerising Mountain Of Rose Quartz and the haunting Valerie June And The Tennessee Express, a collaboration with Nashville bluegrass troupe The Old Crow Medicine Show (who've toured with Mumford & Sons). \"They're very successful at what they do, they loved my music and said 'hey, don't worry about money just come and record a few songs with us'.\"  In 2009 she was a featured artist on MTV's online series $5 Cover (following the lives of Memphis musicians attempting to make ends meet) and eventually raised $15,000 through crowd-funding website Kickstarter to record a debut album proper. Then, the universe intervened: through word-of-mouth, the manager for producer Kevin Augunas heard Valerie's music, sent it to Augunas, who loved it so much he flew into Memphis the following day. He asked who she'd like to write with and she suggested Dan Auerbach, whose solo work she'd loved (and who had recently moved to Nashville). Valerie, deliberately, had never signed to a record label before, although there had been no shortage of offers from both major and independent US-based labels, and was spotted playing in France by Sunday Best's label partner Sarah Bolshi. \"I never signed a label deal because it didn't feel right,\" she says.  \"I need to be with people who not only like this record but my stripped down stuff too. People will tell you, 'you can do whatever you wanna do with our label'. I didn't trust anybody telling me that until I met Sarah! And it's more me, a speciality label.\"   Pushin' Against A Stone is so-called because that's the story of her life - and the story of her forebears, too.  \"I feel I've spent my life pushing against a stone,\" she says. \"And the jobs I've had have been fitting for getting a true feel for how  the traditional artists I loved came home after a hard day to sit on the porch and play tunes until bedtime. That's one reason why they were older before anybody cared. When I first started playing instruments I thought, OK, I'm probably not gonna be the next Beyonce, this is not gonna happen for me until I'm very very old. Like...Seasick Steve! Who I love. And then maybe somebody will come see me play in my shack in Mississippi. That's kinda how it is for many artists who make roots music. So I'm just really happy it's happening now and I'm not up there with my cane.\"   Good things come to those who wait and Valerie June's time is now, the last year bringing rave reviews at SXSW, a collaboration with Grammy-nominated Fugees producer John Forte (on the hip-hop-blues song Give Me Water) as the word-of-mouth whisper has gradually grown into a collective global holler. This September, one of her friends sent her a Facebook message saying she'd seen a video of her glorious Bestival Performance.  \"And she said, 'you're gonna be a huge star',\" smiles the captivating Valerie June. \"A while ago I would've been like, I dunno about being a huge star. But now I'm like, you know what? If I can get a break? I will take it. I deserve it. I have paid my dues! I can't work on Maggie's Pharm no more. If you wanna bring me a coffee, yeah, I'll let you bring it. Because I have been the person bringing the coffee. I don't need any more experience in that. Now, being a queen? M'Kay! I think I can use a little spoiling. Bring it on.\"",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1982",
      "country": "Jackson,Tennessee,USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "en-gb.facebook.com/valeriejunemusic/",
      "formed_year": null,
      "gender": "Female",
      "genre": "Folk",
      "id": "135581",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/june-valerie-52a4c828246c2.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xxxqpt1489159797.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/twvvys1489159815.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/y06s401615626890.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/xwqsww1489159828.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/qtuxtp1489159778.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "b76c1bf7-f33b-460c-bfc3-f140d023fc94",
      "name": "Valerie June",
      "raw_data": {},
      "style": "Blues",
      "twitter": "1",
      "website": "valeriejune.com/the-order-of-time"
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/54/5f/c8/545fc8d3-7a54-8478-6002-a08f6606b08d/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Singer/Songwriter"
      ],
      "id": "313040471",
      "name": "Valerie June",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/valerie-june/313040471"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "2959182",
      "images": [
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/31xgOCoAQ5cGq21ajQNuEMYWqPVOpOZMLkwLP8KSdbg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 316,
          "resource_url": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/tt6gKdLBgqTFRnTHELT8PoNpAiTrKMO8NHbmz1yONq8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
          "width": 400
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/n_VbzfgSgGh9LVoHPAESBmxCIduhcohQtk_jHW6NWRY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 228,
          "resource_url": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/n2f52YV7GudSxjUkTIm7obpT50BD4KuHAks9VGkOTDc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
          "width": 400
        },
        {
          "height": 472,
          "resource_url": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/mhhOQELn8zxg9Lq-YsfyObOG3Y4VfRx0l0kvW7qHCXk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 399,
          "resource_url": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/mTC9PGw0MJSWfQF1kdwsEN4oBgmfVPEsq3E8b3WGFiM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 475,
          "resource_url": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/yoSnPRgIStKHbiTiLpNAzMKw0lbVMnKcw89zWQvOE4w/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 900,
          "resource_url": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/SuITuPNo2-f9DBAO786inpW5JAY9FEj2TWLN-3x2QDI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/5gR1Lapq_Hshlw16KvI8pjL5vcfgmhzsXLumQUOFgQA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "Valerie June",
      "namevariations": [
        "V. June",
        "Valerie June Hockett"
      ],
      "profile": "American singer, songwriter and multi-instrumentalist from Memphis, Tennessee, USA.\r\nDaughter of [a5616183], sister of [a5616184] and [a5616182].",
      "raw_data": {
        "aliases": [
          {
            "id": 4156583,
            "name": "Valerie Joyner",
            "resource_url": "https://api.discogs.com/artists/4156583",
            "thumbnail_url": "https://i.discogs.com/WnMx7eHjCMAg93pz8Cmh2wb6wYzsgin4ZAqP3EaxELE/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxNTY1/ODMtMTQxOTEwOTI2/OC0yMjQ1LmpwZWc.jpeg"
          }
        ],
        "data_quality": "Correct",
        "groups": [
          {
            "active": true,
            "id": 3681163,
            "name": "The Wandering",
            "resource_url": "https://api.discogs.com/artists/3681163",
            "thumbnail_url": ""
          }
        ],
        "id": 2959182,
        "images": [
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/i6ne1e8H9AFDXL3YDkAcN7zJ9RvQUTwKI45sM45KCPA/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/31xgOCoAQ5cGq21ajQNuEMYWqPVOpOZMLkwLP8KSdbg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 316,
            "resource_url": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Ry4KgJDA5ij2UbyzZrufEqwHz77kKPOhL2Df9AGdIpo/rs:fit/g:sm/q:90/h:316/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/tt6gKdLBgqTFRnTHELT8PoNpAiTrKMO8NHbmz1yONq8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTM1MzMyNjQw/OC05OTAzLmpwZWc.jpeg",
            "width": 400
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/mSEr0fofBZRqsBTsZG8DeXF0RDDCWoyawvdy4SWggKU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/n_VbzfgSgGh9LVoHPAESBmxCIduhcohQtk_jHW6NWRY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MS0xNTk1LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 228,
            "resource_url": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/8deH6imqIJ1gW93OUMkhg817zgoMI83qO_i0xX5lafE/rs:fit/g:sm/q:90/h:228/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/n2f52YV7GudSxjUkTIm7obpT50BD4KuHAks9VGkOTDc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC00NzkxLmpwZWc.jpeg",
            "width": 400
          },
          {
            "height": 472,
            "resource_url": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/BiZNW91cMpqccrTVoYvKJ8I8kvnf70IPsAMPNON9hBE/rs:fit/g:sm/q:90/h:472/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/mhhOQELn8zxg9Lq-YsfyObOG3Y4VfRx0l0kvW7qHCXk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDMx/NC02MDQ4LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 399,
            "resource_url": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/XfMW-jwxgrg-HdZa57HkxCx36N0GOISGkv1HWUWLR9A/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/mTC9PGw0MJSWfQF1kdwsEN4oBgmfVPEsq3E8b3WGFiM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDM0/Ny0xMzQ3LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 475,
            "resource_url": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/OX36Dxi0lk_RlHeZABPqK1PYvLotHfaLNCRdVFJK4_M/rs:fit/g:sm/q:90/h:475/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/yoSnPRgIStKHbiTiLpNAzMKw0lbVMnKcw89zWQvOE4w/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQx/NS0yNzU3LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 900,
            "resource_url": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/WYGuYQFdoXFvE6r6APQmg5InTrq40RG8xjq8vJwXYhY/rs:fit/g:sm/q:90/h:900/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/SuITuPNo2-f9DBAO786inpW5JAY9FEj2TWLN-3x2QDI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00NTk2LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/mmaoM-tsM-isNb1g2zdlBNKzQu2kqUVGEPuXscHHYhU/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/5gR1Lapq_Hshlw16KvI8pjL5vcfgmhzsXLumQUOFgQA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDQ1/Mi00OTA0LmpwZWc.jpeg",
            "width": 600
          }
        ],
        "name": "Valerie June",
        "namevariations": [
          "V. June",
          "Valerie June Hockett"
        ],
        "profile": "American singer, songwriter and multi-instrumentalist from Memphis, Tennessee, USA.\r\nDaughter of [a5616183], sister of [a5616184] and [a5616182].",
        "realname": "Valerie June Hockett",
        "releases_url": "https://api.discogs.com/artists/2959182/releases",
        "resource_url": "https://api.discogs.com/artists/2959182",
        "uri": "https://www.discogs.com/artist/2959182-Valerie-June",
        "urls": [
          "http://www.valeriejune.com/",
          "https://soundcloud.com/valeriejune",
          "http://www.myspace.com/valeriejune",
          "https://www.facebook.com/valeriejunemusic",
          "https://twitter.com/thevaleriejune",
          "http://thevaleriejune.tumblr.com/",
          "http://en.wikipedia.org/wiki/Valerie_June"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/2959182",
      "thumb": "https://i.discogs.com/31xgOCoAQ5cGq21ajQNuEMYWqPVOpOZMLkwLP8KSdbg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5NTkx/ODItMTQxNzg5NDI2/MC05NTA5LmpwZWc.jpeg",
      "url": "https://www.discogs.com/artist/2959182-Valerie-June",
      "urls": [
        "http://www.valeriejune.com/",
        "https://soundcloud.com/valeriejune",
        "http://www.myspace.com/valeriejune",
        "https://www.facebook.com/valeriejunemusic",
        "https://twitter.com/thevaleriejune",
        "http://thevaleriejune.tumblr.com/",
        "http://en.wikipedia.org/wiki/Valerie_June"
      ]
    },
    "lastfm": {
      "bio_content": "Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.\n\nIf June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today's myriad retro troubadours, hers a stunningly emotive amalgamation of blues, folk, gospel, soul, Appalachian and bluegrass (including irresistible banjo). She exists, however, today, an artist as modern as an iPod Shuffle, a musician for the generation which carries the entire history of recorded music so casually inside its phone.\n\nLike a potent distillation bubbling on a Prohibition-era porch, Valerie June makes self-styled “organic moonshine roots music”, music for the porch parties of today, a party where she strums her guitar, plucks her banjo, opens her mouth and delta-blues-country stridently sashays out, a stunning peal somewhere between Dolly Parton and Billie Holiday. Or is it more Wanda Jackson and Shirley Goodman, you know, from Shirley & Co, who sang Shame Shame Shame so disco friskily in 1974? Valerie June does this to you: reaches inside your musical brain and shakes it, unleashing ghosts, emotions and memories, all fluttering like countless musical flakes inside the snowglobe of your mind.\n\nA self-taught musician, singer and song-writer from small-town Humboldt, Tennessee (population 8,000), she honed her astonishing sound in the vibrant Memphis atmosphere, her spectrum of influences the history of music itself: Elizabeth Cotten, Leadbelly, The Carter Family, Whitney Houston, Van Morrison, Dolly Parton, Roscoe Holcomb, Woody Guthrie, Nico, Junior Kimbrough, Nina Simone, Bob Dylan, The Beatles, Nick Drake, Leonard Cohen, Joni Mitchell, Tracey Chapman, Billie Holiday, The Rolling Stones, Blind Lemon Jefferson, Mississippi John Hurt, Gillian Welch, Townes Van Zandt, Elmore James, Skip James, Blind Willie McTell, Memphis Minnie...\n\n\n“Being from Jackson and Humboldt, Tennessee, I was raised one hour from Memphis and two hours from Nashville,” lilts Valerie June, in her sing-song, southern belle way. “It was and still is hard to go anywhere without hearing\n\ncountry and blues music. It always reminds me of home. It's the place in art where the colour lines of the South seem to blend.”Her debut album, though, is that most rare of contemporary concepts: unique.\n\nPushin' Against A Stone, released on Rob da Bank's stellar boutique label Sunday Best, was mostly recorded at The Black Key's Easy Eye studio in Nashville. Produced by Dan Auerbach (The Black Keys) and Kevin Augunas (Edward Sharpe & The Magnetic Zeros, Florence & The Machine) it's a sonic postcard from the universe, where the atoms of history live.\n\n\n“I just love old records,” she smiles, a beautiful woman with old-school dreadlocks spiraling out towards freedom. “I like the crackle, the gritty sound. So do a lotta other people! I think we just wanna hear real music. Alongside the modern beat-machine music. For a while it was only moving in a new direction and people started missing the old stuff. I think it's something people long for.”\n\n\nThe debut single, Workin’ Woman Blues, is a riot, a brand new bona-fide blues-pop anthem, as if Bobbie Gentry fronted a Stax soul-revue, those mesmerising vocals telling it how it is: “I ain't fit to be no mother, I ain't fit to be no wife, yeah, I been workin' like a man, y'all, I've been working all my life.” Elsewhere, there's the delicate yet rousing triumph of Somebody To Love (featuring the iconic Booker T. Jones), the traditional folk-gospel charm of Trials, Troubles, Tribulations, the spectral, swampy wooziness of Pushin' Against A Stone (The Specials meets Phil Spector) and the dizzy, harmonised, Shangri-La sashay of Wanna Be On Your Mind, Valerie June's voice sounding, somehow, both as old and wise as mother nature and as playfully naïve as a schoolgirl skipping home. Staggeringly, she'd never worked with a producer before, the experience opening her up to infinite new atmospheric possibilities.  \n\n“It was different,” she says. “  I'd been holding on to a particular image of what I wanted to be as a folk musician, a country musician, a southern roots musician. But when I heard the producers' ideas I thought, 'think bigger'. I looked at the careers of Joni Mitchell, Van Morrison, Joan Baez and they’ve put out all kinds of\n\nmusic over the course of their careers so far. If I wanna put out a punk rock record next week, that's me. It's all coming from me.  Even if I have to continue juggling jobs, I am a career artist.”\n\nWe don't hear so much, these days, from the old-school working class girls, the ones who can't afford the freedom to pursue their most daring dreams. Valerie June, the eldest girl of five kids (who'd often pretend to be the Jackson Five), first learned to sing in church, both a black church and later, a white church, when her family moved to the country. People sang in church, “even when they couldn't sing” and she'd mimic them all, “from homeless people to wealthy people until my own voice just started coming out, a mixture of everyone”. She had her first jobs as a teen, helping her dad, both a promoter for local gospel singers and in the construction business (she'd hang posters in town and then head to the demolition sites). Soon she was constantly singing, writing songs, a freedom-seeking spirit who went travelling as a wandering songbird up and down the American west coast, then the east coast, a gypsy nightingale and holistic craftswoman who'd sing for tips in subway stations and sell her own handmade soap. By the time she moved back to Memphis in 2000, she had a plethora of songs written and finally taught herself guitar and banjo, as neighbourhood eyes were raised. “Black people aren't supposed to play the banjo,” she laughs, “it's seen as country and bluegrass but it's an African instrument. I love it.” Soon, she was testing out her tentative musical skills in Memphis bars and restaurants, “which was more teaching myself in front of people,” she notes. “Memphis is a good town for being born as an artist. If you make a mistake people are like, 'we heard the good part'. They nurture you. You can take your time.”\n\n\nWith a dream to make a studio album and no cash to fund it, “it's hard to think about making a record when you've gotta pay rent”, she went to work full-time, now tunneling her way to freedom like Andy Dufresne in the Shawshank Redemption through daily, determined graft. She took on numerous service jobs: housekeeper, dog-walker, babysitter, vegetarian meal cooker, house sitter and personal assistant to the wealthy. And that was just the morning. “In the\n\nafternoon, I'd work in a herb shop, Maggie's Pharm. Then I would go play a gig, just me and my guitar.”\n\nShe began to musically emerge, playing the Memphis Music & Heritage Festival, the International Folk Alliance Conference, the Cooper-Young Festival, the King Biscuit Blues Festival in Helena, AR, finally making enough money for three lo-fi recordings which she sold as CDs on tour: the raw, acoustic The Way Of The Weeping Willow (recorded in an 1800s farmhouse), the vocally mesmerising Mountain Of Rose Quartz and the haunting Valerie June And The Tennessee Express, a collaboration with Nashville bluegrass troupe The Old Crow Medicine Show (who've toured with Mumford & Sons). “They're very successful at what they do, they loved my music and said 'hey, don't worry about money just come and record a few songs with us'.”\n\nIn 2009 she was a featured artist on MTV's online series $5 Cover (following the lives of Memphis musicians attempting to make ends meet) and eventually raised $15,000 through crowd-funding website Kickstarter to record a debut album proper. Then, the universe intervened: through word-of-mouth, the manager for producer Kevin Augunas heard Valerie's music, sent it to Augunas, who loved it so much he flew into Memphis the following day. He asked who she'd like to write with and she suggested Dan Auerbach, whose solo work she'd loved (and who had recently moved to Nashville). Valerie, deliberately, had never signed to a record label before, although there had been no shortage of offers from both major and independent US-based labels, and was spotted playing in France by Sunday Best's label partner Sarah Bolshi. “I never signed a label deal because it didn't feel right,” she says.  “I need to be with people who not only like this record but my stripped down stuff too. People will tell you, 'you can do whatever you wanna do with our label'. I didn't trust anybody telling me that until I met Sarah! And it's more me, a speciality label.”\n\n\nPushin' Against A Stone is so-called because that's the story of her life - and the story of her forebears, too.  “I feel I've spent my life pushing against a stone,” she says. “And the jobs I've had have been fitting for getting a true feel for how\n\nthe traditional artists I loved came home after a hard day to sit on the porch and play tunes until bedtime. That’s one reason why they were older before anybody cared. When I first started playing instruments I thought, OK, I'm probably not gonna be the next Beyonce, this is not gonna happen for me until I'm very very old. Like...Seasick Steve! Who I love. And then maybe somebody will come see me play in my shack in Mississippi. That's kinda how it is for many artists who make roots music. So I'm just really happy it's happening now and I'm not up there with my cane.”\n\n\nGood things come to those who wait and Valerie June's time is now, the last year bringing rave reviews at SXSW, a collaboration with Grammy-nominated Fugees producer John Forte (on the hip-hop-blues song Give Me Water) as the word-of-mouth whisper has gradually grown into a collective global holler. This September, one of her friends sent her a Facebook message saying she'd seen a video of her glorious Bestival Performance.  “And she said, 'you're gonna be a huge star',” smiles the captivating Valerie June. “A while ago I would've been like, I dunno about being a huge star. But now I'm like, you know what? If I can get a break? I will take it. I deserve it. I have paid my dues! I can't work on Maggie's Pharm no more. If you wanna bring me a coffee, yeah, I'll let you bring it. Because I have been the person bringing the coffee. I don't need any more experience in that. Now, being a queen? M'Kay! I think I can use a little spoiling. Bring it on.”\n <a href=\"https://www.last.fm/music/Valerie+June\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.\n\nIf June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today's myriad retro troubadours <a href=\"https://www.last.fm/music/Valerie+June\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 219431,
      "mbid": "b76c1bf7-f33b-460c-bfc3-f140d023fc94",
      "name": "Valerie June",
      "playcount": 2399047,
      "similar_artists": [
        {
          "name": "S.G. Goodman",
          "url": "https://www.last.fm/music/S.G.+Goodman"
        },
        {
          "name": "Rhiannon Giddens",
          "url": "https://www.last.fm/music/Rhiannon+Giddens"
        },
        {
          "name": "Amythyst Kiah",
          "url": "https://www.last.fm/music/Amythyst+Kiah"
        },
        {
          "name": "Allison Russell",
          "url": "https://www.last.fm/music/Allison+Russell"
        },
        {
          "name": "Sunny War",
          "url": "https://www.last.fm/music/Sunny+War"
        }
      ],
      "tags": [
        "folk",
        "blues",
        "country",
        "Alt-country",
        "female vocalists"
      ],
      "url": "https://www.last.fm/music/Valerie+June"
    },
    "spotify": {
      "followers": 184061,
      "genres": [
        "folk",
        "americana"
      ],
      "id": "4QZdOCb3UacKbQ1ybDFAKM",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eba4d591c3d5009ceddb94c822",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174a4d591c3d5009ceddb94c822",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178a4d591c3d5009ceddb94c822",
          "width": 160
        }
      ],
      "name": "Valerie June",
      "popularity": 49,
      "url": "https://open.spotify.com/artist/4QZdOCb3UacKbQ1ybDFAKM"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Valerie June (born Valerie June Hockett in 1982) is an American singer, songwriter, and multi-instrumentalist from Memphis, Tennessee. She began recording and performing in 2001, initially with her then-husband in the duo Bella Sun. In her solo work her sound encompasses a mixture of folk, blues, gospel, soul, country, Appalachian and bluegrass.  If June had been a roots artist in America 80 years ago, and she often sings as if she was, she might have been a principle influence on today's myriad retro troubadours, hers a stunningly emotive amalgamation of blues, folk, gospel, soul, Appalachian and bluegrass (including irresistible banjo). She exists, however, today, an artist as modern as an iPod Shuffle, a musician for the generation which carries the entire history of recorded music so casually inside its phone.  Like a potent distillation bubbling on a Prohibition-era porch, Valerie June makes self-styled \"organic moonshine roots music\", music for the porch parties of today, a party where she strums her guitar, plucks her banjo, opens her mouth and delta-blues-country stridently sashays out, a stunning peal somewhere between Dolly Parton and Billie Holiday. Or is it more Wanda Jackson and Shirley Goodman, you know, from Shirley & Co, who sang Shame Shame Shame so disco friskily in 1974? Valerie June does this to you: reaches inside your musical brain and shakes it, unleashing ghosts, emotions and memories, all fluttering like countless musical flakes inside the snowglobe of your mind.  A self-taught musician, singer and song-writer from small-town Humboldt, Tennessee (population 8,000), she honed her astonishing sound in the vibrant Memphis atmosphere, her spectrum of influences the history of music itself: Elizabeth Cotten, Leadbelly, The Carter Family, Whitney Houston, Van Morrison, Dolly Parton, Roscoe Holcomb, Woody Guthrie, Nico, Junior Kimbrough, Nina Simone, Bob Dylan, The Beatles, Nick Drake, Leonard Cohen, Joni Mitchell, Tracey Chapman, Billie Holiday, The Rolling Stones, Blind Lemon Jefferson, Mississippi John Hurt, Gillian Welch, Townes Van Zandt, Elmore James, Skip James, Blind Willie McTell, Memphis Minnie...   \"Being from Jackson and Humboldt, Tennessee, I was raised one hour from Memphis and two hours from Nashville,\" lilts Valerie June, in her sing-song, southern belle way. \"It was and still is hard to go anywhere without hearing  country and blues music. It always reminds me of home. It's the place in art where the colour lines of the South seem to blend.\"Her debut album, though, is that most rare of contemporary concepts: unique.  Pushin' Against A Stone, released on Rob da Bank's stellar boutique label Sunday Best, was mostly recorded at The Black Key's Easy Eye studio in Nashville. Produced by Dan Auerbach (The Black Keys) and Kevin Augunas (Edward Sharpe & The Magnetic Zeros, Florence & The Machine) it's a sonic postcard from the universe, where the atoms of history live.   \"I just love old records,\" she smiles, a beautiful woman with old-school dreadlocks spiraling out towards freedom. \"I like the crackle, the gritty sound. So do a lotta other people! I think we just wanna hear real music. Alongside the modern beat-machine music. For a while it was only moving in a new direction and people started missing the old stuff. I think it's something people long for.\"   The debut single, Workin' Woman Blues, is a riot, a brand new bona-fide blues-pop anthem, as if Bobbie Gentry fronted a Stax soul-revue, those mesmerising vocals telling it how it is: \"I ain't fit to be no mother, I ain't fit to be no wife, yeah, I been workin' like a man, y'all, I've been working all my life.\" Elsewhere, there's the delicate yet rousing triumph of Somebody To Love (featuring the iconic Booker T. Jones), the traditional folk-gospel charm of Trials, Troubles, Tribulations, the spectral, swampy wooziness of Pushin' Against A Stone (The Specials meets Phil Spector) and the dizzy, harmonised, Shangri-La sashay of Wanna Be On Your Mind, Valerie June's voice sounding, somehow, both as old and wise as mother nature and as playfully naïve as a schoolgirl skipping home. Staggeringly, she'd never worked with a producer before, the experience opening her up to infinite new atmospheric possibilities.    \"It was different,\" she says. \"  I'd been holding on to a particular image of what I wanted to be as a folk musician, a country musician, a southern roots musician. But when I heard the producers' ideas I thought, 'think bigger'. I looked at the careers of Joni Mitchell, Van Morrison, Joan Baez and they've put out all kinds of  music over the course of their careers so far. If I wanna put out a punk rock record next week, that's me. It's all coming from me.  Even if I have to continue juggling jobs, I am a career artist.\"  We don't hear so much, these days, from the old-school working class girls, the ones who can't afford the freedom to pursue their most daring dreams. Valerie June, the eldest girl of five kids (who'd often pretend to be the Jackson Five), first learned to sing in church, both a black church and later, a white church, when her family moved to the country. People sang in church, \"even when they couldn't sing\" and she'd mimic them all, \"from homeless people to wealthy people until my own voice just started coming out, a mixture of everyone\". She had her first jobs as a teen, helping her dad, both a promoter for local gospel singers and in the construction business (she'd hang posters in town and then head to the demolition sites). Soon she was constantly singing, writing songs, a freedom-seeking spirit who went travelling as a wandering songbird up and down the American west coast, then the east coast, a gypsy nightingale and holistic craftswoman who'd sing for tips in subway stations and sell her own handmade soap. By the time she moved back to Memphis in 2000, she had a plethora of songs written and finally taught herself guitar and banjo, as neighbourhood eyes were raised. \"Black people aren't supposed to play the banjo,\" she laughs, \"it's seen as country and bluegrass but it's an African instrument. I love it.\" Soon, she was testing out her tentative musical skills in Memphis bars and restaurants, \"which was more teaching myself in front of people,\" she notes. \"Memphis is a good town for being born as an artist. If you make a mistake people are like, 'we heard the good part'. They nurture you. You can take your time.\"   With a dream to make a studio album and no cash to fund it, \"it's hard to think about making a record when you've gotta pay rent\", she went to work full-time, now tunneling her way to freedom like Andy Dufresne in the Shawshank Redemption through daily, determined graft. She took on numerous service jobs: housekeeper, dog-walker, babysitter, vegetarian meal cooker, house sitter and personal assistant to the wealthy. And that was just the morning. \"In the  afternoon, I'd work in a herb shop, Maggie's Pharm. Then I would go play a gig, just me and my guitar.\"  She began to musically emerge, playing the Memphis Music & Heritage Festival, the International Folk Alliance Conference, the Cooper-Young Festival, the King Biscuit Blues Festival in Helena, AR, finally making enough money for three lo-fi recordings which she sold as CDs on tour: the raw, acoustic The Way Of The Weeping Willow (recorded in an 1800s farmhouse), the vocally mesmerising Mountain Of Rose Quartz and the haunting Valerie June And The Tennessee Express, a collaboration with Nashville bluegrass troupe The Old Crow Medicine Show (who've toured with Mumford & Sons). \"They're very successful at what they do, they loved my music and said 'hey, don't worry about money just come and record a few songs with us'.\"  In 2009 she was a featured artist on MTV's online series $5 Cover (following the lives of Memphis musicians attempting to make ends meet) and eventually raised $15,000 through crowd-funding website Kickstarter to record a debut album proper. Then, the universe intervened: through word-of-mouth, the manager for producer Kevin Augunas heard Valerie's music, sent it to Augunas, who loved it so much he flew into Memphis the following day. He asked who she'd like to write with and she suggested Dan Auerbach, whose solo work she'd loved (and who had recently moved to Nashville). Valerie, deliberately, had never signed to a record label before, although there had been no shortage of offers from both major and independent US-based labels, and was spotted playing in France by Sunday Best's label partner Sarah Bolshi. \"I never signed a label deal because it didn't feel right,\" she says.  \"I need to be with people who not only like this record but my stripped down stuff too. People will tell you, 'you can do whatever you wanna do with our label'. I didn't trust anybody telling me that until I met Sarah! And it's more me, a speciality label.\"   Pushin' Against A Stone is so-called because that's the story of her life - and the story of her forebears, too.  \"I feel I've spent my life pushing against a stone,\" she says. \"And the jobs I've had have been fitting for getting a true feel for how  the traditional artists I loved came home after a hard day to sit on the porch and play tunes until bedtime. That's one reason why they were older before anybody cared. When I first started playing instruments I thought, OK, I'm probably not gonna be the next Beyonce, this is not gonna happen for me until I'm very very old. Like...Seasick Steve! Who I love. And then maybe somebody will come see me play in my shack in Mississippi. That's kinda how it is for many artists who make roots music. So I'm just really happy it's happening now and I'm not up there with my cane.\"   Good things come to those who wait and Valerie June's time is now, the last year bringing rave reviews at SXSW, a collaboration with Grammy-nominated Fugees producer John Forte (on the hip-hop-blues song Give Me Water) as the word-of-mouth whisper has gradually grown into a collective global holler. This September, one of her friends sent her a Facebook message saying she'd seen a video of her glorious Bestival Performance.  \"And she said, 'you're gonna be a huge star',\" smiles the captivating Valerie June. \"A while ago I would've been like, I dunno about being a huge star. But now I'm like, you know what? If I can get a break? I will take it. I deserve it. I have paid my dues! I can't work on Maggie's Pharm no more. If you wanna bring me a coffee, yeah, I'll let you bring it. Because I have been the person bringing the coffee. I don't need any more experience in that. Now, being a queen? M'Kay! I think I can use a little spoiling. Bring it on.\"",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1982",
      "country": "Jackson,Tennessee,USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "en-gb.facebook.com/valeriejunemusic/",
      "formed_year": null,
      "gender": "Female",
      "genre": "Folk",
      "id": "135581",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/june-valerie-52a4c828246c2.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xxxqpt1489159797.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/twvvys1489159815.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/y06s401615626890.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/xwqsww1489159828.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/qtuxtp1489159778.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "b76c1bf7-f33b-460c-bfc3-f140d023fc94",
      "name": "Valerie June",
      "raw_data": {},
      "style": "Blues",
      "twitter": "1",
      "website": "valeriejune.com/the-order-of-time"
    }
  },
  "spotify_id": "4QZdOCb3UacKbQ1ybDFAKM",
  "spotify_url": "https://open.spotify.com/artist/4QZdOCb3UacKbQ1ybDFAKM",
  "updated_at": "2025-07-08T20:56:11.564604",
  "wikipedia_url": null
}