{
  "apple_music_id": "576693",
  "apple_music_url": "https://music.apple.com/gb/artist/the-drifters/576693",
  "biography": "The Drifters is a long-lived American doo wop Pop R&B band, originally formed by Clyde McPhatter (of Billy Ward & the Dominoes) in 1953 from New York City, NY, USA. There have been over 60 members since 1953. www.theofficialdrifters.com shows the current lineup and tour dates.\n\nThe original Drifters\n\nAhmet Ertegün of Atlantic Records approached Clyde McPhatter after he left The Dominoes and signed him. McPhatter first recruited several members of his former group, The Mount Lebanon Singers: William “Chick” Anderson (tenor), David Baldwin (baritone), and James “Wrinkle” Johnson (bass), plus David “Little Dave” Baughan (tenor). This aggregation lasted for only a single session (from which \"Lucille\" was the only song released), after which Atlantic asked McPhatter to form a different group. He finally settled on Gerhart Thrasherand Andrew Thrasher on baritone and second tenor, respectively, Bill Pinkney on high tenor, Willie Ferbee as bass, and Walter Adams on guitar. This is the group on the second session, which produced the group's first major hit: \"Money Honey\".\n\nAfter the session, Ferbee was involved in an accident and left the group and Adams died (to be replaced by Jimmy Oliver). Ferbee was not replaced and the voice parts were shifted around: Gerhart Thrasher became first tenor, Andrew Thrasher was now the baritone, and Bill Pinkney shifted down to bass. The group released several more hits (\"Such A Night,\" [1][2] \"Honey Love,\" \"Bip Bam,\" \"White Christmas,\" and \"What'cha Gonna Do\") before McPhatter was drafted in May 1954 (after which he pursued a solo career). McPhatter had demanded a large share of the group's profits, which he had been denied in The Dominoes, but, upon his departure, did not ensure that this would continue for his successor. He sold his share of the group to [bandmember from=1953 to=1956[artist]George Treadwell, manager, former jazz trumpeter, and husband of legendary singer Sarah Vaughan. As a result, the Drifters cycled through copious members, none of whom made much money. McPhatter later expressed regret at this action, recognizing that it doomed his fellow musicians to unprofitability.\n\nMcPhatter was first replaced by David Baughn, who was on the group's first session. While his voice was similar to McPhatter's, his erratic behavior made him unsuitable in the eyes of Atlantic Records executives. Baughn soon left the group, and was replaced by Cleveland native Johnny Moore (of The Hornets). This lineup had a major R&B hit in 1955 with \"Adorable,\" followed by several others (\"Ruby Baby,\" \"I Got To Get Myself A Woman,\" and \"Fools Fall In Love\"). Johnny Moore was drafted in November 1957 and replaced by Bobby Hendricks (who had briefly been with The Swallows), but to no success; the group was not able to break into mainstream markets.\n\nIn the mid 1950s, the Drifters began working with Jerry Leiber and Mike Stoller, legendary songwriters, who eventually became the group's producers as well. This is widely considered the group's golden age, inaugurated by the 1956 hit \"(April, 1993)I Gotta Get Myself a Woman.\" Low salaries contributed to burnout among the members, particularly Bill Pinkney, who was fired after asking Treadwell for more money. Andrew Thrasher left as well, in protest. Pinkney formed another group, called The Flyers, with lead singer Bobby Hendricks (before he joined the Drifters to replace army-bound Johnny Moore).\n\nBill Pinkney was replaced by Tommy Evans (who had replaced Jimmy Ricks in The Ravens). Charlie Hughes, a baritone, replaced Andrew Thrasher. By early 1958, the lineup was: Bobby Hendricks (lead tenor), Gerhart Thrasher (first tenor), Jimmy Milner (baritone), Tommy Evans (bass), and Jimmy Oliver (guitar). By May 1958, both Hendricks and Oliver had quit, returning only for a week's appearance at the Apollo Theater. During that week, one of the members got into a fight with the owner of the Apollo. That was the last straw for manager George Treadwell, who fired the entire group.\n\nSince Treadwell owned the rights to the name \"Drifters,\" and since he still had a year's worth of bookings for the Apollo, he recruited another group, The Five Crowns, featuring lead singer Ben E. King. The group changed its name to the \"Drifters\" and went out on the road to tour for almost a year, although this new group had no connection to the prior Drifters.\n\n\nBill Pinkney's \"Original Drifters\"\n\nMeanwhile, Bill Pinkney and other \"fired\" Drifters once again joined with the Thrashers and David Baughan to begin touring as \"The Original Drifters\" (although their first recordings, for End in 1959, were as the \"Harmony Grits\"). Baughan left after a short time, leaving the group a trio. Bobby Lee Hollis joined in 1964 and took over the lead spot. Later that year, Andrew Thrasher was out and Jimmy Lewis was in. Bobby Hendricks returned, making the group a quintet for a short time, before Lewis left. Andrew Thrasher returned, replacing Hollis. Hollis and Baughan bounced in and out through the 1960s. By 1968, the group was Pinkney, Gerhart Thrasher, Hollis, and Hendricks. At this point, the group split.\n\nPinkney met with an existing group, The Tears, and recruited them as the new Original Drifters. The Tears were Benny Anderson, George Wallace, Albert Fortson, and Mark Williams. Shortly after recruiting them, they broke away from Pinkney and continued touring as the Original Drifters for over a decade (Pinkney filed suit and successfully stopped them at that time).\n\nPinkney then brought in new members Bruce Caesar, Clarence \"Tex\" Walker, and Bruce Richardson. The lineup changed rapidly. In 1979 the group was Pinkney, Andrew Lawyer, Chuck Cockerham, Harriel Jackson, and Tony Cook. Their 1995 album Peace in the Valley, on Blackberry Records, credited vocals to Pinkney, Cockerham, Richard Knight Dunbar, Vernon Young, and Greg Johnson. [3][4] They appeared on the PBS special, Doo Wop 51 with Pinkney, Dunbar, Johnson, and Bobby Hendricks. The current lineup is Pinkney, Cockerham, Dunbar, Young, and Clyde McPhatter's son, Billy McPhatter. Greg Johnson is now in Bobby Hendricks' Drifters.\n\n\nThe second Drifters\n\nTreadwell had approached Lover Patterson, the manager of The Five Crowns. All but one member of The Five Crowns went along with the name change to become the Drifters. The new line-up consisted of: Benjamin Earl Nelson (known professionally as Ben E. King; lead tenor), Charlie Thomas (tenor), Dock Green (baritone), and Elsbeary Hobbs (bass). James \"Poppa\" Clark was the fifth member; he was not included in the new group.\n\nThis new lineup released several singles that became chart hits: \"There Goes My Baby,\" the first commercial rock-and-roll recording to include a string orchestra, \"Dance With Me,\" \"This Magic Moment,\" \"Save The Last Dance For Me,\" and \"I Count The Tears.\" However, personnel changes started almost immediately. Lover Patterson (who had managed the Five Crowns and was now the Drifters' road manager) got into a fight with George Treadwell. Since Patterson had Ben E. King under personal contract, he refused to let King tour with the group. Thus, King continued to record with the group for about a year before beginning a successful solo career. New member Johnny Lee Williams did the touring (although he can be heard leading \"True Love, True Love\"). Williams was subsequently replaced by Rudy Lewis (of The Clara Ward Singers), who led the Drifters on hits such as \"Some Kind Of Wonderful,\" \"Please Stay,\" and \"Up on the Roof.\" While recording \"Please Stay,\" songwriter Burt Bacharach met Dionne Warwick, a backup singer, thus beginning a legendary partnership.\n\nBass Elsbeary Hobbs was drafted and eventually replaced by the returning Tommy Evans (from the 1958 group). Dock Green left in 1962 and was replaced by Eugene Pearson (of The Rivileers and Cleftones). Tommy Evans left again in 1963 and was replaced by Johnny Terry. After his military service and a failed solo career, Johnny Moore returned in 1964, making the group a quintet of Moore, Charlie Thomas, Rudy Lewis, Gene Pearson, and Johnny Terry.\n\nLater that year, the group was scheduled to record \"Under the Boardwalk\" on May 21. However, Rudy Lewis died the night before the session, and Johnny Moore took over as the sole lead (he and Lewis had been alternating). Terry was replaced in 1966 by Dan Dandridge for a couple of months, then by William Brent, who had been with Johnny Moore in The Hornets in 1954. Gene Pearson was replaced by Rick Sheppard that same year. By late 1966, baritone/bass Bill Fredricks replaced William Brent. Charlie Thomas, the group's last \"original member\" (from the day The Five Crowns had become the Drifters), left in mid-1967 and was replaced by Charles Baskerville, a former member of The Limelites. Baskerville stayed only a short time, leaving before a session (which was done as a trio). Baritone Milton Turner was added by the end of 1967. In late 1969, Milton Turner left and was replaced by another singer named Charlie Thomas (who took the nickname Don Thomas to avoid confusion with the former member). This lineup lasted only a few months. By March 1970, the Drifters had broken up. Johnny Moore and Bill Fredericks reunited in January 1971 (along with two unknown singers) to do an independently-produced session that was subsequently sold to Atlantic. \"A Rose By Any Other Name\" and \"Be My Lady\" became the Drifters' last Atlantic release.\n\n\nPost-Atlantic career\n\nAfter this, the Drifters moved to [place[England[/place] and underwent the usual bewildering personnel changes. Throughout the 1970s, the only charted records for the group were on the British charts - notably \"Kissing In The Back Row Of The Movies\", \"There Goes My First Love\" and \"You're More Than A Number In My Little Red Book\". Along with Moore and Fredricks, Butch Leake and former Ink Spots mamber Grant Kitchings[/bandmember were members initially. Fredricks was replaced by [bandmember]Clyde Brown the next year, and Kitchings by Billy Lewis the year after. Leake was replaced by Joe Blunt in 1976, making the lineup Johnny Moore, Clyde Brown, Joe Blunt, and Billy Lewis. This year, Faye Treadwell renamed the group's management company Treadwell Drifters Inc.\n\nMoore left in 1978 and was replaced by Ray Lewis. Blunt and Billy Lewis left in 1979 and were replaced by the returning Johnny Moore and former Temptations lead Louis Price. Moore left again in late 1982, along with Clyde Brown. They were replaced by two returning members, Ben Nelson (a.k.a. Ben E. King) and Bill Fredricks.\n\nAround this time, members left and rejoined frequently. Fredricks, Lewis, and Price left in 1983 and were replaced by the returning Johnny Moore, Joe Blunt, and Clyde Brown. In 1986, the group changed all of its members and the new lineup consisted of new member Jonah Ellis and former members Ray Lewis, Billy Lewis, and Louis Price. The next year, more former members came in as replacements, making the group Moore, Billy and Ray Lewis, and Gene Jenkins (replaced shortly after by George Chandler, then John Thurston). Ray Lewis was out in 1988, and was replaced by Joe Cofie. In 1989, Billy Lewis left, and replaced by the returning George Chandler, then Tony Jackson, Keith John, and finally Peter Lamarr in 1990.\n\nThurston was out at the end of the year and was replaced by Roy Hemmings. Patrick Alan was in for Lamaar briefly. Lamaar left in 1991 and was replaced by Rohan Delano Turney. This lineup lasted until 1996, when Cofie was out and Jason Leigh was in. Leigh was replaced after two years by the returning Peter Lamarr.\n\nTragedy struck in 1999 when the group's longest serving member, Johnny Moore, died. Patrick Alan returned to the group, keeping it a quartet. Lamarr left again in 2003, and was replaced by Victor Bynoe. Hemmings left in 2004 and was replaced by the again-returning Lamarr. The group's current lineup is Peter Lamarr, Rohan Delano Turney, Patrick Alan, and Victor Bynoe. [5] This line up is fully endorsed by Johnny Moore's wife and in Allan, Lamarr and Turner actually contains three of the longest serving Drifters members.\n\nIn 2001, Faye Treadwell left the United Kingdom, allegedly due to bankruptcy. Two members of her company, Mark Lundquist and Phil Lunderman, started a new management company, Drifters UK Limited, to run the group. Their new duties included stopping a patent by an imposter Drifters group. [6][7]\n\nAs of December 2006, writs have been served in the London High Court by Tina Treadwell, daughter of George and Faye, against Lundquist and Lunderman, alleging they are not the rightful controllers of The Drifters. Tina's group features Roy Hemmings and Jason Leigh. It should be noted that Hemmings remained with Lundquist and Lunderman initially, leaving three years after the formation of Drifters UK Limited.[8][9] It will be interesting to see how things transpire should Treadwell win her case, since the current Drifters lineup touring the UK has built up a fan base selling out one tour after another with Johnny Moore and continuing after his death. The Vocal Group Hall of Fame has inducted both 'The Original Drifters' (1998) and 'Ben E. King and The Drifters'(2000).\n\nIn 2004, Rolling Stone Magazine ranked The Drifters #81 on their list of the 100 Greatest Artists of All Time.[1]\n\nOn July 4, 2007, Bill Pinkney died of a heart attack in his room at the Hilton Hotel, Daytona Beach, Florida, where he was in town to perform for the 4th of July Red, White and Boom Event.[2]\n\nIn 2009, the lineup consists of Damion Charles, Michael Williams, Steve V. King and Maurice Cannon. For tour dates  and more info go to www.theofficialdrifters.com  \n\n\n\nThere was also a Japanese vocal group called the Drifters although the romanisation of their name (ザドリフタース)　yields many variations: Doriftas, Dorifutas, Dorihutasu, etc. <a href=\"https://www.last.fm/music/The+Drifters\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T16:06:31.573143",
  "discogs_id": "269102",
  "discogs_url": "https://www.discogs.com/artist/269102",
  "followers": 600199,
  "formed_date": null,
  "genres": [
    "R&B/Soul",
    "doo-wop",
    "motown",
    "soul",
    "oldies",
    "60s",
    "rhythm and blues",
    "doo wop"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/e9/47/dd/e947ddbb-c3a2-7bf9-628e-2980d7676059/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 1000,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/9cebb08480116550d85b6268d9adb1c2aee718f7",
      "width": 1000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/3361d8c88dc781f3a76657778454051db42e6d9e",
      "width": 640
    },
    {
      "height": 200,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ed6c740fd6ad7faa31964b7a7762009b4b7826bd",
      "width": 200
    },
    {
      "height": 64,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/686750d79b66f2658a84cda6d2e25de97aa85faa",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "bd26fb86-61e7-4ac4-a5e0-e15108ab95f4",
  "lastfm_url": "https://www.last.fm/music/The+Drifters",
  "local_images": {
    "hi-res": "public/artist/the-drifters/the-drifters-hi-res.jpg",
    "medium": "public/artist/the-drifters/the-drifters-medium.jpg",
    "small": "public/artist/the-drifters/the-drifters-small.jpg"
  },
  "name": "The Drifters",
  "popularity": 61,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/e9/47/dd/e947ddbb-c3a2-7bf9-628e-2980d7676059/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "R&B/Soul"
      ],
      "id": "576693",
      "name": "The Drifters",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/the-drifters/576693"
    },
    "discogs": {
      "id": 269102,
      "original_name": "The Drifters",
      "role": ""
    },
    "lastfm": {
      "bio_content": "The Drifters is a long-lived American doo wop Pop R&B band, originally formed by Clyde McPhatter (of Billy Ward & the Dominoes) in 1953 from New York City, NY, USA. There have been over 60 members since 1953. www.theofficialdrifters.com shows the current lineup and tour dates.\n\nThe original Drifters\n\nAhmet Ertegün of Atlantic Records approached Clyde McPhatter after he left The Dominoes and signed him. McPhatter first recruited several members of his former group, The Mount Lebanon Singers: William “Chick” Anderson (tenor), David Baldwin (baritone), and James “Wrinkle” Johnson (bass), plus David “Little Dave” Baughan (tenor). This aggregation lasted for only a single session (from which \"Lucille\" was the only song released), after which Atlantic asked McPhatter to form a different group. He finally settled on Gerhart Thrasherand Andrew Thrasher on baritone and second tenor, respectively, Bill Pinkney on high tenor, Willie Ferbee as bass, and Walter Adams on guitar. This is the group on the second session, which produced the group's first major hit: \"Money Honey\".\n\nAfter the session, Ferbee was involved in an accident and left the group and Adams died (to be replaced by Jimmy Oliver). Ferbee was not replaced and the voice parts were shifted around: Gerhart Thrasher became first tenor, Andrew Thrasher was now the baritone, and Bill Pinkney shifted down to bass. The group released several more hits (\"Such A Night,\" [1][2] \"Honey Love,\" \"Bip Bam,\" \"White Christmas,\" and \"What'cha Gonna Do\") before McPhatter was drafted in May 1954 (after which he pursued a solo career). McPhatter had demanded a large share of the group's profits, which he had been denied in The Dominoes, but, upon his departure, did not ensure that this would continue for his successor. He sold his share of the group to [bandmember from=1953 to=1956[artist]George Treadwell, manager, former jazz trumpeter, and husband of legendary singer Sarah Vaughan. As a result, the Drifters cycled through copious members, none of whom made much money. McPhatter later expressed regret at this action, recognizing that it doomed his fellow musicians to unprofitability.\n\nMcPhatter was first replaced by David Baughn, who was on the group's first session. While his voice was similar to McPhatter's, his erratic behavior made him unsuitable in the eyes of Atlantic Records executives. Baughn soon left the group, and was replaced by Cleveland native Johnny Moore (of The Hornets). This lineup had a major R&B hit in 1955 with \"Adorable,\" followed by several others (\"Ruby Baby,\" \"I Got To Get Myself A Woman,\" and \"Fools Fall In Love\"). Johnny Moore was drafted in November 1957 and replaced by Bobby Hendricks (who had briefly been with The Swallows), but to no success; the group was not able to break into mainstream markets.\n\nIn the mid 1950s, the Drifters began working with Jerry Leiber and Mike Stoller, legendary songwriters, who eventually became the group's producers as well. This is widely considered the group's golden age, inaugurated by the 1956 hit \"(April, 1993)I Gotta Get Myself a Woman.\" Low salaries contributed to burnout among the members, particularly Bill Pinkney, who was fired after asking Treadwell for more money. Andrew Thrasher left as well, in protest. Pinkney formed another group, called The Flyers, with lead singer Bobby Hendricks (before he joined the Drifters to replace army-bound Johnny Moore).\n\nBill Pinkney was replaced by Tommy Evans (who had replaced Jimmy Ricks in The Ravens). Charlie Hughes, a baritone, replaced Andrew Thrasher. By early 1958, the lineup was: Bobby Hendricks (lead tenor), Gerhart Thrasher (first tenor), Jimmy Milner (baritone), Tommy Evans (bass), and Jimmy Oliver (guitar). By May 1958, both Hendricks and Oliver had quit, returning only for a week's appearance at the Apollo Theater. During that week, one of the members got into a fight with the owner of the Apollo. That was the last straw for manager George Treadwell, who fired the entire group.\n\nSince Treadwell owned the rights to the name \"Drifters,\" and since he still had a year's worth of bookings for the Apollo, he recruited another group, The Five Crowns, featuring lead singer Ben E. King. The group changed its name to the \"Drifters\" and went out on the road to tour for almost a year, although this new group had no connection to the prior Drifters.\n\n\nBill Pinkney's \"Original Drifters\"\n\nMeanwhile, Bill Pinkney and other \"fired\" Drifters once again joined with the Thrashers and David Baughan to begin touring as \"The Original Drifters\" (although their first recordings, for End in 1959, were as the \"Harmony Grits\"). Baughan left after a short time, leaving the group a trio. Bobby Lee Hollis joined in 1964 and took over the lead spot. Later that year, Andrew Thrasher was out and Jimmy Lewis was in. Bobby Hendricks returned, making the group a quintet for a short time, before Lewis left. Andrew Thrasher returned, replacing Hollis. Hollis and Baughan bounced in and out through the 1960s. By 1968, the group was Pinkney, Gerhart Thrasher, Hollis, and Hendricks. At this point, the group split.\n\nPinkney met with an existing group, The Tears, and recruited them as the new Original Drifters. The Tears were Benny Anderson, George Wallace, Albert Fortson, and Mark Williams. Shortly after recruiting them, they broke away from Pinkney and continued touring as the Original Drifters for over a decade (Pinkney filed suit and successfully stopped them at that time).\n\nPinkney then brought in new members Bruce Caesar, Clarence \"Tex\" Walker, and Bruce Richardson. The lineup changed rapidly. In 1979 the group was Pinkney, Andrew Lawyer, Chuck Cockerham, Harriel Jackson, and Tony Cook. Their 1995 album Peace in the Valley, on Blackberry Records, credited vocals to Pinkney, Cockerham, Richard Knight Dunbar, Vernon Young, and Greg Johnson. [3][4] They appeared on the PBS special, Doo Wop 51 with Pinkney, Dunbar, Johnson, and Bobby Hendricks. The current lineup is Pinkney, Cockerham, Dunbar, Young, and Clyde McPhatter's son, Billy McPhatter. Greg Johnson is now in Bobby Hendricks' Drifters.\n\n\nThe second Drifters\n\nTreadwell had approached Lover Patterson, the manager of The Five Crowns. All but one member of The Five Crowns went along with the name change to become the Drifters. The new line-up consisted of: Benjamin Earl Nelson (known professionally as Ben E. King; lead tenor), Charlie Thomas (tenor), Dock Green (baritone), and Elsbeary Hobbs (bass). James \"Poppa\" Clark was the fifth member; he was not included in the new group.\n\nThis new lineup released several singles that became chart hits: \"There Goes My Baby,\" the first commercial rock-and-roll recording to include a string orchestra, \"Dance With Me,\" \"This Magic Moment,\" \"Save The Last Dance For Me,\" and \"I Count The Tears.\" However, personnel changes started almost immediately. Lover Patterson (who had managed the Five Crowns and was now the Drifters' road manager) got into a fight with George Treadwell. Since Patterson had Ben E. King under personal contract, he refused to let King tour with the group. Thus, King continued to record with the group for about a year before beginning a successful solo career. New member Johnny Lee Williams did the touring (although he can be heard leading \"True Love, True Love\"). Williams was subsequently replaced by Rudy Lewis (of The Clara Ward Singers), who led the Drifters on hits such as \"Some Kind Of Wonderful,\" \"Please Stay,\" and \"Up on the Roof.\" While recording \"Please Stay,\" songwriter Burt Bacharach met Dionne Warwick, a backup singer, thus beginning a legendary partnership.\n\nBass Elsbeary Hobbs was drafted and eventually replaced by the returning Tommy Evans (from the 1958 group). Dock Green left in 1962 and was replaced by Eugene Pearson (of The Rivileers and Cleftones). Tommy Evans left again in 1963 and was replaced by Johnny Terry. After his military service and a failed solo career, Johnny Moore returned in 1964, making the group a quintet of Moore, Charlie Thomas, Rudy Lewis, Gene Pearson, and Johnny Terry.\n\nLater that year, the group was scheduled to record \"Under the Boardwalk\" on May 21. However, Rudy Lewis died the night before the session, and Johnny Moore took over as the sole lead (he and Lewis had been alternating). Terry was replaced in 1966 by Dan Dandridge for a couple of months, then by William Brent, who had been with Johnny Moore in The Hornets in 1954. Gene Pearson was replaced by Rick Sheppard that same year. By late 1966, baritone/bass Bill Fredricks replaced William Brent. Charlie Thomas, the group's last \"original member\" (from the day The Five Crowns had become the Drifters), left in mid-1967 and was replaced by Charles Baskerville, a former member of The Limelites. Baskerville stayed only a short time, leaving before a session (which was done as a trio). Baritone Milton Turner was added by the end of 1967. In late 1969, Milton Turner left and was replaced by another singer named Charlie Thomas (who took the nickname Don Thomas to avoid confusion with the former member). This lineup lasted only a few months. By March 1970, the Drifters had broken up. Johnny Moore and Bill Fredericks reunited in January 1971 (along with two unknown singers) to do an independently-produced session that was subsequently sold to Atlantic. \"A Rose By Any Other Name\" and \"Be My Lady\" became the Drifters' last Atlantic release.\n\n\nPost-Atlantic career\n\nAfter this, the Drifters moved to [place[England[/place] and underwent the usual bewildering personnel changes. Throughout the 1970s, the only charted records for the group were on the British charts - notably \"Kissing In The Back Row Of The Movies\", \"There Goes My First Love\" and \"You're More Than A Number In My Little Red Book\". Along with Moore and Fredricks, Butch Leake and former Ink Spots mamber Grant Kitchings[/bandmember were members initially. Fredricks was replaced by [bandmember]Clyde Brown the next year, and Kitchings by Billy Lewis the year after. Leake was replaced by Joe Blunt in 1976, making the lineup Johnny Moore, Clyde Brown, Joe Blunt, and Billy Lewis. This year, Faye Treadwell renamed the group's management company Treadwell Drifters Inc.\n\nMoore left in 1978 and was replaced by Ray Lewis. Blunt and Billy Lewis left in 1979 and were replaced by the returning Johnny Moore and former Temptations lead Louis Price. Moore left again in late 1982, along with Clyde Brown. They were replaced by two returning members, Ben Nelson (a.k.a. Ben E. King) and Bill Fredricks.\n\nAround this time, members left and rejoined frequently. Fredricks, Lewis, and Price left in 1983 and were replaced by the returning Johnny Moore, Joe Blunt, and Clyde Brown. In 1986, the group changed all of its members and the new lineup consisted of new member Jonah Ellis and former members Ray Lewis, Billy Lewis, and Louis Price. The next year, more former members came in as replacements, making the group Moore, Billy and Ray Lewis, and Gene Jenkins (replaced shortly after by George Chandler, then John Thurston). Ray Lewis was out in 1988, and was replaced by Joe Cofie. In 1989, Billy Lewis left, and replaced by the returning George Chandler, then Tony Jackson, Keith John, and finally Peter Lamarr in 1990.\n\nThurston was out at the end of the year and was replaced by Roy Hemmings. Patrick Alan was in for Lamaar briefly. Lamaar left in 1991 and was replaced by Rohan Delano Turney. This lineup lasted until 1996, when Cofie was out and Jason Leigh was in. Leigh was replaced after two years by the returning Peter Lamarr.\n\nTragedy struck in 1999 when the group's longest serving member, Johnny Moore, died. Patrick Alan returned to the group, keeping it a quartet. Lamarr left again in 2003, and was replaced by Victor Bynoe. Hemmings left in 2004 and was replaced by the again-returning Lamarr. The group's current lineup is Peter Lamarr, Rohan Delano Turney, Patrick Alan, and Victor Bynoe. [5] This line up is fully endorsed by Johnny Moore's wife and in Allan, Lamarr and Turner actually contains three of the longest serving Drifters members.\n\nIn 2001, Faye Treadwell left the United Kingdom, allegedly due to bankruptcy. Two members of her company, Mark Lundquist and Phil Lunderman, started a new management company, Drifters UK Limited, to run the group. Their new duties included stopping a patent by an imposter Drifters group. [6][7]\n\nAs of December 2006, writs have been served in the London High Court by Tina Treadwell, daughter of George and Faye, against Lundquist and Lunderman, alleging they are not the rightful controllers of The Drifters. Tina's group features Roy Hemmings and Jason Leigh. It should be noted that Hemmings remained with Lundquist and Lunderman initially, leaving three years after the formation of Drifters UK Limited.[8][9] It will be interesting to see how things transpire should Treadwell win her case, since the current Drifters lineup touring the UK has built up a fan base selling out one tour after another with Johnny Moore and continuing after his death. The Vocal Group Hall of Fame has inducted both 'The Original Drifters' (1998) and 'Ben E. King and The Drifters'(2000).\n\nIn 2004, Rolling Stone Magazine ranked The Drifters #81 on their list of the 100 Greatest Artists of All Time.[1]\n\nOn July 4, 2007, Bill Pinkney died of a heart attack in his room at the Hilton Hotel, Daytona Beach, Florida, where he was in town to perform for the 4th of July Red, White and Boom Event.[2]\n\nIn 2009, the lineup consists of Damion Charles, Michael Williams, Steve V. King and Maurice Cannon. For tour dates  and more info go to www.theofficialdrifters.com  \n\n\n\nThere was also a Japanese vocal group called the Drifters although the romanisation of their name (ザドリフタース)　yields many variations: Doriftas, Dorifutas, Dorihutasu, etc. <a href=\"https://www.last.fm/music/The+Drifters\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "The Drifters is a long-lived American doo wop Pop R&B band, originally formed by Clyde McPhatter (of Billy Ward & the Dominoes) in 1953 from New York City, NY, USA. There have been over 60 members since 1953. www.theofficialdrifters.com shows the current lineup and tour dates.\n\nThe original Drifters\n\nAhmet Ertegün of Atlantic Records approached Clyde McPhatter after he left The Dominoes and signed him. McPhatter first recruited several members of his former group <a href=\"https://www.last.fm/music/The+Drifters\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 933805,
      "mbid": "bd26fb86-61e7-4ac4-a5e0-e15108ab95f4",
      "name": "The Drifters",
      "playcount": 6507182,
      "similar_artists": [
        {
          "name": "The Shirelles",
          "url": "https://www.last.fm/music/The+Shirelles"
        },
        {
          "name": "Clyde McPhatter",
          "url": "https://www.last.fm/music/Clyde+McPhatter"
        },
        {
          "name": "Ben E. King",
          "url": "https://www.last.fm/music/Ben+E.+King"
        },
        {
          "name": "The Everly Brothers",
          "url": "https://www.last.fm/music/The+Everly+Brothers"
        },
        {
          "name": "The Coasters",
          "url": "https://www.last.fm/music/The+Coasters"
        }
      ],
      "tags": [
        "soul",
        "oldies",
        "60s",
        "rhythm and blues",
        "doo wop"
      ],
      "url": "https://www.last.fm/music/The+Drifters"
    },
    "spotify": {
      "followers": 600199,
      "genres": [
        "doo-wop",
        "motown"
      ],
      "id": "1FqqOl9itIUpXr4jZPIVoT",
      "images": [
        {
          "height": 1000,
          "url": "https://i.scdn.co/image/9cebb08480116550d85b6268d9adb1c2aee718f7",
          "width": 1000
        },
        {
          "height": 640,
          "url": "https://i.scdn.co/image/3361d8c88dc781f3a76657778454051db42e6d9e",
          "width": 640
        },
        {
          "height": 200,
          "url": "https://i.scdn.co/image/ed6c740fd6ad7faa31964b7a7762009b4b7826bd",
          "width": 200
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/686750d79b66f2658a84cda6d2e25de97aa85faa",
          "width": 64
        }
      ],
      "name": "The Drifters",
      "popularity": 61,
      "url": "https://open.spotify.com/artist/1FqqOl9itIUpXr4jZPIVoT"
    }
  },
  "spotify_id": "1FqqOl9itIUpXr4jZPIVoT",
  "spotify_url": "https://open.spotify.com/artist/1FqqOl9itIUpXr4jZPIVoT",
  "updated_at": "2025-07-05T16:06:33.658533",
  "wikipedia_url": null
}