{
  "apple_music_id": "333601",
  "apple_music_url": "https://music.apple.com/gb/artist/allen-toussaint/333601",
  "biography": "Allen Toussaint (January 14, 1938 – November 10, 2015) was an American musician, songwriter/composer, record producer, and influential figure in New Orleans R&B.\nMany of Toussaint's songs became familiar through versions by other musicians, including \"Working in the Coal Mine\", \"Ride Your Pony\", \"Fortune Teller\", \"Play Something Sweet (Brickyard Blues)\", \"Southern Nights\", \"Everything I Do Gonna Be Funky\", \"I'll Take a Melody\", \"Get Out of My Life, Woman\" and \"Mother-in-Law\".\n\nToussaint (/ˈtuːsɑːnt/) grew up in a shotgun house in the New Orleans neighborhood of Gert Town, where his mother, Naomi Neville (whose name he later adopted pseudonymously for some of his works), welcomed and fed all manner of musicians as they practiced and recorded with her son. After a lucky break at age 17 in which he stood in for Huey Smith at a performance with Earl King's band in Prichard, Alabama, Toussaint was introduced to a group of local musicians who performed regularly at a night club on LaSalle street Uptown; they were known as the Dew Drop Set.  He initially recorded for RCA Victor as Al Tousan and recorded an album of instrumentals, including the song \"Java\", which became a #1 hit for Al Hirt (also on RCA) in 1964.\n\nIn the 1960s and 1970s, Toussaint  was a prolific writer, producer and arranger, creating numerous hits for a variety of artists including Lee Dorsey, Robert Palmer, The Showmen, The Meters, Betty Wright, Solomon Burke and Willie West. He produced material for Dr John, Labelle, Chocolate Milk and Aaron Neville amongst many more. \n\nAn accomplished pianist and lyricist, Toussaint wrote many hit songs including early instrumental efforts Java (a hit for Al Hirt) and Whipped Cream  which went platinum when done by Herb Alpert. Other Toussaint compositions that continue to be covered by artists to this day, include \"Working in a Coalmine\", \"PLAY SOMETHING SWEET (BRICKYARD BLUES)\", \"Get Out My Life Woman\" and \"Yes We Can Can\". Some of his songs from the 1950s and 1960s were penned under his mother's maiden name, the pseudonym Naomi Neville. These include  Fortune Teller recorded by the Rolling Stones, and \"Ruler of My Heart\", recorded by Irma Thomas and reinterpreted as \"Pain in My Heart\" by Otis Redding. He arranged horn parts for The Band, and wrote what became one of Glen Campbell's biggest hits Southern Nights as well as A Certain Girl , which charted when recorded by acts as diverse as Warren Zevon, Benny Spellman and The Yardbirds.\n\nAside from his success behind the scenes, Toussaint also launched his own solo career, which peaked in the '70s with the albums \"From a Whisper to a Scream\" and \"Southern Nights\". For much of his career he partnered with Marshall Sehorn. They co-owned and operated the Sea-Saint recording studio in the Gentilly neighborhood of New Orleans. They also partnered in a record label, that went under various names. Along with many of his contemporaries, Allen Toussaint found that interest in his compositions was rekindled when his work began to be heavily sampled by hip hop artists in the 1980s and 1990s. \n\nDespite rumours at the time, Toussaint did not take refuge at the Louisiana Superdome in the wake of the Hurricane Katrina disaster. Instead, Toussaint weathered out the storm in the Astor Crowne Plaza Hotel. After the hurricane Toussaint left New Orleans for New York City, where he was living while his house was rebuilt. His first television appearance after the hurricane was on the September 7, 2005 episode of The Late Show with David Letterman, sitting in with Paul Shaffer and his CBS Orchestra. Toussaint performed each month at Joe's Pub in New York City.\n\n\"The River In Reverse\", Toussaint's collaborative album with Elvis Costello, was released on 29 May 2006  and was recorded in Toussaint's native New Orleans and Hollywood with help from engineer and producer Joe Hardy. Costello and Toussaint assembled a big band and embarked on a tour of theaters and festivals and released a DVD of their collaboration. \n\nToussaint died in the early hours of November 10, 2015 while on tour in Madrid, Spain. Following a concert at the Teatro Lara, he suffered two cardiac arrests at his hotel and was pronounced dead on his arrival at hospital. He was 77. He is survived by his two children, including son Clarence (better known as Reginald) and daughter Alison, and by several grandchildren. His children had managed his career in recent years.\n\n\nA significant early influence on Toussaint was the second-line piano style of Professor Longhair. In his early years he worked mainly for Joe Banashak's Minit Records and Instant Records, but after Minit was sold to its distributor, he teamed up with Marshall Sehorn, starting their own record label variously known as Tou-Sea, Sansu, Deesu or Kansu. In 1973 Toussaint and Sehorn created the Sea-Saint recording studio in Gentilly.\n\nIn the early 1960s he wrote and produced a string of hits for New Orleans R&B artists such as Ernie K-Doe, Irma Thomas, Art and Aaron Neville, The Showmen, and Lee Dorsey.\n\n\"Ruler of My Heart\", recorded by Irma Thomas. This song was subsequently recorded by Otis Redding under the title \"Pain in My Heart\", and by The Rolling Stones on their second album.\nIn 1964, \"A Certain Girl\" (originally by Ernie K-Doe) was the B-side of the first single release by The Yardbirds; the song was released again in 1980 by Warren Zevon.\nA two-sided 1962 hit by Benny Spellman comprised \"Lipstick Traces (On A Cigarette),\" later covered by The O'Jays, Ringo Starr, and Alex Chilton.\nThe simple but effective \"Fortune Teller\", which was covered by many 1960s rock groups including The Rolling Stones, The Nashville Teens, The Who, The Hollies, The Throb, and ex-Searchers founder member Tony Jackson.\nToussaint credited about twenty songs to his parents, Clarence and Naomi. These include Benny Spellman's 1961 original version of \"Fortune Teller\" and The Artwoods' 1966 version of \"Work, Work, Work\". Alison Krauss and Robert Plant 2007 covered \"Fortune Teller\" on their 2007 collaboration album Raising Sand. A fairly thorough song list appears in Toussaint's discography section Pseudonyms, below.\n\nToussaint's piano and arrangements show up on hundreds of records during the early 1960s on records by Lee Dorsey, Chris Kenner, and scores of other artists. Starting in the 1970s, he switched gears to a funkier sound, writing and producing for The Meters, Dr John, and the Wild Tchoupitoulas Mardi Gras Indians tribe. He also began to work with non-New Orleans artists such as B.J. Thomas, Robert Palmer, Willy DeVille, Sandy Denny, Elkie Brooks, Solomon Burke, Scottish soul singer Frankie Miller (High Life) and southern rocker Mylon LeFevre.[citation needed] He arranged horn music for The Band's 1971 album Cahoots, plus Rock of Ages and The Last Waltz film, in conjunction with arranging horn parts for their concert repertoire. Boz Scaggs recorded Toussaint's \"What Do You Want the Girl to Do?\" on his 1976 album Silk Degrees, which reached #2 on the U.S. pop albums chart. In 1976 he also collaborated with John Mayall on the album Notice to Appear.\n\nToussaint also launched his own solo career, which peaked in the 1970s with the albums From a Whisper to a Scream and Southern Nights. It was during this time that he teamed with Labelle, and produced their highly acclaimed 1975 album Nightbirds, which spawned the Number One hit, \"Lady Marmalade\". The same year, Toussaint collaborated with Paul McCartney and Wings for their hit album Venus and Mars and played on the song Rock Show. Two years later, Glen Campbell covered Toussaint's \"Southern Nights\" and carried the song to Number One on the Pop, Country and Adult-Contemporary Charts. Along with many of his contemporaries, Toussaint found that interest in his compositions was rekindled when his work began to be sampled by hip hop artists in the 1980s and 1990s.\n\nHe was inducted into the Rock and Roll Hall of Fame in 1998 and, in 2009, the Louisiana Music Hall of Fame. On May 9, 2011 he was inducted into the Blues Hall of Fame.\n\nToussaint weathered Hurricane Katrina in the Astor Crowne Plaza Hotel. After the hurricane Toussaint left New Orleans for Baton Rouge, Louisiana, and eventually settled in New York City. His first television appearance after the hurricane was on the September 7, 2005 episode of the Late Show with David Letterman, sitting in with Paul Shaffer and his CBS Orchestra. Toussaint performed regularly at Joe's Pub in New York City through 2009.\n\nThe River in Reverse, Toussaint's collaborative album with Elvis Costello, was released on 29 May 2006 in the UK on the Verve label, by Universal Classics and Jazz UCJ. It was recorded in Hollywood and, notably, in Toussaint's native New Orleans as the first major studio session to take place after Hurricane Katrina. In 2007, Toussaint performed a duet with Paul McCartney of a song by fellow New Orleans musician and resident Fats Domino, \"I Want to Walk You Home\", as their contribution to Goin' Home: A Tribute to Fats Domino (Vanguard).\n\nIn 2008, Toussaint's song \"Sweet Touch of Love\" was used in a deodorant commercial for the Axe (Lynx) brand. The commercial won a Gold Lion at the 2008 Cannes Lions International Advertising Festival. In February 2008, Toussaint appeared on Le Show, the Harry Shearer show broadcast on NPR via KCRW. He appeared in London in August 2008, where he performed a gig at The Roundhouse. In October 2008 he performed at Festival New Orleans at The O2 alongside acts such as Dr. John and Buckwheat Zydeco. Sponsored by Quint Davis of the New Orleans Jazz & Heritage Festival and Philip Anschutz, the event was intended to promote New Orleans music and culture and to revive the once-lucrative tourist trade that had been almost completely lost following the flooding of Hurricane Katrina. After his second performance at the festival, Toussaint appeared alongside then-Lieutenant Governor of Louisiana, Mitch Landrieu. The following day, he performed again in London at the NFL Tailgate Party.\n\nToussaint performed for a taping of the PBS series Austin City Limits on June 30, 2009 during the show's 35th anniversary season. He played instrumentals from his then recent album, \"The Bright Mississippi\", as well as many songs from his back catalog. He performed with Levon Helm and his band on Imus in the Morning on October 9, 2009. In December 2009, he was featured on Elvis Costello's Spectacle program on the Sundance Channel, singing \"A Certain Girl\". Toussaint appeared on Eric Clapton's 2010 album, Clapton, in two Fats Waller covers, \"My Very Good Friend the Milkman\" and \"When Somebody Thinks You're Wonderful\".\n\nToussaint was a musical mentor to Swedish-born New Orleans songwriter and performer Theresa Andersson.\n\n\n <a href=\"https://www.last.fm/music/Allen+Toussaint\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T17:45:42.062414",
  "discogs_id": "136135",
  "discogs_url": "https://www.discogs.com/artist/136135",
  "followers": 98987,
  "formed_date": null,
  "genres": [
    "Jazz",
    "cajun",
    "soul",
    "New Orleans",
    "funk",
    "rhythm and blues",
    "new orleans rhythm and blues"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/6c/f2/58/6cf25877-88c8-692c-730f-d2127b3c890d/mzl.xbzfhzec.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 665,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/2437dba48cbb3de77c2fec0cd4f75281a9083066",
      "width": 1000
    },
    {
      "height": 425,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/f30a0de53694bd5b0a7ac1d1d196f00c6b39f06e",
      "width": 639
    },
    {
      "height": 133,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/97973a48db93b83dfd581f0643fc142e57e8eff2",
      "width": 200
    },
    {
      "height": 43,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/7ff47e75042bb4bc0317dd48fb67bb5f47cdeb50",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "ec21cced-2d22-4883-9ee3-f642e6e52f58",
  "lastfm_url": "https://www.last.fm/music/Allen+Toussaint",
  "local_images": {
    "hi-res": "public/artist/allen-toussaint/allen-toussaint-hi-res.jpg",
    "medium": "public/artist/allen-toussaint/allen-toussaint-medium.jpg",
    "small": "public/artist/allen-toussaint/allen-toussaint-small.jpg"
  },
  "name": "Allen Toussaint",
  "popularity": 45,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/6c/f2/58/6cf25877-88c8-692c-730f-d2127b3c890d/mzl.xbzfhzec.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Jazz"
      ],
      "id": "333601",
      "name": "Allen Toussaint",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/allen-toussaint/333601"
    },
    "discogs": {
      "id": 136135,
      "original_name": "Allen Toussaint",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Allen Toussaint (January 14, 1938 – November 10, 2015) was an American musician, songwriter/composer, record producer, and influential figure in New Orleans R&B.\nMany of Toussaint's songs became familiar through versions by other musicians, including \"Working in the Coal Mine\", \"Ride Your Pony\", \"Fortune Teller\", \"Play Something Sweet (Brickyard Blues)\", \"Southern Nights\", \"Everything I Do Gonna Be Funky\", \"I'll Take a Melody\", \"Get Out of My Life, Woman\" and \"Mother-in-Law\".\n\nToussaint (/ˈtuːsɑːnt/) grew up in a shotgun house in the New Orleans neighborhood of Gert Town, where his mother, Naomi Neville (whose name he later adopted pseudonymously for some of his works), welcomed and fed all manner of musicians as they practiced and recorded with her son. After a lucky break at age 17 in which he stood in for Huey Smith at a performance with Earl King's band in Prichard, Alabama, Toussaint was introduced to a group of local musicians who performed regularly at a night club on LaSalle street Uptown; they were known as the Dew Drop Set.  He initially recorded for RCA Victor as Al Tousan and recorded an album of instrumentals, including the song \"Java\", which became a #1 hit for Al Hirt (also on RCA) in 1964.\n\nIn the 1960s and 1970s, Toussaint  was a prolific writer, producer and arranger, creating numerous hits for a variety of artists including Lee Dorsey, Robert Palmer, The Showmen, The Meters, Betty Wright, Solomon Burke and Willie West. He produced material for Dr John, Labelle, Chocolate Milk and Aaron Neville amongst many more. \n\nAn accomplished pianist and lyricist, Toussaint wrote many hit songs including early instrumental efforts Java (a hit for Al Hirt) and Whipped Cream  which went platinum when done by Herb Alpert. Other Toussaint compositions that continue to be covered by artists to this day, include \"Working in a Coalmine\", \"PLAY SOMETHING SWEET (BRICKYARD BLUES)\", \"Get Out My Life Woman\" and \"Yes We Can Can\". Some of his songs from the 1950s and 1960s were penned under his mother's maiden name, the pseudonym Naomi Neville. These include  Fortune Teller recorded by the Rolling Stones, and \"Ruler of My Heart\", recorded by Irma Thomas and reinterpreted as \"Pain in My Heart\" by Otis Redding. He arranged horn parts for The Band, and wrote what became one of Glen Campbell's biggest hits Southern Nights as well as A Certain Girl , which charted when recorded by acts as diverse as Warren Zevon, Benny Spellman and The Yardbirds.\n\nAside from his success behind the scenes, Toussaint also launched his own solo career, which peaked in the '70s with the albums \"From a Whisper to a Scream\" and \"Southern Nights\". For much of his career he partnered with Marshall Sehorn. They co-owned and operated the Sea-Saint recording studio in the Gentilly neighborhood of New Orleans. They also partnered in a record label, that went under various names. Along with many of his contemporaries, Allen Toussaint found that interest in his compositions was rekindled when his work began to be heavily sampled by hip hop artists in the 1980s and 1990s. \n\nDespite rumours at the time, Toussaint did not take refuge at the Louisiana Superdome in the wake of the Hurricane Katrina disaster. Instead, Toussaint weathered out the storm in the Astor Crowne Plaza Hotel. After the hurricane Toussaint left New Orleans for New York City, where he was living while his house was rebuilt. His first television appearance after the hurricane was on the September 7, 2005 episode of The Late Show with David Letterman, sitting in with Paul Shaffer and his CBS Orchestra. Toussaint performed each month at Joe's Pub in New York City.\n\n\"The River In Reverse\", Toussaint's collaborative album with Elvis Costello, was released on 29 May 2006  and was recorded in Toussaint's native New Orleans and Hollywood with help from engineer and producer Joe Hardy. Costello and Toussaint assembled a big band and embarked on a tour of theaters and festivals and released a DVD of their collaboration. \n\nToussaint died in the early hours of November 10, 2015 while on tour in Madrid, Spain. Following a concert at the Teatro Lara, he suffered two cardiac arrests at his hotel and was pronounced dead on his arrival at hospital. He was 77. He is survived by his two children, including son Clarence (better known as Reginald) and daughter Alison, and by several grandchildren. His children had managed his career in recent years.\n\n\nA significant early influence on Toussaint was the second-line piano style of Professor Longhair. In his early years he worked mainly for Joe Banashak's Minit Records and Instant Records, but after Minit was sold to its distributor, he teamed up with Marshall Sehorn, starting their own record label variously known as Tou-Sea, Sansu, Deesu or Kansu. In 1973 Toussaint and Sehorn created the Sea-Saint recording studio in Gentilly.\n\nIn the early 1960s he wrote and produced a string of hits for New Orleans R&B artists such as Ernie K-Doe, Irma Thomas, Art and Aaron Neville, The Showmen, and Lee Dorsey.\n\n\"Ruler of My Heart\", recorded by Irma Thomas. This song was subsequently recorded by Otis Redding under the title \"Pain in My Heart\", and by The Rolling Stones on their second album.\nIn 1964, \"A Certain Girl\" (originally by Ernie K-Doe) was the B-side of the first single release by The Yardbirds; the song was released again in 1980 by Warren Zevon.\nA two-sided 1962 hit by Benny Spellman comprised \"Lipstick Traces (On A Cigarette),\" later covered by The O'Jays, Ringo Starr, and Alex Chilton.\nThe simple but effective \"Fortune Teller\", which was covered by many 1960s rock groups including The Rolling Stones, The Nashville Teens, The Who, The Hollies, The Throb, and ex-Searchers founder member Tony Jackson.\nToussaint credited about twenty songs to his parents, Clarence and Naomi. These include Benny Spellman's 1961 original version of \"Fortune Teller\" and The Artwoods' 1966 version of \"Work, Work, Work\". Alison Krauss and Robert Plant 2007 covered \"Fortune Teller\" on their 2007 collaboration album Raising Sand. A fairly thorough song list appears in Toussaint's discography section Pseudonyms, below.\n\nToussaint's piano and arrangements show up on hundreds of records during the early 1960s on records by Lee Dorsey, Chris Kenner, and scores of other artists. Starting in the 1970s, he switched gears to a funkier sound, writing and producing for The Meters, Dr John, and the Wild Tchoupitoulas Mardi Gras Indians tribe. He also began to work with non-New Orleans artists such as B.J. Thomas, Robert Palmer, Willy DeVille, Sandy Denny, Elkie Brooks, Solomon Burke, Scottish soul singer Frankie Miller (High Life) and southern rocker Mylon LeFevre.[citation needed] He arranged horn music for The Band's 1971 album Cahoots, plus Rock of Ages and The Last Waltz film, in conjunction with arranging horn parts for their concert repertoire. Boz Scaggs recorded Toussaint's \"What Do You Want the Girl to Do?\" on his 1976 album Silk Degrees, which reached #2 on the U.S. pop albums chart. In 1976 he also collaborated with John Mayall on the album Notice to Appear.\n\nToussaint also launched his own solo career, which peaked in the 1970s with the albums From a Whisper to a Scream and Southern Nights. It was during this time that he teamed with Labelle, and produced their highly acclaimed 1975 album Nightbirds, which spawned the Number One hit, \"Lady Marmalade\". The same year, Toussaint collaborated with Paul McCartney and Wings for their hit album Venus and Mars and played on the song Rock Show. Two years later, Glen Campbell covered Toussaint's \"Southern Nights\" and carried the song to Number One on the Pop, Country and Adult-Contemporary Charts. Along with many of his contemporaries, Toussaint found that interest in his compositions was rekindled when his work began to be sampled by hip hop artists in the 1980s and 1990s.\n\nHe was inducted into the Rock and Roll Hall of Fame in 1998 and, in 2009, the Louisiana Music Hall of Fame. On May 9, 2011 he was inducted into the Blues Hall of Fame.\n\nToussaint weathered Hurricane Katrina in the Astor Crowne Plaza Hotel. After the hurricane Toussaint left New Orleans for Baton Rouge, Louisiana, and eventually settled in New York City. His first television appearance after the hurricane was on the September 7, 2005 episode of the Late Show with David Letterman, sitting in with Paul Shaffer and his CBS Orchestra. Toussaint performed regularly at Joe's Pub in New York City through 2009.\n\nThe River in Reverse, Toussaint's collaborative album with Elvis Costello, was released on 29 May 2006 in the UK on the Verve label, by Universal Classics and Jazz UCJ. It was recorded in Hollywood and, notably, in Toussaint's native New Orleans as the first major studio session to take place after Hurricane Katrina. In 2007, Toussaint performed a duet with Paul McCartney of a song by fellow New Orleans musician and resident Fats Domino, \"I Want to Walk You Home\", as their contribution to Goin' Home: A Tribute to Fats Domino (Vanguard).\n\nIn 2008, Toussaint's song \"Sweet Touch of Love\" was used in a deodorant commercial for the Axe (Lynx) brand. The commercial won a Gold Lion at the 2008 Cannes Lions International Advertising Festival. In February 2008, Toussaint appeared on Le Show, the Harry Shearer show broadcast on NPR via KCRW. He appeared in London in August 2008, where he performed a gig at The Roundhouse. In October 2008 he performed at Festival New Orleans at The O2 alongside acts such as Dr. John and Buckwheat Zydeco. Sponsored by Quint Davis of the New Orleans Jazz & Heritage Festival and Philip Anschutz, the event was intended to promote New Orleans music and culture and to revive the once-lucrative tourist trade that had been almost completely lost following the flooding of Hurricane Katrina. After his second performance at the festival, Toussaint appeared alongside then-Lieutenant Governor of Louisiana, Mitch Landrieu. The following day, he performed again in London at the NFL Tailgate Party.\n\nToussaint performed for a taping of the PBS series Austin City Limits on June 30, 2009 during the show's 35th anniversary season. He played instrumentals from his then recent album, \"The Bright Mississippi\", as well as many songs from his back catalog. He performed with Levon Helm and his band on Imus in the Morning on October 9, 2009. In December 2009, he was featured on Elvis Costello's Spectacle program on the Sundance Channel, singing \"A Certain Girl\". Toussaint appeared on Eric Clapton's 2010 album, Clapton, in two Fats Waller covers, \"My Very Good Friend the Milkman\" and \"When Somebody Thinks You're Wonderful\".\n\nToussaint was a musical mentor to Swedish-born New Orleans songwriter and performer Theresa Andersson.\n\n\n <a href=\"https://www.last.fm/music/Allen+Toussaint\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Allen Toussaint (January 14, 1938 – November 10, 2015) was an American musician, songwriter/composer, record producer, and influential figure in New Orleans R&B.\nMany of Toussaint's songs became familiar through versions by other musicians, including \"Working in the Coal Mine\", \"Ride Your Pony\", \"Fortune Teller\", \"Play Something Sweet (Brickyard Blues)\", \"Southern Nights\", \"Everything I Do Gonna Be Funky\", \"I'll Take a Melody\", \"Get Out of My Life, Woman\" and \"Mother-in-Law\". <a href=\"https://www.last.fm/music/Allen+Toussaint\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 236545,
      "mbid": "ec21cced-2d22-4883-9ee3-f642e6e52f58",
      "name": "Allen Toussaint",
      "playcount": 2275451,
      "similar_artists": [
        {
          "name": "Professor Longhair",
          "url": "https://www.last.fm/music/Professor+Longhair"
        },
        {
          "name": "Dr. John",
          "url": "https://www.last.fm/music/Dr.+John"
        },
        {
          "name": "Lee Dorsey",
          "url": "https://www.last.fm/music/Lee+Dorsey"
        },
        {
          "name": "The Meters",
          "url": "https://www.last.fm/music/The+Meters"
        },
        {
          "name": "Bobby Charles",
          "url": "https://www.last.fm/music/Bobby+Charles"
        }
      ],
      "tags": [
        "soul",
        "New Orleans",
        "funk",
        "rhythm and blues",
        "new orleans rhythm and blues"
      ],
      "url": "https://www.last.fm/music/Allen+Toussaint"
    },
    "spotify": {
      "followers": 98987,
      "genres": [
        "cajun"
      ],
      "id": "63aP18bg2ABSOqSNQcAMNy",
      "images": [
        {
          "height": 665,
          "url": "https://i.scdn.co/image/2437dba48cbb3de77c2fec0cd4f75281a9083066",
          "width": 1000
        },
        {
          "height": 425,
          "url": "https://i.scdn.co/image/f30a0de53694bd5b0a7ac1d1d196f00c6b39f06e",
          "width": 639
        },
        {
          "height": 133,
          "url": "https://i.scdn.co/image/97973a48db93b83dfd581f0643fc142e57e8eff2",
          "width": 200
        },
        {
          "height": 43,
          "url": "https://i.scdn.co/image/7ff47e75042bb4bc0317dd48fb67bb5f47cdeb50",
          "width": 64
        }
      ],
      "name": "Allen Toussaint",
      "popularity": 45,
      "url": "https://open.spotify.com/artist/63aP18bg2ABSOqSNQcAMNy"
    }
  },
  "spotify_id": "63aP18bg2ABSOqSNQcAMNy",
  "spotify_url": "https://open.spotify.com/artist/63aP18bg2ABSOqSNQcAMNy",
  "updated_at": "2025-07-05T17:45:45.200455",
  "wikipedia_url": null
}