{
  "apple_music_id": "1317475786",
  "apple_music_url": "https://music.apple.com/gb/artist/magenta/1317475786",
  "biography": "Although heavily influenced by progressive rock, Reed is a professional songwriter and has done many other projects for both film and television. The most successful of these projects was called Trippa, featuring Christina Booth on vocals and Rob Reed on guitars and keyboards. Reed asked Christina to be lead vocalist for a progressive rock project he had in mind, and the initial ideas for Magenta were born. Booth went on to guest on a number of Cyan albums.\n\nIn 2000, Reed started writing for what would become Magenta's debut release, Revolutions. Reed wanted to do something new, bigger and more conceptual. \"Current prog bands are always scared and shy about admitting the influences of the great bands of the 70’s, and I wanted to come clean and admit and celebrate those influences, and hopefully create something as worthwhile as those classic bands\" said Reed. \"To do this, all I had to do was to give priority to melody rather than technical showmanship, something I have always tried to do with all my work.\" Revolutions was named \"Best New Album\" in 2001 by Musical Discoveries, an online resource for female vocalists in the music industry.\n\nMagenta's second album, Seven was released in March 2004 and sold out of its first pressing within four weeks. The band's first single, \"Broken\" was released in June 2004 - from the EP Broken. While shorter than any of the epic tracks on Seven, Broken retains the classic prog rock sound of Magenta, with a slightly more modern edge.\n\nIn November 2004, Magenta released the double live album Another Time, Another Place, recorded on tour in Europe from 2002-2004. The live concert DVD The Gathering was also released in late 2005 and a series of live shows followed.\n\nMagenta's third studio album, Home, was officially released on June 1, 2006. The album is a concept piece and tells the story of a woman who emigrates from Liverpool, England in the early 1970s to \"find herself\" in the USA. The CD is 68 minutes long and includes contributions from a variety of guests including Magenta regulars Martin Shellard on guitar alongside Troy Donockley (Iona, Mostly Autumn) on Uilleann Pipes and whistles. Once again, the album was written and produced by Rob Reed, with lyrics by Steve Reed. Musically, Home represents a further development for the band, combining the Magenta sound established on Revolutions, Seven and the two singles Broken and I’m Alive. The new album was released in two separate versions, the single disc Home and the double disc version featuring the New York Suite. The second disc contains four longer pieces of music which could not fit onto the single disc version. Home was later re-released as a double album, with the four tracks from the New York Suite inserted into the relevant position in the \"story\".\n\nMagenta: The Singles was released in summer 2007. The album features re-recorded versions of various singles and album tracks. Rob Reed explains, \"The first reason for doing the album was to get definitive versions of the songs recorded. We’d been playing some of the songs live for 3 years and we now had Dan on bass, and he’d brought his own character to the songs as they’d developed. Also, the original versions had been recorded quite quickly and we wanted to get high quality versions of the songs down, as we’d done with \"Speechless\". It was great to take a bit more time with them and record them properly. Also a lot of Prog fans don’t like buying singles, they’d much rather have the album format, and at 79 minutes we certainly have an album's worth of material. We can delete the singles now.\"\n\nIn addition, another DVD Live At The Point was recorded on the 23rd of November at The Point in Cardiff.\n\nOn 30 November 2007 it was announced that drummer Allan Mason-Jones had left the live version of the band. He was replaced in the live band by Keiran Bailey. On 11 December 2007 it was announced that rhythm guitarist Martin Rosser had also left the band to work with Dan Fry and Allan Mason-Jones on their new C-Sides project.\n\nTheir fourth album, entitled \"Metamorphosis\", was released to registered fans on March 23, 2008, with an accompanying DVD featuring footage of the recording process and a full 5.1 version of the album. (The official release date for these items was April 21.) Prior to its release, Reed said it was \"unlike what Magenta fans have heard up until now.\" The album contains just four tracks, two of which are longer than 20 minutes. The album has a much darker edge than previous Magenta albums.\n\nIn November 2009, Magenta performed an acoustic concert at Peter Gabriel's Real World Studios near Bath. The concert was notable for featuring a wind section, and the one-off return of Martin Rosser on rhythm guitar - Colin Edwards having recently departed the band. The concert Live At Real World was released as a double CD and DVD in September 2010.\n\nOn 4 March 2010, it was announced on the Magenta homepage that bassist Dan Fry had left the live band, to pursue his MLE project. This caused two shows in Holland set for May to be cancelled, and the band went on an extended hiatus while other projects were being worked on, such as Christina Booth's and Chris Fry's solo albums.\n\nMagenta returned to the live scene at the Summer's End Festival in October 2011, with Dan Nelson and Steve Roberts (from Godsticks) on bass and drums respectively.\n\nMagenta's fifth album, Chameleon, was released in November 2011. It features several shorter tracks but mostly with a hard edge, similar to the previous album Metamorphosis. At this time, Magenta's full members were confirmed to be Rob Reed, Christina Booth and Chris Fry, with other musicians brought in for studio recordings and live gigs. Kieran Bailey recorded drums on the album but no longer plays with the live version of the band.\nCurrent status\n\nMagenta remain active, with work continuing on the sixth album and some more gigs scheduled, including the inaugural Celebr8 festival in Kingston-upon-Thames in July 2012. The live band continues to be the three core members along with Godsticks' Dan Nelson and Steve Roberts.\n\nRob Reed's previous project, Cyan, is also taking to the stage for the first time to play at the Summer's End Festival in September 2012. The live band will feature the Magenta live line-up, but with Steffan Rhys Williams on lead vocals rather than Christina Booth.",
  "country": null,
  "created_at": "2025-07-05T17:09:45.801720",
  "discogs_id": "1120292",
  "discogs_url": "https://www.discogs.com/artist/1120292",
  "followers": 5823,
  "formed_date": null,
  "genres": [
    "Dance",
    "cumbia",
    "cuarteto",
    "Progressive rock",
    "female vocalists",
    "symphonic prog",
    "Gothic Rock",
    "neo-progressive rock",
    "progressive rock",
    "Progressive Rock"
  ],
  "id": "magenta-1751731788",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/98/32/91/98329168-062a-4a58-b78b-3e40176fa8be/ami-identity-74b07a3277d3c7127beadb401c9184e0-2025-01-15T11-36-27.995Z_cropped.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616d0000b27307321903aaec7b82a8a10916",
      "width": 640
    },
    {
      "height": 300,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616d00001e0207321903aaec7b82a8a10916",
      "width": 300
    },
    {
      "height": 64,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616d0000485107321903aaec7b82a8a10916",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/rpuyvs1464750833.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/rsprtr1342342670.png",
      "width": 400
    }
  ],
  "lastfm_mbid": "ebcde1c3-2e18-42a8-ab9b-3f5f20c935f8",
  "lastfm_url": "https://www.last.fm/music/Magenta",
  "local_images": {
    "hi-res": "../public/artist/magenta/magenta-hi-res.jpg",
    "medium": "../public/artist/magenta/magenta-medium.jpg",
    "small": "../public/artist/magenta/magenta-small.jpg"
  },
  "name": "Magenta",
  "popularity": 61,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='1317475786', url='https://music.apple.com/gb/artist/magenta/1317475786', name='Magenta', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/98/32/91/98329168-062a-4a58-b78b-3e40176fa8be/ami-identity-74b07a3277d3c7127beadb401c9184e0-2025-01-15T11-36-27.995Z_cropped.png/2000x2000bb.jpg', genres=['Dance'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '1317475786', 'type': 'artists', 'href': '/v1/catalog/gb/artists/1317475786', 'attributes': {'name': 'Magenta', 'genreNames': ['Dance'], 'artwork': {'width': 1484, 'height': 1484, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/98/32/91/98329168-062a-4a58-b78b-3e40176fa8be/ami-identity-74b07a3277d3c7127beadb401c9184e0-2025-01-15T11-36-27.995Z_cropped.png/{w}x{h}bb.jpg', 'bgColor': '0d0d0d', 'textColor1': 'fcf6e8', 'textColor2': 'f9d8b0', 'textColor3': 'ccc7bc', 'textColor4': 'c9af8f'}, 'url': 'https://music.apple.com/gb/artist/magenta/1317475786'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/1317475786/albums', 'next': '/v1/catalog/gb/artists/1317475786/albums?offset=25', 'data': [{'id': '1743929328', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1743929328'}, {'id': '1714991349', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1714991349'}, {'id': '1804269423', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1804269423'}, {'id': '1475308779', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1475308779'}, {'id': '1543926976', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1543926976'}, {'id': '1690026724', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1690026724'}, {'id': '1675473224', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1675473224'}, {'id': '1540088657', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1540088657'}, {'id': '1442631629', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1442631629'}, {'id': '1726610828', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1726610828'}, {'id': '1659625327', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1659625327'}, {'id': '1715899503', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1715899503'}, {'id': '1716044604', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1716044604'}, {'id': '1455161112', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1455161112'}, {'id': '1666594835', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1666594835'}, {'id': '1613978705', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1613978705'}, {'id': '1819937922', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1819937922'}, {'id': '1508417244', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1508417244'}, {'id': '1630407137', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1630407137'}, {'id': '1682228362', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1682228362'}, {'id': '1590872473', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1590872473'}, {'id': '1575899007', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1575899007'}, {'id': '1446935723', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1446935723'}, {'id': '1683153064', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1683153064'}, {'id': '1739768381', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1739768381'}]}}})",
    "discogs": {
      "cover_image": "",
      "id": "1120292",
      "images": [],
      "members": [],
      "name": "Magenta",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "1120292",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/1120292"
      },
      "resource_url": "https://api.discogs.com/artists/1120292",
      "thumb": "",
      "url": "https://www.discogs.com/artist/1120292",
      "urls": []
    },
    "lastfm": "ArtistLastFmData(name='Magenta', url='https://www.last.fm/music/Magenta', mbid='ebcde1c3-2e18-42a8-ab9b-3f5f20c935f8', listeners=58160, playcount=696930, bio_summary='There are at least seven artists which have used this name\\n1. progressive rock band from Wales\\n2. rock group from Norway\\n3. 70s folk rock band from England\\n4. musical group from Greece\\n5. synthpop group from Spain\\n6. rock group from Belgium\\n7. Drum N Bass producer from Czech Republic\\n\\nMagenta (1): Cyan was formed in 1984 while Reed was still at school, although the band broke up after only a few gigs and one demo tape release. Reed takes his influences from bands like Genesis, Mike Oldfield, Yes, Eurythmics, and Björk. <a href=\"https://www.last.fm/music/Magenta\">Read more on Last.fm</a>', bio_content='There are at least seven artists which have used this name\\n1. progressive rock band from Wales\\n2. rock group from Norway\\n3. 70s folk rock band from England\\n4. musical group from Greece\\n5. synthpop group from Spain\\n6. rock group from Belgium\\n7. Drum N Bass producer from Czech Republic\\n\\nMagenta (1): Cyan was formed in 1984 while Reed was still at school, although the band broke up after only a few gigs and one demo tape release. Reed takes his influences from bands like Genesis, Mike Oldfield, Yes, Eurythmics, and Björk. Though heavily influenced by progressive rock, Reed is a professional songwriter and has done many other projects for both film and television\\n\\nThe most successful of these projects was called Trippa. Described as \"a contemporary Eurythmics for the new millennium\" mixing their own brand of edgy industrial pop with soaring orchestral arrangements. The band featured Christina Booth on vocals and Rob Reed on guitars and keyboards, joined by Rhiannon Stundon (backing vocals) and Ryan Aston (drums). The band released the Trippa EP in 1999, and were voted ‘Record of the Week’ on Virgin Radio, appearing on British television a number of times. It was during this time that Reed asked Christina to be lead vocalist for a progressive rock project he had in mind, and the initial ideas for Magenta were born. \\nMagenta was originally a studio project, with Rob playing most of the instruments. However, once their debut Revolutions was released  in 1999 there was a demand for live shows. Rob recruited (along with Christina) Chris Fry and Martin Rosser on guitar, Matthew Cohen on bass and Allan Mason-Jones on drums. Recently, Matt left the band and was replaced by Chris\\' younger brother Dan. The band released their third album Home in 2006 together with New York Suite. In 2008 the much darker album Metamorphosis saw the light of day. Their latest release to date with new songs Chameleon appeared in 2011.\\n\\nMagenta (2): Magenta was formed by Anders Odden during the summer of 1995. Vilde Lockert joined him on vocals that autumn. They released their first EP simply named Magenta in 1997. The song Secret Sky went into the charts in Norway and established their career. Anders Odden was already a well-known name to most of the music-oriented people. He’s been members of bands like Apoptygma Berzerk, Cadaver as well as recording for Satyricon, and being liveguitarist for Celtic Frost. The album Periode was released in March 1998, and Magenta went on tour in Norway and Germany. Magenta signed a new record-deal in April 2001 with the German indielabel Re:pop Music. The summer of 2001 saw the recording of the album Little Girl Lost, when they joined forces with producer, Vegard Ibo Blomberg The album was released in Germany the 24th of June 2002, and was very well received in the German alternative press. It reached number 4 in both the German Alternative Charts during the fall of 2002. Magenta made a video for All Over featuring Mortiis, but were quite stunned to find out that Coca-Cola company wanted this song for their worldwide release of Sprite Zero. The best chart position so far has been reached when Magenta CD single All Over climbed to number 2 in the official charts in Greece on the 8.7.2002 when this campaign went into a frenzy there.\\n\\nMagenta played a lot of gigs in 2002/2003 and the took some time off after the Arvika Festival in Sweden in 2003. Anders re-joined Apoptygma Berzerk on the recording of their new album \"You And Me Against The World\" in 2004/2005. In 2006 Magenta was reinforced with guitar manic Daniel Hill. This was very inspiring for the band and led to one of the most creative period in the bands history. Magenta released a track together with Apoptygma Berzerk called Friendly Fire in the beginning of 2006, and this kicked Magenta into a serious writing process for the new album. The first new song of the new direction is Darkest Dream. Magenta was also enforced with Jonas Groth who contributed to the production of the rest of the new album. Art And Accidents was release in November 2008 digitally and then officially on February 9, 2009.\\n\\nA new album is recorded and will be released in February 09 featuring new band member Daniel Hill (Guitar, Bass, Vocals) and guest appearances from several known Norwegian musicians including members of Apoptygma Berzerk, Gluecifer and Gothminister.\\n\\nMagenta (3): A folk band from UK which released at least the album Canterbury Moon in 1978.\\n\\nMagenta (4): An ethnic/entechna music project from Greece, with songs written by Michalis Nikoloudis (music) and Michalis Koumbios (lyrics) sung by Anastasia Moutsatsou. They have released one CD.\\n\\nMagenta (5): A synthpop band from Spain. They released a LP titled \"La Reina del Salón\" in 1985.\\n\\nMagenta (6): little is known about this band from Belgium <a href=\"https://www.last.fm/music/Magenta\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['Progressive rock', 'female vocalists', 'symphonic prog', 'Gothic Rock', 'neo-progressive rock'], similar_artists=[{'name': 'Pendragon', 'url': 'https://www.last.fm/music/Pendragon'}, {'name': 'Glass Hammer', 'url': 'https://www.last.fm/music/Glass+Hammer'}, {'name': 'It Bites', 'url': 'https://www.last.fm/music/It+Bites'}, {'name': 'IQ', 'url': 'https://www.last.fm/music/IQ'}, {'name': 'Big Big Train', 'url': 'https://www.last.fm/music/Big+Big+Train'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Magenta', 'mbid': 'ebcde1c3-2e18-42a8-ab9b-3f5f20c935f8', 'url': 'https://www.last.fm/music/Magenta', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '58160', 'playcount': '696930'}, 'similar': {'artist': [{'name': 'Pendragon', 'url': 'https://www.last.fm/music/Pendragon', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Glass Hammer', 'url': 'https://www.last.fm/music/Glass+Hammer', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'It Bites', 'url': 'https://www.last.fm/music/It+Bites', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'IQ', 'url': 'https://www.last.fm/music/IQ', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Big Big Train', 'url': 'https://www.last.fm/music/Big+Big+Train', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'Progressive rock', 'url': 'https://www.last.fm/tag/Progressive+rock'}, {'name': 'female vocalists', 'url': 'https://www.last.fm/tag/female+vocalists'}, {'name': 'symphonic prog', 'url': 'https://www.last.fm/tag/symphonic+prog'}, {'name': 'Gothic Rock', 'url': 'https://www.last.fm/tag/Gothic+Rock'}, {'name': 'neo-progressive rock', 'url': 'https://www.last.fm/tag/neo-progressive+rock'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Magenta/+wiki'}}, 'published': '25 Jun 2006, 23:35', 'summary': 'There are at least seven artists which have used this name\\n1. progressive rock band from Wales\\n2. rock group from Norway\\n3. 70s folk rock band from England\\n4. musical group from Greece\\n5. synthpop group from Spain\\n6. rock group from Belgium\\n7. Drum N Bass producer from Czech Republic\\n\\nMagenta (1): Cyan was formed in 1984 while Reed was still at school, although the band broke up after only a few gigs and one demo tape release. Reed takes his influences from bands like Genesis, Mike Oldfield, Yes, Eurythmics, and Björk. <a href=\"https://www.last.fm/music/Magenta\">Read more on Last.fm</a>', 'content': 'There are at least seven artists which have used this name\\n1. progressive rock band from Wales\\n2. rock group from Norway\\n3. 70s folk rock band from England\\n4. musical group from Greece\\n5. synthpop group from Spain\\n6. rock group from Belgium\\n7. Drum N Bass producer from Czech Republic\\n\\nMagenta (1): Cyan was formed in 1984 while Reed was still at school, although the band broke up after only a few gigs and one demo tape release. Reed takes his influences from bands like Genesis, Mike Oldfield, Yes, Eurythmics, and Björk. Though heavily influenced by progressive rock, Reed is a professional songwriter and has done many other projects for both film and television\\n\\nThe most successful of these projects was called Trippa. Described as \"a contemporary Eurythmics for the new millennium\" mixing their own brand of edgy industrial pop with soaring orchestral arrangements. The band featured Christina Booth on vocals and Rob Reed on guitars and keyboards, joined by Rhiannon Stundon (backing vocals) and Ryan Aston (drums). The band released the Trippa EP in 1999, and were voted ‘Record of the Week’ on Virgin Radio, appearing on British television a number of times. It was during this time that Reed asked Christina to be lead vocalist for a progressive rock project he had in mind, and the initial ideas for Magenta were born. \\nMagenta was originally a studio project, with Rob playing most of the instruments. However, once their debut Revolutions was released  in 1999 there was a demand for live shows. Rob recruited (along with Christina) Chris Fry and Martin Rosser on guitar, Matthew Cohen on bass and Allan Mason-Jones on drums. Recently, Matt left the band and was replaced by Chris\\' younger brother Dan. The band released their third album Home in 2006 together with New York Suite. In 2008 the much darker album Metamorphosis saw the light of day. Their latest release to date with new songs Chameleon appeared in 2011.\\n\\nMagenta (2): Magenta was formed by Anders Odden during the summer of 1995. Vilde Lockert joined him on vocals that autumn. They released their first EP simply named Magenta in 1997. The song Secret Sky went into the charts in Norway and established their career. Anders Odden was already a well-known name to most of the music-oriented people. He’s been members of bands like Apoptygma Berzerk, Cadaver as well as recording for Satyricon, and being liveguitarist for Celtic Frost. The album Periode was released in March 1998, and Magenta went on tour in Norway and Germany. Magenta signed a new record-deal in April 2001 with the German indielabel Re:pop Music. The summer of 2001 saw the recording of the album Little Girl Lost, when they joined forces with producer, Vegard Ibo Blomberg The album was released in Germany the 24th of June 2002, and was very well received in the German alternative press. It reached number 4 in both the German Alternative Charts during the fall of 2002. Magenta made a video for All Over featuring Mortiis, but were quite stunned to find out that Coca-Cola company wanted this song for their worldwide release of Sprite Zero. The best chart position so far has been reached when Magenta CD single All Over climbed to number 2 in the official charts in Greece on the 8.7.2002 when this campaign went into a frenzy there.\\n\\nMagenta played a lot of gigs in 2002/2003 and the took some time off after the Arvika Festival in Sweden in 2003. Anders re-joined Apoptygma Berzerk on the recording of their new album \"You And Me Against The World\" in 2004/2005. In 2006 Magenta was reinforced with guitar manic Daniel Hill. This was very inspiring for the band and led to one of the most creative period in the bands history. Magenta released a track together with Apoptygma Berzerk called Friendly Fire in the beginning of 2006, and this kicked Magenta into a serious writing process for the new album. The first new song of the new direction is Darkest Dream. Magenta was also enforced with Jonas Groth who contributed to the production of the rest of the new album. Art And Accidents was release in November 2008 digitally and then officially on February 9, 2009.\\n\\nA new album is recorded and will be released in February 09 featuring new band member Daniel Hill (Guitar, Bass, Vocals) and guest appearances from several known Norwegian musicians including members of Apoptygma Berzerk, Gluecifer and Gothminister.\\n\\nMagenta (3): A folk band from UK which released at least the album Canterbury Moon in 1978.\\n\\nMagenta (4): An ethnic/entechna music project from Greece, with songs written by Michalis Nikoloudis (music) and Michalis Koumbios (lyrics) sung by Anastasia Moutsatsou. They have released one CD.\\n\\nMagenta (5): A synthpop band from Spain. They released a LP titled \"La Reina del Salón\" in 1985.\\n\\nMagenta (6): little is known about this band from Belgium <a href=\"https://www.last.fm/music/Magenta\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='0uT3lm3wY3LnyP6dtok0q4', url='https://open.spotify.com/artist/0uT3lm3wY3LnyP6dtok0q4', name='Magenta', popularity=61, followers=5823, genres=['cumbia', 'cuarteto'], images=[{'url': 'https://i.scdn.co/image/ab67616d0000b27307321903aaec7b82a8a10916', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616d00001e0207321903aaec7b82a8a10916', 'height': 300, 'width': 300}, {'url': 'https://i.scdn.co/image/ab67616d0000485107321903aaec7b82a8a10916', 'height': 64, 'width': 64}], external_urls={'spotify': 'https://open.spotify.com/artist/0uT3lm3wY3LnyP6dtok0q4'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/0uT3lm3wY3LnyP6dtok0q4'}, 'followers': {'href': None, 'total': 5823}, 'genres': ['cumbia', 'cuarteto'], 'href': 'https://api.spotify.com/v1/artists/0uT3lm3wY3LnyP6dtok0q4', 'id': '0uT3lm3wY3LnyP6dtok0q4', 'images': [{'url': 'https://i.scdn.co/image/ab67616d0000b27307321903aaec7b82a8a10916', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616d00001e0207321903aaec7b82a8a10916', 'height': 300, 'width': 300}, {'url': 'https://i.scdn.co/image/ab67616d0000485107321903aaec7b82a8a10916', 'height': 64, 'width': 64}], 'name': 'Magenta', 'popularity': 61, 'type': 'artist', 'uri': 'spotify:artist:0uT3lm3wY3LnyP6dtok0q4'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": null,
      "biography_de": null,
      "biography_en": "Although heavily influenced by progressive rock, Reed is a professional songwriter and has done many other projects for both film and television. The most successful of these projects was called Trippa, featuring Christina Booth on vocals and Rob Reed on guitars and keyboards. Reed asked Christina to be lead vocalist for a progressive rock project he had in mind, and the initial ideas for Magenta were born. Booth went on to guest on a number of Cyan albums.\n\nIn 2000, Reed started writing for what would become Magenta's debut release, Revolutions. Reed wanted to do something new, bigger and more conceptual. \"Current prog bands are always scared and shy about admitting the influences of the great bands of the 70’s, and I wanted to come clean and admit and celebrate those influences, and hopefully create something as worthwhile as those classic bands\" said Reed. \"To do this, all I had to do was to give priority to melody rather than technical showmanship, something I have always tried to do with all my work.\" Revolutions was named \"Best New Album\" in 2001 by Musical Discoveries, an online resource for female vocalists in the music industry.\n\nMagenta's second album, Seven was released in March 2004 and sold out of its first pressing within four weeks. The band's first single, \"Broken\" was released in June 2004 - from the EP Broken. While shorter than any of the epic tracks on Seven, Broken retains the classic prog rock sound of Magenta, with a slightly more modern edge.\n\nIn November 2004, Magenta released the double live album Another Time, Another Place, recorded on tour in Europe from 2002-2004. The live concert DVD The Gathering was also released in late 2005 and a series of live shows followed.\n\nMagenta's third studio album, Home, was officially released on June 1, 2006. The album is a concept piece and tells the story of a woman who emigrates from Liverpool, England in the early 1970s to \"find herself\" in the USA. The CD is 68 minutes long and includes contributions from a variety of guests including Magenta regulars Martin Shellard on guitar alongside Troy Donockley (Iona, Mostly Autumn) on Uilleann Pipes and whistles. Once again, the album was written and produced by Rob Reed, with lyrics by Steve Reed. Musically, Home represents a further development for the band, combining the Magenta sound established on Revolutions, Seven and the two singles Broken and I’m Alive. The new album was released in two separate versions, the single disc Home and the double disc version featuring the New York Suite. The second disc contains four longer pieces of music which could not fit onto the single disc version. Home was later re-released as a double album, with the four tracks from the New York Suite inserted into the relevant position in the \"story\".\n\nMagenta: The Singles was released in summer 2007. The album features re-recorded versions of various singles and album tracks. Rob Reed explains, \"The first reason for doing the album was to get definitive versions of the songs recorded. We’d been playing some of the songs live for 3 years and we now had Dan on bass, and he’d brought his own character to the songs as they’d developed. Also, the original versions had been recorded quite quickly and we wanted to get high quality versions of the songs down, as we’d done with \"Speechless\". It was great to take a bit more time with them and record them properly. Also a lot of Prog fans don’t like buying singles, they’d much rather have the album format, and at 79 minutes we certainly have an album's worth of material. We can delete the singles now.\"\n\nIn addition, another DVD Live At The Point was recorded on the 23rd of November at The Point in Cardiff.\n\nOn 30 November 2007 it was announced that drummer Allan Mason-Jones had left the live version of the band. He was replaced in the live band by Keiran Bailey. On 11 December 2007 it was announced that rhythm guitarist Martin Rosser had also left the band to work with Dan Fry and Allan Mason-Jones on their new C-Sides project.\n\nTheir fourth album, entitled \"Metamorphosis\", was released to registered fans on March 23, 2008, with an accompanying DVD featuring footage of the recording process and a full 5.1 version of the album. (The official release date for these items was April 21.) Prior to its release, Reed said it was \"unlike what Magenta fans have heard up until now.\" The album contains just four tracks, two of which are longer than 20 minutes. The album has a much darker edge than previous Magenta albums.\n\nIn November 2009, Magenta performed an acoustic concert at Peter Gabriel's Real World Studios near Bath. The concert was notable for featuring a wind section, and the one-off return of Martin Rosser on rhythm guitar - Colin Edwards having recently departed the band. The concert Live At Real World was released as a double CD and DVD in September 2010.\n\nOn 4 March 2010, it was announced on the Magenta homepage that bassist Dan Fry had left the live band, to pursue his MLE project. This caused two shows in Holland set for May to be cancelled, and the band went on an extended hiatus while other projects were being worked on, such as Christina Booth's and Chris Fry's solo albums.\n\nMagenta returned to the live scene at the Summer's End Festival in October 2011, with Dan Nelson and Steve Roberts (from Godsticks) on bass and drums respectively.\n\nMagenta's fifth album, Chameleon, was released in November 2011. It features several shorter tracks but mostly with a hard edge, similar to the previous album Metamorphosis. At this time, Magenta's full members were confirmed to be Rob Reed, Christina Booth and Chris Fry, with other musicians brought in for studio recordings and live gigs. Kieran Bailey recorded drums on the album but no longer plays with the live version of the band.\nCurrent status\n\nMagenta remain active, with work continuing on the sixth album and some more gigs scheduled, including the inaugural Celebr8 festival in Kingston-upon-Thames in July 2012. The live band continues to be the three core members along with Godsticks' Dan Nelson and Steve Roberts.\n\nRob Reed's previous project, Cyan, is also taking to the stage for the first time to play at the Summer's End Festival in September 2012. The live band will feature the Magenta live line-up, but with Steffan Rhys Williams on lead vocals rather than Christina Booth.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "2001",
      "country": "Wales",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "2001",
      "gender": "Mixed",
      "genre": null,
      "id": "112447",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/rpuyvs1464750833.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/rsprtr1342342670.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "3",
      "mood": null,
      "music_videos": null,
      "musicbrainz_id": "ebcde1c3-2e18-42a8-ab9b-3f5f20c935f8",
      "name": "Magenta",
      "raw_data": {},
      "style": "Progressive Rock",
      "twitter": "1",
      "website": "www.magenta-web.co.uk/index2.html"
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/98/32/91/98329168-062a-4a58-b78b-3e40176fa8be/ami-identity-74b07a3277d3c7127beadb401c9184e0-2025-01-15T11-36-27.995Z_cropped.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Dance"
      ],
      "id": "1317475786",
      "name": "Magenta",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/magenta/1317475786"
    },
    "discogs": {
      "cover_image": "",
      "id": "1120292",
      "images": [],
      "members": [],
      "name": "Magenta",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "1120292",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/1120292"
      },
      "resource_url": "https://api.discogs.com/artists/1120292",
      "thumb": "",
      "url": "https://www.discogs.com/artist/1120292",
      "urls": []
    },
    "lastfm": {
      "bio_content": "There are at least seven artists which have used this name\n1. progressive rock band from Wales\n2. rock group from Norway\n3. 70s folk rock band from England\n4. musical group from Greece\n5. synthpop group from Spain\n6. rock group from Belgium\n7. Drum N Bass producer from Czech Republic\n\nMagenta (1): Cyan was formed in 1984 while Reed was still at school, although the band broke up after only a few gigs and one demo tape release. Reed takes his influences from bands like Genesis, Mike Oldfield, Yes, Eurythmics, and Björk. Though heavily influenced by progressive rock, Reed is a professional songwriter and has done many other projects for both film and television\n\nThe most successful of these projects was called Trippa. Described as \"a contemporary Eurythmics for the new millennium\" mixing their own brand of edgy industrial pop with soaring orchestral arrangements. The band featured Christina Booth on vocals and Rob Reed on guitars and keyboards, joined by Rhiannon Stundon (backing vocals) and Ryan Aston (drums). The band released the Trippa EP in 1999, and were voted ‘Record of the Week’ on Virgin Radio, appearing on British television a number of times. It was during this time that Reed asked Christina to be lead vocalist for a progressive rock project he had in mind, and the initial ideas for Magenta were born. \nMagenta was originally a studio project, with Rob playing most of the instruments. However, once their debut Revolutions was released  in 1999 there was a demand for live shows. Rob recruited (along with Christina) Chris Fry and Martin Rosser on guitar, Matthew Cohen on bass and Allan Mason-Jones on drums. Recently, Matt left the band and was replaced by Chris' younger brother Dan. The band released their third album Home in 2006 together with New York Suite. In 2008 the much darker album Metamorphosis saw the light of day. Their latest release to date with new songs Chameleon appeared in 2011.\n\nMagenta (2): Magenta was formed by Anders Odden during the summer of 1995. Vilde Lockert joined him on vocals that autumn. They released their first EP simply named Magenta in 1997. The song Secret Sky went into the charts in Norway and established their career. Anders Odden was already a well-known name to most of the music-oriented people. He’s been members of bands like Apoptygma Berzerk, Cadaver as well as recording for Satyricon, and being liveguitarist for Celtic Frost. The album Periode was released in March 1998, and Magenta went on tour in Norway and Germany. Magenta signed a new record-deal in April 2001 with the German indielabel Re:pop Music. The summer of 2001 saw the recording of the album Little Girl Lost, when they joined forces with producer, Vegard Ibo Blomberg The album was released in Germany the 24th of June 2002, and was very well received in the German alternative press. It reached number 4 in both the German Alternative Charts during the fall of 2002. Magenta made a video for All Over featuring Mortiis, but were quite stunned to find out that Coca-Cola company wanted this song for their worldwide release of Sprite Zero. The best chart position so far has been reached when Magenta CD single All Over climbed to number 2 in the official charts in Greece on the 8.7.2002 when this campaign went into a frenzy there.\n\nMagenta played a lot of gigs in 2002/2003 and the took some time off after the Arvika Festival in Sweden in 2003. Anders re-joined Apoptygma Berzerk on the recording of their new album \"You And Me Against The World\" in 2004/2005. In 2006 Magenta was reinforced with guitar manic Daniel Hill. This was very inspiring for the band and led to one of the most creative period in the bands history. Magenta released a track together with Apoptygma Berzerk called Friendly Fire in the beginning of 2006, and this kicked Magenta into a serious writing process for the new album. The first new song of the new direction is Darkest Dream. Magenta was also enforced with Jonas Groth who contributed to the production of the rest of the new album. Art And Accidents was release in November 2008 digitally and then officially on February 9, 2009.\n\nA new album is recorded and will be released in February 09 featuring new band member Daniel Hill (Guitar, Bass, Vocals) and guest appearances from several known Norwegian musicians including members of Apoptygma Berzerk, Gluecifer and Gothminister.\n\nMagenta (3): A folk band from UK which released at least the album Canterbury Moon in 1978.\n\nMagenta (4): An ethnic/entechna music project from Greece, with songs written by Michalis Nikoloudis (music) and Michalis Koumbios (lyrics) sung by Anastasia Moutsatsou. They have released one CD.\n\nMagenta (5): A synthpop band from Spain. They released a LP titled \"La Reina del Salón\" in 1985.\n\nMagenta (6): little is known about this band from Belgium <a href=\"https://www.last.fm/music/Magenta\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "There are at least seven artists which have used this name\n1. progressive rock band from Wales\n2. rock group from Norway\n3. 70s folk rock band from England\n4. musical group from Greece\n5. synthpop group from Spain\n6. rock group from Belgium\n7. Drum N Bass producer from Czech Republic\n\nMagenta (1): Cyan was formed in 1984 while Reed was still at school, although the band broke up after only a few gigs and one demo tape release. Reed takes his influences from bands like Genesis, Mike Oldfield, Yes, Eurythmics, and Björk. <a href=\"https://www.last.fm/music/Magenta\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 58160,
      "mbid": "ebcde1c3-2e18-42a8-ab9b-3f5f20c935f8",
      "name": "Magenta",
      "playcount": 696930,
      "similar_artists": [
        {
          "name": "Pendragon",
          "url": "https://www.last.fm/music/Pendragon"
        },
        {
          "name": "Glass Hammer",
          "url": "https://www.last.fm/music/Glass+Hammer"
        },
        {
          "name": "It Bites",
          "url": "https://www.last.fm/music/It+Bites"
        },
        {
          "name": "IQ",
          "url": "https://www.last.fm/music/IQ"
        },
        {
          "name": "Big Big Train",
          "url": "https://www.last.fm/music/Big+Big+Train"
        }
      ],
      "tags": [
        "Progressive rock",
        "female vocalists",
        "symphonic prog",
        "Gothic Rock",
        "neo-progressive rock"
      ],
      "url": "https://www.last.fm/music/Magenta"
    },
    "spotify": {
      "followers": 5823,
      "genres": [
        "cumbia",
        "cuarteto"
      ],
      "id": "0uT3lm3wY3LnyP6dtok0q4",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b27307321903aaec7b82a8a10916",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e0207321903aaec7b82a8a10916",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d0000485107321903aaec7b82a8a10916",
          "width": 64
        }
      ],
      "name": "Magenta",
      "popularity": 61,
      "url": "https://open.spotify.com/artist/0uT3lm3wY3LnyP6dtok0q4"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": null,
      "biography_de": null,
      "biography_en": "Although heavily influenced by progressive rock, Reed is a professional songwriter and has done many other projects for both film and television. The most successful of these projects was called Trippa, featuring Christina Booth on vocals and Rob Reed on guitars and keyboards. Reed asked Christina to be lead vocalist for a progressive rock project he had in mind, and the initial ideas for Magenta were born. Booth went on to guest on a number of Cyan albums.\n\nIn 2000, Reed started writing for what would become Magenta's debut release, Revolutions. Reed wanted to do something new, bigger and more conceptual. \"Current prog bands are always scared and shy about admitting the influences of the great bands of the 70’s, and I wanted to come clean and admit and celebrate those influences, and hopefully create something as worthwhile as those classic bands\" said Reed. \"To do this, all I had to do was to give priority to melody rather than technical showmanship, something I have always tried to do with all my work.\" Revolutions was named \"Best New Album\" in 2001 by Musical Discoveries, an online resource for female vocalists in the music industry.\n\nMagenta's second album, Seven was released in March 2004 and sold out of its first pressing within four weeks. The band's first single, \"Broken\" was released in June 2004 - from the EP Broken. While shorter than any of the epic tracks on Seven, Broken retains the classic prog rock sound of Magenta, with a slightly more modern edge.\n\nIn November 2004, Magenta released the double live album Another Time, Another Place, recorded on tour in Europe from 2002-2004. The live concert DVD The Gathering was also released in late 2005 and a series of live shows followed.\n\nMagenta's third studio album, Home, was officially released on June 1, 2006. The album is a concept piece and tells the story of a woman who emigrates from Liverpool, England in the early 1970s to \"find herself\" in the USA. The CD is 68 minutes long and includes contributions from a variety of guests including Magenta regulars Martin Shellard on guitar alongside Troy Donockley (Iona, Mostly Autumn) on Uilleann Pipes and whistles. Once again, the album was written and produced by Rob Reed, with lyrics by Steve Reed. Musically, Home represents a further development for the band, combining the Magenta sound established on Revolutions, Seven and the two singles Broken and I’m Alive. The new album was released in two separate versions, the single disc Home and the double disc version featuring the New York Suite. The second disc contains four longer pieces of music which could not fit onto the single disc version. Home was later re-released as a double album, with the four tracks from the New York Suite inserted into the relevant position in the \"story\".\n\nMagenta: The Singles was released in summer 2007. The album features re-recorded versions of various singles and album tracks. Rob Reed explains, \"The first reason for doing the album was to get definitive versions of the songs recorded. We’d been playing some of the songs live for 3 years and we now had Dan on bass, and he’d brought his own character to the songs as they’d developed. Also, the original versions had been recorded quite quickly and we wanted to get high quality versions of the songs down, as we’d done with \"Speechless\". It was great to take a bit more time with them and record them properly. Also a lot of Prog fans don’t like buying singles, they’d much rather have the album format, and at 79 minutes we certainly have an album's worth of material. We can delete the singles now.\"\n\nIn addition, another DVD Live At The Point was recorded on the 23rd of November at The Point in Cardiff.\n\nOn 30 November 2007 it was announced that drummer Allan Mason-Jones had left the live version of the band. He was replaced in the live band by Keiran Bailey. On 11 December 2007 it was announced that rhythm guitarist Martin Rosser had also left the band to work with Dan Fry and Allan Mason-Jones on their new C-Sides project.\n\nTheir fourth album, entitled \"Metamorphosis\", was released to registered fans on March 23, 2008, with an accompanying DVD featuring footage of the recording process and a full 5.1 version of the album. (The official release date for these items was April 21.) Prior to its release, Reed said it was \"unlike what Magenta fans have heard up until now.\" The album contains just four tracks, two of which are longer than 20 minutes. The album has a much darker edge than previous Magenta albums.\n\nIn November 2009, Magenta performed an acoustic concert at Peter Gabriel's Real World Studios near Bath. The concert was notable for featuring a wind section, and the one-off return of Martin Rosser on rhythm guitar - Colin Edwards having recently departed the band. The concert Live At Real World was released as a double CD and DVD in September 2010.\n\nOn 4 March 2010, it was announced on the Magenta homepage that bassist Dan Fry had left the live band, to pursue his MLE project. This caused two shows in Holland set for May to be cancelled, and the band went on an extended hiatus while other projects were being worked on, such as Christina Booth's and Chris Fry's solo albums.\n\nMagenta returned to the live scene at the Summer's End Festival in October 2011, with Dan Nelson and Steve Roberts (from Godsticks) on bass and drums respectively.\n\nMagenta's fifth album, Chameleon, was released in November 2011. It features several shorter tracks but mostly with a hard edge, similar to the previous album Metamorphosis. At this time, Magenta's full members were confirmed to be Rob Reed, Christina Booth and Chris Fry, with other musicians brought in for studio recordings and live gigs. Kieran Bailey recorded drums on the album but no longer plays with the live version of the band.\nCurrent status\n\nMagenta remain active, with work continuing on the sixth album and some more gigs scheduled, including the inaugural Celebr8 festival in Kingston-upon-Thames in July 2012. The live band continues to be the three core members along with Godsticks' Dan Nelson and Steve Roberts.\n\nRob Reed's previous project, Cyan, is also taking to the stage for the first time to play at the Summer's End Festival in September 2012. The live band will feature the Magenta live line-up, but with Steffan Rhys Williams on lead vocals rather than Christina Booth.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "2001",
      "country": "Wales",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "2001",
      "gender": "Mixed",
      "genre": null,
      "id": "112447",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/rpuyvs1464750833.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/rsprtr1342342670.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "3",
      "mood": null,
      "music_videos": null,
      "musicbrainz_id": "ebcde1c3-2e18-42a8-ab9b-3f5f20c935f8",
      "name": "Magenta",
      "raw_data": {},
      "style": "Progressive Rock",
      "twitter": "1",
      "website": "www.magenta-web.co.uk/index2.html"
    }
  },
  "spotify_id": "0uT3lm3wY3LnyP6dtok0q4",
  "spotify_url": "https://open.spotify.com/artist/0uT3lm3wY3LnyP6dtok0q4",
  "updated_at": "2025-07-08T20:45:49.244752",
  "wikipedia_url": null
}