{
  "apple_music_id": "1443280326",
  "apple_music_url": "https://music.apple.com/gb/album/the-italian-job-original-soundtrack/1443280326",
  "artists": [
    {
      "apple_music_id": "49436",
      "biography": "Quincy Delight Jones Jr. (March 14, 1933 – November 3, 2024) was an American record producer, songwriter, composer, arranger, and film and television producer. His career spanned over 70 years, with 28 Grammy Awards won out of 80 nominations, and a Grammy Legend Award in 1992. \n\nJones came to prominence in the 1950s as a jazz arranger and conductor before working on pop music and film scores. He moved easily between genres, producing pop hit records for Lesley Gore in the early 1960s (including \"It's My Party\") and serving as an arranger and conductor for several collaborations between the jazz artists Frank Sinatra and Count Basie. In 1968, Jones became the first African American to be nominated for an Academy Award for Best Original Song for \"The Eyes of Love\" from the film Banning. Jones was also nominated for an Academy Award for Best Original Score for his work on the 1967 film In Cold Blood, making him the first African American to be nominated twice in the same year. Jones produced three of the most successful albums by pop star Michael Jackson: Off the Wall (1979), Thriller (1982), and Bad (1987). In 1985, Jones produced and conducted the charity song \"We Are the World\", which raised funds for victims of famine in Ethiopia.\n\nIn 1971, Jones became the first African American to be the musical director and conductor of the Academy Awards. In 1995, he was the first African American to receive the academy's Jean Hersholt Humanitarian Award. He is tied with sound designer Willie D. Burton as the second most Oscar-nominated African American, with seven nominations each. In 2013, Jones was inducted into the Rock & Roll Hall of Fame in the Ahmet Ertegun Award category. He was named one of the most influential jazz musicians of the 20th century by Time.\n\nEarly life\nQuincy Delight Jones Jr. was born in the South Side of Chicago, Illinois on March 14, 1933, the elder of two sons to Sarah Frances (née Wells; died 1999), a bank officer and apartment complex manager, and Quincy Delight Jones, a semi-professional baseball player and carpenter from Kentucky. Jones's paternal grandmother was an ex-slave from Louisville, and Jones later discovered that his paternal grandfather was Welsh. With the help of the author Alex Haley in 1972 and Latter-day Saint researchers in Salt Lake City, Jones discovered that one of his mother's ancestors was James Lanier, a relative of poet Sidney Lanier. Jones said, \"He had a baby with my great-grandmother (a slave), and my grandmother was born there (on a plantation in Kentucky). We traced this all the way back to the Laniers, the same family as Tennessee Williams.\" Learning that the Lanier immigrant ancestors were French Huguenots who had court musicians among their ancestors, Jones attributed some of his musicianship to them.\n\nFor the 2006 PBS television program African American Lives, Jones had his DNA tested, and genealogists researched his family history again. His DNA revealed he is mostly African, but also has 34% European ancestry on both sides of his family. Research showed that he has English, French, Italian, and Welsh ancestry through his father. His mother's side is of West and Central African descent, specifically the Tikar people of Cameroon. His mother also had European ancestry, including Lanier male ancestors who fought for the Confederacy, making him eligible for membership in the Sons of Confederate Veterans. Among his ancestors is Elizabeth Washington Lewis, a sister of president George Washington.\n\nJones's family moved to Chicago during the Great Migration. Jones had a younger brother, Lloyd, who was an engineer for the Seattle television station KOMO-TV until his death in 1998. Jones was introduced to music by his mother, who always sang religious songs, and next-door neighbor Lucy Jackson. When Jones was five or six, Jackson played stride piano next door, and he would listen through the walls. Jackson recalled that after he heard her one-day, she could not get him off her piano.\n\nWhen Jones was young, his mother had a schizophrenic breakdown and was sent to a mental institution. His father divorced her and married Elvera Jones, who already had three children of her own: Waymond, Theresa, and Katherine. Elvera and Quincy Sr. later had three children together: Jeanette, Margie, and Richard. In 1943, the family moved to Bremerton, Washington, Jones's father took a wartime job at the Puget Sound Naval Shipyard. After the war, the family moved to Seattle, where Jones attended Garfield High School and developed his skills as a trumpeter and arranger. His classmates included Charles Taylor, who played saxophone and whose mother, Evelyn Bundy, was one of Seattle's first society jazz bandleaders. Jones and Taylor began playing music together, and at the age of fourteen, they played with a National Reserve band. Jones said he acquired more experience with music growing up in a smaller city due to the lack of competition.\n\nAt age 14, Jones introduced himself to 16-year-old Ray Charles after watching him play at the Black Elks Club.\n\nJones cited Ray Charles as an early inspiration for his own music career, noting that Charles overcame his blindness to achieve his musical goals. Jones credited his father's sturdy work ethic with giving him the means to proceed, and his loving nature with holding the family together. Jones cited his father's rhyming motto: \"Once a task is just begun, never leave until it's done. Be the labor great or small, do it well or not at all.\"\n\nIn 1951, Jones earned a scholarship to Seattle University. After one semester, he transferred to what is now the Berklee College of Music in Boston on another scholarship. There, he played at Izzy Ort's Bar & Grille with Bunny Campbell and Preston Sandiford, whom he cited as important influences. He left his studies after receiving an offer to tour as a trumpeter, arranger, and pianist with bandleader Lionel Hampton and embarked on his professional career. On the road with Hampton, he displayed a gift for arranging songs. He moved to New York City, where he received freelance commissions writing arrangements for Charles, who was by then a close friend, and for Sarah Vaughan, Dinah Washington, Count Basie, Duke Ellington, and Gene Krupa.\n\nMusic career\nIn 1953, aged 20, Jones traveled with jazz bandleader Lionel Hampton for a European tour of the Hampton orchestra. He said the tour changed his view of racism in the United States:\n\"It gave you some sense of perspective on past, present, and future. It took the myopic conflict between just black and white in the United States and put it on another level because you saw the turmoil between the Armenians and the Turks, and the Cypriots and the Greeks, and the Swedes and the Danes, and the Koreans and the Japanese. Everybody had these hassles, and you saw it was a basic part of human nature, these conflicts. It opened my soul; it opened my mind.\"\n\nIn early 1956, Jones accepted a temporary job at CBS' Stage Show hosted by Jimmy and Tommy Dorsey that was broadcast live from Studio 50 in New York City (known today as the Ed Sullivan Theater). On January 28, February 4, 11 and 18, as well as on March 17 and 24, Jones played second trumpet in the studio band that supported 21-year-old Elvis Presley in his first six television appearances. Presley sang \"Heartbreak Hotel\", which became his first No. 1 record and the Billboard magazine Pop Record of the year. Soon after, as a trumpeter and musical director for Dizzy Gillespie, Jones went on tour of the Middle East and South America sponsored by the United States Information Agency. After returning, he signed a contract with ABC-Paramount and started his recording career as the leader of his band. In 1957, he moved to Paris, where he studied composition and theory with Nadia Boulanger and Olivier Messiaen and performed at the Paris Olympia. He became music director at Barclay, a French record company and the licensee for Mercury in France.\n\nDuring the 1950s, Jones toured Europe with several jazz orchestras. As musical director of Harold Arlen's jazz musical Free and Easy, he took to the road again. A European tour closed in Paris in February 1960. With musicians from the Arlen show, he formed his big band the Jones Boys with eighteen musicians. The band included double bass player Eddie Jones and trumpeter Reunald Jones (none of the three were related). The band toured North America and Europe, and the concerts met enthusiastic audiences and sparkling reviews, but the earnings failed to support a band of this size. Poor budget planning resulted in an economic disaster; the band dissolved, leaving Jones in a financial crisis.\n\n\"We had the best jazz band on the planet, and yet we were literally starving. That's when I discovered that there was music, and there was the music business. If I were to survive, I would have to learn the difference between the two.\"\n\nIrving Green, head of Mercury, helped Jones with a personal loan and a job as musical director of the company's New York division. He worked with Doug Moody, founder of Mystic Records.\n\nBreakthrough and rise\nIn 1961, Jones was promoted as the vice-president of Mercury, becoming the first African American to hold the position. During the same year, at the invitation of director Sidney Lumet, he composed music for The Pawnbroker (1964). It was the first of his nearly 40 major motion picture scores. Following the success of The Pawnbroker, Jones left Mercury and moved to Los Angeles. After composing film scores for Mirage and The Slender Thread in 1965, he was in constant demand as a composer. His film credits over the next seven years included Walk, Don't Run, The Deadly Affair, In Cold Blood, In the Heat of the Night, Mackenna's Gold, The Italian Job, Bob & Carol & Ted & Alice, Cactus Flower, The Out-of-Towners, They Call Me Mister Tibbs!, The Anderson Tapes, $ (Dollars), and The Getaway. In addition, he composed \"The Streetbeater\", which became the theme music for the television sitcom Sanford and Son, starring his close friend Redd Foxx, and the themes for other TV shows, including Ironside, Rebop, Banacek, The Bill Cosby Show, the opening episode of Roots, Mad TV, and the game show Now You See It.\n\nIn the 1960s, Jones worked as an arranger for Billy Eckstine, Ella Fitzgerald, Shirley Horn, Peggy Lee, Nana Mouskouri, Frank Sinatra, Sarah Vaughan, and Dinah Washington. His solo recordings included Walking in Space, Gula Matari, Smackwater Jack, You've Got It Bad Girl, Body Heat, Mellow Madness, and I Heard That!!\n\nJones's 1962 tune \"Soul Bossa Nova\", which originated on the Big Band Bossa Nova album, was used as the theme for the 1997 spy comedy Austin Powers: International Man of Mystery.\n\nJones produced all four million-selling singles for Lesley Gore during the early and mid-sixties, including \"It's My Party\" (UK No. 8; US No. 1), its sequel \"Judy's Turn to Cry\" (US No. 5), \"She's a Fool\" (also a US No. 5) in 1963, and \"You Don't Own Me\" (US No. 2 for four weeks in 1964). He continued to produce for Gore until 1966, including the Greenwich/Barry hits \"Look of Love\" (US No. 27 in 1965) and \"Maybe I Know\" (UK No. 20; US No. 14 in 1964).\n\nIn 1975, Jones founded Qwest Productions, for which he arranged and produced successful albums by Frank Sinatra and others. In 1978, he produced the soundtrack for The Wiz, the musical adaptation of The Wizard of Oz, which starred Michael Jackson and Diana Ross. In 1982, he produced Jackson's Thriller, the bestselling album in history of the music industry.\n\nHis 1981 album The Dude yielded the hits \"Ai No Corrida\" (a remake of a song by Chaz Jankel), \"Just Once\", and \"One Hundred Ways\", both sung by James Ingram.\n\nMarking Jones's debut as a film producer, 1985's The Color Purple received 11 Oscar nominations that year, including one for Jones's score. Jones, Thomas Newman, and Alan Silvestri are the only composers besides John Williams to have written scores for a Steven Spielberg-directed theatrical feature film. Additionally, through this picture, Jones is credited with introducing Whoopi Goldberg and Oprah Winfrey to film audiences around the world.\n\nAfter the 1985 American Music Awards ceremony, Jones used his influence to draw most of the major American recording artists of the day into a studio to record the song \"We Are the World\" to raise money for the victims of famine in Ethiopia. When people marveled at his ability to make the collaboration work, Jones explained that he had taped a sign on the entrance reading \"Check Your Ego at the Door\". He was also quoted as saying, \"We don't want to make a hunger record in tuxedos\", requiring all participants to wear casual clothing in the studio. In 1986, he started off Qwest Entertainment to produce theatrical feature films, through Qwest Film and Television, and launched a home video label, Qwest Home Video, in order to manage the home video titles made by the studio, and Qwest Entertainment would continue to operate their pre-existing subsidiaries like Qwest Records, Quincy Jones Productions and Qwest Music Publishing.\n\nIn 1990, Quincy Jones Productions joined with Time Warner to create Quincy Jones Entertainment (QJE). The company signed a 10-picture deal with Warner Bros. and a two-series deal with NBC Productions (now Universal Television). The television show The Fresh Prince of Bel-Air was completed in 1990, but producers of In the House (from UPN) rejected its early concept stages. Jones produced the successful The Fresh Prince of Bel-Air (discovering Will Smith), UPN's In the House, First-Run Syndication's The Jenny Jones Show (in association with Telepictures Productions, 1994–1997 only) and FOX's Madtv – which ran for 14 seasons. In the early 1990s, he started a huge, ongoing project called \"The Evolution of Black Music\". QJE started a weekly talk show with Jones's friend, Reverend Jesse Jackson, as the host.\n\nBeginning in the late 1970s, Jones tried to convince Miles Davis to revive the music he recorded on several classic albums of the 1950s, which was arranged by Gil Evans. Davis always refused, citing a desire to avoid revisiting the past. But in 1991, Davis relented. Despite having pneumonia, he agreed to perform the music at the Montreux Jazz Festival. The recording, Miles & Quincy Live at Montreux, was his last album; he died several months afterward.\n\nIn 1993, Jones collaborated with David Salzman to produce the concert An American Reunion, a celebration of Bill Clinton's inauguration as President of the United States. During the same year, he and Salzman renamed his company to Quincy Jones/David Salzman Entertainment.\n\nIn 2001, Jones published his autobiography Q: The Autobiography of Quincy Jones. On July 31, 2007, he partnered with Wizzard Media to start the Quincy Jones Video Podcast. In each episode, he shares his knowledge and experience in the music industry. The first episode features him in the studio producing \"I Knew I Loved You\" for Celine Dion. This is included on the Ennio Morricone tribute album We All Love Ennio Morricone.\n\nJones helped produce Anita Hall's 2009 album Send Love. In 2013, he produced Emily Bear's album Diversity. After that, he produced albums for Grace, Justin Kauflin, Alfredo Rodríguez, Andreas Varady, and Nikki Yanofsky. He also became a mentor to Jacob Collier.\n\nIn 2010, Jones, along with brand strategist Chris Vance, co-founded Playground Sessions, a NY City-based developer of subscription software that teaches people to play the piano using interactive videos. Pianists Harry Connick Jr. and David Sides are among the company's video instructors. Jones worked with Vance and Sides to develop the video lessons and incorporate techniques to modernize the instruction format.\n\nIn 2017, Jones and French producer Reza Ackbaraly started Qwest TV, the world's first subscription video-on-demand (SVOD) service for jazz and eclectic music from around the world. The platform features a handpicked selection of ad-free concerts, interviews, documentaries, and exclusive, original content, all in HD or 4K.\n\nWork with Frank Sinatra\nQuincy Jones first worked with Frank Sinatra in 1958 when invited by Princess Grace to arrange a benefit concert at the Monaco Sporting Club. Six years later, Sinatra hired him to arrange and conduct Sinatra's second album with Count Basie, It Might as Well Be Swing (1964). Jones conducted and arranged Sinatra's live album with the Basie Band, Sinatra at the Sands (1966). Jones was also the arranger/conductor when Sinatra, Sammy Davis Jr., Dean Martin, and Johnny Carson performed with the Basie orchestra in June 1965 in St. Louis, Missouri, in a benefit for Dismas House. The fund-raiser was broadcast to movie theaters around the country and eventually released on VHS. Later that year, Jones was the arranger/conductor when Sinatra and Basie appeared on The Hollywood Palace TV show on October 16, 1965. Nineteen years later, Sinatra and Jones teamed up for 1984's L.A. Is My Lady. Jones said:\n\"Frank Sinatra took me to a whole new planet. I worked with him until he passed away in '98. He left me his ring. I never take it off. Now, when I go to Sicily, I don't need a passport. I just flash my ring.\"\n\nWork with Michael Jackson\nWhile working on the film The Wiz, Michael Jackson asked Jones to recommend some producers for his upcoming solo album. Jones offered some names but eventually offered to produce the record himself. Jackson accepted and the resulting record, Off the Wall, sold about 20 million copies. This made Jones the most powerful record producer in the industry at that time. Jones and Jackson's next collaboration, Thriller, sold 65 million copies and became the highest-selling album of all time. The rise of MTV and the advent of music videos as promotional tools also contributed to Thriller's sales. Jones worked on Jackson's album Bad, which sold 45 million copies, and was the last time they worked with each other. Audio interviews with Jones are included in the 2001 special editions of Off the Wall, Thriller, and Bad.\n\nIn a 2002 interview, when asked if he would work with Jones again, Jackson suggested he might. But in 2007, when Jones was asked by NME, he said, \"Man, please! We already did that. I have talked to him about working with him again but I've got too much to do. I've got 900 products, I'm 74 years old.\"\n\nFollowing Jackson's death on June 25, 2009, Jones said:\n\"I am absolutely devastated at this tragic and unexpected news. For Michael to be taken away from us so suddenly at such a young age, I just don't have the words. Divinity brought our souls together on The Wiz and allowed us to do what we were able to throughout the '80s. To this day, the music we created together on Off the Wall, Thriller and Bad is played in every corner of the world, and the reason for that is because he had it all ... talent, grace, professionalism, and dedication. He was the consummate entertainer, and his contributions and legacy will be felt upon the world forever. I've lost my little brother today, and part of my soul has gone with him.\"\n\nIn October 2013, the BBC and The Hollywood Reporter said Jones planned to sue Michael Jackson's estate for $10 million. Jones said that MJJ Productions, a song company managed by Jackson's estate and Sony Music Entertainment, improperly re-edited songs to deprive him of royalties and production fees and breached an agreement giving him the right to remix master recordings for albums released after Jackson's death. The songs Jones produced for Jackson were used in the film This Is It. Jones was reported to be filing the suits against the Michael Jackson Cirque du Soleil shows and the 25th-anniversary edition of the Bad album. He believed he should have received a producer credit in the film.\n\nBrazilian and other culture\nThe Brazilian singer Simone, whom Jones cites as \"one of the world's greatest singers\"; Brazilian musicians Ivan Lins and Milton Nascimento; and percussionist Paulinho da Costa, who Jones called \"one of the best in the business\", have become close friends and partners in his recent works.\n\nThe famous Japanese composer Mamoru Fujisawa, known as 'Joe Hisaishi,' formulated his last name as an alias inspired by American musician and composer Quincy Jones; 'Hisaishi' being the kanji equivalent of 'Quincy.'\n\nMedia appearances\nJones had a brief appearance in the 1990 video for the Time song \"Jerk Out\", and was a guest actor on an episode of The Boondocks. He appeared with Ray Charles in the music video of their song \"One Mint Julep\" and also with Ray Charles and Chaka Khan in the music video of their song \"I'll Be Good to You\". Jones hosted an episode of the long-running NBC sketch comedy show Saturday Night Live on February 10, 1990 (during SNL's 15th season). The episode was notable for having 10 musical guests (the most any SNL episode has had in its 40 plus years on the air): Tevin Campbell, Andrae Crouch, Sandra Crouch, rappers Kool Moe Dee and Big Daddy Kane, Melle Mel, Quincy D III, Siedah Garrett, Al Jarreau, and Take 6, and for a performance of Dizzy Gillespie's \"Manteca\" by the SNL Band (conducted by Quincy Jones). Jones impersonated Marion Barry, the former mayor of Washington, D.C., in the recurring sketch The Bob Waltman Special. He later produced his own sketch comedy show, FOX's MADtv, which ran from 1995 to 2009.\n\nJones appeared in the 1999 Walt Disney Pictures animated film Fantasia 2000, introducing the set piece of George Gershwin's Rhapsody in Blue. Two years later, he made a cameo appearance as himself in the film Austin Powers in Goldmember. On February 10, 2008, Jones joined Usher in presenting the Grammy Award for Album of the Year to Herbie Hancock. On January 6, 2009, he appeared on NBC's Last Call with Carson Daly to discuss his career. Daly informally floated the idea that Jones should become the first minister of culture for the United States, pending the inauguration of Barack Obama as president. Daly noted that only the US and Germany, among leading world countries, did not have a cabinet-level position for this role. Commentators on NPR and in the Chronicle of Higher Education have also discussed the topic of a minister of culture.\n\nIn February 2014, Jones appeared in Keep on Keepin' On, a documentary about his friend, jazz trumpeter and flugelhorn player Clark Terry. In the film, Terry introduces Jones to his protégé Justin Kauflin, whom Jones then signs to his band and label. In July 2014, Jones starred in a documentary film called The Distortion of Sound. In September 2015, he was a guest on Dr. Dre's The Pharmacy on Beats 1 Radio. He was also featured on Jacob Collier's YouTube cover of Michael Jackson's \"PYT (Pretty Young Thing)\". On February 28, 2016, he and Pharrell Williams presented Ennio Morricone with the Oscar for best film score. and in August 2016, he and his music were featured at BBC Proms in Royal Albert Hall, London.\n\nOn March 20, 2020, Jones guest starred on a music video by Travis Scott and Young Thug for the song \"Out West\". Jones makes and consumes a sandwich during the course of the video.\n\nIn January 2022, Jones appeared on the album Dawn FM by Canadian singer the Weeknd, performing a monologue in the sixth track, \"A Tale by Quincy\".\n\nDeath\nJones died on November 3, 2024 at his home in Bel-Air, Los Angeles at the age of 91. <a href=\"https://www.last.fm/music/Quincy+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "17546",
      "discogs_original_name": "Quincy Jones",
      "id": null,
      "lastfm_mbid": "5803c81e-739a-4057-9a5c-cf84e55db630",
      "name": "Quincy Jones",
      "role": "",
      "spotify_id": "3rxIQc9kWT6Ueg4BhnOwRK",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Quincy Jones": {
      "biography": "Quincy Delight Jones Jr. (March 14, 1933 – November 3, 2024) was an American record producer, songwriter, composer, arranger, and film and television producer. His career spanned over 70 years, with 28 Grammy Awards won out of 80 nominations, and a Grammy Legend Award in 1992. \n\nJones came to prominence in the 1950s as a jazz arranger and conductor before working on pop music and film scores. He moved easily between genres, producing pop hit records for Lesley Gore in the early 1960s (including \"It's My Party\") and serving as an arranger and conductor for several collaborations between the jazz artists Frank Sinatra and Count Basie. In 1968, Jones became the first African American to be nominated for an Academy Award for Best Original Song for \"The Eyes of Love\" from the film Banning. Jones was also nominated for an Academy Award for Best Original Score for his work on the 1967 film In Cold Blood, making him the first African American to be nominated twice in the same year. Jones produced three of the most successful albums by pop star Michael Jackson: Off the Wall (1979), Thriller (1982), and Bad (1987). In 1985, Jones produced and conducted the charity song \"We Are the World\", which raised funds for victims of famine in Ethiopia.\n\nIn 1971, Jones became the first African American to be the musical director and conductor of the Academy Awards. In 1995, he was the first African American to receive the academy's Jean Hersholt Humanitarian Award. He is tied with sound designer Willie D. Burton as the second most Oscar-nominated African American, with seven nominations each. In 2013, Jones was inducted into the Rock & Roll Hall of Fame in the Ahmet Ertegun Award category. He was named one of the most influential jazz musicians of the 20th century by Time.\n\nEarly life\nQuincy Delight Jones Jr. was born in the South Side of Chicago, Illinois on March 14, 1933, the elder of two sons to Sarah Frances (née Wells; died 1999), a bank officer and apartment complex manager, and Quincy Delight Jones, a semi-professional baseball player and carpenter from Kentucky. Jones's paternal grandmother was an ex-slave from Louisville, and Jones later discovered that his paternal grandfather was Welsh. With the help of the author Alex Haley in 1972 and Latter-day Saint researchers in Salt Lake City, Jones discovered that one of his mother's ancestors was James Lanier, a relative of poet Sidney Lanier. Jones said, \"He had a baby with my great-grandmother (a slave), and my grandmother was born there (on a plantation in Kentucky). We traced this all the way back to the Laniers, the same family as Tennessee Williams.\" Learning that the Lanier immigrant ancestors were French Huguenots who had court musicians among their ancestors, Jones attributed some of his musicianship to them.\n\nFor the 2006 PBS television program African American Lives, Jones had his DNA tested, and genealogists researched his family history again. His DNA revealed he is mostly African, but also has 34% European ancestry on both sides of his family. Research showed that he has English, French, Italian, and Welsh ancestry through his father. His mother's side is of West and Central African descent, specifically the Tikar people of Cameroon. His mother also had European ancestry, including Lanier male ancestors who fought for the Confederacy, making him eligible for membership in the Sons of Confederate Veterans. Among his ancestors is Elizabeth Washington Lewis, a sister of president George Washington.\n\nJones's family moved to Chicago during the Great Migration. Jones had a younger brother, Lloyd, who was an engineer for the Seattle television station KOMO-TV until his death in 1998. Jones was introduced to music by his mother, who always sang religious songs, and next-door neighbor Lucy Jackson. When Jones was five or six, Jackson played stride piano next door, and he would listen through the walls. Jackson recalled that after he heard her one-day, she could not get him off her piano.\n\nWhen Jones was young, his mother had a schizophrenic breakdown and was sent to a mental institution. His father divorced her and married Elvera Jones, who already had three children of her own: Waymond, Theresa, and Katherine. Elvera and Quincy Sr. later had three children together: Jeanette, Margie, and Richard. In 1943, the family moved to Bremerton, Washington, Jones's father took a wartime job at the Puget Sound Naval Shipyard. After the war, the family moved to Seattle, where Jones attended Garfield High School and developed his skills as a trumpeter and arranger. His classmates included Charles Taylor, who played saxophone and whose mother, Evelyn Bundy, was one of Seattle's first society jazz bandleaders. Jones and Taylor began playing music together, and at the age of fourteen, they played with a National Reserve band. Jones said he acquired more experience with music growing up in a smaller city due to the lack of competition.\n\nAt age 14, Jones introduced himself to 16-year-old Ray Charles after watching him play at the Black Elks Club.\n\nJones cited Ray Charles as an early inspiration for his own music career, noting that Charles overcame his blindness to achieve his musical goals. Jones credited his father's sturdy work ethic with giving him the means to proceed, and his loving nature with holding the family together. Jones cited his father's rhyming motto: \"Once a task is just begun, never leave until it's done. Be the labor great or small, do it well or not at all.\"\n\nIn 1951, Jones earned a scholarship to Seattle University. After one semester, he transferred to what is now the Berklee College of Music in Boston on another scholarship. There, he played at Izzy Ort's Bar & Grille with Bunny Campbell and Preston Sandiford, whom he cited as important influences. He left his studies after receiving an offer to tour as a trumpeter, arranger, and pianist with bandleader Lionel Hampton and embarked on his professional career. On the road with Hampton, he displayed a gift for arranging songs. He moved to New York City, where he received freelance commissions writing arrangements for Charles, who was by then a close friend, and for Sarah Vaughan, Dinah Washington, Count Basie, Duke Ellington, and Gene Krupa.\n\nMusic career\nIn 1953, aged 20, Jones traveled with jazz bandleader Lionel Hampton for a European tour of the Hampton orchestra. He said the tour changed his view of racism in the United States:\n\"It gave you some sense of perspective on past, present, and future. It took the myopic conflict between just black and white in the United States and put it on another level because you saw the turmoil between the Armenians and the Turks, and the Cypriots and the Greeks, and the Swedes and the Danes, and the Koreans and the Japanese. Everybody had these hassles, and you saw it was a basic part of human nature, these conflicts. It opened my soul; it opened my mind.\"\n\nIn early 1956, Jones accepted a temporary job at CBS' Stage Show hosted by Jimmy and Tommy Dorsey that was broadcast live from Studio 50 in New York City (known today as the Ed Sullivan Theater). On January 28, February 4, 11 and 18, as well as on March 17 and 24, Jones played second trumpet in the studio band that supported 21-year-old Elvis Presley in his first six television appearances. Presley sang \"Heartbreak Hotel\", which became his first No. 1 record and the Billboard magazine Pop Record of the year. Soon after, as a trumpeter and musical director for Dizzy Gillespie, Jones went on tour of the Middle East and South America sponsored by the United States Information Agency. After returning, he signed a contract with ABC-Paramount and started his recording career as the leader of his band. In 1957, he moved to Paris, where he studied composition and theory with Nadia Boulanger and Olivier Messiaen and performed at the Paris Olympia. He became music director at Barclay, a French record company and the licensee for Mercury in France.\n\nDuring the 1950s, Jones toured Europe with several jazz orchestras. As musical director of Harold Arlen's jazz musical Free and Easy, he took to the road again. A European tour closed in Paris in February 1960. With musicians from the Arlen show, he formed his big band the Jones Boys with eighteen musicians. The band included double bass player Eddie Jones and trumpeter Reunald Jones (none of the three were related). The band toured North America and Europe, and the concerts met enthusiastic audiences and sparkling reviews, but the earnings failed to support a band of this size. Poor budget planning resulted in an economic disaster; the band dissolved, leaving Jones in a financial crisis.\n\n\"We had the best jazz band on the planet, and yet we were literally starving. That's when I discovered that there was music, and there was the music business. If I were to survive, I would have to learn the difference between the two.\"\n\nIrving Green, head of Mercury, helped Jones with a personal loan and a job as musical director of the company's New York division. He worked with Doug Moody, founder of Mystic Records.\n\nBreakthrough and rise\nIn 1961, Jones was promoted as the vice-president of Mercury, becoming the first African American to hold the position. During the same year, at the invitation of director Sidney Lumet, he composed music for The Pawnbroker (1964). It was the first of his nearly 40 major motion picture scores. Following the success of The Pawnbroker, Jones left Mercury and moved to Los Angeles. After composing film scores for Mirage and The Slender Thread in 1965, he was in constant demand as a composer. His film credits over the next seven years included Walk, Don't Run, The Deadly Affair, In Cold Blood, In the Heat of the Night, Mackenna's Gold, The Italian Job, Bob & Carol & Ted & Alice, Cactus Flower, The Out-of-Towners, They Call Me Mister Tibbs!, The Anderson Tapes, $ (Dollars), and The Getaway. In addition, he composed \"The Streetbeater\", which became the theme music for the television sitcom Sanford and Son, starring his close friend Redd Foxx, and the themes for other TV shows, including Ironside, Rebop, Banacek, The Bill Cosby Show, the opening episode of Roots, Mad TV, and the game show Now You See It.\n\nIn the 1960s, Jones worked as an arranger for Billy Eckstine, Ella Fitzgerald, Shirley Horn, Peggy Lee, Nana Mouskouri, Frank Sinatra, Sarah Vaughan, and Dinah Washington. His solo recordings included Walking in Space, Gula Matari, Smackwater Jack, You've Got It Bad Girl, Body Heat, Mellow Madness, and I Heard That!!\n\nJones's 1962 tune \"Soul Bossa Nova\", which originated on the Big Band Bossa Nova album, was used as the theme for the 1997 spy comedy Austin Powers: International Man of Mystery.\n\nJones produced all four million-selling singles for Lesley Gore during the early and mid-sixties, including \"It's My Party\" (UK No. 8; US No. 1), its sequel \"Judy's Turn to Cry\" (US No. 5), \"She's a Fool\" (also a US No. 5) in 1963, and \"You Don't Own Me\" (US No. 2 for four weeks in 1964). He continued to produce for Gore until 1966, including the Greenwich/Barry hits \"Look of Love\" (US No. 27 in 1965) and \"Maybe I Know\" (UK No. 20; US No. 14 in 1964).\n\nIn 1975, Jones founded Qwest Productions, for which he arranged and produced successful albums by Frank Sinatra and others. In 1978, he produced the soundtrack for The Wiz, the musical adaptation of The Wizard of Oz, which starred Michael Jackson and Diana Ross. In 1982, he produced Jackson's Thriller, the bestselling album in history of the music industry.\n\nHis 1981 album The Dude yielded the hits \"Ai No Corrida\" (a remake of a song by Chaz Jankel), \"Just Once\", and \"One Hundred Ways\", both sung by James Ingram.\n\nMarking Jones's debut as a film producer, 1985's The Color Purple received 11 Oscar nominations that year, including one for Jones's score. Jones, Thomas Newman, and Alan Silvestri are the only composers besides John Williams to have written scores for a Steven Spielberg-directed theatrical feature film. Additionally, through this picture, Jones is credited with introducing Whoopi Goldberg and Oprah Winfrey to film audiences around the world.\n\nAfter the 1985 American Music Awards ceremony, Jones used his influence to draw most of the major American recording artists of the day into a studio to record the song \"We Are the World\" to raise money for the victims of famine in Ethiopia. When people marveled at his ability to make the collaboration work, Jones explained that he had taped a sign on the entrance reading \"Check Your Ego at the Door\". He was also quoted as saying, \"We don't want to make a hunger record in tuxedos\", requiring all participants to wear casual clothing in the studio. In 1986, he started off Qwest Entertainment to produce theatrical feature films, through Qwest Film and Television, and launched a home video label, Qwest Home Video, in order to manage the home video titles made by the studio, and Qwest Entertainment would continue to operate their pre-existing subsidiaries like Qwest Records, Quincy Jones Productions and Qwest Music Publishing.\n\nIn 1990, Quincy Jones Productions joined with Time Warner to create Quincy Jones Entertainment (QJE). The company signed a 10-picture deal with Warner Bros. and a two-series deal with NBC Productions (now Universal Television). The television show The Fresh Prince of Bel-Air was completed in 1990, but producers of In the House (from UPN) rejected its early concept stages. Jones produced the successful The Fresh Prince of Bel-Air (discovering Will Smith), UPN's In the House, First-Run Syndication's The Jenny Jones Show (in association with Telepictures Productions, 1994–1997 only) and FOX's Madtv – which ran for 14 seasons. In the early 1990s, he started a huge, ongoing project called \"The Evolution of Black Music\". QJE started a weekly talk show with Jones's friend, Reverend Jesse Jackson, as the host.\n\nBeginning in the late 1970s, Jones tried to convince Miles Davis to revive the music he recorded on several classic albums of the 1950s, which was arranged by Gil Evans. Davis always refused, citing a desire to avoid revisiting the past. But in 1991, Davis relented. Despite having pneumonia, he agreed to perform the music at the Montreux Jazz Festival. The recording, Miles & Quincy Live at Montreux, was his last album; he died several months afterward.\n\nIn 1993, Jones collaborated with David Salzman to produce the concert An American Reunion, a celebration of Bill Clinton's inauguration as President of the United States. During the same year, he and Salzman renamed his company to Quincy Jones/David Salzman Entertainment.\n\nIn 2001, Jones published his autobiography Q: The Autobiography of Quincy Jones. On July 31, 2007, he partnered with Wizzard Media to start the Quincy Jones Video Podcast. In each episode, he shares his knowledge and experience in the music industry. The first episode features him in the studio producing \"I Knew I Loved You\" for Celine Dion. This is included on the Ennio Morricone tribute album We All Love Ennio Morricone.\n\nJones helped produce Anita Hall's 2009 album Send Love. In 2013, he produced Emily Bear's album Diversity. After that, he produced albums for Grace, Justin Kauflin, Alfredo Rodríguez, Andreas Varady, and Nikki Yanofsky. He also became a mentor to Jacob Collier.\n\nIn 2010, Jones, along with brand strategist Chris Vance, co-founded Playground Sessions, a NY City-based developer of subscription software that teaches people to play the piano using interactive videos. Pianists Harry Connick Jr. and David Sides are among the company's video instructors. Jones worked with Vance and Sides to develop the video lessons and incorporate techniques to modernize the instruction format.\n\nIn 2017, Jones and French producer Reza Ackbaraly started Qwest TV, the world's first subscription video-on-demand (SVOD) service for jazz and eclectic music from around the world. The platform features a handpicked selection of ad-free concerts, interviews, documentaries, and exclusive, original content, all in HD or 4K.\n\nWork with Frank Sinatra\nQuincy Jones first worked with Frank Sinatra in 1958 when invited by Princess Grace to arrange a benefit concert at the Monaco Sporting Club. Six years later, Sinatra hired him to arrange and conduct Sinatra's second album with Count Basie, It Might as Well Be Swing (1964). Jones conducted and arranged Sinatra's live album with the Basie Band, Sinatra at the Sands (1966). Jones was also the arranger/conductor when Sinatra, Sammy Davis Jr., Dean Martin, and Johnny Carson performed with the Basie orchestra in June 1965 in St. Louis, Missouri, in a benefit for Dismas House. The fund-raiser was broadcast to movie theaters around the country and eventually released on VHS. Later that year, Jones was the arranger/conductor when Sinatra and Basie appeared on The Hollywood Palace TV show on October 16, 1965. Nineteen years later, Sinatra and Jones teamed up for 1984's L.A. Is My Lady. Jones said:\n\"Frank Sinatra took me to a whole new planet. I worked with him until he passed away in '98. He left me his ring. I never take it off. Now, when I go to Sicily, I don't need a passport. I just flash my ring.\"\n\nWork with Michael Jackson\nWhile working on the film The Wiz, Michael Jackson asked Jones to recommend some producers for his upcoming solo album. Jones offered some names but eventually offered to produce the record himself. Jackson accepted and the resulting record, Off the Wall, sold about 20 million copies. This made Jones the most powerful record producer in the industry at that time. Jones and Jackson's next collaboration, Thriller, sold 65 million copies and became the highest-selling album of all time. The rise of MTV and the advent of music videos as promotional tools also contributed to Thriller's sales. Jones worked on Jackson's album Bad, which sold 45 million copies, and was the last time they worked with each other. Audio interviews with Jones are included in the 2001 special editions of Off the Wall, Thriller, and Bad.\n\nIn a 2002 interview, when asked if he would work with Jones again, Jackson suggested he might. But in 2007, when Jones was asked by NME, he said, \"Man, please! We already did that. I have talked to him about working with him again but I've got too much to do. I've got 900 products, I'm 74 years old.\"\n\nFollowing Jackson's death on June 25, 2009, Jones said:\n\"I am absolutely devastated at this tragic and unexpected news. For Michael to be taken away from us so suddenly at such a young age, I just don't have the words. Divinity brought our souls together on The Wiz and allowed us to do what we were able to throughout the '80s. To this day, the music we created together on Off the Wall, Thriller and Bad is played in every corner of the world, and the reason for that is because he had it all ... talent, grace, professionalism, and dedication. He was the consummate entertainer, and his contributions and legacy will be felt upon the world forever. I've lost my little brother today, and part of my soul has gone with him.\"\n\nIn October 2013, the BBC and The Hollywood Reporter said Jones planned to sue Michael Jackson's estate for $10 million. Jones said that MJJ Productions, a song company managed by Jackson's estate and Sony Music Entertainment, improperly re-edited songs to deprive him of royalties and production fees and breached an agreement giving him the right to remix master recordings for albums released after Jackson's death. The songs Jones produced for Jackson were used in the film This Is It. Jones was reported to be filing the suits against the Michael Jackson Cirque du Soleil shows and the 25th-anniversary edition of the Bad album. He believed he should have received a producer credit in the film.\n\nBrazilian and other culture\nThe Brazilian singer Simone, whom Jones cites as \"one of the world's greatest singers\"; Brazilian musicians Ivan Lins and Milton Nascimento; and percussionist Paulinho da Costa, who Jones called \"one of the best in the business\", have become close friends and partners in his recent works.\n\nThe famous Japanese composer Mamoru Fujisawa, known as 'Joe Hisaishi,' formulated his last name as an alias inspired by American musician and composer Quincy Jones; 'Hisaishi' being the kanji equivalent of 'Quincy.'\n\nMedia appearances\nJones had a brief appearance in the 1990 video for the Time song \"Jerk Out\", and was a guest actor on an episode of The Boondocks. He appeared with Ray Charles in the music video of their song \"One Mint Julep\" and also with Ray Charles and Chaka Khan in the music video of their song \"I'll Be Good to You\". Jones hosted an episode of the long-running NBC sketch comedy show Saturday Night Live on February 10, 1990 (during SNL's 15th season). The episode was notable for having 10 musical guests (the most any SNL episode has had in its 40 plus years on the air): Tevin Campbell, Andrae Crouch, Sandra Crouch, rappers Kool Moe Dee and Big Daddy Kane, Melle Mel, Quincy D III, Siedah Garrett, Al Jarreau, and Take 6, and for a performance of Dizzy Gillespie's \"Manteca\" by the SNL Band (conducted by Quincy Jones). Jones impersonated Marion Barry, the former mayor of Washington, D.C., in the recurring sketch The Bob Waltman Special. He later produced his own sketch comedy show, FOX's MADtv, which ran from 1995 to 2009.\n\nJones appeared in the 1999 Walt Disney Pictures animated film Fantasia 2000, introducing the set piece of George Gershwin's Rhapsody in Blue. Two years later, he made a cameo appearance as himself in the film Austin Powers in Goldmember. On February 10, 2008, Jones joined Usher in presenting the Grammy Award for Album of the Year to Herbie Hancock. On January 6, 2009, he appeared on NBC's Last Call with Carson Daly to discuss his career. Daly informally floated the idea that Jones should become the first minister of culture for the United States, pending the inauguration of Barack Obama as president. Daly noted that only the US and Germany, among leading world countries, did not have a cabinet-level position for this role. Commentators on NPR and in the Chronicle of Higher Education have also discussed the topic of a minister of culture.\n\nIn February 2014, Jones appeared in Keep on Keepin' On, a documentary about his friend, jazz trumpeter and flugelhorn player Clark Terry. In the film, Terry introduces Jones to his protégé Justin Kauflin, whom Jones then signs to his band and label. In July 2014, Jones starred in a documentary film called The Distortion of Sound. In September 2015, he was a guest on Dr. Dre's The Pharmacy on Beats 1 Radio. He was also featured on Jacob Collier's YouTube cover of Michael Jackson's \"PYT (Pretty Young Thing)\". On February 28, 2016, he and Pharrell Williams presented Ennio Morricone with the Oscar for best film score. and in August 2016, he and his music were featured at BBC Proms in Royal Albert Hall, London.\n\nOn March 20, 2020, Jones guest starred on a music video by Travis Scott and Young Thug for the song \"Out West\". Jones makes and consumes a sandwich during the course of the video.\n\nIn January 2022, Jones appeared on the album Dawn FM by Canadian singer the Weeknd, performing a monologue in the sixth track, \"A Tale by Quincy\".\n\nDeath\nJones died on November 3, 2024 at his home in Bel-Air, Los Angeles at the age of 91. <a href=\"https://www.last.fm/music/Quincy+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "UK",
  "created_at": "2025-07-05T17:21:58.416774",
  "date_added": "2017-04-02T13:01:56-07:00",
  "discogs_id": "6089363",
  "discogs_url": "https://www.discogs.com/release/6089363-Quincy-Jones-The-Italian-Job-Original-Sound-Track",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Stage & Screen"
  ],
  "id": "6089363",
  "images": [
    {
      "height": 500,
      "resource_url": "https://i.discogs.com/naS5tZBULrocbREKeWiGmK63ZqnwPbgoOKrR1J-d9aI/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTYwODkz/NjMtMTQxMDc4OTY0/OS0zNDMyLmpwZWc.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/naS5tZBULrocbREKeWiGmK63ZqnwPbgoOKrR1J-d9aI/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTYwODkz/NjMtMTQxMDc4OTY0/OS0zNDMyLmpwZWc.jpeg",
      "width": 500
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/bd/9a/0a/bd9a0a08-9c2e-ebdf-f4cf-4a7c0d8cc97f/00602547250971.rgb.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "Paramount Records"
  ],
  "lastfm_mbid": null,
  "lastfm_url": null,
  "local_images": {
    "hi-res": "public/album/the-italian-job-original-sound-track-6089363/the-italian-job-original-sound-track-6089363-hi-res.jpg",
    "medium": "public/album/the-italian-job-original-sound-track-6089363/the-italian-job-original-sound-track-6089363-medium.jpg",
    "small": "public/album/the-italian-job-original-sound-track-6089363/the-italian-job-original-sound-track-6089363-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T17:22:09.286095",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "The Italian Job (Original Soundtrack)",
  "release_name_discogs": "The Italian Job (Original Sound Track)",
  "release_name_spotify": "The Italian Job (Original Soundtrack)",
  "released": "2014-09-15",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/bd/9a/0a/bd9a0a08-9c2e-ebdf-f4cf-4a7c0d8cc97f/00602547250971.rgb.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 1969 Geffen Records",
      "editorial_notes": null,
      "id": "1443280326",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Quincy Jones",
        "artwork": {
          "bgColor": "a18d50",
          "height": 1500,
          "textColor1": "0d0d07",
          "textColor2": "161006",
          "textColor3": "2b2615",
          "textColor4": "312915",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/bd/9a/0a/bd9a0a08-9c2e-ebdf-f4cf-4a7c0d8cc97f/00602547250971.rgb.jpg/{w}x{h}bb.jpg",
          "width": 1500
        },
        "copyright": "℗ 1969 Geffen Records",
        "genreNames": [
          "Soundtrack",
          "Music"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "The Italian Job (Original Soundtrack)",
        "playParams": {
          "id": "1443280326",
          "kind": "album"
        },
        "recordLabel": "Geffen",
        "releaseDate": "1969-01-01",
        "trackCount": 12,
        "upc": "00602547250971",
        "url": "https://music.apple.com/gb/album/the-italian-job-original-soundtrack/1443280326"
      },
      "url": "https://music.apple.com/gb/album/the-italian-job-original-soundtrack/1443280326"
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "© 2000 Geffen Records",
          "type": "C"
        },
        {
          "text": "℗ 1969 Geffen Records",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "00602547250971"
      },
      "id": "3D6klQFLS1FBo29LzHlkZc",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b273eb10888830c8f4da1541e512",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e02eb10888830c8f4da1541e512",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d00004851eb10888830c8f4da1541e512",
          "width": 64
        }
      ],
      "label": "Geffen",
      "popularity": 36,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
            },
            "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
            "id": "3rxIQc9kWT6Ueg4BhnOwRK",
            "name": "Quincy Jones",
            "type": "artist",
            "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
          }
        ],
        "copyrights": [
          {
            "text": "© 2000 Geffen Records",
            "type": "C"
          },
          {
            "text": "℗ 1969 Geffen Records",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "00602547250971"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/3D6klQFLS1FBo29LzHlkZc"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/3D6klQFLS1FBo29LzHlkZc?market=US",
        "id": "3D6klQFLS1FBo29LzHlkZc",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b273eb10888830c8f4da1541e512",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e02eb10888830c8f4da1541e512",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d00004851eb10888830c8f4da1541e512",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "Geffen",
        "name": "The Italian Job (Original Soundtrack)",
        "popularity": 36,
        "release_date": "1969-01-01",
        "release_date_precision": "day",
        "total_tracks": 12,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/3D6klQFLS1FBo29LzHlkZc/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                },
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/06kr5yNAM2rOf4DXemM8fl"
                  },
                  "href": "https://api.spotify.com/v1/artists/06kr5yNAM2rOf4DXemM8fl",
                  "id": "06kr5yNAM2rOf4DXemM8fl",
                  "name": "Matt Monro",
                  "type": "artist",
                  "uri": "spotify:artist:06kr5yNAM2rOf4DXemM8fl"
                }
              ],
              "disc_number": 1,
              "duration_ms": 220160,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3Tz5fLDzaPYxvd5MY6gtS1"
              },
              "href": "https://api.spotify.com/v1/tracks/3Tz5fLDzaPYxvd5MY6gtS1",
              "id": "3Tz5fLDzaPYxvd5MY6gtS1",
              "is_local": false,
              "is_playable": true,
              "name": "On Days Like These - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:3Tz5fLDzaPYxvd5MY6gtS1"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 149800,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3h2wmzJ90daR4KFTtvNxK6"
              },
              "href": "https://api.spotify.com/v1/tracks/3h2wmzJ90daR4KFTtvNxK6",
              "id": "3h2wmzJ90daR4KFTtvNxK6",
              "is_local": false,
              "is_playable": true,
              "name": "Something's Cookin' - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:3h2wmzJ90daR4KFTtvNxK6"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 61626,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/4Qv6TKNAkDeVb0zmDqlhx9"
              },
              "href": "https://api.spotify.com/v1/tracks/4Qv6TKNAkDeVb0zmDqlhx9",
              "id": "4Qv6TKNAkDeVb0zmDqlhx9",
              "is_local": false,
              "is_playable": true,
              "name": "Hello Mrs. Beckerman! - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:4Qv6TKNAkDeVb0zmDqlhx9"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 119933,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/33iWL32DtbwSz4qS63ls0r"
              },
              "href": "https://api.spotify.com/v1/tracks/33iWL32DtbwSz4qS63ls0r",
              "id": "33iWL32DtbwSz4qS63ls0r",
              "is_local": false,
              "is_playable": true,
              "name": "Britannia And Mr. Bridger - If You Please - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:33iWL32DtbwSz4qS63ls0r"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 106560,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7IFcpQ24TiIqWXB4s8Ng06"
              },
              "href": "https://api.spotify.com/v1/tracks/7IFcpQ24TiIqWXB4s8Ng06",
              "id": "7IFcpQ24TiIqWXB4s8Ng06",
              "is_local": false,
              "is_playable": true,
              "name": "Trouble For Charlie - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:7IFcpQ24TiIqWXB4s8Ng06"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                },
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/5FP5tCzBeZnOemocPb8bOo"
                  },
                  "href": "https://api.spotify.com/v1/artists/5FP5tCzBeZnOemocPb8bOo",
                  "id": "5FP5tCzBeZnOemocPb8bOo",
                  "name": "Peter King",
                  "type": "artist",
                  "uri": "spotify:artist:5FP5tCzBeZnOemocPb8bOo"
                }
              ],
              "disc_number": 1,
              "duration_ms": 189133,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2XeRwHQAfMa7Ogks85pIU0"
              },
              "href": "https://api.spotify.com/v1/tracks/2XeRwHQAfMa7Ogks85pIU0",
              "id": "2XeRwHQAfMa7Ogks85pIU0",
              "is_local": false,
              "is_playable": true,
              "name": "On Days Like These - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:2XeRwHQAfMa7Ogks85pIU0"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 193026,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3apGZ4PZ6Od0vB2ygXWqz7"
              },
              "href": "https://api.spotify.com/v1/tracks/3apGZ4PZ6Od0vB2ygXWqz7",
              "id": "3apGZ4PZ6Od0vB2ygXWqz7",
              "is_local": false,
              "is_playable": true,
              "name": "It's Caper Time (The Self Preservation Society) - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:3apGZ4PZ6Od0vB2ygXWqz7"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 82600,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/43xZbkvVzc6iT8wo6RqqT3"
              },
              "href": "https://api.spotify.com/v1/tracks/43xZbkvVzc6iT8wo6RqqT3",
              "id": "43xZbkvVzc6iT8wo6RqqT3",
              "is_local": false,
              "is_playable": true,
              "name": "Meanwhile, Back In The Mafia - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 8,
              "type": "track",
              "uri": "spotify:track:43xZbkvVzc6iT8wo6RqqT3"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 91800,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2lsk6jHhRTHi8Ch1wWKvyS"
              },
              "href": "https://api.spotify.com/v1/tracks/2lsk6jHhRTHi8Ch1wWKvyS",
              "id": "2lsk6jHhRTHi8Ch1wWKvyS",
              "is_local": false,
              "is_playable": true,
              "name": "Smell That Gold! - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 9,
              "type": "track",
              "uri": "spotify:track:2lsk6jHhRTHi8Ch1wWKvyS"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 126066,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5rriMwsJYGTW9hnQ1tjgap"
              },
              "href": "https://api.spotify.com/v1/tracks/5rriMwsJYGTW9hnQ1tjgap",
              "id": "5rriMwsJYGTW9hnQ1tjgap",
              "is_local": false,
              "is_playable": true,
              "name": "Greensleeves And All That Jazz - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 10,
              "type": "track",
              "uri": "spotify:track:5rriMwsJYGTW9hnQ1tjgap"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 74000,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3wlcS3bkQ60HR48bAJCV80"
              },
              "href": "https://api.spotify.com/v1/tracks/3wlcS3bkQ60HR48bAJCV80",
              "id": "3wlcS3bkQ60HR48bAJCV80",
              "is_local": false,
              "is_playable": true,
              "name": "On Days Like These - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 11,
              "type": "track",
              "uri": "spotify:track:3wlcS3bkQ60HR48bAJCV80"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3rxIQc9kWT6Ueg4BhnOwRK"
                  },
                  "href": "https://api.spotify.com/v1/artists/3rxIQc9kWT6Ueg4BhnOwRK",
                  "id": "3rxIQc9kWT6Ueg4BhnOwRK",
                  "name": "Quincy Jones",
                  "type": "artist",
                  "uri": "spotify:artist:3rxIQc9kWT6Ueg4BhnOwRK"
                }
              ],
              "disc_number": 1,
              "duration_ms": 235693,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7J2CzAvOO96WH71WWr6KDw"
              },
              "href": "https://api.spotify.com/v1/tracks/7J2CzAvOO96WH71WWr6KDw",
              "id": "7J2CzAvOO96WH71WWr6KDw",
              "is_local": false,
              "is_playable": true,
              "name": "Getta Bloomin' Move On! (The Self Preservation Society) - From \"The Italian Job\" Soundtrack",
              "preview_url": null,
              "track_number": 12,
              "type": "track",
              "uri": "spotify:track:7J2CzAvOO96WH71WWr6KDw"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 12
        },
        "type": "album",
        "uri": "spotify:album:3D6klQFLS1FBo29LzHlkZc"
      },
      "release_date": "1969-01-01",
      "release_date_precision": "day",
      "total_tracks": 12,
      "tracks": [
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            },
            {
              "id": "06kr5yNAM2rOf4DXemM8fl",
              "name": "Matt Monro"
            }
          ],
          "duration_ms": 220160,
          "explicit": false,
          "id": "3Tz5fLDzaPYxvd5MY6gtS1",
          "name": "On Days Like These - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 149800,
          "explicit": false,
          "id": "3h2wmzJ90daR4KFTtvNxK6",
          "name": "Something's Cookin' - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 61626,
          "explicit": false,
          "id": "4Qv6TKNAkDeVb0zmDqlhx9",
          "name": "Hello Mrs. Beckerman! - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 119933,
          "explicit": false,
          "id": "33iWL32DtbwSz4qS63ls0r",
          "name": "Britannia And Mr. Bridger - If You Please - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 106560,
          "explicit": false,
          "id": "7IFcpQ24TiIqWXB4s8Ng06",
          "name": "Trouble For Charlie - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            },
            {
              "id": "5FP5tCzBeZnOemocPb8bOo",
              "name": "Peter King"
            }
          ],
          "duration_ms": 189133,
          "explicit": false,
          "id": "2XeRwHQAfMa7Ogks85pIU0",
          "name": "On Days Like These - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 193026,
          "explicit": false,
          "id": "3apGZ4PZ6Od0vB2ygXWqz7",
          "name": "It's Caper Time (The Self Preservation Society) - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 7
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 82600,
          "explicit": false,
          "id": "43xZbkvVzc6iT8wo6RqqT3",
          "name": "Meanwhile, Back In The Mafia - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 8
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 91800,
          "explicit": false,
          "id": "2lsk6jHhRTHi8Ch1wWKvyS",
          "name": "Smell That Gold! - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 9
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 126066,
          "explicit": false,
          "id": "5rriMwsJYGTW9hnQ1tjgap",
          "name": "Greensleeves And All That Jazz - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 10
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 74000,
          "explicit": false,
          "id": "3wlcS3bkQ60HR48bAJCV80",
          "name": "On Days Like These - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 11
        },
        {
          "artists": [
            {
              "id": "3rxIQc9kWT6Ueg4BhnOwRK",
              "name": "Quincy Jones"
            }
          ],
          "duration_ms": 235693,
          "explicit": false,
          "id": "7J2CzAvOO96WH71WWr6KDw",
          "name": "Getta Bloomin' Move On! (The Self Preservation Society) - From \"The Italian Job\" Soundtrack",
          "preview_url": null,
          "track_number": 12
        }
      ],
      "url": "https://open.spotify.com/album/3D6klQFLS1FBo29LzHlkZc"
    }
  },
  "spotify_id": "3D6klQFLS1FBo29LzHlkZc",
  "spotify_url": "https://open.spotify.com/album/3D6klQFLS1FBo29LzHlkZc",
  "styles": [
    "Soundtrack",
    "Score"
  ],
  "title": "The Italian Job (Original Sound Track)",
  "tracklist": [
    {
      "artists": [],
      "duration": "3:39",
      "position": "A1",
      "title": "On Days Like These"
    },
    {
      "artists": [],
      "duration": "2:30",
      "position": "A2",
      "title": "Something's Cookin'"
    },
    {
      "artists": [],
      "duration": "1:00",
      "position": "A3",
      "title": "Hello Mrs. Beckerman!"
    },
    {
      "artists": [],
      "duration": "1:55",
      "position": "A4",
      "title": "Britannia-And Mr. Bridger - If You Please"
    },
    {
      "artists": [],
      "duration": "1:45",
      "position": "A5",
      "title": "Trouble For Charlie"
    },
    {
      "artists": [],
      "duration": "3:07",
      "position": "A6",
      "title": "On Days Like These"
    },
    {
      "artists": [],
      "duration": "3:10",
      "position": "B1",
      "title": "It's Caper Time - The Italian Job (Vocal)"
    },
    {
      "artists": [],
      "duration": "1:20",
      "position": "B2",
      "title": "Meanwhile, Back At The Mafia"
    },
    {
      "artists": [],
      "duration": "1:30",
      "position": "B3",
      "title": "Smell That Gold"
    },
    {
      "artists": [],
      "duration": "2:05",
      "position": "B4",
      "title": "Greensleeves And All That Jazz"
    },
    {
      "artists": [],
      "duration": "4:00",
      "position": "B5",
      "title": "Getta Bloomin' Move On! - The Italian Job (Vocal)"
    }
  ],
  "updated_at": "2025-07-05T17:22:08.654261",
  "year": 2014
}