{
  "apple_music_id": "262058880",
  "apple_music_url": "https://music.apple.com/gb/album/live-at-the-apollo/262058880",
  "artists": [
    {
      "apple_music_id": "180586",
      "biography": "From their first hit in 1974 through their heyday in the '80s, Daryl Hall and John Oates' smooth, catchy take on Philly soul brought them commercial success — including six number one singles and six platinum albums. Hall & Oates' music was well-constructed and produced; at their best, their songs were filled with strong hooks and melodies that adhered to soul traditions without being a slave to them by incorporating elements of new wave and hard rock.\n\nDaryl Hall began performing professionally while he was a student at Temple University. In 1966, he recorded a single with Kenny Gamble and the Romeos; the group featured Kenny Gamble, Leon Huff, and Thom Bell, who would all become the architects of Philly soul. During this time, Hall frequently appeared on sessions for Gamble and Huff. In 1967, Hall met John Oates, a fellow Temple University student. Oates was leading his own soul band at the time. The two students realized they had similar tastes and began performing together in an array of R&B and doo wop groups. By 1968, the duo had parted ways, as Oates transferred schools and Hall formed the soft rock band Gulliver; the group released one album on Elektra in the late '60s before disbanding.\n\nAfter Gulliver's breakup, Hall concentrated on session work again, appearing as a backup vocalist for The Stylistics, The Delfonics, and The Intruders, among others. Oates returned to Philadelphia in 1969, and he and Hall began writing folk-oriented songs and performing together. Eventually they came to the attention of Tommy Mottola, who quickly became their manager, securing the duo a contract with Atlantic Records. On their first records — Whole Oates (1972), Abandoned Luncheonette (1973), War Babies (1974) — the duo were establishing their sound, working with producers like Arif Mardin and Todd Rundgren and removing much of their folk influences. At the beginning of 1974, the duo relocated from Philadelphia to New York. During this period, they only managed one hit — the number 60 \"She's Gone\" in the spring of 1974.\n\nAfter they moved to RCA in 1975, the duo landed on its successful mixture of soul, pop, and rock, scoring a Top Ten single with \"Sara Smile.\" The success of \"Sara Smile\" prompted the re-release of \"She's Gone,\" which rocketed into the Top Ten as well. Released in the summer of 1976, Bigger than the Both of Us was only moderately successful upon its release. The record took off in early 1977, when \"Rich Girl\" became the duo's first number one single.\n\nAlthough they had several minor hits between 1977 and 1980, the albums Hall & Oates released at the end of the decade were not as successful as their mid-'70s records. Nevertheless, they were more adventurous, incorporating more rock elements into their blue-eyed soul. The combination would finally pay off in late 1980, when the duo released the self-produced Voices, the album that marked the beginning of Hall & Oates' greatest commercial and artistic success. The first single from Voices, a cover of Righteous Brothers' \"You've Lost That Lovin' Feeling,\" reached number 12, yet it was the second single, \"Kiss on My List\" that confirmed their commercial potential by becoming the duo's second number one single; its follow-up, \"You Make My Dreams\" hit number five. They quickly released Private Eyes in the summer of 1981; the record featured two number one hits, \"Private Eyes\" and \"I Can't Go for That (No Can Do),\" as well as the Top Ten hit \"Did It in a Minute.\" \"I Can't Go for That (No Can Do)\" also spent a week at the top of the R&B charts — a rare accomplishment for a white act. H20 followed in 1982 and it proved more successful than their two previous albums, selling over two million copies and launching their biggest hit single, \"Maneater,\" as well as the Top Ten hits \"One on One\" and \"Family Man.\" The following year, the duo released a greatest-hits compilation, Rock 'N Soul, Pt. 1, that featured two new Top Ten hits — the number two \"Say It Isn't So\" and \"Adult Education.\"\n\nIn April of 1984, the Recording Industry Association of America announced that Hall & Oates had surpassed Everly Brothers as the most successful duo in rock history, earning a total of 19 gold and platinum awards. Released in October of 1984, Big Bam Boom expanded their number of gold and platinum awards, selling over two million copies and launching four Top 40 singles, including the number one \"Out of Touch.\" Following their contract-fulfilling gold album Live at the Apollo with David Ruffin & Eddie Kendrick, Hall & Oates went on hiatus. After the lukewarm reception for Daryl Hall's 1986 solo album, Three Hearts in the Happy Ending Machine, the duo regrouped to release 1988's Ooh Yeah!, their first record for Arista. The first single, \"Everything Your Heart Desires,\" went to number three and helped propel the album to platinum status.\n\nHowever, none of the album's other singles broke the Top 20, indicating that the era of chart dominance had ended. Change of Season, released in 1990, confirmed that fact. Although the record went gold, it only featured one Top 40 hit — the number 11 single, \"So Close.\" The duo mounted a comeback in 1997 with Marigold Sky, but it was only partially successful; far better was 2003's Do It for Love and the following year soul covers record Our Kind of Soul. <a href=\"https://www.last.fm/music/+noredirect/Daryl+Hall+&+John+Oates\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "95886",
      "discogs_original_name": "Daryl Hall & John Oates",
      "id": null,
      "lastfm_mbid": null,
      "name": "Daryl Hall & John Oates",
      "role": "",
      "spotify_id": "77tT1kLj6mCWtFNqiOmP9H",
      "wikipedia_url": null
    },
    {
      "apple_music_id": "103814",
      "biography": "Davis Eli \"David\" Ruffin (January 18, 1941 – June 1, 1991) was an American soul singer and musician most famous for his work as one of the lead singers of the Temptations from 1964 to 1968 (or the group's \"Classic Five\" period as it was later known). He was the lead voice on such famous songs as \"My Girl\" and \"Ain't Too Proud to Beg.\"\nKnown for his unique raspy and anguished tenor vocals, Ruffin was ranked as one of the 100 Greatest Singers of All Time by Rolling Stone magazine in 2008. He was inducted into the Rock and Roll Hall of Fame in 1989 for his work with the Temptations. Fellow Motown recording artist Marvin Gaye once said admiringly of Ruffin that, \"I heard [in his voice] a strength my own voice lacked.\"\n\nRuffin was born Davis Eli Ruffin in the rural unincorporated community of Whynot, Mississippi, fifteen miles from Meridian, Mississippi. He was the third born son of Elias \"Eli\" Ruffin, a Baptist minister, and Ophelia Ruffin (née Davis). His siblings were Quincy B. Ruffin, Rita Ruffin, and Jimmy L. Ruffin. His parents were both natives of Mississippi. His father Eli worked as a truck driver at a lumber mill and his mother Ophelia worked out of their home. As far as the ancestry of the Ruffin family, Eli's parents had moved from Alabama to Mississippi, due to the harsh circumstances of living after the American Civil War. Prior to living in Alabama, David Ruffin's great grandparents, John Ruffin and Clara Ruffin, had moved from Bertie County, North Carolina. John Ruffin was a Civil War Veteran, fighting with the 14th United States Colored Heavy Artillery Regiment.\nRuffin's father was strict and at times violently abusive. Ruffin's mother died just months after his birth and his father married a schoolteacher, Earline, in 1942. As a young child, Ruffin, along with his other siblings (older brothers Quincy and Jimmy, and sister Rita Mae), traveled with their father and their stepmother as a family gospel group, opening shows for Mahalia Jackson and The Five Blind Boys of Mississippi, among others. Ruffin sang in the choir at Mount Salem Methodist Church, talent shows, and wherever else he could. In 1955, at the age of fourteen, he left home under the guardianship of a minister and went to Memphis, Tennessee with the purpose of pursuing the ministry.\nAt age 15, Ruffin went to Hot Springs, Arkansas with the jazz musician Phineas Newborn, Sr. There they played at the Fifty Grand Ballroom and Casino. Ruffin continued to sing at talent shows, worked with horses at a jockey club and eventually became a member of the Dixie Nightingales. He also sang with the Soul Stirrers briefly after the departure of Johnnie Taylor. It was in Ruffin's travels as a teenager that he met such later popular personalities as Elvis Presley, Little Richard, Frankie Lymon, Bobby Womack, the Staple Singers, the Swan Silvertones and the Dixie Hummingbirds.\nAfter some of his singing idols like Sam Cooke and Jackie Wilson had left gospel music and gone secular, Ruffin also turned in that direction. The 16-year-old Ruffin met and came under the guardianship of Eddie Bush and his wife Dorothy Helen, who took the teenager to Detroit, Michigan, where his brother Jimmy was pursuing a career in music while working at the Ford Motor Company.\n\nAfter moving to Detroit with the Bushes, Ruffin recorded his first released records with the songs \"You and I\" (1958) b/w \"Believe Me\" (1958) and the original version of \"Statue of a Fool.\" These songs were recorded at Vega Records and released under the name \"Little David Bush\", using the last name of the man he was living with at the time, Eddie Bush. Ruffin would later recall how he initially recorded \"a different kind of music\", strongly influenced by the smoother pop and R&B of the time, when he first recorded in Detroit for Vega.\nIn 1957, Ruffin met Berry Gordy, Jr., then a songwriter with ambitions of running his own label. Ruffin lived with Gordy's father, a contractor, and helped \"Pops\" Gordy do construction work on the building that would become Hitsville USA, the headquarters for Gordy's Tamla Records (later Motown Records) label. Ruffin's brother Jimmy would eventually be signed to Tamla's Miracle Records label as an artist.\nRuffin also worked alongside another ambitious singer, Marvin Gaye, as an apprentice at Anna Records, a Chess-distributed label run by Gordy's sister Gwen Gordy Fuqua and his songwriting partner Billy Davis. Asked about Ruffin in the Detroit Free Press in 1988, Gordy Fuqua said, \"He was very much a gentleman, yes ma'am and no ma'am, but the thing that really impressed me about David was that he was one of the only artists I've seen who rehearsed like he was on stage.\"\nEventually, Ruffin started recording at Anna Records, and recorded the song \"I'm in Love\" b/w \"One of These Days\" (1961), with the Voice Masters, which included future Motown producer Lamont Dozier and members of the singing group the Originals Ty Hunter, C.P. Spencer, Hank Dixon and Voice Masters and The Originals founder Walter Gaines (and, at one time, it also had another future Temptations member, Melvin Franklin, one of numerous people David would claim as a cousin).\nRuffin eventually met an up-and-coming local group by the name of The Temptations. His older brother Jimmy Ruffin went on a Motortown Revue tour with the Temptations, and he told David that they needed someone to sing tenor in their group. Ruffin showed interest in joining the group to Otis Williams whom he lived very close to in Detroit. In January 1964, Ruffin became a member of the Temptations after founding member Elbridge \"Al\" Bryant was fired from the group (Ruffin's first recording session with the group was January 9, 1964). Though both David and his brother Jimmy were considered, David was given an edge over Jimmy thanks to his performance skills, which David displayed when he joined the Temptations on-stage during the New Year's Eve party in 1963.\n\nThe bespectacled Ruffin initially sang backgrounds, while the role of lead singer mostly alternated between Eddie Kendricks and Paul Williams. He did sing a few lead parts both on stage and in the studio during his first year with the group, but his leads on these studio tracks would not be released for over a year, as they were considered not good enough to showcase Ruffin's vocals. Smokey Robinson, who produced and co-wrote most of the Temptations' material at this point, saw Ruffin during this period as a \"sleeping giant\" in the group with a unique voice that was, \"mellow,\" yet, \"gruff.\" Robinson thought that if he could write just the perfect song for Ruffin's voice, then he could have a smash hit. The song was to be something that Ruffin could \"belt out\" yet something that was also \"melodic and sweet\". That song, \"My Girl\", was recorded in November 1964 and released a month later, became the group's first number-one single in 1965. \"My Girl\" became the Temptations' signature song and elevated Ruffin to the role of lead singer and front man.\nThe follow-ups to \"My Girl\" were also extremely successful singles, including the Ruffin-led hits \"It's Growing\" (1965), \"Since I Lost My Baby\" (1965), \"My Baby\" (1965), \"Ain't Too Proud to Beg\" (1966), \"Beauty Is Only Skin Deep\" (1966), \"(I Know) I'm Losing You\" (1966), \"All I Need\" (1967), \"(Loneliness Made Me Realize) It's You That I Need\" (1967), \"I Wish It Would Rain\" (1967), and \"I Could Never Love Another (After Loving You)\" (1968). Ruffin also shared lead vocals on the 1967 hit single \"You're My Everything\" with Eddie Kendricks. The tall, 6'3\", Ruffin's passionate and dramatic performances endeared him to the Temptations' audiences and fans. According to Otis Williams, Ruffin (playfully nicknamed \"Ruff\" by the group) was initially a natural comedian and a hard-working singer when he first joined the group. Ruffin's most notable non-vocal contribution to the Temptations was the masterminding of their trademark four-headed microphone stand.\n\nBy 1967, however, ego problems with Ruffin became an issue for the group. He became addicted to cocaine and began missing rehearsals and performances. Refusing to travel with the other Temptations, Ruffin and his then-girlfriend Tammi Terrell traveled in a custom limo (with the image of his trademark black rimmed glasses painted on the door). After the Supremes had their name changed to Diana Ross & the Supremes in early 1967, Ruffin felt that he should become the focal point of the Temptations, just as Diana Ross was for her group and began demanding that the group name be changed to David Ruffin & the Temptations. This led to a number of disagreements between Ruffin and the group's de facto leader, Otis Williams. In addition to the group's problems with Ruffin's ego, he began inquiring into the Temptations' financial records, demanding an accounting of the group's money. This caused friction between Ruffin and Gordy.\nIn June 1968, the Temptations agreed that Ruffin had finally crossed the line when he missed a June 22 Cleveland, Ohio date with the Temptations to instead attend a performance by his new girlfriend, Barbara Gail Martin (Dean Martin's daughter). Ruffin was fired on June 27 and replaced with Dennis Edwards, a former member of The Contours who had been a friend of Ruffin and the group as a whole beforehand. Though Ruffin himself personally encouraged Edwards to take his place, Ruffin began turning up unannounced at Temptations' concerts during Edwards' first few dates with the group. When the group started to perform a Ruffin-era song such as \"My Girl\" or \"Ain't Too Proud to Beg\", Ruffin would suddenly walk on to the stage, take the microphone from Edwards' hands, and steal the show, embarrassing the group but entertaining the fans. According to Edwards, the adulation and Ruffin's pleas convinced the other four Temptations to give Ruffin a second chance, but when he arrived late to what was to be his return show with the group in Gaithersburg, Maryland, The Temptations decided to keep Edwards and drop considerations of rehiring Ruffin.\nIn October 1968, Ruffin filed suit against Motown Records, seeking a release from the label and an accounting of his money. Motown counter-sued to keep the singer from leaving the label and eventually the case was settled. The settlement required Ruffin to remain with Motown to finish out his initial contract (Ruffin joined Motown as a solo artist and always had a separate contract from the other Temptations, which some felt caused a lot of the in-fighting within the group).\n\nRuffin's first solo single was a song originally intended for the Temptations, \"My Whole World Ended (The Moment You Left Me)\". The single from the album entitled My Whole World Ended was released in 1969 followed soon by the album Feelin' Good. The single reached the US Pop & R&B \"Top Ten.\" A third album, titled David, was recorded in 1970-71, but was shelved by Motown and did not see a commercial release until 2004; his next official release for Motown did not arrive until 1973, when David Ruffin was released. His final Top Ten hit was 1975's \"Walk Away from Love\", produced by Van McCoy, which reached number nine on the Pop chart. It sold over one million copies, and was awarded a gold disc by the R.I.A.A. in February 1976. Other notable recordings from Ruffin's solo career include \"I Lost Everything I've Ever Loved\" (1969); the gospel-inflected \"I'm So Glad I Fell For You\" (1970); \"Blood Donors Needed (Give All You Can)\" (1973); \"Common Man\" (1973) (which was sampled on the 2001 Jay-Z song \"Never Change\"); \"No Matter Where\" (1974); \"Who I Am\" (1975); \"Statue of a Fool\" (1975); and cover versions of the Jackson Five's \"I Want You Back\", \"Rainy Night in Georgia\" popularized by Brook Benton (both recorded for the shelved 1970 album); and Harold Melvin and the Blue Notes' \"I Miss You\", featuring Eddie Kendrick (1973).\n\nIn 1970 Ruffin recorded an album with his brother Jimmy, I am My Brother's Keeper, for which they had minor hits with \"When My Love Hand (Comes Tumbling Down)\" and \"Your Love Was Worth Waiting For\". While his solo career initially showed promise, Ruffin reportedly went into decline in part because of his cocaine addiction and the lack of support from Motown.\nAfter leaving Motown in 1977, Ruffin recorded for Warner Bros. Records releasing the albums So Soon We Change (1979) and Gentleman Ruffin (1980), and later signed with RCA Records, accompanied by former Temptations band-mate Eddie Kendrick, who chose to rekindle their friendship when Kendrick himself started experiencing problems with the Temptations.\nIn 1982, Ruffin and Eddie Kendricks re-joined the Temptations for the recording of their album Reunion and the tour to promote the album. Reunion included the R&B hit \"Standing on the Top\" with Rick James. The reunion tour, however, was short lived as Ruffin started to miss shows due to his cocaine addiction, leading the group to be fined thousands of dollars. Otis Williams fired Ruffin for the second and final time from the group along with Kendricks (whose voice was weakened due to heavy chain smoking) by Christmas 1982. Ruffin started touring with Kendrick (who dropped the \"s\" from his last name at this time) as a duo act in 1985.\nIn 1982, Ruffin was sentenced to six months in a low-security prison in Terre Haute, Indiana, for failing to pay taxes during the mid-1970s. On May 19, 1986, he pleaded no contest to a charge of receiving and concealing stolen property worth less than $100 (a Colt .32-caliber handgun) and was fined $50 plus $100 in court costs. Charges of assault and battery and receiving stolen property worth more than $100 were dropped. A 1987 cocaine arrest landed him in jail for repeated parole violations.\nIn 1985, longtime Temptations fans Hall & Oates teamed up with Ruffin and Kendrick to perform at the re-opening of the Apollo Theater in New York. Their performance was released as a relatively successful live album and single. The four singers also sang a medley of Temptations hits at Live Aid on July 13, 1985. John Oates later wrote a minor hit single for Ruffin and Kendrick, but the two duos fell out, allegedly due to Daryl Hall's objections to Ruffin's heavy drug use. After being inducted into the Rock and Roll Hall of Fame, in 1989, with the other Temptations, Ruffin, Kendrick and Dennis Edwards began touring and recording as \"Ruffin/Kendrick/Edwards: Former Leads of The Temptations\". On August 17, 2013 in Cleveland, Ohio The Official R&B Music Hall of Fame inducted David Ruffin as a solo artist and also a member of The Temptations. His family was on hand for this great honor.\n\nRuffin was married twice. His first marriage was to Sandra Ruffin in 1961 with whom he had three daughters, Cheryl, Nedra and Kimberly. In 1976, Ruffin married Joy Hamilton. He also had one son he named David Ruffin Junior with his former girlfriend Genna Sapia, who--after his death--would add \"Ruffin\" to her last name in tribute to their long-term relationship, as well as to the fact that they had a son together. The two lived as husband and wife, but were never legally married.\nRuffin also had a well publicized relationship with Motown label mate and Marvin Gaye duet partner, singer Tammi Terrell.\n\nAfter a successful month-long tour of England with Kendrick and Edwards, Ruffin died on June 1, 1991, in a Philadelphia, Pennsylvania, hospital of \"an adverse reaction to drugs\" - namely cocaine. Although the cause of death was ruled an accident, Ruffin's family and friends suspected foul play, claiming that a money belt containing the proceeds from the tour ($300,000) was missing from his body. He had just finished recording the single \"Hurt the One You Love\" for Motorcity Records.\nIn The Temptations television miniseries, Ruffin's beaten body is depicted as being thrown from a moving car in front of a hospital, where he dies. Also stated in the mini-series was that his body remained unclaimed in a morgue for a week after his death. As a result, Ruffin's estate filed suit against NBC and other major players involved in the making of the series, claiming defamation. According to the plaintiffs in the case, Ruffin was actually taken to the hospital by a limousine and was escorted to the waiting area by his driver, who informed the attendants of his identity. The Ruffin children further state that his body was claimed by one of them within a few days after his death. (Ruffin's estate lost the lawsuit; the ruling against them was upheld on appeal.)\n\nRuffin had many admirers among his fellow artists, mainly for the emotive power he brought to every song he sang. \"Nobody could sing like David Ruffin,\" said his close friend and colleague Martha Reeves (of Martha and the Vandellas fame). His contemporary, label-mate, and long-time acquaintance Marvin Gaye was particularly impressed with the virility of Ruffin's voice. Gaye said Ruffin's work \"made me remember that when a lot of women listen to music, they want to feel the power of a real man.\"\nDaryl Hall of Hall & Oates, one of Ruffin's biggest fans, said, \"His voice had a certain glorious anguish that spoke to people on many emotional levels\". Ruffin himself said, \"I don't know what kind of voice I have, I really don't\"...it's just about \"the feeling I get for the song.\"\nThe raspy-voiced Rod Stewart fell in love with Ruffin's voice after he heard \"I Wish It Would Rain\". \"It jumped out of the speakers and ravished my soul,\" Stewart exclaimed. Stewart would later become friends with Ruffin. \"His voice was so powerful -- like a foghorn on the Queen Mary,\" Stewart told Rolling Stone magazine.\nFor all of his nearly forty years in the music business, much of it with modest success, Ruffin is remembered almost exclusively for his relatively brief stint in the Temptations. The cover art of his last album Gentleman Ruffin was the inspiration on the art of rapper Wiz Khalifa's mixtape Kush and Orange Juice.\n\nIn 1998, NBC aired The Temptations, a four-hour television miniseries about the group's career. Ruffin was portrayed by Leon Robinson (who uses the professional name \"Leon\"). The actor won high praise for his portrayal of Ruffin, but Ruffin's family was upset by the way the miniseries portrayed Ruffin and filed a lawsuit against the producers of the miniseries and also Otis Williams, whose memoir had been the source material for the miniseries. The case was dismissed in favor of the defendants, with Williams later claiming that he had no real control over the presentation of the material.\nGrand Puba of Brand Nubian referenced the singer on the 1990 single \"All for One\", stating: \"I hit a beat and swing a note as if my name was David Ruffin\".\nRapper Machine Gun Kelly also referenced the singer on his 2013 song \"See My Tears\" stating:\"Fought every temptation shit, I guess I’m David Ruffin huh?\"\nThe first song on Fall Out Boy's 2005 CD From Under the Cork Tree was to have been titled \"My Name is David Ruffin...and These are The Temptations\" but for legal reasons, the name was changed (to \"Our Lawyer Made Us Change the Name of This Song So We Wouldn't Get Sued\").\nHotstylz used Ruffin's song and referred his name on their hip-hop single \"Lookin' Boy\".\nAmerican rap rock group Gym Class Heroes references Ruffin in the 2008 song \"Like Father, Like Son (Papa's Song)\" from their album The Quilt stating: \"I never understood temptation. But I guess we both got a little David Ruffin in us.\"\n <a href=\"https://www.last.fm/music/David+Ruffin\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "86101",
      "discogs_original_name": "David Ruffin",
      "id": null,
      "lastfm_mbid": "3d2ac089-fdc8-4381-a4b5-fcdc7fc36590",
      "name": "David Ruffin",
      "role": "",
      "spotify_id": "3FZn8Z2B7mfaSOU8NE62KR",
      "wikipedia_url": null
    },
    {
      "apple_music_id": "103776",
      "biography": "Eddie Kendricks (Edward James Kendrick, Union Springs, Alabama, December 17, 1939 – Birmingham, Alabama, October 5, 1992), was an American singer and songwriter, noted for his distinctive falsetto singing style. Kendricks co-founded the Motown singing group The Temptations, and was one of their lead singers from 1960 until 1971. His was the lead voice on such famous songs as \"The Way You Do The Things You Do\", \"Get Ready\", and \"Just My Imagination\". As a solo artist, Kendricks recorded several hits of his own during the 1970s, including the number-one single \"Keep On Truckin'\".\n\nKendricks' solo career began slowly; he endured two years of singles that missed the Top 40, while The Temptations continued with their string of Norman Whitfield-helmed hits (one of which, \"Superstar (Remember How You Got Where You Are)\", was written as a jab towards Kendricks and Ruffin). Despite enjoying only a modicum of commercial success and radio airplay, Kendricks's 1972 album People... Hold On (with the aid of his touring group, The Young Senators: Jimi Dougans, Frank Hooker, LeRoy Fleming, Wornell Jones, David Lecraft, James Drumer Johnson and John Engram) was a cornerstone of DJ playlists in downtown New York's nascent disco scene. The expansive, eight minute take on \"Girl, You Need A Change Of Mind\", which peaked at number thirteen on the soul chart, from the album was a particular favorite at David Mancuso's Loft. The single was later remade by R&B singer D'Angelo for the Get on the Bus Soundtrack. As the dance craze seeped through into other cities, Kendricks scored a #1 pop hit in 1973 with the Frank Wilson-produced \"Keep on Truckin'\". It sold over one million copies, and was awarded a gold disc. Future hits included \"Boogie Down\" (US #2) (1974) and another million selling release,[3] \"Son of Sagittarius\" (US #28) (1974), \"Shoeshine Boy\" (US #18) (1975), and \"He's a Friend\" (US #36) (1976). Another notable song is \"Intimate Friends\" (1977), which is sampled for the Alicia Keys song \"Unbreakable\", \"A Penny for My Thoughts\" by Common, Sparkle's \"Time to Move on\" on her self-titled first studio album and Sweet Sable's \"Old Time's Sake\" from the soundtrack for the 1994 2pac film, Above the Rim. Erykah Badu also sampled \"Intimate Friends\" for her song \"Fall in Love (Your Funeral)\", as well as his song \"My People... Hold on\" for her song \"My People\" on her album New Amerykah Part One (4th World War).\nExasperated by a lack of creative and financial control, Kendricks left Motown in 1978, with the requirement of signing away the rights to his royalties. He moved first to Arista Records, and later to Atlantic Records. By this time, his popularity had waned, and he was also gradually losing his voice as a result of chain smoking.\nHe and David Ruffin briefly re-joined the Temptations for a 1982 reunion tour. In an interview with Tom Meros, Dennis Edwards, Kendricks's former Temptations band mate, claimed that Kendricks had issues hitting his falsetto notes during recording sessions for the reunion album. Because of his singing difficulty, Edwards said that Kendricks went to a physician to examine his vocal ability. The physician discovered a \"pin drop\" of cancer on one of his lungs. However, Kendricks reportedly refused to undergo chemotherapy at the time because of fear that he would lose his hair.\nRuffin and Kendrick (Kendricks dropped the \"s\" from his stage name during the 1980s) reportedly met up one night when Ruffin went to watch Kendrick perform in a nightclub; Kendrick spotted Ruffin in the crowd, pointed him out, and invited him to come up on stage and perform with him. Afterward they talked about touring on their own and recorded an album as a duo for RCA in 1988.\n\nEarlier, in 1985, they participated in the Hall & Oates live album Live at The Apollo recorded at a benefit at New York City's Apollo Theater; and sang with the duo at Live Aid in Philadelphia and the MTV Video Music Awards in New York. Hall & Oates have cited Kendrick and Ruffin specifically, and the Temptations in general, as a major influence.\nIn 1989, Kendrick, Ruffin, and their Temptations bandmates were inducted into the Rock and Roll Hall of Fame. There, Kendrick and Ruffin made plans with fellow former Temptation Dennis Edwards to tour and record as \"Ruffin/Kendrick/Edwards, Former Leads of The Temptations.\" The Ruffin/Kendrick/ Edwards project was cut short in 1991, when Kendrick was diagnosed with lung cancer and David Ruffin died of a drug overdose, although Kendrick and Edwards continued to tour for the remainder of 1991.\nIn late 1991, Kendrick, by now living in his native Birmingham, Alabama, underwent surgery to have one of his lungs removed in hopes of preventing the spread of the cancer. He continued to tour through the summer of 1992, when he fell ill again and was hospitalized. Kendrick died on October 5, 1992, of lung cancer in Birmingham at the age of 52. Kendrick is survived by his three children: Parris Kendrick, Aika Kendrick and Paul Kendrick. He was buried in Elmwood Cemetery.\nIn 1998, NBC aired The Temptations, a four-hour television miniseries based upon an autobiographical book by Otis Williams. Kendricks was portrayed by actor Terron Brooks.\n\nKendricks was born in  on December 17, 1939, the son of Johnny and Lee Bell Kendrick. He had one sister, Patricia, and three brothers, Charles, Robert, and Clarence. His family moved to Birmingham, where he met and began singing with his best friend Paul Williams in their church choir in the late 1940s. In 1955, Kendricks, Williams, and friends Kell Osborne and Jerome Averette formed a doo-wop group called The Cavaliers, and began performing around Birmingham. The group decided to move for better opportunities in their musical careers, and in 1957 the group moved to Cleveland, Ohio. In Cleveland, they met manager Milton Jenkins, and soon moved with Jenkins to Detroit, Michigan, where the Cavaliers renamed themselves 'The Primes'. Under Jenkins' management, the Primes did well for themselves in the Detroit area, eventually creating a female spin-off group called The Primettes (later The Supremes). In 1961, Osbourne moved to California, and the Primes disbanded. Kendricks and Paul Williams joined forces with members Otis Williams and Melvin \"Blue\" Franklin of Otis Wiliiams and the Distants after three members quit and became The Elgins, who on the same day changed their name to \"The Temptations\" and signed to Motown.\n\nThe Temptations began singing background for Mary Wells. After an initial dry period, The Temptations quickly became the most successful male vocal group of the 1960s. Although technically Kendricks was first tenor in the group's harmony, he predominately sang in a falsetto voice. Among the Temptations songs Kendricks sang lead on were \"Dream Come True\" (1962), the group's first charting single; \"The Way You Do the Things You Do\" (1964), the group's first US Top 20 hit; \"I'll Be in Trouble\" (1964); \"The Girl's Alright With Me\" (1964), a popular b-side that Kendricks co-wrote; \"Girl (Why You Wanna Make Me Blue)\" (1964); \"Get Ready\" (1966); \"Please Return Your Love to Me\" (1968); and \"Just My Imagination\" (1971). He was also allowed to sing a few leads in his natural voice such as \"May I Have This Dance\" (1962). He shares lead vocal duty on other records, including \"You're My Everything\" (1967) (shared with David Ruffin), and a long string of Norman Whitfield produced psychedelic soul records where all five Temptations sang lead, such as the Grammy winner \"Cloud Nine\" (1968), \"I Can't Get Next to You\" (1969), and \"Ball of Confusion\" (1970). He also leads on \"I'm Gonna Make You Love Me\" (1968), a popular duet with Diana Ross and the Supremes, and on the Temptations' famous version of the Christmas classic \"Rudolph the Red-Nosed Reindeer\" (1968).\n\nIn the Temptations, Kendricks was responsible for creating most of the group's vocal arrangements, and also served as wardrobe manager, including the now famous purple suits the group wore for one performance. He also co-wrote several Temptations songs apart from \"The Girl's Alright With Me\" including \"Isn't She Pretty\" (1961) and \"Don't Send Me Away\" (1967). His favorite food was cornbread, and as a result he was nicknamed \"Cornbread\" (or \"Corn\" for short) by his groupmates. According to Otis Williams, Kendricks romantically pursued Diana Ross, lead singer of the Supremes, and he was said to have been close friends with Martha Reeves of the Vandellas. In her second book, Supreme Faith, Supremes singer Mary Wilson writes that she and Kendricks were lovers \"briefly,\" but remained close friends.\nKendricks remained in the group through the rest of the decade, but a number of issues began to push him away from it in the late 1960s and early 1970s. He was uncomfortable with singing the psychedelic style that Whitfield was now crafting for the group as opposed to the romantic ballads they had sung under the direction of Smokey Robinson; his friend Paul Williams was often too ill to perform with the group; and Kendricks often found himself at odds with bandmates Otis Williams and Melvin Franklin. As he grew away from the group, Kendricks began to rekindle his friendship with ex-Temptation David Ruffin, who convinced him to leave the group.\nIn a 1991 interview with a Chicago television series called Urban Street, Kendricks said he had actually considered leaving the group as early as 1965, even though that was when the band was finally starting to take off, because of things that \"weren't quite proper.\" He explained that they were working with people that \"didn't have their best interests at heart.\" Kendricks, however, initially decided to stay in the group because he was worried he would not get the support he needed if he left the group. Kendricks also expressed the fact that his relationship with Berry Gordy was less than cordial. \"Berry Gordy is a man I don't know, I only met him about three times,\" he said, but \"I know he didn't particularly care for me.\" Kendricks stated that he did not agree with many decisions that were made.\nFollowing one final altercation with Williams and Franklin during a run at the Copacabana nightclub in November 1970, Kendricks walked off after the first night and didn't return, and it was mutually decided he would leave the group. While working on his first solo album, Kendricks recorded one last hit single with the Temptations, 1971's \"Just My Imagination (Running Away with Me)\". By the time the record reached #1 on the US pop charts in April 1971, Kendricks had signed a solo deal with Motown's Tamla imprint and was preparing the release of his first solo album, All By Myself. However, many of his problems with Motown would reoccur.\n\n <a href=\"https://www.last.fm/music/Eddie+Kendricks\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "29810",
      "discogs_original_name": "Eddie Kendricks",
      "id": null,
      "lastfm_mbid": "cf3ea6e9-c856-4737-a988-6b64cc9f2bf2",
      "name": "Eddie Kendricks",
      "role": "",
      "spotify_id": "2Uuon75BhnuuxdKLYn4wHn",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Daryl Hall & John Oates": {
      "biography": "From their first hit in 1974 through their heyday in the '80s, Daryl Hall and John Oates' smooth, catchy take on Philly soul brought them commercial success — including six number one singles and six platinum albums. Hall & Oates' music was well-constructed and produced; at their best, their songs were filled with strong hooks and melodies that adhered to soul traditions without being a slave to them by incorporating elements of new wave and hard rock.\n\nDaryl Hall began performing professionally while he was a student at Temple University. In 1966, he recorded a single with Kenny Gamble and the Romeos; the group featured Kenny Gamble, Leon Huff, and Thom Bell, who would all become the architects of Philly soul. During this time, Hall frequently appeared on sessions for Gamble and Huff. In 1967, Hall met John Oates, a fellow Temple University student. Oates was leading his own soul band at the time. The two students realized they had similar tastes and began performing together in an array of R&B and doo wop groups. By 1968, the duo had parted ways, as Oates transferred schools and Hall formed the soft rock band Gulliver; the group released one album on Elektra in the late '60s before disbanding.\n\nAfter Gulliver's breakup, Hall concentrated on session work again, appearing as a backup vocalist for The Stylistics, The Delfonics, and The Intruders, among others. Oates returned to Philadelphia in 1969, and he and Hall began writing folk-oriented songs and performing together. Eventually they came to the attention of Tommy Mottola, who quickly became their manager, securing the duo a contract with Atlantic Records. On their first records — Whole Oates (1972), Abandoned Luncheonette (1973), War Babies (1974) — the duo were establishing their sound, working with producers like Arif Mardin and Todd Rundgren and removing much of their folk influences. At the beginning of 1974, the duo relocated from Philadelphia to New York. During this period, they only managed one hit — the number 60 \"She's Gone\" in the spring of 1974.\n\nAfter they moved to RCA in 1975, the duo landed on its successful mixture of soul, pop, and rock, scoring a Top Ten single with \"Sara Smile.\" The success of \"Sara Smile\" prompted the re-release of \"She's Gone,\" which rocketed into the Top Ten as well. Released in the summer of 1976, Bigger than the Both of Us was only moderately successful upon its release. The record took off in early 1977, when \"Rich Girl\" became the duo's first number one single.\n\nAlthough they had several minor hits between 1977 and 1980, the albums Hall & Oates released at the end of the decade were not as successful as their mid-'70s records. Nevertheless, they were more adventurous, incorporating more rock elements into their blue-eyed soul. The combination would finally pay off in late 1980, when the duo released the self-produced Voices, the album that marked the beginning of Hall & Oates' greatest commercial and artistic success. The first single from Voices, a cover of Righteous Brothers' \"You've Lost That Lovin' Feeling,\" reached number 12, yet it was the second single, \"Kiss on My List\" that confirmed their commercial potential by becoming the duo's second number one single; its follow-up, \"You Make My Dreams\" hit number five. They quickly released Private Eyes in the summer of 1981; the record featured two number one hits, \"Private Eyes\" and \"I Can't Go for That (No Can Do),\" as well as the Top Ten hit \"Did It in a Minute.\" \"I Can't Go for That (No Can Do)\" also spent a week at the top of the R&B charts — a rare accomplishment for a white act. H20 followed in 1982 and it proved more successful than their two previous albums, selling over two million copies and launching their biggest hit single, \"Maneater,\" as well as the Top Ten hits \"One on One\" and \"Family Man.\" The following year, the duo released a greatest-hits compilation, Rock 'N Soul, Pt. 1, that featured two new Top Ten hits — the number two \"Say It Isn't So\" and \"Adult Education.\"\n\nIn April of 1984, the Recording Industry Association of America announced that Hall & Oates had surpassed Everly Brothers as the most successful duo in rock history, earning a total of 19 gold and platinum awards. Released in October of 1984, Big Bam Boom expanded their number of gold and platinum awards, selling over two million copies and launching four Top 40 singles, including the number one \"Out of Touch.\" Following their contract-fulfilling gold album Live at the Apollo with David Ruffin & Eddie Kendrick, Hall & Oates went on hiatus. After the lukewarm reception for Daryl Hall's 1986 solo album, Three Hearts in the Happy Ending Machine, the duo regrouped to release 1988's Ooh Yeah!, their first record for Arista. The first single, \"Everything Your Heart Desires,\" went to number three and helped propel the album to platinum status.\n\nHowever, none of the album's other singles broke the Top 20, indicating that the era of chart dominance had ended. Change of Season, released in 1990, confirmed that fact. Although the record went gold, it only featured one Top 40 hit — the number 11 single, \"So Close.\" The duo mounted a comeback in 1997 with Marigold Sky, but it was only partially successful; far better was 2003's Do It for Love and the following year soul covers record Our Kind of Soul. <a href=\"https://www.last.fm/music/+noredirect/Daryl+Hall+&+John+Oates\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    },
    "David Ruffin": {
      "biography": "Davis Eli \"David\" Ruffin (January 18, 1941 – June 1, 1991) was an American soul singer and musician most famous for his work as one of the lead singers of the Temptations from 1964 to 1968 (or the group's \"Classic Five\" period as it was later known). He was the lead voice on such famous songs as \"My Girl\" and \"Ain't Too Proud to Beg.\"\nKnown for his unique raspy and anguished tenor vocals, Ruffin was ranked as one of the 100 Greatest Singers of All Time by Rolling Stone magazine in 2008. He was inducted into the Rock and Roll Hall of Fame in 1989 for his work with the Temptations. Fellow Motown recording artist Marvin Gaye once said admiringly of Ruffin that, \"I heard [in his voice] a strength my own voice lacked.\"\n\nRuffin was born Davis Eli Ruffin in the rural unincorporated community of Whynot, Mississippi, fifteen miles from Meridian, Mississippi. He was the third born son of Elias \"Eli\" Ruffin, a Baptist minister, and Ophelia Ruffin (née Davis). His siblings were Quincy B. Ruffin, Rita Ruffin, and Jimmy L. Ruffin. His parents were both natives of Mississippi. His father Eli worked as a truck driver at a lumber mill and his mother Ophelia worked out of their home. As far as the ancestry of the Ruffin family, Eli's parents had moved from Alabama to Mississippi, due to the harsh circumstances of living after the American Civil War. Prior to living in Alabama, David Ruffin's great grandparents, John Ruffin and Clara Ruffin, had moved from Bertie County, North Carolina. John Ruffin was a Civil War Veteran, fighting with the 14th United States Colored Heavy Artillery Regiment.\nRuffin's father was strict and at times violently abusive. Ruffin's mother died just months after his birth and his father married a schoolteacher, Earline, in 1942. As a young child, Ruffin, along with his other siblings (older brothers Quincy and Jimmy, and sister Rita Mae), traveled with their father and their stepmother as a family gospel group, opening shows for Mahalia Jackson and The Five Blind Boys of Mississippi, among others. Ruffin sang in the choir at Mount Salem Methodist Church, talent shows, and wherever else he could. In 1955, at the age of fourteen, he left home under the guardianship of a minister and went to Memphis, Tennessee with the purpose of pursuing the ministry.\nAt age 15, Ruffin went to Hot Springs, Arkansas with the jazz musician Phineas Newborn, Sr. There they played at the Fifty Grand Ballroom and Casino. Ruffin continued to sing at talent shows, worked with horses at a jockey club and eventually became a member of the Dixie Nightingales. He also sang with the Soul Stirrers briefly after the departure of Johnnie Taylor. It was in Ruffin's travels as a teenager that he met such later popular personalities as Elvis Presley, Little Richard, Frankie Lymon, Bobby Womack, the Staple Singers, the Swan Silvertones and the Dixie Hummingbirds.\nAfter some of his singing idols like Sam Cooke and Jackie Wilson had left gospel music and gone secular, Ruffin also turned in that direction. The 16-year-old Ruffin met and came under the guardianship of Eddie Bush and his wife Dorothy Helen, who took the teenager to Detroit, Michigan, where his brother Jimmy was pursuing a career in music while working at the Ford Motor Company.\n\nAfter moving to Detroit with the Bushes, Ruffin recorded his first released records with the songs \"You and I\" (1958) b/w \"Believe Me\" (1958) and the original version of \"Statue of a Fool.\" These songs were recorded at Vega Records and released under the name \"Little David Bush\", using the last name of the man he was living with at the time, Eddie Bush. Ruffin would later recall how he initially recorded \"a different kind of music\", strongly influenced by the smoother pop and R&B of the time, when he first recorded in Detroit for Vega.\nIn 1957, Ruffin met Berry Gordy, Jr., then a songwriter with ambitions of running his own label. Ruffin lived with Gordy's father, a contractor, and helped \"Pops\" Gordy do construction work on the building that would become Hitsville USA, the headquarters for Gordy's Tamla Records (later Motown Records) label. Ruffin's brother Jimmy would eventually be signed to Tamla's Miracle Records label as an artist.\nRuffin also worked alongside another ambitious singer, Marvin Gaye, as an apprentice at Anna Records, a Chess-distributed label run by Gordy's sister Gwen Gordy Fuqua and his songwriting partner Billy Davis. Asked about Ruffin in the Detroit Free Press in 1988, Gordy Fuqua said, \"He was very much a gentleman, yes ma'am and no ma'am, but the thing that really impressed me about David was that he was one of the only artists I've seen who rehearsed like he was on stage.\"\nEventually, Ruffin started recording at Anna Records, and recorded the song \"I'm in Love\" b/w \"One of These Days\" (1961), with the Voice Masters, which included future Motown producer Lamont Dozier and members of the singing group the Originals Ty Hunter, C.P. Spencer, Hank Dixon and Voice Masters and The Originals founder Walter Gaines (and, at one time, it also had another future Temptations member, Melvin Franklin, one of numerous people David would claim as a cousin).\nRuffin eventually met an up-and-coming local group by the name of The Temptations. His older brother Jimmy Ruffin went on a Motortown Revue tour with the Temptations, and he told David that they needed someone to sing tenor in their group. Ruffin showed interest in joining the group to Otis Williams whom he lived very close to in Detroit. In January 1964, Ruffin became a member of the Temptations after founding member Elbridge \"Al\" Bryant was fired from the group (Ruffin's first recording session with the group was January 9, 1964). Though both David and his brother Jimmy were considered, David was given an edge over Jimmy thanks to his performance skills, which David displayed when he joined the Temptations on-stage during the New Year's Eve party in 1963.\n\nThe bespectacled Ruffin initially sang backgrounds, while the role of lead singer mostly alternated between Eddie Kendricks and Paul Williams. He did sing a few lead parts both on stage and in the studio during his first year with the group, but his leads on these studio tracks would not be released for over a year, as they were considered not good enough to showcase Ruffin's vocals. Smokey Robinson, who produced and co-wrote most of the Temptations' material at this point, saw Ruffin during this period as a \"sleeping giant\" in the group with a unique voice that was, \"mellow,\" yet, \"gruff.\" Robinson thought that if he could write just the perfect song for Ruffin's voice, then he could have a smash hit. The song was to be something that Ruffin could \"belt out\" yet something that was also \"melodic and sweet\". That song, \"My Girl\", was recorded in November 1964 and released a month later, became the group's first number-one single in 1965. \"My Girl\" became the Temptations' signature song and elevated Ruffin to the role of lead singer and front man.\nThe follow-ups to \"My Girl\" were also extremely successful singles, including the Ruffin-led hits \"It's Growing\" (1965), \"Since I Lost My Baby\" (1965), \"My Baby\" (1965), \"Ain't Too Proud to Beg\" (1966), \"Beauty Is Only Skin Deep\" (1966), \"(I Know) I'm Losing You\" (1966), \"All I Need\" (1967), \"(Loneliness Made Me Realize) It's You That I Need\" (1967), \"I Wish It Would Rain\" (1967), and \"I Could Never Love Another (After Loving You)\" (1968). Ruffin also shared lead vocals on the 1967 hit single \"You're My Everything\" with Eddie Kendricks. The tall, 6'3\", Ruffin's passionate and dramatic performances endeared him to the Temptations' audiences and fans. According to Otis Williams, Ruffin (playfully nicknamed \"Ruff\" by the group) was initially a natural comedian and a hard-working singer when he first joined the group. Ruffin's most notable non-vocal contribution to the Temptations was the masterminding of their trademark four-headed microphone stand.\n\nBy 1967, however, ego problems with Ruffin became an issue for the group. He became addicted to cocaine and began missing rehearsals and performances. Refusing to travel with the other Temptations, Ruffin and his then-girlfriend Tammi Terrell traveled in a custom limo (with the image of his trademark black rimmed glasses painted on the door). After the Supremes had their name changed to Diana Ross & the Supremes in early 1967, Ruffin felt that he should become the focal point of the Temptations, just as Diana Ross was for her group and began demanding that the group name be changed to David Ruffin & the Temptations. This led to a number of disagreements between Ruffin and the group's de facto leader, Otis Williams. In addition to the group's problems with Ruffin's ego, he began inquiring into the Temptations' financial records, demanding an accounting of the group's money. This caused friction between Ruffin and Gordy.\nIn June 1968, the Temptations agreed that Ruffin had finally crossed the line when he missed a June 22 Cleveland, Ohio date with the Temptations to instead attend a performance by his new girlfriend, Barbara Gail Martin (Dean Martin's daughter). Ruffin was fired on June 27 and replaced with Dennis Edwards, a former member of The Contours who had been a friend of Ruffin and the group as a whole beforehand. Though Ruffin himself personally encouraged Edwards to take his place, Ruffin began turning up unannounced at Temptations' concerts during Edwards' first few dates with the group. When the group started to perform a Ruffin-era song such as \"My Girl\" or \"Ain't Too Proud to Beg\", Ruffin would suddenly walk on to the stage, take the microphone from Edwards' hands, and steal the show, embarrassing the group but entertaining the fans. According to Edwards, the adulation and Ruffin's pleas convinced the other four Temptations to give Ruffin a second chance, but when he arrived late to what was to be his return show with the group in Gaithersburg, Maryland, The Temptations decided to keep Edwards and drop considerations of rehiring Ruffin.\nIn October 1968, Ruffin filed suit against Motown Records, seeking a release from the label and an accounting of his money. Motown counter-sued to keep the singer from leaving the label and eventually the case was settled. The settlement required Ruffin to remain with Motown to finish out his initial contract (Ruffin joined Motown as a solo artist and always had a separate contract from the other Temptations, which some felt caused a lot of the in-fighting within the group).\n\nRuffin's first solo single was a song originally intended for the Temptations, \"My Whole World Ended (The Moment You Left Me)\". The single from the album entitled My Whole World Ended was released in 1969 followed soon by the album Feelin' Good. The single reached the US Pop & R&B \"Top Ten.\" A third album, titled David, was recorded in 1970-71, but was shelved by Motown and did not see a commercial release until 2004; his next official release for Motown did not arrive until 1973, when David Ruffin was released. His final Top Ten hit was 1975's \"Walk Away from Love\", produced by Van McCoy, which reached number nine on the Pop chart. It sold over one million copies, and was awarded a gold disc by the R.I.A.A. in February 1976. Other notable recordings from Ruffin's solo career include \"I Lost Everything I've Ever Loved\" (1969); the gospel-inflected \"I'm So Glad I Fell For You\" (1970); \"Blood Donors Needed (Give All You Can)\" (1973); \"Common Man\" (1973) (which was sampled on the 2001 Jay-Z song \"Never Change\"); \"No Matter Where\" (1974); \"Who I Am\" (1975); \"Statue of a Fool\" (1975); and cover versions of the Jackson Five's \"I Want You Back\", \"Rainy Night in Georgia\" popularized by Brook Benton (both recorded for the shelved 1970 album); and Harold Melvin and the Blue Notes' \"I Miss You\", featuring Eddie Kendrick (1973).\n\nIn 1970 Ruffin recorded an album with his brother Jimmy, I am My Brother's Keeper, for which they had minor hits with \"When My Love Hand (Comes Tumbling Down)\" and \"Your Love Was Worth Waiting For\". While his solo career initially showed promise, Ruffin reportedly went into decline in part because of his cocaine addiction and the lack of support from Motown.\nAfter leaving Motown in 1977, Ruffin recorded for Warner Bros. Records releasing the albums So Soon We Change (1979) and Gentleman Ruffin (1980), and later signed with RCA Records, accompanied by former Temptations band-mate Eddie Kendrick, who chose to rekindle their friendship when Kendrick himself started experiencing problems with the Temptations.\nIn 1982, Ruffin and Eddie Kendricks re-joined the Temptations for the recording of their album Reunion and the tour to promote the album. Reunion included the R&B hit \"Standing on the Top\" with Rick James. The reunion tour, however, was short lived as Ruffin started to miss shows due to his cocaine addiction, leading the group to be fined thousands of dollars. Otis Williams fired Ruffin for the second and final time from the group along with Kendricks (whose voice was weakened due to heavy chain smoking) by Christmas 1982. Ruffin started touring with Kendrick (who dropped the \"s\" from his last name at this time) as a duo act in 1985.\nIn 1982, Ruffin was sentenced to six months in a low-security prison in Terre Haute, Indiana, for failing to pay taxes during the mid-1970s. On May 19, 1986, he pleaded no contest to a charge of receiving and concealing stolen property worth less than $100 (a Colt .32-caliber handgun) and was fined $50 plus $100 in court costs. Charges of assault and battery and receiving stolen property worth more than $100 were dropped. A 1987 cocaine arrest landed him in jail for repeated parole violations.\nIn 1985, longtime Temptations fans Hall & Oates teamed up with Ruffin and Kendrick to perform at the re-opening of the Apollo Theater in New York. Their performance was released as a relatively successful live album and single. The four singers also sang a medley of Temptations hits at Live Aid on July 13, 1985. John Oates later wrote a minor hit single for Ruffin and Kendrick, but the two duos fell out, allegedly due to Daryl Hall's objections to Ruffin's heavy drug use. After being inducted into the Rock and Roll Hall of Fame, in 1989, with the other Temptations, Ruffin, Kendrick and Dennis Edwards began touring and recording as \"Ruffin/Kendrick/Edwards: Former Leads of The Temptations\". On August 17, 2013 in Cleveland, Ohio The Official R&B Music Hall of Fame inducted David Ruffin as a solo artist and also a member of The Temptations. His family was on hand for this great honor.\n\nRuffin was married twice. His first marriage was to Sandra Ruffin in 1961 with whom he had three daughters, Cheryl, Nedra and Kimberly. In 1976, Ruffin married Joy Hamilton. He also had one son he named David Ruffin Junior with his former girlfriend Genna Sapia, who--after his death--would add \"Ruffin\" to her last name in tribute to their long-term relationship, as well as to the fact that they had a son together. The two lived as husband and wife, but were never legally married.\nRuffin also had a well publicized relationship with Motown label mate and Marvin Gaye duet partner, singer Tammi Terrell.\n\nAfter a successful month-long tour of England with Kendrick and Edwards, Ruffin died on June 1, 1991, in a Philadelphia, Pennsylvania, hospital of \"an adverse reaction to drugs\" - namely cocaine. Although the cause of death was ruled an accident, Ruffin's family and friends suspected foul play, claiming that a money belt containing the proceeds from the tour ($300,000) was missing from his body. He had just finished recording the single \"Hurt the One You Love\" for Motorcity Records.\nIn The Temptations television miniseries, Ruffin's beaten body is depicted as being thrown from a moving car in front of a hospital, where he dies. Also stated in the mini-series was that his body remained unclaimed in a morgue for a week after his death. As a result, Ruffin's estate filed suit against NBC and other major players involved in the making of the series, claiming defamation. According to the plaintiffs in the case, Ruffin was actually taken to the hospital by a limousine and was escorted to the waiting area by his driver, who informed the attendants of his identity. The Ruffin children further state that his body was claimed by one of them within a few days after his death. (Ruffin's estate lost the lawsuit; the ruling against them was upheld on appeal.)\n\nRuffin had many admirers among his fellow artists, mainly for the emotive power he brought to every song he sang. \"Nobody could sing like David Ruffin,\" said his close friend and colleague Martha Reeves (of Martha and the Vandellas fame). His contemporary, label-mate, and long-time acquaintance Marvin Gaye was particularly impressed with the virility of Ruffin's voice. Gaye said Ruffin's work \"made me remember that when a lot of women listen to music, they want to feel the power of a real man.\"\nDaryl Hall of Hall & Oates, one of Ruffin's biggest fans, said, \"His voice had a certain glorious anguish that spoke to people on many emotional levels\". Ruffin himself said, \"I don't know what kind of voice I have, I really don't\"...it's just about \"the feeling I get for the song.\"\nThe raspy-voiced Rod Stewart fell in love with Ruffin's voice after he heard \"I Wish It Would Rain\". \"It jumped out of the speakers and ravished my soul,\" Stewart exclaimed. Stewart would later become friends with Ruffin. \"His voice was so powerful -- like a foghorn on the Queen Mary,\" Stewart told Rolling Stone magazine.\nFor all of his nearly forty years in the music business, much of it with modest success, Ruffin is remembered almost exclusively for his relatively brief stint in the Temptations. The cover art of his last album Gentleman Ruffin was the inspiration on the art of rapper Wiz Khalifa's mixtape Kush and Orange Juice.\n\nIn 1998, NBC aired The Temptations, a four-hour television miniseries about the group's career. Ruffin was portrayed by Leon Robinson (who uses the professional name \"Leon\"). The actor won high praise for his portrayal of Ruffin, but Ruffin's family was upset by the way the miniseries portrayed Ruffin and filed a lawsuit against the producers of the miniseries and also Otis Williams, whose memoir had been the source material for the miniseries. The case was dismissed in favor of the defendants, with Williams later claiming that he had no real control over the presentation of the material.\nGrand Puba of Brand Nubian referenced the singer on the 1990 single \"All for One\", stating: \"I hit a beat and swing a note as if my name was David Ruffin\".\nRapper Machine Gun Kelly also referenced the singer on his 2013 song \"See My Tears\" stating:\"Fought every temptation shit, I guess I’m David Ruffin huh?\"\nThe first song on Fall Out Boy's 2005 CD From Under the Cork Tree was to have been titled \"My Name is David Ruffin...and These are The Temptations\" but for legal reasons, the name was changed (to \"Our Lawyer Made Us Change the Name of This Song So We Wouldn't Get Sued\").\nHotstylz used Ruffin's song and referred his name on their hip-hop single \"Lookin' Boy\".\nAmerican rap rock group Gym Class Heroes references Ruffin in the 2008 song \"Like Father, Like Son (Papa's Song)\" from their album The Quilt stating: \"I never understood temptation. But I guess we both got a little David Ruffin in us.\"\n <a href=\"https://www.last.fm/music/David+Ruffin\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    },
    "Eddie Kendricks": {
      "biography": "Eddie Kendricks (Edward James Kendrick, Union Springs, Alabama, December 17, 1939 – Birmingham, Alabama, October 5, 1992), was an American singer and songwriter, noted for his distinctive falsetto singing style. Kendricks co-founded the Motown singing group The Temptations, and was one of their lead singers from 1960 until 1971. His was the lead voice on such famous songs as \"The Way You Do The Things You Do\", \"Get Ready\", and \"Just My Imagination\". As a solo artist, Kendricks recorded several hits of his own during the 1970s, including the number-one single \"Keep On Truckin'\".\n\nKendricks' solo career began slowly; he endured two years of singles that missed the Top 40, while The Temptations continued with their string of Norman Whitfield-helmed hits (one of which, \"Superstar (Remember How You Got Where You Are)\", was written as a jab towards Kendricks and Ruffin). Despite enjoying only a modicum of commercial success and radio airplay, Kendricks's 1972 album People... Hold On (with the aid of his touring group, The Young Senators: Jimi Dougans, Frank Hooker, LeRoy Fleming, Wornell Jones, David Lecraft, James Drumer Johnson and John Engram) was a cornerstone of DJ playlists in downtown New York's nascent disco scene. The expansive, eight minute take on \"Girl, You Need A Change Of Mind\", which peaked at number thirteen on the soul chart, from the album was a particular favorite at David Mancuso's Loft. The single was later remade by R&B singer D'Angelo for the Get on the Bus Soundtrack. As the dance craze seeped through into other cities, Kendricks scored a #1 pop hit in 1973 with the Frank Wilson-produced \"Keep on Truckin'\". It sold over one million copies, and was awarded a gold disc. Future hits included \"Boogie Down\" (US #2) (1974) and another million selling release,[3] \"Son of Sagittarius\" (US #28) (1974), \"Shoeshine Boy\" (US #18) (1975), and \"He's a Friend\" (US #36) (1976). Another notable song is \"Intimate Friends\" (1977), which is sampled for the Alicia Keys song \"Unbreakable\", \"A Penny for My Thoughts\" by Common, Sparkle's \"Time to Move on\" on her self-titled first studio album and Sweet Sable's \"Old Time's Sake\" from the soundtrack for the 1994 2pac film, Above the Rim. Erykah Badu also sampled \"Intimate Friends\" for her song \"Fall in Love (Your Funeral)\", as well as his song \"My People... Hold on\" for her song \"My People\" on her album New Amerykah Part One (4th World War).\nExasperated by a lack of creative and financial control, Kendricks left Motown in 1978, with the requirement of signing away the rights to his royalties. He moved first to Arista Records, and later to Atlantic Records. By this time, his popularity had waned, and he was also gradually losing his voice as a result of chain smoking.\nHe and David Ruffin briefly re-joined the Temptations for a 1982 reunion tour. In an interview with Tom Meros, Dennis Edwards, Kendricks's former Temptations band mate, claimed that Kendricks had issues hitting his falsetto notes during recording sessions for the reunion album. Because of his singing difficulty, Edwards said that Kendricks went to a physician to examine his vocal ability. The physician discovered a \"pin drop\" of cancer on one of his lungs. However, Kendricks reportedly refused to undergo chemotherapy at the time because of fear that he would lose his hair.\nRuffin and Kendrick (Kendricks dropped the \"s\" from his stage name during the 1980s) reportedly met up one night when Ruffin went to watch Kendrick perform in a nightclub; Kendrick spotted Ruffin in the crowd, pointed him out, and invited him to come up on stage and perform with him. Afterward they talked about touring on their own and recorded an album as a duo for RCA in 1988.\n\nEarlier, in 1985, they participated in the Hall & Oates live album Live at The Apollo recorded at a benefit at New York City's Apollo Theater; and sang with the duo at Live Aid in Philadelphia and the MTV Video Music Awards in New York. Hall & Oates have cited Kendrick and Ruffin specifically, and the Temptations in general, as a major influence.\nIn 1989, Kendrick, Ruffin, and their Temptations bandmates were inducted into the Rock and Roll Hall of Fame. There, Kendrick and Ruffin made plans with fellow former Temptation Dennis Edwards to tour and record as \"Ruffin/Kendrick/Edwards, Former Leads of The Temptations.\" The Ruffin/Kendrick/ Edwards project was cut short in 1991, when Kendrick was diagnosed with lung cancer and David Ruffin died of a drug overdose, although Kendrick and Edwards continued to tour for the remainder of 1991.\nIn late 1991, Kendrick, by now living in his native Birmingham, Alabama, underwent surgery to have one of his lungs removed in hopes of preventing the spread of the cancer. He continued to tour through the summer of 1992, when he fell ill again and was hospitalized. Kendrick died on October 5, 1992, of lung cancer in Birmingham at the age of 52. Kendrick is survived by his three children: Parris Kendrick, Aika Kendrick and Paul Kendrick. He was buried in Elmwood Cemetery.\nIn 1998, NBC aired The Temptations, a four-hour television miniseries based upon an autobiographical book by Otis Williams. Kendricks was portrayed by actor Terron Brooks.\n\nKendricks was born in  on December 17, 1939, the son of Johnny and Lee Bell Kendrick. He had one sister, Patricia, and three brothers, Charles, Robert, and Clarence. His family moved to Birmingham, where he met and began singing with his best friend Paul Williams in their church choir in the late 1940s. In 1955, Kendricks, Williams, and friends Kell Osborne and Jerome Averette formed a doo-wop group called The Cavaliers, and began performing around Birmingham. The group decided to move for better opportunities in their musical careers, and in 1957 the group moved to Cleveland, Ohio. In Cleveland, they met manager Milton Jenkins, and soon moved with Jenkins to Detroit, Michigan, where the Cavaliers renamed themselves 'The Primes'. Under Jenkins' management, the Primes did well for themselves in the Detroit area, eventually creating a female spin-off group called The Primettes (later The Supremes). In 1961, Osbourne moved to California, and the Primes disbanded. Kendricks and Paul Williams joined forces with members Otis Williams and Melvin \"Blue\" Franklin of Otis Wiliiams and the Distants after three members quit and became The Elgins, who on the same day changed their name to \"The Temptations\" and signed to Motown.\n\nThe Temptations began singing background for Mary Wells. After an initial dry period, The Temptations quickly became the most successful male vocal group of the 1960s. Although technically Kendricks was first tenor in the group's harmony, he predominately sang in a falsetto voice. Among the Temptations songs Kendricks sang lead on were \"Dream Come True\" (1962), the group's first charting single; \"The Way You Do the Things You Do\" (1964), the group's first US Top 20 hit; \"I'll Be in Trouble\" (1964); \"The Girl's Alright With Me\" (1964), a popular b-side that Kendricks co-wrote; \"Girl (Why You Wanna Make Me Blue)\" (1964); \"Get Ready\" (1966); \"Please Return Your Love to Me\" (1968); and \"Just My Imagination\" (1971). He was also allowed to sing a few leads in his natural voice such as \"May I Have This Dance\" (1962). He shares lead vocal duty on other records, including \"You're My Everything\" (1967) (shared with David Ruffin), and a long string of Norman Whitfield produced psychedelic soul records where all five Temptations sang lead, such as the Grammy winner \"Cloud Nine\" (1968), \"I Can't Get Next to You\" (1969), and \"Ball of Confusion\" (1970). He also leads on \"I'm Gonna Make You Love Me\" (1968), a popular duet with Diana Ross and the Supremes, and on the Temptations' famous version of the Christmas classic \"Rudolph the Red-Nosed Reindeer\" (1968).\n\nIn the Temptations, Kendricks was responsible for creating most of the group's vocal arrangements, and also served as wardrobe manager, including the now famous purple suits the group wore for one performance. He also co-wrote several Temptations songs apart from \"The Girl's Alright With Me\" including \"Isn't She Pretty\" (1961) and \"Don't Send Me Away\" (1967). His favorite food was cornbread, and as a result he was nicknamed \"Cornbread\" (or \"Corn\" for short) by his groupmates. According to Otis Williams, Kendricks romantically pursued Diana Ross, lead singer of the Supremes, and he was said to have been close friends with Martha Reeves of the Vandellas. In her second book, Supreme Faith, Supremes singer Mary Wilson writes that she and Kendricks were lovers \"briefly,\" but remained close friends.\nKendricks remained in the group through the rest of the decade, but a number of issues began to push him away from it in the late 1960s and early 1970s. He was uncomfortable with singing the psychedelic style that Whitfield was now crafting for the group as opposed to the romantic ballads they had sung under the direction of Smokey Robinson; his friend Paul Williams was often too ill to perform with the group; and Kendricks often found himself at odds with bandmates Otis Williams and Melvin Franklin. As he grew away from the group, Kendricks began to rekindle his friendship with ex-Temptation David Ruffin, who convinced him to leave the group.\nIn a 1991 interview with a Chicago television series called Urban Street, Kendricks said he had actually considered leaving the group as early as 1965, even though that was when the band was finally starting to take off, because of things that \"weren't quite proper.\" He explained that they were working with people that \"didn't have their best interests at heart.\" Kendricks, however, initially decided to stay in the group because he was worried he would not get the support he needed if he left the group. Kendricks also expressed the fact that his relationship with Berry Gordy was less than cordial. \"Berry Gordy is a man I don't know, I only met him about three times,\" he said, but \"I know he didn't particularly care for me.\" Kendricks stated that he did not agree with many decisions that were made.\nFollowing one final altercation with Williams and Franklin during a run at the Copacabana nightclub in November 1970, Kendricks walked off after the first night and didn't return, and it was mutually decided he would leave the group. While working on his first solo album, Kendricks recorded one last hit single with the Temptations, 1971's \"Just My Imagination (Running Away with Me)\". By the time the record reached #1 on the US pop charts in April 1971, Kendricks had signed a solo deal with Motown's Tamla imprint and was preparing the release of his first solo album, All By Myself. However, many of his problems with Motown would reoccur.\n\n <a href=\"https://www.last.fm/music/Eddie+Kendricks\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "Europe",
  "created_at": "2025-07-05T16:09:36.097401",
  "date_added": "2020-08-01T12:45:09-07:00",
  "discogs_id": "1389988",
  "discogs_url": "https://www.discogs.com/release/1389988-Daryl-Hall-John-Oates-With-David-Ruffin-Eddie-Kendrick-Live-At-The-Apollo",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock",
    "Funk / Soul"
  ],
  "id": "1389988",
  "images": [
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/_FgRRAfpkLkavKoZFz8kUlnoPnvKETjrHSHECwN6ric/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDYzOTk0/MC5qcGVn.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/_FgRRAfpkLkavKoZFz8kUlnoPnvKETjrHSHECwN6ric/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDYzOTk0/MC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 582,
      "resource_url": "https://i.discogs.com/njC5G-YjJ6986rffbZVUhyIECxnjK7NPP8VR4BtHlzQ/rs:fit/g:sm/q:90/h:582/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDYzOTk2/Mi5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/njC5G-YjJ6986rffbZVUhyIECxnjK7NPP8VR4BtHlzQ/rs:fit/g:sm/q:90/h:582/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDYzOTk2/Mi5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/WTrm2gTx_W1Ll47_c99-ebSI9gW5M9-yIWCuInQHVP4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTIzNTc1Njg5/OS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/WTrm2gTx_W1Ll47_c99-ebSI9gW5M9-yIWCuInQHVP4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTIzNTc1Njg5/OS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/jSrTBBOfnp6r-ZE1InFplo-7iYNntVdNQDcX8mTZZXg/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTIzNTc1Njg3/MC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/jSrTBBOfnp6r-ZE1InFplo-7iYNntVdNQDcX8mTZZXg/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTIzNTc1Njg3/MC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/FKHCWnrqAQlQXTE5GjuIdYJv_aBbLwVrTHWfAJ32yK4/rs:fit/g:sm/q:90/h:600/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDYzOTk5/OS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/FKHCWnrqAQlQXTE5GjuIdYJv_aBbLwVrTHWfAJ32yK4/rs:fit/g:sm/q:90/h:600/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDYzOTk5/OS5qcGVn.jpeg",
      "width": 586
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/_IFjlKtsjBVgj7kg0SZ1N5Q7Bp6NjseFkzhn2T73HTY/rs:fit/g:sm/q:90/h:600/w:596/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDY0MDAy/NC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/_IFjlKtsjBVgj7kg0SZ1N5Q7Bp6NjseFkzhn2T73HTY/rs:fit/g:sm/q:90/h:600/w:596/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTMwMDY0MDAy/NC5qcGVn.jpeg",
      "width": 596
    },
    {
      "height": 220,
      "resource_url": "https://i.discogs.com/SuYAzuxid2k_tzx32E_RL__yjQChFZUcdL_RGKj_3fU/rs:fit/g:sm/q:90/h:220/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTU5MTU0Mjg1/OC0xMTkzLmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/SuYAzuxid2k_tzx32E_RL__yjQChFZUcdL_RGKj_3fU/rs:fit/g:sm/q:90/h:220/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTU5MTU0Mjg1/OC0xMTkzLmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 120,
      "resource_url": "https://i.discogs.com/XrUSAQvqjyNnnHtxSMpMiwdRwd45z24q7lGttUBwN08/rs:fit/g:sm/q:90/h:120/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTU5MTU0Mjg1/OC0zMzA3LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/XrUSAQvqjyNnnHtxSMpMiwdRwd45z24q7lGttUBwN08/rs:fit/g:sm/q:90/h:120/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTEzODk5/ODgtMTU5MTU0Mjg1/OC0zMzA3LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music/15/ac/83/mzi.bxkrpzli.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "RCA"
  ],
  "lastfm_mbid": null,
  "lastfm_url": null,
  "local_images": {
    "hi-res": "public/album/live-at-the-apollo-1389988/live-at-the-apollo-1389988-hi-res.jpg",
    "medium": "public/album/live-at-the-apollo-1389988/live-at-the-apollo-1389988-medium.jpg",
    "small": "public/album/live-at-the-apollo-1389988/live-at-the-apollo-1389988-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T16:09:45.496199",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "Live At the Apollo",
  "release_name_discogs": "Live At The Apollo",
  "release_name_spotify": "Live at the Apollo",
  "released": "1985",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music/15/ac/83/mzi.bxkrpzli.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 1985 RCA Records, a division of Sony Music Entertainment",
      "editorial_notes": "Daryl Hall and John Oates are in peak form on this electric 1985 headlining set at the Apollo Theater from 1985, showing off their effortlessly tight-knit yet limber take on soul pop. With former Temptations members Eddie Kendricks and David Ruffin in tow, the duo flash their bona fides on a rollicking introductory medley of Motown hits, before bringing it down to a simmer on a slow-burning take of “When Something Is Wrong With My Baby\".",
      "id": "262058880",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Daryl Hall & John Oates",
        "artwork": {
          "bgColor": "191d1e",
          "height": 600,
          "textColor1": "f1f2ec",
          "textColor2": "eaafb6",
          "textColor3": "c6c8c3",
          "textColor4": "c09297",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music/15/ac/83/mzi.bxkrpzli.jpg/{w}x{h}bb.jpg",
          "width": 596
        },
        "copyright": "℗ 1985 RCA Records, a division of Sony Music Entertainment",
        "editorialNotes": {
          "short": "Watch their sweaty, pop-infused soul come to life.",
          "standard": "Daryl Hall and John Oates are in peak form on this electric 1985 headlining set at the Apollo Theater from 1985, showing off their effortlessly tight-knit yet limber take on soul pop. With former Temptations members Eddie Kendricks and David Ruffin in tow, the duo flash their bona fides on a rollicking introductory medley of Motown hits, before bringing it down to a simmer on a slow-burning take of “When Something Is Wrong With My Baby\"."
        },
        "genreNames": [
          "Rock",
          "Music",
          "R&B/Soul",
          "Pop",
          "Soft Rock",
          "Adult Contemporary",
          "Soul",
          "Pop/Rock"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "Live At the Apollo",
        "playParams": {
          "id": "262058880",
          "kind": "album"
        },
        "recordLabel": "RCA/Legacy",
        "releaseDate": "1985-09-30",
        "trackCount": 7,
        "upc": "743211600323",
        "url": "https://music.apple.com/gb/album/live-at-the-apollo/262058880"
      },
      "url": "https://music.apple.com/gb/album/live-at-the-apollo/262058880"
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "(P) 1985 RCA Records, a division of Sony Music Entertainment",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "743211600323"
      },
      "id": "6e6XTbQ6rFQdyxQU1BUU4V",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b273e23b202f08ebdba20912bede",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e02e23b202f08ebdba20912bede",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d00004851e23b202f08ebdba20912bede",
          "width": 64
        }
      ],
      "label": "RCA/Legacy",
      "popularity": 23,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
            },
            "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
            "id": "77tT1kLj6mCWtFNqiOmP9H",
            "name": "Daryl Hall & John Oates",
            "type": "artist",
            "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
          }
        ],
        "copyrights": [
          {
            "text": "(P) 1985 RCA Records, a division of Sony Music Entertainment",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "743211600323"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/6e6XTbQ6rFQdyxQU1BUU4V"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/6e6XTbQ6rFQdyxQU1BUU4V?market=US",
        "id": "6e6XTbQ6rFQdyxQU1BUU4V",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b273e23b202f08ebdba20912bede",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e02e23b202f08ebdba20912bede",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d00004851e23b202f08ebdba20912bede",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "RCA/Legacy",
        "name": "Live at the Apollo",
        "popularity": 23,
        "release_date": "1985-09-10",
        "release_date_precision": "day",
        "total_tracks": 7,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/6e6XTbQ6rFQdyxQU1BUU4V/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
                  },
                  "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
                  "id": "77tT1kLj6mCWtFNqiOmP9H",
                  "name": "Daryl Hall & John Oates",
                  "type": "artist",
                  "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
                },
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/3FZn8Z2B7mfaSOU8NE62KR"
                  },
                  "href": "https://api.spotify.com/v1/artists/3FZn8Z2B7mfaSOU8NE62KR",
                  "id": "3FZn8Z2B7mfaSOU8NE62KR",
                  "name": "David Ruffin",
                  "type": "artist",
                  "uri": "spotify:artist:3FZn8Z2B7mfaSOU8NE62KR"
                },
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/2Uuon75BhnuuxdKLYn4wHn"
                  },
                  "href": "https://api.spotify.com/v1/artists/2Uuon75BhnuuxdKLYn4wHn",
                  "id": "2Uuon75BhnuuxdKLYn4wHn",
                  "name": "Eddie Kendricks",
                  "type": "artist",
                  "uri": "spotify:artist:2Uuon75BhnuuxdKLYn4wHn"
                }
              ],
              "disc_number": 1,
              "duration_ms": 756506,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0ZiMBtVGEWORKGmYRywM4Z"
              },
              "href": "https://api.spotify.com/v1/tracks/0ZiMBtVGEWORKGmYRywM4Z",
              "id": "0ZiMBtVGEWORKGmYRywM4Z",
              "is_local": false,
              "is_playable": true,
              "name": "Apollo Medley (with David Ruffin & Eddie Kendricks) - Live at the Apollo Theater, Harlem, NY - May 1985",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:0ZiMBtVGEWORKGmYRywM4Z"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
                  },
                  "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
                  "id": "77tT1kLj6mCWtFNqiOmP9H",
                  "name": "Daryl Hall & John Oates",
                  "type": "artist",
                  "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
                }
              ],
              "disc_number": 1,
              "duration_ms": 274800,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2veQXzhCtqhXO2i2MPVNg5"
              },
              "href": "https://api.spotify.com/v1/tracks/2veQXzhCtqhXO2i2MPVNg5",
              "id": "2veQXzhCtqhXO2i2MPVNg5",
              "is_local": false,
              "is_playable": true,
              "name": "When Something Is Wrong with My Baby - Live at the Apollo Theater, Harlem, NY - May 1985",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:2veQXzhCtqhXO2i2MPVNg5"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
                  },
                  "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
                  "id": "77tT1kLj6mCWtFNqiOmP9H",
                  "name": "Daryl Hall & John Oates",
                  "type": "artist",
                  "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
                }
              ],
              "disc_number": 1,
              "duration_ms": 471693,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5IhWRng9ZfxhIRu167eGxN"
              },
              "href": "https://api.spotify.com/v1/tracks/5IhWRng9ZfxhIRu167eGxN",
              "id": "5IhWRng9ZfxhIRu167eGxN",
              "is_local": false,
              "is_playable": true,
              "name": "Everytime You Go Away - Live at the Apollo Theater, Harlem, NY - May 1985",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:5IhWRng9ZfxhIRu167eGxN"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
                  },
                  "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
                  "id": "77tT1kLj6mCWtFNqiOmP9H",
                  "name": "Daryl Hall & John Oates",
                  "type": "artist",
                  "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
                }
              ],
              "disc_number": 1,
              "duration_ms": 462600,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1qrNDLrfpNjeabttloK3QG"
              },
              "href": "https://api.spotify.com/v1/tracks/1qrNDLrfpNjeabttloK3QG",
              "id": "1qrNDLrfpNjeabttloK3QG",
              "is_local": false,
              "is_playable": true,
              "name": "I Can't Go for That (No Can Do) - Live at the Apollo Theater, Harlem, NY - May 1985",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:1qrNDLrfpNjeabttloK3QG"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
                  },
                  "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
                  "id": "77tT1kLj6mCWtFNqiOmP9H",
                  "name": "Daryl Hall & John Oates",
                  "type": "artist",
                  "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
                }
              ],
              "disc_number": 1,
              "duration_ms": 352840,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5QBDHJb3JgrR3lPeaABMom"
              },
              "href": "https://api.spotify.com/v1/tracks/5QBDHJb3JgrR3lPeaABMom",
              "id": "5QBDHJb3JgrR3lPeaABMom",
              "is_local": false,
              "is_playable": true,
              "name": "One On One - Live at the Apollo Theater, Harlem, NY - May 1985",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:5QBDHJb3JgrR3lPeaABMom"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
                  },
                  "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
                  "id": "77tT1kLj6mCWtFNqiOmP9H",
                  "name": "Daryl Hall & John Oates",
                  "type": "artist",
                  "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
                }
              ],
              "disc_number": 1,
              "duration_ms": 364693,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3eiLpPf8HqpjWzaiWaD9tF"
              },
              "href": "https://api.spotify.com/v1/tracks/3eiLpPf8HqpjWzaiWaD9tF",
              "id": "3eiLpPf8HqpjWzaiWaD9tF",
              "is_local": false,
              "is_playable": true,
              "name": "Possession Obsession - Live at the Apollo Theater, Harlem, NY - May 1985",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:3eiLpPf8HqpjWzaiWaD9tF"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/77tT1kLj6mCWtFNqiOmP9H"
                  },
                  "href": "https://api.spotify.com/v1/artists/77tT1kLj6mCWtFNqiOmP9H",
                  "id": "77tT1kLj6mCWtFNqiOmP9H",
                  "name": "Daryl Hall & John Oates",
                  "type": "artist",
                  "uri": "spotify:artist:77tT1kLj6mCWtFNqiOmP9H"
                }
              ],
              "disc_number": 1,
              "duration_ms": 396400,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2g5LFjzR7ezFVqWpn769I9"
              },
              "href": "https://api.spotify.com/v1/tracks/2g5LFjzR7ezFVqWpn769I9",
              "id": "2g5LFjzR7ezFVqWpn769I9",
              "is_local": false,
              "is_playable": true,
              "name": "Adult Education - Live at the Apollo Theater, Harlem, NY - May 1985",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:2g5LFjzR7ezFVqWpn769I9"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 7
        },
        "type": "album",
        "uri": "spotify:album:6e6XTbQ6rFQdyxQU1BUU4V"
      },
      "release_date": "1985-09-10",
      "release_date_precision": "day",
      "total_tracks": 7,
      "tracks": [
        {
          "artists": [
            {
              "id": "77tT1kLj6mCWtFNqiOmP9H",
              "name": "Daryl Hall & John Oates"
            },
            {
              "id": "3FZn8Z2B7mfaSOU8NE62KR",
              "name": "David Ruffin"
            },
            {
              "id": "2Uuon75BhnuuxdKLYn4wHn",
              "name": "Eddie Kendricks"
            }
          ],
          "duration_ms": 756506,
          "explicit": false,
          "id": "0ZiMBtVGEWORKGmYRywM4Z",
          "name": "Apollo Medley (with David Ruffin & Eddie Kendricks) - Live at the Apollo Theater, Harlem, NY - May 1985",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "77tT1kLj6mCWtFNqiOmP9H",
              "name": "Daryl Hall & John Oates"
            }
          ],
          "duration_ms": 274800,
          "explicit": false,
          "id": "2veQXzhCtqhXO2i2MPVNg5",
          "name": "When Something Is Wrong with My Baby - Live at the Apollo Theater, Harlem, NY - May 1985",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "77tT1kLj6mCWtFNqiOmP9H",
              "name": "Daryl Hall & John Oates"
            }
          ],
          "duration_ms": 471693,
          "explicit": false,
          "id": "5IhWRng9ZfxhIRu167eGxN",
          "name": "Everytime You Go Away - Live at the Apollo Theater, Harlem, NY - May 1985",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "77tT1kLj6mCWtFNqiOmP9H",
              "name": "Daryl Hall & John Oates"
            }
          ],
          "duration_ms": 462600,
          "explicit": false,
          "id": "1qrNDLrfpNjeabttloK3QG",
          "name": "I Can't Go for That (No Can Do) - Live at the Apollo Theater, Harlem, NY - May 1985",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "77tT1kLj6mCWtFNqiOmP9H",
              "name": "Daryl Hall & John Oates"
            }
          ],
          "duration_ms": 352840,
          "explicit": false,
          "id": "5QBDHJb3JgrR3lPeaABMom",
          "name": "One On One - Live at the Apollo Theater, Harlem, NY - May 1985",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "77tT1kLj6mCWtFNqiOmP9H",
              "name": "Daryl Hall & John Oates"
            }
          ],
          "duration_ms": 364693,
          "explicit": false,
          "id": "3eiLpPf8HqpjWzaiWaD9tF",
          "name": "Possession Obsession - Live at the Apollo Theater, Harlem, NY - May 1985",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "77tT1kLj6mCWtFNqiOmP9H",
              "name": "Daryl Hall & John Oates"
            }
          ],
          "duration_ms": 396400,
          "explicit": false,
          "id": "2g5LFjzR7ezFVqWpn769I9",
          "name": "Adult Education - Live at the Apollo Theater, Harlem, NY - May 1985",
          "preview_url": null,
          "track_number": 7
        }
      ],
      "url": "https://open.spotify.com/album/6e6XTbQ6rFQdyxQU1BUU4V"
    }
  },
  "spotify_id": "6e6XTbQ6rFQdyxQU1BUU4V",
  "spotify_url": "https://open.spotify.com/album/6e6XTbQ6rFQdyxQU1BUU4V",
  "styles": [
    "Pop Rock",
    "Soul"
  ],
  "title": "Live At The Apollo",
  "tracklist": [
    {
      "artists": [],
      "duration": "",
      "position": "",
      "title": "Side 1"
    },
    {
      "artists": [],
      "duration": "",
      "position": "",
      "title": "Apollo Medley"
    },
    {
      "artists": [],
      "duration": "4:50",
      "position": "A2",
      "title": "When Something Is Wrong With My Baby"
    },
    {
      "artists": [],
      "duration": "7:08",
      "position": "A3",
      "title": "Everytime You Go Away"
    },
    {
      "artists": [],
      "duration": "",
      "position": "",
      "title": "Side A"
    },
    {
      "artists": [],
      "duration": "7:24",
      "position": "B1",
      "title": "I Can't Go For That (No Can Do)"
    },
    {
      "artists": [],
      "duration": "5:13",
      "position": "B2",
      "title": "One On One"
    },
    {
      "artists": [],
      "duration": "5:33",
      "position": "B3",
      "title": "Possession Obsession"
    },
    {
      "artists": [],
      "duration": "6:05",
      "position": "B4",
      "title": "Adult Education"
    }
  ],
  "updated_at": "2025-07-05T16:09:44.731375",
  "year": 1985
}