{
  "apple_music_id": "125560478",
  "apple_music_url": "https://music.apple.com/gb/artist/nine-below-zero/125560478",
  "biography": "Dennis Greaves  heads up the band, playing guitar and singing better now than at any time in his career, a legend in waiting persona! Then there is the mighty rhythm section of Gerry McAvoy  and Brendan O'Neill blowing up a storm! Gerry is a bass player's bass player, who spent 15 years laying it down for Rory Gallagher as did Brendan on drums for 10 years. Over this fat slice of rhythm, comes the unique harmonica of Mark Feltham ,since January 2001 Mark has been back playing with Nine Below Zero needless to say anyone who knows the band will be aware of his history, himself and Dennis being the founder members of the band. Live, this combination is lethal, hammering and nailing the big R n B sound to the floor of many a famous stage. It is not unusual for the band to sell out big clubs weeks up front.\n\"NBZ are brilliant live, they work so hard , the audience often go home as exhausted as the band\" so says Andrew Zweck of top promoters Harvey Goldsmith Ents. They have carved out a very credible niche, a place they will be for a very long time to come, because, who else is this good?.....this often? NBZ are the viable alternative to Alternative, a band that most definately come to play, a band with their own genuine sound and deep understanding of their musical roots. NBZ have a tireless spirit, no regrets, no excuses, no crap.\n\nFormed in South London in 1977, they won their place on the main London circuit two years later, storming usually complacent venues like Dingwalls, The Music Machine and The Rock Garden with a rip-roaring of Blues and R&B. Suddenly there was life in the old Blues horse yet! A new dynamic life! There was vigour, there was spontaneity, there was enthusiasm, there was ....... Nine Below Zero.\n\t\n\nAs the band embarked on a frighteningly intensive gig schedule, the stirrings grew and word spread across the nation, over the Channel to Europe and beyond. People like Canned Heat , Dr Feelgood and The Blues Band wanted to know about NBZ, offered them supports and so the reputation swelled, at the same rate as the crowds until they were a headlining band in their own right.\nAs time went by however it soon became clear that their contemporary and energetic performance of cover versions, was merely a starting point for their own ideas to emerge with a vibrant solid sound that is finally and indisputably their own.\nThe real story began with Dennis Greaves , nine years old and already wise to musicians like John Mayall and B.B. King via an uncles record collection. His interest grew, and by the time of his final year at school, he had a bass guitar and amp. In the time honoured 'Rock n Roll' tradition \"School work just stopped.... I was in the music room all the time trying to play this thing\".\nHis perseverance paid off and Dennis formed a band with a couple of mates, switched to lead guitar and ' made alot of noise'. They only ever played one gig and that was at a wedding reception.\nHis next band faired slightly better, they were accepted for a handful of pub bookings but a staple diet of Bad Company and Led Zeppelin proved too much for Dennis, so he left taking with him bassist Pete Clark . Together the pair set about forming a band to play the music closest to their hearts. They recruited a school friend, Kenny Bradley on drums, as well as one of their teachers for vocals, who dropped out shortly afterwards.\nThey still needed a harmonica player and someone gave Dennis the number of a bloke called Mark Feltham , so he telephoned him and discovered that they only lived a few doors from each other in Tulse Hill. They arranged to have a blow and Mark, who has only previously practised in his bedroom, was immediately accepted into 'Stans Blues Band' .\n\nIt was the fledgling Nine Below Zero .\n\nThe year was 1977 and the mood was Punk but the band had no intention of succumbing to fashion, even though the record companies were busily signing everything they saw with spiky hair and studs. They wanted to do it their way, no compromises. Ironically, the spirit of punk had it's helpful effects, Dennis harnessing it's 'hell for leather' energy into the music of Stans Blues Band. To say that they were playing New Wave R&B wouldn't be far off the mark.\nConsequently, they found themselves acceptable to certain elements of the punk audience, and in demand locally from their earliest days. They began playing regularly at pubs like the 'Thomas A Beckett' in the Old Kent Road, the 'Apples and Pears' in Bermondsey and the 'Clock House' in Clapham. It was a time of apprenticeship.\nThe first real breakthrough came when Dingwalls offered them a gig in January 1979, impressed by a tape that the band had recorded at the 'Apples and Pears' and sent to various influential venues. From then on 'Stans Blues Band' were playing in all the right venues in London and it was round the end of that year that there occurred the most significant event of all. A musician named Mickey Modern walked into the 'Thomas A Beckett', saw and loved the band and instantly decided to manage them, fed up with his own recording career, he saw in management the opportunity to be creative in a new and exciting way.\nWisely he persuaded them to stop calling themselves 'Stans Blues Band' ; they became 'Nine Below Zero' , a name which carried the blues flavour that Dennis was so anxious to preserve. Within a couple of weeks Mickey had them in the studio recording a demo that included four tracks which would materialise in the New Year on the 'Pack Fair and Square' EP . He found them a recording deal with A&M Records , who put out the EP themselves after the initial 3000 released by the band sold out. ( Released on Mickey's own label through A&M called M&L Records - if you've still got one of these keep it very safe as it's worth a fortune!)\nMickey demanded that they played more gigs and so the band gave up their day jobs and started playing any and every gig they could, seven nights a week, for weeks on end. Oddly enough, without having a hit record, the tracks from the EP were played almost every day for weeks, putting NBZ firmly on the map. All this took A&M completely by surprise, Derek Green ( then MD with A&M) said \" the exposure the band got never turned into real sales. I still can't say why now \"\nIn March 1980 Mickey 'Stix' Burkey gave up his day job and stepped in behind the drum kit to replace Kenny Bradley who had been finding the increasing demands of NBZ that bit too hectic. Stix knew the band, having previously supported them with a group called ' Spoof Order '. \" I thought I'd like to play in NBZ when I first saw them\" he recalls. A happy turn of events.\n\tThe band reached another milestone on July 16th 1980, when they recorded their first album ' Live at the Marquee ' , an exciting and vivid representation of the band as they were at that time. (Produced by Mickey, it still sells healthily today and is asked for by people all over Europe ) And so they went on tour to promote it.\nThree months later they headlined the Hammersmith Odeon with special guest Alexis Korner. The whole of 1980 was one long relentless tour for the band, they can remember having only one week off, but the endless slog was paying off and their continued advancement clearly visible.January 1981 bought recording sessions for their second album 'Don't point your finger' - their first studio album and a major progression.\nIt featured nine tracks written by members of the band as opposed to only three on their debut set and combined songs of loyal blues, thrust with several more uncharacteristic ompositions, notably ' You can't please all the People all the Time' , a robust number with an infectious chorus that pointed to a taste of things to come. Derek Green bought in Glyn Johns ( him of Led Zeppelin and Rolling Stones fame ) who was at that time a staff producer.\nGlyn made a great job of the album. In twelve days it was finished and released within two months. The album entered the charts twice, remaining there in all for about five weeks. Through Glyn the band were exposed to The Who and Kenney Jones came down to the studio. He loved what he heard and promptly asked Pete Townsend to give NBZ the support slot on The Who tour. The same thing happened with Ray Davies and so they went on tour with The Kinks .\n\nIn their quest for musical perfection, NBZ decided to look for a new bass player and with much regret had to say goodbye to Pete Clark in June 1981 and set about auditioning 50 replacements. Brian Bethall was the second and they knew that they would go back to him with their offer, impressed firstly by the fact that he did not look like a musician and secondly by his confident and imaginative playing. This had been an eventful year for the band and still in their early twenties they were still as enthusiastic and as excited as they ever were. They had made appearances on the 'Old Grey Whistle Test' , the 'South Bank Show' and further on up the road their legendary appearance on the very first ' Young Ones ' . Together with supports to The Who and The Kinks under their belts the band certainly proved that they could kick with the best of them.\nNine Below Zero recorded an album at Glyn John's studio in West Sussex but Glyn never allowed the band to stay the night and so they had to drive 100 miles a day. This had an odd effect on the relationship so things never really got off the ground and the album was shelved. Mind you, '11+11' was written as an epitaph and was re-recorded later. \t\n'Third Degree' was probably the most under-rated of all the albums that NBZ made. It contained the classic track '11+11' and was produced by Simon Boswell , who was a very influential part of the band's learning curve. '11+11' should have been a monster hit but somehow either it was miss-timed or bad luck took a hand. The disappointment had a knock on effect and the band split.\nDennis moved into the 'Truth' for the remainder of the eighties and Mark, having earned a high reputation entered the session world with high regard and quickly got himself established with Rory Gallagher . Brian continued playing and eventually found himself playing with the 'Blow Monkeys' . Stix ended up in management and equipment hire.\nThe year is 1990 and after some serious persuasion from various sources a 10th Anniversary gig is announced at the Town and Country Club in October. Was the NBZ flag still flying? The gig sold out and another gig was announced. Gerry McAvoy and Brendan O'Neill were leaving Rory Gallagher's band and they intended to form their own but through Mark Feltham they heard that Dennis was trying out Drums and Bass players for the new NBZ. So a blow was arranged and worked a treat. The packed houses at the Town and Country witnessed the same energy, excitement and fervour that blew their minds a decade ago. NBZ were back and the public greeted them with open arms.\nA short tour in December followed taking them out of London and showing the band that they were wanted nationwide. At the same time Derek Green , now of China Records , came,saw and wanted to be involved. In early 1991 5 songs were demo-ed and played to China Records. China said Go with an album and 'On the Road Again' a significant and apt title was recorded and released in April 1991. Touring continued establishing NBZ again in the UK and earning them high regard in Europe. Tour followed tour in '91. NBZ were back .\nIt was sad to have to say goodbye to Mark early in '92 due to health problems but a new harmonica player called Alan Glen quickly filled the gap. He first came to light in 1985 when he won the Hohner Harmonica Player of the Year. Alan had also played with B.B King , Johnny Winter and Albert Collins . And so the touring continued, and another album called 'Off the Hook' was released again on China Records, inviting rave reviews. Then they supported Sting on his 1993 European tour, things were going pretty well.\nWhat a year 1994 was for NBZ, a full book of dates and good record sales. Little did they know that their reputation had reaches the ears of Eric Clapton and he loved what he heard. Suddenly they were invited to join Eric at the Royal Albert Hall, playing the whole twelve nights and going down a storm. In the audience on one of those nights sat Sting, he loved the band so much he bought them! That night he signed NBZ to his newly formed record company Panagea Records distributed through A&M. Word got round and Ray Davies , a long time NBZ fan booked them for his tour of Britain including Wembley Arena. Brian May came in with six shows across Britain on his solo tour.\nOctober and November 1994 saw the band gigging all over America and Canada with Allanah Miles and Alvin Lee promoting their U.S. album 'Hot Music for A Cold Night' . In 1995 Alan Glen left the band , due to the heavy touring commitments and his place was filled by Billy Boy from Ireland who had supported the band on one of their gigs over there. March 1996 saw the release of their next album 'Ice Staion Zero' , tracks co-written with Nik Kershaw and Russ Ballard and great self-penned maximum R&B titles. This album was the best thing they had done up to this point. Later that year they got an invitation from Bruce Willis to play with him at Planet Hollywood in London, what an experience that turned out to be.\n1996 saw them touring heavily with Billy to help get him accustomed to the work load required by Nine Below Zero and they got to headline many festivals in Europe and at last they got the chance to headline the Colne British Blues Festival that summer.\n1997 saw the band form their own record company called Zed Records and their first release was an album called 'Covers' which had four reversible covers and was not full of cover songs as some people thought. This album was received well and guitarist magazines even interviewed Dennis. There was a bizarre start to 1998, a tour of Bangladesh working with the British Council, this was an eye opener. The band took their task as ambassadors and blues representatives very well and made a lot of friends. Even in Dacca people want to learn how to play Hideaway like Freddie King. In this same year the band started work on the 'Refrigerator' album and did a single for the first National Curry Day with an Indian Artist called Bappi Lahri.\n1999 was the year the band successfully negotiated with A&M to license their back catalogue to Zed Records, culminating with the release of 'Live at the Marquee' on CD for the first time in October 1999. Also they finished recording and mixing the 'Refrigerator' album. That takes us to its release in January 2000 and a whole year booked touring the album that has eleven self-penned songs and has been critically acclaimed by Mojo Magazine . The year 2000 also saw them celebrate the 20th anniversary of Live at the Marquee at the Thomas a Beckett where they started their career. Mark Feltham played both nights and it was electrifying and hot.\n\t'Don't Point Your Finger' was released in September 2000 and 'Third Degree' is released in early 2001. This sees the completion of the A&M years released on CD and takes us nicely to the present with more tours booked and more releases on Zed Records.\n2001, and Mark Feltham had rejoined Nine Below Zero after the success of the Thomas a Beckett concerts in London.\nThe old band were back together again and concert tours, festival appearances, and radio interviews,etc started too flow in.\nNine Below Zero worked nonstop for the best part of the next seventeen months,when it was decided that a brand new DVD of the band performing live just had to be released,..and so it was that in May 2002 The ON THE ROAD AGAIN DVD was filmed and recorded in Wilbarston, England. Interviews, and a full two hour concert was now recorded for ever on celluloid.\nThe Band had made it clear to people close at hand, that they had been toying with the idea of one day, releasing an acoustic record, a sort of UNPLUGGED Nine Below Zero..So with this the guys set off to deepest Hampshire in England to record the wonderful CHILLED record. The record was made over two weeks with NBZ and Stephen Smith producing.\nPaul McCartney and Pretenders guitarist Robbie McIntosh added some background guitar to Dennis Greaves already weeping blues guitar.\nNine Below then set off around Europe to take CHILLED to the people, and rave reviews followed them on the exausting touring schedule they had embarked upon.\nThe year of 2004 was a big year for the guys,as they fulfilled the dream of playing one of Europes greatest blues festivals, PISTOIA BLUES, in Italy, Dennis and JOHN MAYALL chatted away backstage, with ALVIN LEE and STEVE WINWOOD, as SANTANA headlined the following night.\nNBZ were to later meet up again with MAYALL on the BANGOL blues festival in France.\nOne more project had to be completed before the guys could move on into 2005 and that was with the making of a truly analogue blues record,where the guys literally took of thier hats to some of the great blues artists they had loved so much.\nThe record was recorded in KONK studios London, owned by Mr RAY DAVIES of the KINKS and he would regularly pop in to see his old mate Dennis to see how the project was going.\nThe record was aptly named HATS OFF, and yet again, the band took off with Contributors BEN WATERS and PETE WINGFIELD on the shows around Europe.\n2005...and one of the highlights of the year was a two times sold out show of the 100 club in Oxford street in London. Mr PETE WINGFIELD of the EVERLY BROTHERS and ALBERT LEE fame, became such good mates with the band that he is the kind of 5th member now when the situation warrants some blues piano.\nThe Guys took in SERBIA, SLOVENIA, MACEDONIA, and CROATIA in 2005 to take the blues to places that had been starved for so long due to depressed economy over a long and bitter war. NBZ made many friends in the BALTIC states in 2005 and are now Truly international, by any strech of the imagination.\nThe new website was a priority in the first month of 2006, and all of us here in the NBZ offices in LONDON hope you find something of intrest in its pages.\n\nHere is hoping for yet another great year from these remarkable four guys. <a href=\"https://www.last.fm/music/Nine+Below+Zero\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T15:44:53.515353",
  "discogs_id": "1251222",
  "discogs_url": "https://www.discogs.com/artist/1251222",
  "followers": 11388,
  "formed_date": null,
  "genres": [
    "Blues",
    "blues rock",
    "blues",
    "uk r&b",
    "mod revival",
    "punk",
    "mod"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/64/cf/3a/64cf3a69-dfea-6bc5-cafe-7e22557908fb/mzi.tdrpddxn.jpg/2000x2000ac.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb42715139b1c22681a35bd18c",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000517442715139b1c22681a35bd18c",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f17842715139b1c22681a35bd18c",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "17a0def3-9186-4787-958e-295cf9cc3911",
  "lastfm_url": "https://www.last.fm/music/Nine+Below+Zero",
  "local_images": {
    "hi-res": "public/artist/nine-below-zero/nine-below-zero-hi-res.jpg",
    "medium": "public/artist/nine-below-zero/nine-below-zero-medium.jpg",
    "small": "public/artist/nine-below-zero/nine-below-zero-small.jpg"
  },
  "name": "Nine Below Zero",
  "popularity": 24,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/64/cf/3a/64cf3a69-dfea-6bc5-cafe-7e22557908fb/mzi.tdrpddxn.jpg/2000x2000ac.jpg",
      "editorial_notes": null,
      "genres": [
        "Blues"
      ],
      "id": "125560478",
      "name": "Nine Below Zero",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/nine-below-zero/125560478"
    },
    "discogs": {
      "id": 1251222,
      "original_name": "Nine Below Zero",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Dennis Greaves  heads up the band, playing guitar and singing better now than at any time in his career, a legend in waiting persona! Then there is the mighty rhythm section of Gerry McAvoy  and Brendan O'Neill blowing up a storm! Gerry is a bass player's bass player, who spent 15 years laying it down for Rory Gallagher as did Brendan on drums for 10 years. Over this fat slice of rhythm, comes the unique harmonica of Mark Feltham ,since January 2001 Mark has been back playing with Nine Below Zero needless to say anyone who knows the band will be aware of his history, himself and Dennis being the founder members of the band. Live, this combination is lethal, hammering and nailing the big R n B sound to the floor of many a famous stage. It is not unusual for the band to sell out big clubs weeks up front.\n\"NBZ are brilliant live, they work so hard , the audience often go home as exhausted as the band\" so says Andrew Zweck of top promoters Harvey Goldsmith Ents. They have carved out a very credible niche, a place they will be for a very long time to come, because, who else is this good?.....this often? NBZ are the viable alternative to Alternative, a band that most definately come to play, a band with their own genuine sound and deep understanding of their musical roots. NBZ have a tireless spirit, no regrets, no excuses, no crap.\n\nFormed in South London in 1977, they won their place on the main London circuit two years later, storming usually complacent venues like Dingwalls, The Music Machine and The Rock Garden with a rip-roaring of Blues and R&B. Suddenly there was life in the old Blues horse yet! A new dynamic life! There was vigour, there was spontaneity, there was enthusiasm, there was ....... Nine Below Zero.\n\t\n\nAs the band embarked on a frighteningly intensive gig schedule, the stirrings grew and word spread across the nation, over the Channel to Europe and beyond. People like Canned Heat , Dr Feelgood and The Blues Band wanted to know about NBZ, offered them supports and so the reputation swelled, at the same rate as the crowds until they were a headlining band in their own right.\nAs time went by however it soon became clear that their contemporary and energetic performance of cover versions, was merely a starting point for their own ideas to emerge with a vibrant solid sound that is finally and indisputably their own.\nThe real story began with Dennis Greaves , nine years old and already wise to musicians like John Mayall and B.B. King via an uncles record collection. His interest grew, and by the time of his final year at school, he had a bass guitar and amp. In the time honoured 'Rock n Roll' tradition \"School work just stopped.... I was in the music room all the time trying to play this thing\".\nHis perseverance paid off and Dennis formed a band with a couple of mates, switched to lead guitar and ' made alot of noise'. They only ever played one gig and that was at a wedding reception.\nHis next band faired slightly better, they were accepted for a handful of pub bookings but a staple diet of Bad Company and Led Zeppelin proved too much for Dennis, so he left taking with him bassist Pete Clark . Together the pair set about forming a band to play the music closest to their hearts. They recruited a school friend, Kenny Bradley on drums, as well as one of their teachers for vocals, who dropped out shortly afterwards.\nThey still needed a harmonica player and someone gave Dennis the number of a bloke called Mark Feltham , so he telephoned him and discovered that they only lived a few doors from each other in Tulse Hill. They arranged to have a blow and Mark, who has only previously practised in his bedroom, was immediately accepted into 'Stans Blues Band' .\n\nIt was the fledgling Nine Below Zero .\n\nThe year was 1977 and the mood was Punk but the band had no intention of succumbing to fashion, even though the record companies were busily signing everything they saw with spiky hair and studs. They wanted to do it their way, no compromises. Ironically, the spirit of punk had it's helpful effects, Dennis harnessing it's 'hell for leather' energy into the music of Stans Blues Band. To say that they were playing New Wave R&B wouldn't be far off the mark.\nConsequently, they found themselves acceptable to certain elements of the punk audience, and in demand locally from their earliest days. They began playing regularly at pubs like the 'Thomas A Beckett' in the Old Kent Road, the 'Apples and Pears' in Bermondsey and the 'Clock House' in Clapham. It was a time of apprenticeship.\nThe first real breakthrough came when Dingwalls offered them a gig in January 1979, impressed by a tape that the band had recorded at the 'Apples and Pears' and sent to various influential venues. From then on 'Stans Blues Band' were playing in all the right venues in London and it was round the end of that year that there occurred the most significant event of all. A musician named Mickey Modern walked into the 'Thomas A Beckett', saw and loved the band and instantly decided to manage them, fed up with his own recording career, he saw in management the opportunity to be creative in a new and exciting way.\nWisely he persuaded them to stop calling themselves 'Stans Blues Band' ; they became 'Nine Below Zero' , a name which carried the blues flavour that Dennis was so anxious to preserve. Within a couple of weeks Mickey had them in the studio recording a demo that included four tracks which would materialise in the New Year on the 'Pack Fair and Square' EP . He found them a recording deal with A&M Records , who put out the EP themselves after the initial 3000 released by the band sold out. ( Released on Mickey's own label through A&M called M&L Records - if you've still got one of these keep it very safe as it's worth a fortune!)\nMickey demanded that they played more gigs and so the band gave up their day jobs and started playing any and every gig they could, seven nights a week, for weeks on end. Oddly enough, without having a hit record, the tracks from the EP were played almost every day for weeks, putting NBZ firmly on the map. All this took A&M completely by surprise, Derek Green ( then MD with A&M) said \" the exposure the band got never turned into real sales. I still can't say why now \"\nIn March 1980 Mickey 'Stix' Burkey gave up his day job and stepped in behind the drum kit to replace Kenny Bradley who had been finding the increasing demands of NBZ that bit too hectic. Stix knew the band, having previously supported them with a group called ' Spoof Order '. \" I thought I'd like to play in NBZ when I first saw them\" he recalls. A happy turn of events.\n\tThe band reached another milestone on July 16th 1980, when they recorded their first album ' Live at the Marquee ' , an exciting and vivid representation of the band as they were at that time. (Produced by Mickey, it still sells healthily today and is asked for by people all over Europe ) And so they went on tour to promote it.\nThree months later they headlined the Hammersmith Odeon with special guest Alexis Korner. The whole of 1980 was one long relentless tour for the band, they can remember having only one week off, but the endless slog was paying off and their continued advancement clearly visible.January 1981 bought recording sessions for their second album 'Don't point your finger' - their first studio album and a major progression.\nIt featured nine tracks written by members of the band as opposed to only three on their debut set and combined songs of loyal blues, thrust with several more uncharacteristic ompositions, notably ' You can't please all the People all the Time' , a robust number with an infectious chorus that pointed to a taste of things to come. Derek Green bought in Glyn Johns ( him of Led Zeppelin and Rolling Stones fame ) who was at that time a staff producer.\nGlyn made a great job of the album. In twelve days it was finished and released within two months. The album entered the charts twice, remaining there in all for about five weeks. Through Glyn the band were exposed to The Who and Kenney Jones came down to the studio. He loved what he heard and promptly asked Pete Townsend to give NBZ the support slot on The Who tour. The same thing happened with Ray Davies and so they went on tour with The Kinks .\n\nIn their quest for musical perfection, NBZ decided to look for a new bass player and with much regret had to say goodbye to Pete Clark in June 1981 and set about auditioning 50 replacements. Brian Bethall was the second and they knew that they would go back to him with their offer, impressed firstly by the fact that he did not look like a musician and secondly by his confident and imaginative playing. This had been an eventful year for the band and still in their early twenties they were still as enthusiastic and as excited as they ever were. They had made appearances on the 'Old Grey Whistle Test' , the 'South Bank Show' and further on up the road their legendary appearance on the very first ' Young Ones ' . Together with supports to The Who and The Kinks under their belts the band certainly proved that they could kick with the best of them.\nNine Below Zero recorded an album at Glyn John's studio in West Sussex but Glyn never allowed the band to stay the night and so they had to drive 100 miles a day. This had an odd effect on the relationship so things never really got off the ground and the album was shelved. Mind you, '11+11' was written as an epitaph and was re-recorded later. \t\n'Third Degree' was probably the most under-rated of all the albums that NBZ made. It contained the classic track '11+11' and was produced by Simon Boswell , who was a very influential part of the band's learning curve. '11+11' should have been a monster hit but somehow either it was miss-timed or bad luck took a hand. The disappointment had a knock on effect and the band split.\nDennis moved into the 'Truth' for the remainder of the eighties and Mark, having earned a high reputation entered the session world with high regard and quickly got himself established with Rory Gallagher . Brian continued playing and eventually found himself playing with the 'Blow Monkeys' . Stix ended up in management and equipment hire.\nThe year is 1990 and after some serious persuasion from various sources a 10th Anniversary gig is announced at the Town and Country Club in October. Was the NBZ flag still flying? The gig sold out and another gig was announced. Gerry McAvoy and Brendan O'Neill were leaving Rory Gallagher's band and they intended to form their own but through Mark Feltham they heard that Dennis was trying out Drums and Bass players for the new NBZ. So a blow was arranged and worked a treat. The packed houses at the Town and Country witnessed the same energy, excitement and fervour that blew their minds a decade ago. NBZ were back and the public greeted them with open arms.\nA short tour in December followed taking them out of London and showing the band that they were wanted nationwide. At the same time Derek Green , now of China Records , came,saw and wanted to be involved. In early 1991 5 songs were demo-ed and played to China Records. China said Go with an album and 'On the Road Again' a significant and apt title was recorded and released in April 1991. Touring continued establishing NBZ again in the UK and earning them high regard in Europe. Tour followed tour in '91. NBZ were back .\nIt was sad to have to say goodbye to Mark early in '92 due to health problems but a new harmonica player called Alan Glen quickly filled the gap. He first came to light in 1985 when he won the Hohner Harmonica Player of the Year. Alan had also played with B.B King , Johnny Winter and Albert Collins . And so the touring continued, and another album called 'Off the Hook' was released again on China Records, inviting rave reviews. Then they supported Sting on his 1993 European tour, things were going pretty well.\nWhat a year 1994 was for NBZ, a full book of dates and good record sales. Little did they know that their reputation had reaches the ears of Eric Clapton and he loved what he heard. Suddenly they were invited to join Eric at the Royal Albert Hall, playing the whole twelve nights and going down a storm. In the audience on one of those nights sat Sting, he loved the band so much he bought them! That night he signed NBZ to his newly formed record company Panagea Records distributed through A&M. Word got round and Ray Davies , a long time NBZ fan booked them for his tour of Britain including Wembley Arena. Brian May came in with six shows across Britain on his solo tour.\nOctober and November 1994 saw the band gigging all over America and Canada with Allanah Miles and Alvin Lee promoting their U.S. album 'Hot Music for A Cold Night' . In 1995 Alan Glen left the band , due to the heavy touring commitments and his place was filled by Billy Boy from Ireland who had supported the band on one of their gigs over there. March 1996 saw the release of their next album 'Ice Staion Zero' , tracks co-written with Nik Kershaw and Russ Ballard and great self-penned maximum R&B titles. This album was the best thing they had done up to this point. Later that year they got an invitation from Bruce Willis to play with him at Planet Hollywood in London, what an experience that turned out to be.\n1996 saw them touring heavily with Billy to help get him accustomed to the work load required by Nine Below Zero and they got to headline many festivals in Europe and at last they got the chance to headline the Colne British Blues Festival that summer.\n1997 saw the band form their own record company called Zed Records and their first release was an album called 'Covers' which had four reversible covers and was not full of cover songs as some people thought. This album was received well and guitarist magazines even interviewed Dennis. There was a bizarre start to 1998, a tour of Bangladesh working with the British Council, this was an eye opener. The band took their task as ambassadors and blues representatives very well and made a lot of friends. Even in Dacca people want to learn how to play Hideaway like Freddie King. In this same year the band started work on the 'Refrigerator' album and did a single for the first National Curry Day with an Indian Artist called Bappi Lahri.\n1999 was the year the band successfully negotiated with A&M to license their back catalogue to Zed Records, culminating with the release of 'Live at the Marquee' on CD for the first time in October 1999. Also they finished recording and mixing the 'Refrigerator' album. That takes us to its release in January 2000 and a whole year booked touring the album that has eleven self-penned songs and has been critically acclaimed by Mojo Magazine . The year 2000 also saw them celebrate the 20th anniversary of Live at the Marquee at the Thomas a Beckett where they started their career. Mark Feltham played both nights and it was electrifying and hot.\n\t'Don't Point Your Finger' was released in September 2000 and 'Third Degree' is released in early 2001. This sees the completion of the A&M years released on CD and takes us nicely to the present with more tours booked and more releases on Zed Records.\n2001, and Mark Feltham had rejoined Nine Below Zero after the success of the Thomas a Beckett concerts in London.\nThe old band were back together again and concert tours, festival appearances, and radio interviews,etc started too flow in.\nNine Below Zero worked nonstop for the best part of the next seventeen months,when it was decided that a brand new DVD of the band performing live just had to be released,..and so it was that in May 2002 The ON THE ROAD AGAIN DVD was filmed and recorded in Wilbarston, England. Interviews, and a full two hour concert was now recorded for ever on celluloid.\nThe Band had made it clear to people close at hand, that they had been toying with the idea of one day, releasing an acoustic record, a sort of UNPLUGGED Nine Below Zero..So with this the guys set off to deepest Hampshire in England to record the wonderful CHILLED record. The record was made over two weeks with NBZ and Stephen Smith producing.\nPaul McCartney and Pretenders guitarist Robbie McIntosh added some background guitar to Dennis Greaves already weeping blues guitar.\nNine Below then set off around Europe to take CHILLED to the people, and rave reviews followed them on the exausting touring schedule they had embarked upon.\nThe year of 2004 was a big year for the guys,as they fulfilled the dream of playing one of Europes greatest blues festivals, PISTOIA BLUES, in Italy, Dennis and JOHN MAYALL chatted away backstage, with ALVIN LEE and STEVE WINWOOD, as SANTANA headlined the following night.\nNBZ were to later meet up again with MAYALL on the BANGOL blues festival in France.\nOne more project had to be completed before the guys could move on into 2005 and that was with the making of a truly analogue blues record,where the guys literally took of thier hats to some of the great blues artists they had loved so much.\nThe record was recorded in KONK studios London, owned by Mr RAY DAVIES of the KINKS and he would regularly pop in to see his old mate Dennis to see how the project was going.\nThe record was aptly named HATS OFF, and yet again, the band took off with Contributors BEN WATERS and PETE WINGFIELD on the shows around Europe.\n2005...and one of the highlights of the year was a two times sold out show of the 100 club in Oxford street in London. Mr PETE WINGFIELD of the EVERLY BROTHERS and ALBERT LEE fame, became such good mates with the band that he is the kind of 5th member now when the situation warrants some blues piano.\nThe Guys took in SERBIA, SLOVENIA, MACEDONIA, and CROATIA in 2005 to take the blues to places that had been starved for so long due to depressed economy over a long and bitter war. NBZ made many friends in the BALTIC states in 2005 and are now Truly international, by any strech of the imagination.\nThe new website was a priority in the first month of 2006, and all of us here in the NBZ offices in LONDON hope you find something of intrest in its pages.\n\nHere is hoping for yet another great year from these remarkable four guys. <a href=\"https://www.last.fm/music/Nine+Below+Zero\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Dennis Greaves  heads up the band, playing guitar and singing better now than at any time in his career, a legend in waiting persona! Then there is the mighty rhythm section of Gerry McAvoy  and Brendan O'Neill blowing up a storm! Gerry is a bass player's bass player, who spent 15 years laying it down for Rory Gallagher as did Brendan on drums for 10 years. Over this fat slice of rhythm, comes the unique harmonica of Mark Feltham ,since January 2001 <a href=\"https://www.last.fm/music/Nine+Below+Zero\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 12184,
      "mbid": "17a0def3-9186-4787-958e-295cf9cc3911",
      "name": "Nine Below Zero",
      "playcount": 129948,
      "similar_artists": [
        {
          "name": "The Blues Band",
          "url": "https://www.last.fm/music/The+Blues+Band"
        },
        {
          "name": "The Lambrettas",
          "url": "https://www.last.fm/music/The+Lambrettas"
        },
        {
          "name": "The Merton Parkas",
          "url": "https://www.last.fm/music/The+Merton+Parkas"
        },
        {
          "name": "Larry Miller",
          "url": "https://www.last.fm/music/Larry+Miller"
        },
        {
          "name": "Makin' Time",
          "url": "https://www.last.fm/music/Makin%27+Time"
        }
      ],
      "tags": [
        "blues",
        "blues rock",
        "mod revival",
        "punk",
        "mod"
      ],
      "url": "https://www.last.fm/music/Nine+Below+Zero"
    },
    "spotify": {
      "followers": 11388,
      "genres": [
        "blues rock",
        "blues",
        "uk r&b"
      ],
      "id": "3OPxkeeqWspVVPlc6XUSaq",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb42715139b1c22681a35bd18c",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab6761610000517442715139b1c22681a35bd18c",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f17842715139b1c22681a35bd18c",
          "width": 160
        }
      ],
      "name": "Nine Below Zero",
      "popularity": 24,
      "url": "https://open.spotify.com/artist/3OPxkeeqWspVVPlc6XUSaq"
    }
  },
  "spotify_id": "3OPxkeeqWspVVPlc6XUSaq",
  "spotify_url": "https://open.spotify.com/artist/3OPxkeeqWspVVPlc6XUSaq",
  "updated_at": "2025-07-05T15:44:54.273182",
  "wikipedia_url": null
}