{
  "apple_music_id": "718829",
  "apple_music_url": "https://music.apple.com/gb/artist/primal-scream/718829",
  "biography": "Primal Scream is an alternative rock band from Glasgow, Scotland, originally formed in 1982 by Bobby Gillespie and Jim Beattie. The current lineup include Bobby Gillespie (vocals; former The Wake bassist and The Jesus & Mary Chain drummer), Andrew Innes (guitars), Simone Butler (bass) and Darrin Mooney (drums). Other important members were Robert \"Throb\" Young (guitars from 1985 to 2006), Gary \"Mani\" Mounfield (bass from 1996 to 2011; also former The Stone Roses bassist) and Martin Duffy (keyboards from 1989 until his death in 2022). The band is renowned for the frequent change of music style, from indie pop, indie rock, classic rock to alternative rock with electronic influences.\n\nThe band released eleven studio albums so far: the indie pop Sonic Flower Groove (1987), the indie rock Primal Scream (1989), the alternative rock/acid house Screamadelica (1991), the classic rock Give Out But Don't Give Up (1994), the alternative rock/electronic Vanishing Point (1997), the alternative rock/industrial rock XTRMNTR (2000) and Evil Heat (2002), the classic rock Riot City Blues (2006), the alternative rock Beautiful Future (2008), the experimental/psychedelic rock More Light (2013), and the synthpop/dance Chaosmosis (2016).\n\nThey also released the compilation albums Echo Dek (1997), Dirty Hits (2003) and Shoot Speed (More Dirty Hits) (2004), Give Out But Don’t Give Up: The Original Memphis Recordings (2018), Maximum Rock ‘n’ Roll: The Singles (2019), The Screamadelica 12” Singles (2021), Reverberations: Travelling in Time (2023), the live albums Live in Japan (2003) , Screamadelica - Live (2011) and Live at Levitation (2021).\n\nHistory:\nWhile attending Kings Park Secondary School in Glasgow, Bobby Gillespie met Robert 'Throb' Young and Alan McGee. Gillespie and McGee were heavily influenced by punk rock. In 1978, they joined a local punk band, The Drains, where Andrew Innes was the guitarist. After The Drains disbanded, McGee and Innes relocated to London, while Gillespie chose to remain in Glasgow.\n\nIn 1982, Bobby Gillespie and another school friend Jim Beattie recorded \"elemental noise tapes\", in which Gillespie would bang two dustbin lids together and Beattie played fuzz-guitar. They soon moved on to Velvet Underground and The Byrds cover songs before starting to write their own songs, based on Jah Wobble and Peter Hook basslines. They named themselves Primal Scream, a term used to describe a cry heard in primal therapy. Their first recording session, for McGee's independent label Essential Records, was a single track entitled \"The Orchard\". Beattie later claimed that they burned the master tape.\n\nAfter the aborted recording, Gillespie joined The Jesus and Mary Chain as their drummer, and alternated between both bands. Soon Gillespie and Beattie expanded Primal Scream's lineup to include Robert Young on bass, rhythm guitarist Stuart May, drummer Tom McGurk, and tambourine player Martin St. John. This lineup was signed to Creation Records, an independent record label founded by Alan McGee, and recorded the group's debut single, \"All Fall Down\". \n\nAfter the release of the single, Gillespie was told by The Jesus and the Mary Chain leaders William and Jim Reid that he was to either dissolve Primal Scream to join the Mary Chain full-time or resign and Gillespie chose to remain with Primal Scream. The B-side \"Velocity Girl\" of the single \"Crystal Crescent\", was released on the C86 compilation. The band switched to Alan McGee's Elevation Records.\n\nAfter some lineup changes, Primal Scream's debut album Sonic Flower Groove was released in September 1987. The album reached number 62 on the British charts and received poor reviews. The backlash from the album caused internal strife within the band and another change in lineup.\n\nThe band's re-signed to Creation Records and released their first single in two years, \"Ivy, Ivy, Ivy\", followed in 4 September 1989 by their sophomore album, Primal Scream. The band's new indie rock sound was met with poor reviews. The album featured Felt keyboardist Martin Duffy guesting.\n\nThe band were first introduced to the acid house scene by McGee in 1988. The band met up with DJ Andrew Weatherall at a rave, and he was given a copy of \"I'm Losing More Than I'll Ever Have\", a track from Primal Scream album, to remix for one of his shows. Weatherall added a drum loop from an Italian bootleg mix of Edie Brickell & The New Bohemians's \"What I Am\", a sample of Gillespie singing a line from Robert Johnson's \"Terraplane Blues\" and the central introductory sample from the Peter Fonda B-movie The Wild Angels. The resulting track, \"Loaded\", became the band's first major hit, reaching number 16 on the UK Singles Chart. This was followed by another single, \"Come Together\", which reached number 19.\n\nThe band entered the studio with Weatherall, Hugo Nicholson, The Orb, and Jimmy Miller producing, and Martin Duffy now full time on keyboards. They released two more singles, \"Higher Than the Sun\" and \"Don't Fight It, Feel It\", both of which were successful. Their third album, Screamadelica, was released in the October 1991 to ecstatic reviews. The album was also a massive commercial success, reaching number 8 on the UK charts. The album won the first Mercury Music Prize, beating Gillespie's former band, The Jesus and Mary Chain. \n\nIn March 1994, Primal Scream released their fourth album, Give Out But Don't Give Up to mixed reviews. Whereas some praised the band's new The Rolling Stones-influenced sound, some dismissed the album as tired and drawing too heavily on their influences. The album was preceded by the successful single \"Rocks\". It was the band's highest charting single to date, reaching number 7 on the UK charts. \"Rocks\" was followed by the singles \"Jailbird\" and \"(I'm Gonna) Cry Myself Blind\".\n\nPrimal Scream also supported Depeche Mode on their American tour. After a short hiatus, the band returned with a new lineup. The bassist Gary 'Mani' Mounfield joined Primal Scream after break-up of his previous band, The Stone Roses and Paul Mulreany was added as their new drummer. \n\nIn July 1997, Primal Scream released their fifth album, Vanishing Point. It received almost unanimously positive reviews upon release and revitalized the band's commercial viability. The music on the album had a complex shoegazing dance/dub rhythm, harking back to the crossover success of Screamadelica, but sounding significantly darker. Some songs on the album were inspired by 1971 cult film Vanishing Point; Gillespie said that they wanted to create an alternative soundtrack for the film. Three singles supported the album: \"Kowalski\", \"Star\" and \"Burning Wheel\".\n\nBefore a short supporting tour scheduled to begin in July, Mulraney left the band and they were forced to use a drum machine. In October 1997, Primal Scream released Echo Dek, a collection of alternative mixes/remixes from Vanishing Point with the bulk of mixes done by Adrian Sherwood. Later that year Kevin Shields (My Bloody Valentine) joined the band on tour, and would have a major influence over their sound in the next few years.\n\nIn 31 January 2000, Primal Scream released their sixth studio album, XTRMNTR. The album featured mulitiple guest appearances, including The Chemical Brothers, New Order's Bernard Sumner, and former My Bloody Valentine guitarist Kevin Shields, who had become a semi-permanent member. Three singles supported the album: \"Swastika Eyes\" (#22 UK), \"Kill All Hippies\" (#24 UK) and \"Accelerator\" (#34 UK). The XTRMNTR's political content was well received, with Allmusic calling it a \"nasty, fierce realization of an entire world that has... lost the plot\". In 2009 NME charted XTRMNTR at #3 in The Top 100 Greatest Albums of the Decade.\n\nXTRMNTR was followed by Evil Heat, released in 5 August 2002. Kevin Shields produced several tracks and Andrew Weatherall produced three tracks, his first work with the band since Vanishing Point. Kate Moss sang professionally for the first time with single \"Some Velvet Morning\", a version of the Lee Hazlewood/Nancy Sinatra song. The album also featured another guest appearance, Led Zeppelin singer Robert Plant. In November 2003, they issued the compilation album Dirty Hits.\n\nPrimal Scream returned in 5 June 2006 with their seventh studio album, Riot City Blues. On this album, the band leaves its electronic element behind and returns to more traditional rock. The album features Will Sergeant (Echo & the Bunnymen) on \"When the Bomb Drops\", Warren Ellis (Nick Cave and the Bad Seeds, Dirty Three) on \"Hell's Coming Down\" and Alison Mosshart (The Kills) performing backing vocals on \"Dolls (Sweet Rock and Roll)\". The first single, \"Country Girl\", became the band's highest charting in their career (#5 in the UK Charts). In 2007 they signed B-Unique Records.\n\nIn 21 July 2008, the band released Beautiful Future, their ninth studio album. The album featured a return to alternative rock and it was promoted by the single \"Can't Go Back\",  produced by Björn Yttling (of Peter Bjorn and John) and Paul Epworth. The album features guest appearances from Lovefoxxx (of Cansei de Ser Sexy), Josh Homme (of Queens of the Stone Age) and folk singer Linda Thompson.\n\nAfter touring seminal album Screamadelica for most of 2011, on 18 October 2011 Mani revealed he had left the band due to the reformation of his original band The Stone Roses. In April 2012 it was announced that Debbie Googe of (My Bloody Valentine) replaced Mani as the bass player of the band. Later in 2012, Simone Butler became the band’s bassist.\n\nThe band's tenth album, More Light, was released in May 2013 on the band's own label, First International, via Ignition Records. The new album was produced by David Holmes, who confirmed the release on his Facebook page on 11 January 2013. The first track taken from the album is \"2013\" with a music video directed by Rei Nadal. The first single proper is \"It's Alright, It's OK\", which was played in the UK by both BBC Radio 2 and 6 Music, as well as supported by leading alternative music stations XFM and Absolute Radio.\nThe album features guest appearances from The Pop Group’s  Mark Stewart, My Bloody Valentine’s Kevin Shields, and Led Zeppelin’s Robert Plant.\n\nThe band’s eleventh album Chaosmosis was released on 18 March 2016. The album features guest appearances from young singers Sky Ferreira and HAIM.\n\nThe band has released several compilation albums since 2018: Give Out But Don’t Give Up: The Original Memphis Recordings (2018), Maximum Rock ‘n’ Roll: The Singles (2019), The Screamadelica 12” Singles (2021), and Reverberations: Travelling in Time (2023).\n\nIn 2021, Bobby Gillespie released his memoir, Tenement Kid. The book intimately describes Gillespie’s life and musical career from his birth up to the release of the classic album Screamadelica in 1991. \n\nOn 18 December 2022, Primal Scream annnounced on their official Instagram account that the band’s longtime keyboardist Martin Duffy tragically died at the age of 55. The cause of death was given as a brain injury suffered after a fall at home in Brighton.\n\nBand members:\nBobby Gillespie (vocals)\nAndrew Innes (guitars)\nSimone Butler (bass)\nDarrin Mooney (drums)\n\nFormer band members:\nJim Beattie (guitars)\nRobert \"Throb\" Young (guitars, bass)\nGary \"Mani\" Mounfield (bass)\nDenise Johnson (vocals)\nPaul Mulraney (drums)\nPaul Harte (rhythm guitar)\nStuart May (rhythm guitar)\nGavin Skinner (drums)\nTom McGurk (drums)\nMartin St. John (tambourine)\nHenry Olsen (bass)\nPhillip 'Toby' Tomanov (drums)\nJim Hunt \nDuncan Mackay\nSteve Sidelnyk\nMartin Duffy (keyboards)\nDebbie Googe (bass)\nBarrie Cadogan (guitars)\n\nOfficial site: www.primalscream.net <a href=\"https://www.last.fm/music/Primal+Scream\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T14:40:19.122996",
  "discogs_id": "3852",
  "discogs_url": "https://www.discogs.com/artist/3852",
  "followers": 548925,
  "formed_date": null,
  "genres": [
    "Alternative",
    "madchester",
    "britpop",
    "alternative dance",
    "rock",
    "indie",
    "electronic",
    "alternative",
    "seen live"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/63/e6/b5/63e6b5bd-9b40-33b0-fb13-f6a940829323/mzl.ibdvlhqj.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb67fc8710036b6a053baef3d5",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000517467fc8710036b6a053baef3d5",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f17867fc8710036b6a053baef3d5",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "55704c38-224f-4b75-b29f-d43653f8bc9a",
  "lastfm_url": "https://www.last.fm/music/Primal+Scream",
  "local_images": {
    "hi-res": "public/artist/primal-scream/primal-scream-hi-res.jpg",
    "medium": "public/artist/primal-scream/primal-scream-medium.jpg",
    "small": "public/artist/primal-scream/primal-scream-small.jpg"
  },
  "name": "Primal Scream",
  "popularity": 55,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/63/e6/b5/63e6b5bd-9b40-33b0-fb13-f6a940829323/mzl.ibdvlhqj.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Alternative"
      ],
      "id": "718829",
      "name": "Primal Scream",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/primal-scream/718829"
    },
    "discogs": {
      "id": 3852,
      "original_name": "Primal Scream",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Primal Scream is an alternative rock band from Glasgow, Scotland, originally formed in 1982 by Bobby Gillespie and Jim Beattie. The current lineup include Bobby Gillespie (vocals; former The Wake bassist and The Jesus & Mary Chain drummer), Andrew Innes (guitars), Simone Butler (bass) and Darrin Mooney (drums). Other important members were Robert \"Throb\" Young (guitars from 1985 to 2006), Gary \"Mani\" Mounfield (bass from 1996 to 2011; also former The Stone Roses bassist) and Martin Duffy (keyboards from 1989 until his death in 2022). The band is renowned for the frequent change of music style, from indie pop, indie rock, classic rock to alternative rock with electronic influences.\n\nThe band released eleven studio albums so far: the indie pop Sonic Flower Groove (1987), the indie rock Primal Scream (1989), the alternative rock/acid house Screamadelica (1991), the classic rock Give Out But Don't Give Up (1994), the alternative rock/electronic Vanishing Point (1997), the alternative rock/industrial rock XTRMNTR (2000) and Evil Heat (2002), the classic rock Riot City Blues (2006), the alternative rock Beautiful Future (2008), the experimental/psychedelic rock More Light (2013), and the synthpop/dance Chaosmosis (2016).\n\nThey also released the compilation albums Echo Dek (1997), Dirty Hits (2003) and Shoot Speed (More Dirty Hits) (2004), Give Out But Don’t Give Up: The Original Memphis Recordings (2018), Maximum Rock ‘n’ Roll: The Singles (2019), The Screamadelica 12” Singles (2021), Reverberations: Travelling in Time (2023), the live albums Live in Japan (2003) , Screamadelica - Live (2011) and Live at Levitation (2021).\n\nHistory:\nWhile attending Kings Park Secondary School in Glasgow, Bobby Gillespie met Robert 'Throb' Young and Alan McGee. Gillespie and McGee were heavily influenced by punk rock. In 1978, they joined a local punk band, The Drains, where Andrew Innes was the guitarist. After The Drains disbanded, McGee and Innes relocated to London, while Gillespie chose to remain in Glasgow.\n\nIn 1982, Bobby Gillespie and another school friend Jim Beattie recorded \"elemental noise tapes\", in which Gillespie would bang two dustbin lids together and Beattie played fuzz-guitar. They soon moved on to Velvet Underground and The Byrds cover songs before starting to write their own songs, based on Jah Wobble and Peter Hook basslines. They named themselves Primal Scream, a term used to describe a cry heard in primal therapy. Their first recording session, for McGee's independent label Essential Records, was a single track entitled \"The Orchard\". Beattie later claimed that they burned the master tape.\n\nAfter the aborted recording, Gillespie joined The Jesus and Mary Chain as their drummer, and alternated between both bands. Soon Gillespie and Beattie expanded Primal Scream's lineup to include Robert Young on bass, rhythm guitarist Stuart May, drummer Tom McGurk, and tambourine player Martin St. John. This lineup was signed to Creation Records, an independent record label founded by Alan McGee, and recorded the group's debut single, \"All Fall Down\". \n\nAfter the release of the single, Gillespie was told by The Jesus and the Mary Chain leaders William and Jim Reid that he was to either dissolve Primal Scream to join the Mary Chain full-time or resign and Gillespie chose to remain with Primal Scream. The B-side \"Velocity Girl\" of the single \"Crystal Crescent\", was released on the C86 compilation. The band switched to Alan McGee's Elevation Records.\n\nAfter some lineup changes, Primal Scream's debut album Sonic Flower Groove was released in September 1987. The album reached number 62 on the British charts and received poor reviews. The backlash from the album caused internal strife within the band and another change in lineup.\n\nThe band's re-signed to Creation Records and released their first single in two years, \"Ivy, Ivy, Ivy\", followed in 4 September 1989 by their sophomore album, Primal Scream. The band's new indie rock sound was met with poor reviews. The album featured Felt keyboardist Martin Duffy guesting.\n\nThe band were first introduced to the acid house scene by McGee in 1988. The band met up with DJ Andrew Weatherall at a rave, and he was given a copy of \"I'm Losing More Than I'll Ever Have\", a track from Primal Scream album, to remix for one of his shows. Weatherall added a drum loop from an Italian bootleg mix of Edie Brickell & The New Bohemians's \"What I Am\", a sample of Gillespie singing a line from Robert Johnson's \"Terraplane Blues\" and the central introductory sample from the Peter Fonda B-movie The Wild Angels. The resulting track, \"Loaded\", became the band's first major hit, reaching number 16 on the UK Singles Chart. This was followed by another single, \"Come Together\", which reached number 19.\n\nThe band entered the studio with Weatherall, Hugo Nicholson, The Orb, and Jimmy Miller producing, and Martin Duffy now full time on keyboards. They released two more singles, \"Higher Than the Sun\" and \"Don't Fight It, Feel It\", both of which were successful. Their third album, Screamadelica, was released in the October 1991 to ecstatic reviews. The album was also a massive commercial success, reaching number 8 on the UK charts. The album won the first Mercury Music Prize, beating Gillespie's former band, The Jesus and Mary Chain. \n\nIn March 1994, Primal Scream released their fourth album, Give Out But Don't Give Up to mixed reviews. Whereas some praised the band's new The Rolling Stones-influenced sound, some dismissed the album as tired and drawing too heavily on their influences. The album was preceded by the successful single \"Rocks\". It was the band's highest charting single to date, reaching number 7 on the UK charts. \"Rocks\" was followed by the singles \"Jailbird\" and \"(I'm Gonna) Cry Myself Blind\".\n\nPrimal Scream also supported Depeche Mode on their American tour. After a short hiatus, the band returned with a new lineup. The bassist Gary 'Mani' Mounfield joined Primal Scream after break-up of his previous band, The Stone Roses and Paul Mulreany was added as their new drummer. \n\nIn July 1997, Primal Scream released their fifth album, Vanishing Point. It received almost unanimously positive reviews upon release and revitalized the band's commercial viability. The music on the album had a complex shoegazing dance/dub rhythm, harking back to the crossover success of Screamadelica, but sounding significantly darker. Some songs on the album were inspired by 1971 cult film Vanishing Point; Gillespie said that they wanted to create an alternative soundtrack for the film. Three singles supported the album: \"Kowalski\", \"Star\" and \"Burning Wheel\".\n\nBefore a short supporting tour scheduled to begin in July, Mulraney left the band and they were forced to use a drum machine. In October 1997, Primal Scream released Echo Dek, a collection of alternative mixes/remixes from Vanishing Point with the bulk of mixes done by Adrian Sherwood. Later that year Kevin Shields (My Bloody Valentine) joined the band on tour, and would have a major influence over their sound in the next few years.\n\nIn 31 January 2000, Primal Scream released their sixth studio album, XTRMNTR. The album featured mulitiple guest appearances, including The Chemical Brothers, New Order's Bernard Sumner, and former My Bloody Valentine guitarist Kevin Shields, who had become a semi-permanent member. Three singles supported the album: \"Swastika Eyes\" (#22 UK), \"Kill All Hippies\" (#24 UK) and \"Accelerator\" (#34 UK). The XTRMNTR's political content was well received, with Allmusic calling it a \"nasty, fierce realization of an entire world that has... lost the plot\". In 2009 NME charted XTRMNTR at #3 in The Top 100 Greatest Albums of the Decade.\n\nXTRMNTR was followed by Evil Heat, released in 5 August 2002. Kevin Shields produced several tracks and Andrew Weatherall produced three tracks, his first work with the band since Vanishing Point. Kate Moss sang professionally for the first time with single \"Some Velvet Morning\", a version of the Lee Hazlewood/Nancy Sinatra song. The album also featured another guest appearance, Led Zeppelin singer Robert Plant. In November 2003, they issued the compilation album Dirty Hits.\n\nPrimal Scream returned in 5 June 2006 with their seventh studio album, Riot City Blues. On this album, the band leaves its electronic element behind and returns to more traditional rock. The album features Will Sergeant (Echo & the Bunnymen) on \"When the Bomb Drops\", Warren Ellis (Nick Cave and the Bad Seeds, Dirty Three) on \"Hell's Coming Down\" and Alison Mosshart (The Kills) performing backing vocals on \"Dolls (Sweet Rock and Roll)\". The first single, \"Country Girl\", became the band's highest charting in their career (#5 in the UK Charts). In 2007 they signed B-Unique Records.\n\nIn 21 July 2008, the band released Beautiful Future, their ninth studio album. The album featured a return to alternative rock and it was promoted by the single \"Can't Go Back\",  produced by Björn Yttling (of Peter Bjorn and John) and Paul Epworth. The album features guest appearances from Lovefoxxx (of Cansei de Ser Sexy), Josh Homme (of Queens of the Stone Age) and folk singer Linda Thompson.\n\nAfter touring seminal album Screamadelica for most of 2011, on 18 October 2011 Mani revealed he had left the band due to the reformation of his original band The Stone Roses. In April 2012 it was announced that Debbie Googe of (My Bloody Valentine) replaced Mani as the bass player of the band. Later in 2012, Simone Butler became the band’s bassist.\n\nThe band's tenth album, More Light, was released in May 2013 on the band's own label, First International, via Ignition Records. The new album was produced by David Holmes, who confirmed the release on his Facebook page on 11 January 2013. The first track taken from the album is \"2013\" with a music video directed by Rei Nadal. The first single proper is \"It's Alright, It's OK\", which was played in the UK by both BBC Radio 2 and 6 Music, as well as supported by leading alternative music stations XFM and Absolute Radio.\nThe album features guest appearances from The Pop Group’s  Mark Stewart, My Bloody Valentine’s Kevin Shields, and Led Zeppelin’s Robert Plant.\n\nThe band’s eleventh album Chaosmosis was released on 18 March 2016. The album features guest appearances from young singers Sky Ferreira and HAIM.\n\nThe band has released several compilation albums since 2018: Give Out But Don’t Give Up: The Original Memphis Recordings (2018), Maximum Rock ‘n’ Roll: The Singles (2019), The Screamadelica 12” Singles (2021), and Reverberations: Travelling in Time (2023).\n\nIn 2021, Bobby Gillespie released his memoir, Tenement Kid. The book intimately describes Gillespie’s life and musical career from his birth up to the release of the classic album Screamadelica in 1991. \n\nOn 18 December 2022, Primal Scream annnounced on their official Instagram account that the band’s longtime keyboardist Martin Duffy tragically died at the age of 55. The cause of death was given as a brain injury suffered after a fall at home in Brighton.\n\nBand members:\nBobby Gillespie (vocals)\nAndrew Innes (guitars)\nSimone Butler (bass)\nDarrin Mooney (drums)\n\nFormer band members:\nJim Beattie (guitars)\nRobert \"Throb\" Young (guitars, bass)\nGary \"Mani\" Mounfield (bass)\nDenise Johnson (vocals)\nPaul Mulraney (drums)\nPaul Harte (rhythm guitar)\nStuart May (rhythm guitar)\nGavin Skinner (drums)\nTom McGurk (drums)\nMartin St. John (tambourine)\nHenry Olsen (bass)\nPhillip 'Toby' Tomanov (drums)\nJim Hunt \nDuncan Mackay\nSteve Sidelnyk\nMartin Duffy (keyboards)\nDebbie Googe (bass)\nBarrie Cadogan (guitars)\n\nOfficial site: www.primalscream.net <a href=\"https://www.last.fm/music/Primal+Scream\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Primal Scream is an alternative rock band from Glasgow, Scotland, originally formed in 1982 by Bobby Gillespie and Jim Beattie. The current lineup include Bobby Gillespie (vocals; former The Wake bassist and The Jesus & Mary Chain drummer), Andrew Innes (guitars), Simone Butler (bass) and Darrin Mooney (drums). Other important members were Robert \"Throb\" Young (guitars from 1985 to 2006), Gary \"Mani\" Mounfield (bass from 1996 to 2011; also former The Stone Roses bassist) and Martin Duffy (keyboards from 1989 until his death in 2022). <a href=\"https://www.last.fm/music/Primal+Scream\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 1290580,
      "mbid": "55704c38-224f-4b75-b29f-d43653f8bc9a",
      "name": "Primal Scream",
      "playcount": 23311530,
      "similar_artists": [
        {
          "name": "The Charlatans",
          "url": "https://www.last.fm/music/The+Charlatans"
        },
        {
          "name": "Happy Mondays",
          "url": "https://www.last.fm/music/Happy+Mondays"
        },
        {
          "name": "The Stone Roses",
          "url": "https://www.last.fm/music/The+Stone+Roses"
        },
        {
          "name": "Manic Street Preachers",
          "url": "https://www.last.fm/music/Manic+Street+Preachers"
        },
        {
          "name": "The Verve",
          "url": "https://www.last.fm/music/The+Verve"
        }
      ],
      "tags": [
        "rock",
        "indie",
        "electronic",
        "alternative",
        "seen live"
      ],
      "url": "https://www.last.fm/music/Primal+Scream"
    },
    "spotify": {
      "followers": 548925,
      "genres": [
        "madchester",
        "britpop",
        "alternative dance"
      ],
      "id": "3wury2nd8idV4GecUg5xze",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb67fc8710036b6a053baef3d5",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab6761610000517467fc8710036b6a053baef3d5",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f17867fc8710036b6a053baef3d5",
          "width": 160
        }
      ],
      "name": "Primal Scream",
      "popularity": 55,
      "url": "https://open.spotify.com/artist/3wury2nd8idV4GecUg5xze"
    }
  },
  "spotify_id": "3wury2nd8idV4GecUg5xze",
  "spotify_url": "https://open.spotify.com/artist/3wury2nd8idV4GecUg5xze",
  "updated_at": "2025-07-05T14:40:19.850745",
  "wikipedia_url": null
}