{
  "apple_music_id": "112440",
  "apple_music_url": "https://music.apple.com/gb/artist/veruca-salt/112440",
  "biography": "1993–1998: Formation and Growth\nNamed after Veruca Salt, the spoiled rich girl from the children's book Charlie and the Chocolate Factory by Roald Dahl and its 1971 film adaptation Willy Wonka & the Chocolate Factory directed by Mel Stuart, Veruca Salt was formed in Chicago by Louise Post (guitar/vocals) and Nina Gordon (guitar/vocals). Post and Gordon were introduced through mutual friend Lili Taylor, and began playing music together. They wrote songs for a year and a half before being joined by Gordon's brother, Jim Shapiro, on drums and Steve Lack on bass. Songwriting was shared between Gordon and Post, though the two seldom collaborated. Rather, each would typically submit a complete song to the group and sing the lead vocal on that song, while the other would record backing vocals.\nThe band had performed a handful of shows when Jim Powers of Minty Fresh Records asked them to sign to the independent label. The band's first release was the single \"Seether\"/\"All Hail Me\" on Minty Fresh Records, in 1994. The single was a success and Veruca Salt accompanied Hole on a tour, before releasing their first full-length album, American Thighs, which eventually reached Gold status.\nAfter signing to Geffen Records, the band quickly gained in popularity as \"Seether\" became an MTV hit. A stop-gap EP recorded by Steve Albini, Blow It Out Your Ass It's Veruca Salt, was released in 1996.\nTheir second album, Eight Arms to Hold You, was produced by Bob Rock and released in 1997. Lead single \"Volcano Girls\" gained exposure as the opening theme to the teen comedy film Jawbreaker. Veruca Salt performed another single, \"Shutterbug\", on Saturday Night Live; however, instead of the featured musical group performing two songs as had been tradition, the musical performances were split between Sting and Veruca Salt. Shapiro left the band soon after the release of Eight Arms and was replaced by Stacy Jones (of Letters to Cleo and American Hi-Fi). Jones toured with the band on the Eight Arms tour, but never recorded with them.\nIn 1996, Veruca Salt appeared as Pavement's replacement band in their video \"Painted Soldiers\".\nIn 1997, they opened for the band Bush in a North American Tour.\n1998–2005: Gordon's departure, reformation and Resolver\nLouise Post (left) and Nicole Fiorentino (right) in 2006 with Veruca Salt\nIn 1998, Gordon left the band to pursue a solo career (her first album Tonight and the Rest of My Life, was released in 2000). The undisclosed dispute between Gordon and Post has been described as \"one of the greatest rock soap operas since Fleetwood Mac or Hüsker Dü.\"\nPost, as the only remaining band member, contributed the song Somebody to the Depeche Mode tribute album For The Masses before recruiting a new lineup. Guitarist Stephen Fitzpatrick joined and went on to become one of Post's principle songwriting partners during the next decade. Jimmy Madla and Suzanne Sokol joined on drums and bass guitar respectively. The new version of the band signed with Beyond Records and released Resolver in 2000 which spawned both a single and video for Born Entertainer.\nSuzanne Sokol left the band at the end of 2000 and was replaced by Post's friend, Gina Crosley. The band continued to tour through the summer of 2001 in the UK. Post and Crosley also attempted to form a supergroup with Courtney Love of Hole and others but the project soon imploded. This allowed the pair to focus on new material for Veruca Salt which eventually yielded the Officially Dead EP that was primarily distributed on during the band's 2002 tour of Australia. Crosley is specifically credited with co-writing \"Smoke & Mirrors.\" She also worked on songs that later appeared on IV, but no credit is officially given and she left before the album was completed.\n2005–2012: VSIV and hiatus\nBy 2005, Madla left to enter the restaurant business and Crosley was also dismissed. They were replaced in the studio by Solomon Snyder and Michael Miley respectively. This session resulted in the Lords of Sounds and Lesser Things (LOSALT). The band went on tour with Post, Fitzpatrick, drummer Kellii Scott of Failure, and bassist Nicole Fiorentino. LOSALT was released independently by the band and included six new songs. The title of the EP is an extract from Zora Neale Hurston's Their Eyes Were Watching God. This lineup then recorded a full-length album, IV, and released it in September 2006 (like Resolver before it, this album was released a month apart from a Nina Gordon solo album). The band then went on what would prove to be the last tour of Louise Post's solo incarnation of the band. A single, \"So Weird\", was released to radio at the end of October 2006 but neither the song nor the album did well commercially.\nIn 2007, the band recorded a cover of Neil Young's song \"Burned\" for a 2007 Breast Cancer Benefit album and then went almost entirely dormant. Louise Post took time to have a child while Fiorentino went on to play bass with the Smashing Pumpkins and The Cold and Lovely. Kellii Scott returned to his original band Failure. On March 14, 2012, the band announced on their official website that they were on an indefinite hiatus.\n2013: reunion\nOn March 15, 2013 the band announced the reunion of its original line-up (Nina Gordon, Louise Post, Jim Shapiro, and Steve Lack) with a message on the band's official Facebook page which read, \"for now let's just say this: hatchets buried, axes exhumed.\" The members, including Post, have gone on to refer to the Resolver/IV era as \"Veruca Starship\" in reference to the convoluted evolution of the band Jefferson Airplane but have also mentioned that they might be open to adding material from their time apart into their sets at some point.\nOn September 29, 2013, the band announced via social media that they were working on new material. Their first release since reforming came in the form of a release for Record Store Day 2014. The band released a 10-inch vinyl EP, MMXIV, which contains two new songs, \"It's Holy\" and \"The Museum of Broken Relationships\" on one side and a twentieth anniversary re-release of Seether on the other. The band then toured both the USA and Australia.\nBoth Louise Post and Nina Gordon had mentioned a full length album was set to be released fall of 2014, however this has been pushed back to early 2015 to allow for touring in 2014.\n(wiki)",
  "country": null,
  "created_at": "2025-07-05T16:19:24.056239",
  "discogs_id": "28974",
  "discogs_url": "https://www.discogs.com/artist/28974",
  "followers": 314377,
  "formed_date": null,
  "genres": [
    "Rock",
    "riot grrrl",
    "grunge",
    "female vocalists",
    "alternative",
    "Grunge",
    "rock",
    "alternative rock",
    "Alternative Rock",
    "Rock/Pop"
  ],
  "id": "veruca-salt-1751728769",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/03/a1/40/03a14004-9e56-0df6-2a5d-9933768902c6/mzl.nrkcklpz.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 507,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/7947f9c222f4f941306b27cf4c7a6b2033f80453",
      "width": 768
    },
    {
      "height": 423,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/491dd40402bf2b9b6269ca95a7ae2c73275434fb",
      "width": 640
    },
    {
      "height": 132,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/e91391f463afb99b4b26b8c5aa43c88071e454ab",
      "width": 200
    },
    {
      "height": 42,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/f857d41be03c17b8572b4e4e06432167152c3823",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/xvuvpy1348112832.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xrptuu1348112881.jpg",
      "width": 1920
    },
    {
      "height": 185,
      "type": "banner",
      "url": "https://www.theaudiodb.com/images/media/artist/banner/wypwsw1512504571.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/vuwsvs1451831813.png",
      "width": 400
    }
  ],
  "lastfm_mbid": "86e8e21a-d29f-47d2-bbf0-e079f7044e71",
  "lastfm_url": "https://www.last.fm/music/Veruca+Salt",
  "local_images": {
    "hi-res": "../public/artist/veruca-salt/veruca-salt-hi-res.jpg",
    "medium": "../public/artist/veruca-salt/veruca-salt-medium.jpg",
    "small": "../public/artist/veruca-salt/veruca-salt-small.jpg"
  },
  "name": "Veruca Salt",
  "popularity": 48,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='112440', url='https://music.apple.com/gb/artist/veruca-salt/112440', name='Veruca Salt', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/03/a1/40/03a14004-9e56-0df6-2a5d-9933768902c6/mzl.nrkcklpz.jpg/2000x2000bb.jpg', genres=['Rock'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '112440', 'type': 'artists', 'href': '/v1/catalog/gb/artists/112440', 'attributes': {'name': 'Veruca Salt', 'genreNames': ['Rock'], 'artwork': {'width': 3787, 'height': 3787, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/03/a1/40/03a14004-9e56-0df6-2a5d-9933768902c6/mzl.nrkcklpz.jpg/{w}x{h}bb.jpg', 'bgColor': 'ffffff', 'textColor1': '12090d', 'textColor2': '1f1817', 'textColor3': '423a3e', 'textColor4': '4b4645'}, 'url': 'https://music.apple.com/gb/artist/veruca-salt/112440'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/112440/albums', 'data': [{'id': '1440908609', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1440908609'}, {'id': '265134156', 'type': 'albums', 'href': '/v1/catalog/gb/albums/265134156'}, {'id': '1482850746', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1482850746'}, {'id': '992287467', 'type': 'albums', 'href': '/v1/catalog/gb/albums/992287467'}, {'id': '324214184', 'type': 'albums', 'href': '/v1/catalog/gb/albums/324214184'}, {'id': '1641358085', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1641358085'}, {'id': '1445169786', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1445169786'}, {'id': '1704256217', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1704256217'}, {'id': '920634476', 'type': 'albums', 'href': '/v1/catalog/gb/albums/920634476'}, {'id': '1487388521', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1487388521'}, {'id': '1681056317', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1681056317'}, {'id': '324363774', 'type': 'albums', 'href': '/v1/catalog/gb/albums/324363774'}]}}})",
    "discogs": {
      "cover_image": "",
      "id": "28974",
      "images": [],
      "members": [],
      "name": "Veruca Salt",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "28974",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/28974"
      },
      "resource_url": "https://api.discogs.com/artists/28974",
      "thumb": "",
      "url": "https://www.discogs.com/artist/28974",
      "urls": []
    },
    "lastfm": "ArtistLastFmData(name='Veruca Salt', url='https://www.last.fm/music/Veruca+Salt', mbid='86e8e21a-d29f-47d2-bbf0-e079f7044e71', listeners=521428, playcount=7346385, bio_summary='Veruca Salt are an grunge group from Chicago, Illinois, USA formed in 1993. The band consists of Louise Post (vocals, guitar), Nina Gordon (vocals, guitar), Steve Lack (bass), and Gordon\\'s brother Jim Shapiro (drums). The band has released five albums: \"American Thighs\" (1994), \"Eight Arms to Hold You\" (1997), \"Resolver\" (2000), \"IV\" (2006) and \"Ghost Notes\" (2015).\\n\\nVeruca Salt was formed alongside the friendship of Louise Post and Nina Gordon. Introduced by Gordon\\'s good friend <a href=\"https://www.last.fm/music/Veruca+Salt\">Read more on Last.fm</a>', bio_content='Veruca Salt are an grunge group from Chicago, Illinois, USA formed in 1993. The band consists of Louise Post (vocals, guitar), Nina Gordon (vocals, guitar), Steve Lack (bass), and Gordon\\'s brother Jim Shapiro (drums). The band has released five albums: \"American Thighs\" (1994), \"Eight Arms to Hold You\" (1997), \"Resolver\" (2000), \"IV\" (2006) and \"Ghost Notes\" (2015).\\n\\nVeruca Salt was formed alongside the friendship of Louise Post and Nina Gordon. Introduced by Gordon\\'s good friend, actress Lili Taylor, Gordon and Post quickly bonded and formed what is now known as Veruca Salt. Originally, the band was an Indigo Girls-inspired acoustic act, but the women quickly realized this wasn\\'t their sound. They quickly enlisted bass player Steve Lack and eventually Gordon\\'s brother Jim Shapiro joined as a drummer, even though he originally was just drumming as a favor to his sister.\\n\\nVeruca Salt released a self-funded demo tape and shopped it to labels, and began to play a handful of small club shows. The buzz around the band grew furiously, and after only a few live gigs, the band was signed to Minty Fresh Records and began recording with producer Brad Wood. At the time Brad was popular due to having recently produced Liz Phair\\'s critically acclaimed Exile in Guyville.\\n\\nThe band released an orange 7\" single for the song \"Seether\" to radio. \"Seether\" was a bratty, distorted alt-rocker about an angry and misunderstood woman. Compared to the rest of Veruca Salt\\'s material, \"Seether\" was very pop, so much so that Gordon said that when she wrote it, she didn\\'t think the rest of the band would like it. They sent \"Seether\" to radio, as it was the most radio-friendly song they had written and the reaction was unexpectedly positive. Unfortunately, the album wasn\\'t complete and they found themselves rushing to complete the album, before \"Seether\" lost its radio momentum. It ended up peaking at #8 on the Modern Rock charts.\\n\\nGeffen Records signed the band after an intense label bidding war and American Thighs was released October 25, 1994. It peaked on the Billboard Top 100 at 69 and was certified Gold. The follow-up single \"All Hail Me\" failed to chart Top 40 on Modern Rock, and the last single from the album, \"Number One Blind\", written by Gordon, did better than the previous single at 20 on Modern Rock chart, but nowhere near as well as \"Seether\". Gordon and Post were unhappy with the song\\'s video, and it was pulled after airing fewer than five times on MTV.\\n\\nTo support this album, Veruca Salt opened for such acts as Hole, Live and PJ Harvey, as well as their own headlining club tour.\\n\\nThe band released an EP in 1996 titled Blow It Out Your Ass It\\'s Veruca Salt to tide fans over until their next album. \\n\\nAfter touring for American Thighs, Gordon and Post entered the studio with Bob Rock to record their second album. They were inspired to work with Bob after hearing Metallica\\'s \"Enter Sandman\" on the loud-system before a Veruca Salt concert at an outdoor music festival.\\n\\nEight Arms to Hold You, which was released February 11, 1997 on Geffen Records, proved to be a difficult and dividing album. Some fans of American Thighs were disappointed by the polished, hard-rock and distinctively Bob Rock production, in comparison to the laidback indie buzz-bin vibe of American Thighs. The new album garnered mixed reviews from music critics as well. Band members have since admitted that this album was difficult for the band, and the recording process was extremely tense. However, Eight Arms to Hold You sold well due to the success of the first single \"Volcano Girls\", written by Gordon. It was a catchy, power-pop tantrum that matched \"Seether\"\\'s success, peaking at #8 on the Modern Rock charts. This album, however, didn\\'t have longevity, and despite peaking higher (Billboard Top 100 at 55) than American Thighs, sales dropped off drastically when the second single \"Shutterbug\" failed to chart despite a high budget video and Saturday Night Live performance, as well as other promotion. Three more singles were sent to radio (\"The Morning Sad\", \"Straight\" and \"Benjamin\") but none of them did well enough to warrant a video. However, the Gordon-penned \"Benjamin\" was released internationally as the third and last commercial single from the album despite having no video and no promotion. \"Benjamin\" also failed to chart. Shapiro left the band soon after the release of Eight Arms and was replaced by Stacy Jones (of Letters to Cleo and now American Hi-Fi). Jones toured with the band on the Eight Arms tour, but never recorded with them.\\n\\nVeruca Salt toured extensively for Eight Arms to Hold You, opening for Bush as well as a lengthy international headlining club tour.\\n\\nNina Gordon left Veruca Salt in early 1998 amid rumors of stolen boyfriends and physical altercations with bandmate Louise Post. Post, now the only original band member, recruited a new band, consisting of Stephen Fitzpatrick (guitar), Suzanne Sokol (bass) and Jimmy Madla (drums), and continued to record and perform under the Veruca Salt moniker. The new band signed with Beyond Records. The first album with the new lineup was 2000\\'s Resolver.\\n\\nDecember 2002 saw the release of both Resolver and lead single \"Born Entertainer\", in Australia through Embryo Records / MGM. Following the release of \"Born Entertainer\" Embryo Records / MGM released the single \"Officially Dead\" which contained newly recorded tracks as well as a remix of \\'the Same Person. The band toured Australia, including the \"Splendour in the Grass\" festival alongside bands such as Placebo and Coldplay. \\'Yeah Man\\' was released as a radio only single.\\n\\nAfter planning to take some time to step away from the music industry the band once again toured and performed at some festival shows in Australia. The tour took in the capital cities as well as performances at both the \"Falls Festival\" and the newly created Southbound festival in Perth. The band completed the 2 week tour and upon arrival back in the United States performed a show at the iconic \"Viper Room\". The band debuted the tracks \\'Blissful Queen\\' and \\'Circular Trend\\' live, both would end up on the album \"IV\"\\n\\n2005 saw another couple of line-up changes with Sokol and Madla leaving, being replaced by Solomon Snyder on bass and Michael Miley on drums for the recording of the EP Lords of Sounds and Lesser Things (LOSALT). The band then went on tour as Post, Fitzpatrick, drummer Kellii Scott and bassist Nicole Fiorentino. LOSALT was released and sold independently at the bands shows and via the website and included six new songs. The title of the EP is an extract from Zora Neale Hurston\\'s Their Eyes Were Watching God. This preluded the full length album, \"IV\", released September 2006 and accompanied by a US tour. The lead single \"So Weird\" was released to radio at the end of October 2006.\\n\\nThey recorded a cover of Neil Young\\'s song \"Burned\" for a 2007 Breast Cancer Benefit album due for release in October 2007. The band became inactive sometime after that, announcing in 2012 that they had entered an indefinite hiatus.\\n\\nIn 2013, the original lineup of the band reunited. In 2014, the band released the single \"The Museum of Broken Relationships.\" and went on a tour of the United States and Australia. The band\\'s first album in nine years, \"Ghost Notes\", was released in July 2015. <a href=\"https://www.last.fm/music/Veruca+Salt\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['female vocalists', 'alternative', 'Grunge', 'rock', 'alternative rock'], similar_artists=[{'name': 'Babes in Toyland', 'url': 'https://www.last.fm/music/Babes+in+Toyland'}, {'name': 'L7', 'url': 'https://www.last.fm/music/L7'}, {'name': 'Hole', 'url': 'https://www.last.fm/music/Hole'}, {'name': 'Letters to Cleo', 'url': 'https://www.last.fm/music/Letters+to+Cleo'}, {'name': '7 Year Bitch', 'url': 'https://www.last.fm/music/7+Year+Bitch'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Veruca Salt', 'mbid': '86e8e21a-d29f-47d2-bbf0-e079f7044e71', 'url': 'https://www.last.fm/music/Veruca+Salt', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '521428', 'playcount': '7346385'}, 'similar': {'artist': [{'name': 'Babes in Toyland', 'url': 'https://www.last.fm/music/Babes+in+Toyland', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'L7', 'url': 'https://www.last.fm/music/L7', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Hole', 'url': 'https://www.last.fm/music/Hole', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Letters to Cleo', 'url': 'https://www.last.fm/music/Letters+to+Cleo', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': '7 Year Bitch', 'url': 'https://www.last.fm/music/7+Year+Bitch', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'female vocalists', 'url': 'https://www.last.fm/tag/female+vocalists'}, {'name': 'alternative', 'url': 'https://www.last.fm/tag/alternative'}, {'name': 'Grunge', 'url': 'https://www.last.fm/tag/Grunge'}, {'name': 'rock', 'url': 'https://www.last.fm/tag/rock'}, {'name': 'alternative rock', 'url': 'https://www.last.fm/tag/alternative+rock'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Veruca+Salt/+wiki'}}, 'published': '21 Feb 2006, 02:18', 'summary': 'Veruca Salt are an grunge group from Chicago, Illinois, USA formed in 1993. The band consists of Louise Post (vocals, guitar), Nina Gordon (vocals, guitar), Steve Lack (bass), and Gordon\\'s brother Jim Shapiro (drums). The band has released five albums: \"American Thighs\" (1994), \"Eight Arms to Hold You\" (1997), \"Resolver\" (2000), \"IV\" (2006) and \"Ghost Notes\" (2015).\\n\\nVeruca Salt was formed alongside the friendship of Louise Post and Nina Gordon. Introduced by Gordon\\'s good friend <a href=\"https://www.last.fm/music/Veruca+Salt\">Read more on Last.fm</a>', 'content': 'Veruca Salt are an grunge group from Chicago, Illinois, USA formed in 1993. The band consists of Louise Post (vocals, guitar), Nina Gordon (vocals, guitar), Steve Lack (bass), and Gordon\\'s brother Jim Shapiro (drums). The band has released five albums: \"American Thighs\" (1994), \"Eight Arms to Hold You\" (1997), \"Resolver\" (2000), \"IV\" (2006) and \"Ghost Notes\" (2015).\\n\\nVeruca Salt was formed alongside the friendship of Louise Post and Nina Gordon. Introduced by Gordon\\'s good friend, actress Lili Taylor, Gordon and Post quickly bonded and formed what is now known as Veruca Salt. Originally, the band was an Indigo Girls-inspired acoustic act, but the women quickly realized this wasn\\'t their sound. They quickly enlisted bass player Steve Lack and eventually Gordon\\'s brother Jim Shapiro joined as a drummer, even though he originally was just drumming as a favor to his sister.\\n\\nVeruca Salt released a self-funded demo tape and shopped it to labels, and began to play a handful of small club shows. The buzz around the band grew furiously, and after only a few live gigs, the band was signed to Minty Fresh Records and began recording with producer Brad Wood. At the time Brad was popular due to having recently produced Liz Phair\\'s critically acclaimed Exile in Guyville.\\n\\nThe band released an orange 7\" single for the song \"Seether\" to radio. \"Seether\" was a bratty, distorted alt-rocker about an angry and misunderstood woman. Compared to the rest of Veruca Salt\\'s material, \"Seether\" was very pop, so much so that Gordon said that when she wrote it, she didn\\'t think the rest of the band would like it. They sent \"Seether\" to radio, as it was the most radio-friendly song they had written and the reaction was unexpectedly positive. Unfortunately, the album wasn\\'t complete and they found themselves rushing to complete the album, before \"Seether\" lost its radio momentum. It ended up peaking at #8 on the Modern Rock charts.\\n\\nGeffen Records signed the band after an intense label bidding war and American Thighs was released October 25, 1994. It peaked on the Billboard Top 100 at 69 and was certified Gold. The follow-up single \"All Hail Me\" failed to chart Top 40 on Modern Rock, and the last single from the album, \"Number One Blind\", written by Gordon, did better than the previous single at 20 on Modern Rock chart, but nowhere near as well as \"Seether\". Gordon and Post were unhappy with the song\\'s video, and it was pulled after airing fewer than five times on MTV.\\n\\nTo support this album, Veruca Salt opened for such acts as Hole, Live and PJ Harvey, as well as their own headlining club tour.\\n\\nThe band released an EP in 1996 titled Blow It Out Your Ass It\\'s Veruca Salt to tide fans over until their next album. \\n\\nAfter touring for American Thighs, Gordon and Post entered the studio with Bob Rock to record their second album. They were inspired to work with Bob after hearing Metallica\\'s \"Enter Sandman\" on the loud-system before a Veruca Salt concert at an outdoor music festival.\\n\\nEight Arms to Hold You, which was released February 11, 1997 on Geffen Records, proved to be a difficult and dividing album. Some fans of American Thighs were disappointed by the polished, hard-rock and distinctively Bob Rock production, in comparison to the laidback indie buzz-bin vibe of American Thighs. The new album garnered mixed reviews from music critics as well. Band members have since admitted that this album was difficult for the band, and the recording process was extremely tense. However, Eight Arms to Hold You sold well due to the success of the first single \"Volcano Girls\", written by Gordon. It was a catchy, power-pop tantrum that matched \"Seether\"\\'s success, peaking at #8 on the Modern Rock charts. This album, however, didn\\'t have longevity, and despite peaking higher (Billboard Top 100 at 55) than American Thighs, sales dropped off drastically when the second single \"Shutterbug\" failed to chart despite a high budget video and Saturday Night Live performance, as well as other promotion. Three more singles were sent to radio (\"The Morning Sad\", \"Straight\" and \"Benjamin\") but none of them did well enough to warrant a video. However, the Gordon-penned \"Benjamin\" was released internationally as the third and last commercial single from the album despite having no video and no promotion. \"Benjamin\" also failed to chart. Shapiro left the band soon after the release of Eight Arms and was replaced by Stacy Jones (of Letters to Cleo and now American Hi-Fi). Jones toured with the band on the Eight Arms tour, but never recorded with them.\\n\\nVeruca Salt toured extensively for Eight Arms to Hold You, opening for Bush as well as a lengthy international headlining club tour.\\n\\nNina Gordon left Veruca Salt in early 1998 amid rumors of stolen boyfriends and physical altercations with bandmate Louise Post. Post, now the only original band member, recruited a new band, consisting of Stephen Fitzpatrick (guitar), Suzanne Sokol (bass) and Jimmy Madla (drums), and continued to record and perform under the Veruca Salt moniker. The new band signed with Beyond Records. The first album with the new lineup was 2000\\'s Resolver.\\n\\nDecember 2002 saw the release of both Resolver and lead single \"Born Entertainer\", in Australia through Embryo Records / MGM. Following the release of \"Born Entertainer\" Embryo Records / MGM released the single \"Officially Dead\" which contained newly recorded tracks as well as a remix of \\'the Same Person. The band toured Australia, including the \"Splendour in the Grass\" festival alongside bands such as Placebo and Coldplay. \\'Yeah Man\\' was released as a radio only single.\\n\\nAfter planning to take some time to step away from the music industry the band once again toured and performed at some festival shows in Australia. The tour took in the capital cities as well as performances at both the \"Falls Festival\" and the newly created Southbound festival in Perth. The band completed the 2 week tour and upon arrival back in the United States performed a show at the iconic \"Viper Room\". The band debuted the tracks \\'Blissful Queen\\' and \\'Circular Trend\\' live, both would end up on the album \"IV\"\\n\\n2005 saw another couple of line-up changes with Sokol and Madla leaving, being replaced by Solomon Snyder on bass and Michael Miley on drums for the recording of the EP Lords of Sounds and Lesser Things (LOSALT). The band then went on tour as Post, Fitzpatrick, drummer Kellii Scott and bassist Nicole Fiorentino. LOSALT was released and sold independently at the bands shows and via the website and included six new songs. The title of the EP is an extract from Zora Neale Hurston\\'s Their Eyes Were Watching God. This preluded the full length album, \"IV\", released September 2006 and accompanied by a US tour. The lead single \"So Weird\" was released to radio at the end of October 2006.\\n\\nThey recorded a cover of Neil Young\\'s song \"Burned\" for a 2007 Breast Cancer Benefit album due for release in October 2007. The band became inactive sometime after that, announcing in 2012 that they had entered an indefinite hiatus.\\n\\nIn 2013, the original lineup of the band reunited. In 2014, the band released the single \"The Museum of Broken Relationships.\" and went on a tour of the United States and Australia. The band\\'s first album in nine years, \"Ghost Notes\", was released in July 2015. <a href=\"https://www.last.fm/music/Veruca+Salt\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='2QwJQuBekTA4qF7N7uLHDP', url='https://open.spotify.com/artist/2QwJQuBekTA4qF7N7uLHDP', name='Veruca Salt', popularity=48, followers=314377, genres=['riot grrrl', 'grunge'], images=[{'url': 'https://i.scdn.co/image/7947f9c222f4f941306b27cf4c7a6b2033f80453', 'height': 507, 'width': 768}, {'url': 'https://i.scdn.co/image/491dd40402bf2b9b6269ca95a7ae2c73275434fb', 'height': 423, 'width': 640}, {'url': 'https://i.scdn.co/image/e91391f463afb99b4b26b8c5aa43c88071e454ab', 'height': 132, 'width': 200}, {'url': 'https://i.scdn.co/image/f857d41be03c17b8572b4e4e06432167152c3823', 'height': 42, 'width': 64}], external_urls={'spotify': 'https://open.spotify.com/artist/2QwJQuBekTA4qF7N7uLHDP'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/2QwJQuBekTA4qF7N7uLHDP'}, 'followers': {'href': None, 'total': 314377}, 'genres': ['riot grrrl', 'grunge'], 'href': 'https://api.spotify.com/v1/artists/2QwJQuBekTA4qF7N7uLHDP', 'id': '2QwJQuBekTA4qF7N7uLHDP', 'images': [{'url': 'https://i.scdn.co/image/7947f9c222f4f941306b27cf4c7a6b2033f80453', 'height': 507, 'width': 768}, {'url': 'https://i.scdn.co/image/491dd40402bf2b9b6269ca95a7ae2c73275434fb', 'height': 423, 'width': 640}, {'url': 'https://i.scdn.co/image/e91391f463afb99b4b26b8c5aa43c88071e454ab', 'height': 132, 'width': 200}, {'url': 'https://i.scdn.co/image/f857d41be03c17b8572b4e4e06432167152c3823', 'height': 42, 'width': 64}], 'name': 'Veruca Salt', 'popularity': 48, 'type': 'artist', 'uri': 'spotify:artist:2QwJQuBekTA4qF7N7uLHDP'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "1993–1998: Formation and Growth\nNamed after Veruca Salt, the spoiled rich girl from the children's book Charlie and the Chocolate Factory by Roald Dahl and its 1971 film adaptation Willy Wonka & the Chocolate Factory directed by Mel Stuart, Veruca Salt was formed in Chicago by Louise Post (guitar/vocals) and Nina Gordon (guitar/vocals). Post and Gordon were introduced through mutual friend Lili Taylor, and began playing music together. They wrote songs for a year and a half before being joined by Gordon's brother, Jim Shapiro, on drums and Steve Lack on bass. Songwriting was shared between Gordon and Post, though the two seldom collaborated. Rather, each would typically submit a complete song to the group and sing the lead vocal on that song, while the other would record backing vocals.\nThe band had performed a handful of shows when Jim Powers of Minty Fresh Records asked them to sign to the independent label. The band's first release was the single \"Seether\"/\"All Hail Me\" on Minty Fresh Records, in 1994. The single was a success and Veruca Salt accompanied Hole on a tour, before releasing their first full-length album, American Thighs, which eventually reached Gold status.\nAfter signing to Geffen Records, the band quickly gained in popularity as \"Seether\" became an MTV hit. A stop-gap EP recorded by Steve Albini, Blow It Out Your Ass It's Veruca Salt, was released in 1996.\nTheir second album, Eight Arms to Hold You, was produced by Bob Rock and released in 1997. Lead single \"Volcano Girls\" gained exposure as the opening theme to the teen comedy film Jawbreaker. Veruca Salt performed another single, \"Shutterbug\", on Saturday Night Live; however, instead of the featured musical group performing two songs as had been tradition, the musical performances were split between Sting and Veruca Salt. Shapiro left the band soon after the release of Eight Arms and was replaced by Stacy Jones (of Letters to Cleo and American Hi-Fi). Jones toured with the band on the Eight Arms tour, but never recorded with them.\nIn 1996, Veruca Salt appeared as Pavement's replacement band in their video \"Painted Soldiers\".\nIn 1997, they opened for the band Bush in a North American Tour.\n1998–2005: Gordon's departure, reformation and Resolver\nLouise Post (left) and Nicole Fiorentino (right) in 2006 with Veruca Salt\nIn 1998, Gordon left the band to pursue a solo career (her first album Tonight and the Rest of My Life, was released in 2000). The undisclosed dispute between Gordon and Post has been described as \"one of the greatest rock soap operas since Fleetwood Mac or Hüsker Dü.\"\nPost, as the only remaining band member, contributed the song Somebody to the Depeche Mode tribute album For The Masses before recruiting a new lineup. Guitarist Stephen Fitzpatrick joined and went on to become one of Post's principle songwriting partners during the next decade. Jimmy Madla and Suzanne Sokol joined on drums and bass guitar respectively. The new version of the band signed with Beyond Records and released Resolver in 2000 which spawned both a single and video for Born Entertainer.\nSuzanne Sokol left the band at the end of 2000 and was replaced by Post's friend, Gina Crosley. The band continued to tour through the summer of 2001 in the UK. Post and Crosley also attempted to form a supergroup with Courtney Love of Hole and others but the project soon imploded. This allowed the pair to focus on new material for Veruca Salt which eventually yielded the Officially Dead EP that was primarily distributed on during the band's 2002 tour of Australia. Crosley is specifically credited with co-writing \"Smoke & Mirrors.\" She also worked on songs that later appeared on IV, but no credit is officially given and she left before the album was completed.\n2005–2012: VSIV and hiatus\nBy 2005, Madla left to enter the restaurant business and Crosley was also dismissed. They were replaced in the studio by Solomon Snyder and Michael Miley respectively. This session resulted in the Lords of Sounds and Lesser Things (LOSALT). The band went on tour with Post, Fitzpatrick, drummer Kellii Scott of Failure, and bassist Nicole Fiorentino. LOSALT was released independently by the band and included six new songs. The title of the EP is an extract from Zora Neale Hurston's Their Eyes Were Watching God. This lineup then recorded a full-length album, IV, and released it in September 2006 (like Resolver before it, this album was released a month apart from a Nina Gordon solo album). The band then went on what would prove to be the last tour of Louise Post's solo incarnation of the band. A single, \"So Weird\", was released to radio at the end of October 2006 but neither the song nor the album did well commercially.\nIn 2007, the band recorded a cover of Neil Young's song \"Burned\" for a 2007 Breast Cancer Benefit album and then went almost entirely dormant. Louise Post took time to have a child while Fiorentino went on to play bass with the Smashing Pumpkins and The Cold and Lovely. Kellii Scott returned to his original band Failure. On March 14, 2012, the band announced on their official website that they were on an indefinite hiatus.\n2013: reunion\nOn March 15, 2013 the band announced the reunion of its original line-up (Nina Gordon, Louise Post, Jim Shapiro, and Steve Lack) with a message on the band's official Facebook page which read, \"for now let's just say this: hatchets buried, axes exhumed.\" The members, including Post, have gone on to refer to the Resolver/IV era as \"Veruca Starship\" in reference to the convoluted evolution of the band Jefferson Airplane but have also mentioned that they might be open to adding material from their time apart into their sets at some point.\nOn September 29, 2013, the band announced via social media that they were working on new material. Their first release since reforming came in the form of a release for Record Store Day 2014. The band released a 10-inch vinyl EP, MMXIV, which contains two new songs, \"It's Holy\" and \"The Museum of Broken Relationships\" on one side and a twentieth anniversary re-release of Seether on the other. The band then toured both the USA and Australia.\nBoth Louise Post and Nina Gordon had mentioned a full length album was set to be released fall of 2014, however this has been pushed back to early 2015 to allow for touring in 2014.\n(wiki)",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1993",
      "country": "Chicago, Illinois, USA",
      "country_code": "US",
      "died_year": "2012",
      "disbanded": true,
      "facebook": "",
      "formed_year": "1993",
      "gender": "Mixed",
      "genre": "Alternative Rock",
      "id": "113083",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/xvuvpy1348112832.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xrptuu1348112881.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/wypwsw1512504571.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/vuwsvs1451831813.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "4",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "86e8e21a-d29f-47d2-bbf0-e079f7044e71",
      "name": "Veruca Salt",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/03/a1/40/03a14004-9e56-0df6-2a5d-9933768902c6/mzl.nrkcklpz.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "112440",
      "name": "Veruca Salt",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/veruca-salt/112440"
    },
    "discogs": {
      "cover_image": "",
      "id": "28974",
      "images": [],
      "members": [],
      "name": "Veruca Salt",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "28974",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/28974"
      },
      "resource_url": "https://api.discogs.com/artists/28974",
      "thumb": "",
      "url": "https://www.discogs.com/artist/28974",
      "urls": []
    },
    "lastfm": {
      "bio_content": "Veruca Salt are an grunge group from Chicago, Illinois, USA formed in 1993. The band consists of Louise Post (vocals, guitar), Nina Gordon (vocals, guitar), Steve Lack (bass), and Gordon's brother Jim Shapiro (drums). The band has released five albums: \"American Thighs\" (1994), \"Eight Arms to Hold You\" (1997), \"Resolver\" (2000), \"IV\" (2006) and \"Ghost Notes\" (2015).\n\nVeruca Salt was formed alongside the friendship of Louise Post and Nina Gordon. Introduced by Gordon's good friend, actress Lili Taylor, Gordon and Post quickly bonded and formed what is now known as Veruca Salt. Originally, the band was an Indigo Girls-inspired acoustic act, but the women quickly realized this wasn't their sound. They quickly enlisted bass player Steve Lack and eventually Gordon's brother Jim Shapiro joined as a drummer, even though he originally was just drumming as a favor to his sister.\n\nVeruca Salt released a self-funded demo tape and shopped it to labels, and began to play a handful of small club shows. The buzz around the band grew furiously, and after only a few live gigs, the band was signed to Minty Fresh Records and began recording with producer Brad Wood. At the time Brad was popular due to having recently produced Liz Phair's critically acclaimed Exile in Guyville.\n\nThe band released an orange 7\" single for the song \"Seether\" to radio. \"Seether\" was a bratty, distorted alt-rocker about an angry and misunderstood woman. Compared to the rest of Veruca Salt's material, \"Seether\" was very pop, so much so that Gordon said that when she wrote it, she didn't think the rest of the band would like it. They sent \"Seether\" to radio, as it was the most radio-friendly song they had written and the reaction was unexpectedly positive. Unfortunately, the album wasn't complete and they found themselves rushing to complete the album, before \"Seether\" lost its radio momentum. It ended up peaking at #8 on the Modern Rock charts.\n\nGeffen Records signed the band after an intense label bidding war and American Thighs was released October 25, 1994. It peaked on the Billboard Top 100 at 69 and was certified Gold. The follow-up single \"All Hail Me\" failed to chart Top 40 on Modern Rock, and the last single from the album, \"Number One Blind\", written by Gordon, did better than the previous single at 20 on Modern Rock chart, but nowhere near as well as \"Seether\". Gordon and Post were unhappy with the song's video, and it was pulled after airing fewer than five times on MTV.\n\nTo support this album, Veruca Salt opened for such acts as Hole, Live and PJ Harvey, as well as their own headlining club tour.\n\nThe band released an EP in 1996 titled Blow It Out Your Ass It's Veruca Salt to tide fans over until their next album. \n\nAfter touring for American Thighs, Gordon and Post entered the studio with Bob Rock to record their second album. They were inspired to work with Bob after hearing Metallica's \"Enter Sandman\" on the loud-system before a Veruca Salt concert at an outdoor music festival.\n\nEight Arms to Hold You, which was released February 11, 1997 on Geffen Records, proved to be a difficult and dividing album. Some fans of American Thighs were disappointed by the polished, hard-rock and distinctively Bob Rock production, in comparison to the laidback indie buzz-bin vibe of American Thighs. The new album garnered mixed reviews from music critics as well. Band members have since admitted that this album was difficult for the band, and the recording process was extremely tense. However, Eight Arms to Hold You sold well due to the success of the first single \"Volcano Girls\", written by Gordon. It was a catchy, power-pop tantrum that matched \"Seether\"'s success, peaking at #8 on the Modern Rock charts. This album, however, didn't have longevity, and despite peaking higher (Billboard Top 100 at 55) than American Thighs, sales dropped off drastically when the second single \"Shutterbug\" failed to chart despite a high budget video and Saturday Night Live performance, as well as other promotion. Three more singles were sent to radio (\"The Morning Sad\", \"Straight\" and \"Benjamin\") but none of them did well enough to warrant a video. However, the Gordon-penned \"Benjamin\" was released internationally as the third and last commercial single from the album despite having no video and no promotion. \"Benjamin\" also failed to chart. Shapiro left the band soon after the release of Eight Arms and was replaced by Stacy Jones (of Letters to Cleo and now American Hi-Fi). Jones toured with the band on the Eight Arms tour, but never recorded with them.\n\nVeruca Salt toured extensively for Eight Arms to Hold You, opening for Bush as well as a lengthy international headlining club tour.\n\nNina Gordon left Veruca Salt in early 1998 amid rumors of stolen boyfriends and physical altercations with bandmate Louise Post. Post, now the only original band member, recruited a new band, consisting of Stephen Fitzpatrick (guitar), Suzanne Sokol (bass) and Jimmy Madla (drums), and continued to record and perform under the Veruca Salt moniker. The new band signed with Beyond Records. The first album with the new lineup was 2000's Resolver.\n\nDecember 2002 saw the release of both Resolver and lead single \"Born Entertainer\", in Australia through Embryo Records / MGM. Following the release of \"Born Entertainer\" Embryo Records / MGM released the single \"Officially Dead\" which contained newly recorded tracks as well as a remix of 'the Same Person. The band toured Australia, including the \"Splendour in the Grass\" festival alongside bands such as Placebo and Coldplay. 'Yeah Man' was released as a radio only single.\n\nAfter planning to take some time to step away from the music industry the band once again toured and performed at some festival shows in Australia. The tour took in the capital cities as well as performances at both the \"Falls Festival\" and the newly created Southbound festival in Perth. The band completed the 2 week tour and upon arrival back in the United States performed a show at the iconic \"Viper Room\". The band debuted the tracks 'Blissful Queen' and 'Circular Trend' live, both would end up on the album \"IV\"\n\n2005 saw another couple of line-up changes with Sokol and Madla leaving, being replaced by Solomon Snyder on bass and Michael Miley on drums for the recording of the EP Lords of Sounds and Lesser Things (LOSALT). The band then went on tour as Post, Fitzpatrick, drummer Kellii Scott and bassist Nicole Fiorentino. LOSALT was released and sold independently at the bands shows and via the website and included six new songs. The title of the EP is an extract from Zora Neale Hurston's Their Eyes Were Watching God. This preluded the full length album, \"IV\", released September 2006 and accompanied by a US tour. The lead single \"So Weird\" was released to radio at the end of October 2006.\n\nThey recorded a cover of Neil Young's song \"Burned\" for a 2007 Breast Cancer Benefit album due for release in October 2007. The band became inactive sometime after that, announcing in 2012 that they had entered an indefinite hiatus.\n\nIn 2013, the original lineup of the band reunited. In 2014, the band released the single \"The Museum of Broken Relationships.\" and went on a tour of the United States and Australia. The band's first album in nine years, \"Ghost Notes\", was released in July 2015. <a href=\"https://www.last.fm/music/Veruca+Salt\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Veruca Salt are an grunge group from Chicago, Illinois, USA formed in 1993. The band consists of Louise Post (vocals, guitar), Nina Gordon (vocals, guitar), Steve Lack (bass), and Gordon's brother Jim Shapiro (drums). The band has released five albums: \"American Thighs\" (1994), \"Eight Arms to Hold You\" (1997), \"Resolver\" (2000), \"IV\" (2006) and \"Ghost Notes\" (2015).\n\nVeruca Salt was formed alongside the friendship of Louise Post and Nina Gordon. Introduced by Gordon's good friend <a href=\"https://www.last.fm/music/Veruca+Salt\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 521428,
      "mbid": "86e8e21a-d29f-47d2-bbf0-e079f7044e71",
      "name": "Veruca Salt",
      "playcount": 7346385,
      "similar_artists": [
        {
          "name": "Babes in Toyland",
          "url": "https://www.last.fm/music/Babes+in+Toyland"
        },
        {
          "name": "L7",
          "url": "https://www.last.fm/music/L7"
        },
        {
          "name": "Hole",
          "url": "https://www.last.fm/music/Hole"
        },
        {
          "name": "Letters to Cleo",
          "url": "https://www.last.fm/music/Letters+to+Cleo"
        },
        {
          "name": "7 Year Bitch",
          "url": "https://www.last.fm/music/7+Year+Bitch"
        }
      ],
      "tags": [
        "female vocalists",
        "alternative",
        "Grunge",
        "rock",
        "alternative rock"
      ],
      "url": "https://www.last.fm/music/Veruca+Salt"
    },
    "spotify": {
      "followers": 314377,
      "genres": [
        "riot grrrl",
        "grunge"
      ],
      "id": "2QwJQuBekTA4qF7N7uLHDP",
      "images": [
        {
          "height": 507,
          "url": "https://i.scdn.co/image/7947f9c222f4f941306b27cf4c7a6b2033f80453",
          "width": 768
        },
        {
          "height": 423,
          "url": "https://i.scdn.co/image/491dd40402bf2b9b6269ca95a7ae2c73275434fb",
          "width": 640
        },
        {
          "height": 132,
          "url": "https://i.scdn.co/image/e91391f463afb99b4b26b8c5aa43c88071e454ab",
          "width": 200
        },
        {
          "height": 42,
          "url": "https://i.scdn.co/image/f857d41be03c17b8572b4e4e06432167152c3823",
          "width": 64
        }
      ],
      "name": "Veruca Salt",
      "popularity": 48,
      "url": "https://open.spotify.com/artist/2QwJQuBekTA4qF7N7uLHDP"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "1993–1998: Formation and Growth\nNamed after Veruca Salt, the spoiled rich girl from the children's book Charlie and the Chocolate Factory by Roald Dahl and its 1971 film adaptation Willy Wonka & the Chocolate Factory directed by Mel Stuart, Veruca Salt was formed in Chicago by Louise Post (guitar/vocals) and Nina Gordon (guitar/vocals). Post and Gordon were introduced through mutual friend Lili Taylor, and began playing music together. They wrote songs for a year and a half before being joined by Gordon's brother, Jim Shapiro, on drums and Steve Lack on bass. Songwriting was shared between Gordon and Post, though the two seldom collaborated. Rather, each would typically submit a complete song to the group and sing the lead vocal on that song, while the other would record backing vocals.\nThe band had performed a handful of shows when Jim Powers of Minty Fresh Records asked them to sign to the independent label. The band's first release was the single \"Seether\"/\"All Hail Me\" on Minty Fresh Records, in 1994. The single was a success and Veruca Salt accompanied Hole on a tour, before releasing their first full-length album, American Thighs, which eventually reached Gold status.\nAfter signing to Geffen Records, the band quickly gained in popularity as \"Seether\" became an MTV hit. A stop-gap EP recorded by Steve Albini, Blow It Out Your Ass It's Veruca Salt, was released in 1996.\nTheir second album, Eight Arms to Hold You, was produced by Bob Rock and released in 1997. Lead single \"Volcano Girls\" gained exposure as the opening theme to the teen comedy film Jawbreaker. Veruca Salt performed another single, \"Shutterbug\", on Saturday Night Live; however, instead of the featured musical group performing two songs as had been tradition, the musical performances were split between Sting and Veruca Salt. Shapiro left the band soon after the release of Eight Arms and was replaced by Stacy Jones (of Letters to Cleo and American Hi-Fi). Jones toured with the band on the Eight Arms tour, but never recorded with them.\nIn 1996, Veruca Salt appeared as Pavement's replacement band in their video \"Painted Soldiers\".\nIn 1997, they opened for the band Bush in a North American Tour.\n1998–2005: Gordon's departure, reformation and Resolver\nLouise Post (left) and Nicole Fiorentino (right) in 2006 with Veruca Salt\nIn 1998, Gordon left the band to pursue a solo career (her first album Tonight and the Rest of My Life, was released in 2000). The undisclosed dispute between Gordon and Post has been described as \"one of the greatest rock soap operas since Fleetwood Mac or Hüsker Dü.\"\nPost, as the only remaining band member, contributed the song Somebody to the Depeche Mode tribute album For The Masses before recruiting a new lineup. Guitarist Stephen Fitzpatrick joined and went on to become one of Post's principle songwriting partners during the next decade. Jimmy Madla and Suzanne Sokol joined on drums and bass guitar respectively. The new version of the band signed with Beyond Records and released Resolver in 2000 which spawned both a single and video for Born Entertainer.\nSuzanne Sokol left the band at the end of 2000 and was replaced by Post's friend, Gina Crosley. The band continued to tour through the summer of 2001 in the UK. Post and Crosley also attempted to form a supergroup with Courtney Love of Hole and others but the project soon imploded. This allowed the pair to focus on new material for Veruca Salt which eventually yielded the Officially Dead EP that was primarily distributed on during the band's 2002 tour of Australia. Crosley is specifically credited with co-writing \"Smoke & Mirrors.\" She also worked on songs that later appeared on IV, but no credit is officially given and she left before the album was completed.\n2005–2012: VSIV and hiatus\nBy 2005, Madla left to enter the restaurant business and Crosley was also dismissed. They were replaced in the studio by Solomon Snyder and Michael Miley respectively. This session resulted in the Lords of Sounds and Lesser Things (LOSALT). The band went on tour with Post, Fitzpatrick, drummer Kellii Scott of Failure, and bassist Nicole Fiorentino. LOSALT was released independently by the band and included six new songs. The title of the EP is an extract from Zora Neale Hurston's Their Eyes Were Watching God. This lineup then recorded a full-length album, IV, and released it in September 2006 (like Resolver before it, this album was released a month apart from a Nina Gordon solo album). The band then went on what would prove to be the last tour of Louise Post's solo incarnation of the band. A single, \"So Weird\", was released to radio at the end of October 2006 but neither the song nor the album did well commercially.\nIn 2007, the band recorded a cover of Neil Young's song \"Burned\" for a 2007 Breast Cancer Benefit album and then went almost entirely dormant. Louise Post took time to have a child while Fiorentino went on to play bass with the Smashing Pumpkins and The Cold and Lovely. Kellii Scott returned to his original band Failure. On March 14, 2012, the band announced on their official website that they were on an indefinite hiatus.\n2013: reunion\nOn March 15, 2013 the band announced the reunion of its original line-up (Nina Gordon, Louise Post, Jim Shapiro, and Steve Lack) with a message on the band's official Facebook page which read, \"for now let's just say this: hatchets buried, axes exhumed.\" The members, including Post, have gone on to refer to the Resolver/IV era as \"Veruca Starship\" in reference to the convoluted evolution of the band Jefferson Airplane but have also mentioned that they might be open to adding material from their time apart into their sets at some point.\nOn September 29, 2013, the band announced via social media that they were working on new material. Their first release since reforming came in the form of a release for Record Store Day 2014. The band released a 10-inch vinyl EP, MMXIV, which contains two new songs, \"It's Holy\" and \"The Museum of Broken Relationships\" on one side and a twentieth anniversary re-release of Seether on the other. The band then toured both the USA and Australia.\nBoth Louise Post and Nina Gordon had mentioned a full length album was set to be released fall of 2014, however this has been pushed back to early 2015 to allow for touring in 2014.\n(wiki)",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1993",
      "country": "Chicago, Illinois, USA",
      "country_code": "US",
      "died_year": "2012",
      "disbanded": true,
      "facebook": "",
      "formed_year": "1993",
      "gender": "Mixed",
      "genre": "Alternative Rock",
      "id": "113083",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/xvuvpy1348112832.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/xrptuu1348112881.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/wypwsw1512504571.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/vuwsvs1451831813.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "4",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "86e8e21a-d29f-47d2-bbf0-e079f7044e71",
      "name": "Veruca Salt",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "spotify_id": "2QwJQuBekTA4qF7N7uLHDP",
  "spotify_url": "https://open.spotify.com/artist/2QwJQuBekTA4qF7N7uLHDP",
  "updated_at": "2025-07-08T20:51:45.891585",
  "wikipedia_url": null
}