{
  "apple_music_id": "58757",
  "apple_music_url": "https://music.apple.com/gb/artist/sheryl-crow/58757",
  "biography": "Sheryl Suzanne Crow (born February 11, 1962) is an American blues rock singer, guitarist, bassist, pianist and songwriter. Her music blends country, pop, folk, and blues rock into one mainstream sound, and she has won nine Grammy Awards. Crow is also a noted political activist.\n\nCrow was born in Kennett, Missouri. Her parents were members of a local big band in which her father, an attorney, played trumpet. The family was very musical and owned three pianos.\n\nIn school, she was active in choir, athletics, and school plays. Even at a young age she was a perfectionist who strived to please her parents. In high school she was a drum majorette, member of the Pep Club, the National Honor Society, Future Farmers of America, Freshman Maid, Senior Maid and Paperdoll Queen. When her prom date was later questioned about her fame he said that at the time he thought she \"would be a doctor's wife someday\". She graduated in 1984 from the University of Missouri where she majored in music education with a concentration in piano. Coincidentally, actor Brad Pitt and ABC-TV news anchor Elizabeth Vargas were also students at the University of Missouri at the same time Crow was studying there; however, it is unknown whether or not any of these three future celebrities actually knew each other while they were students.\n\nFollowing college she became an elementary school music teacher in a suburb of St. Louis where she could be located closer to her fiance. Teaching during the day allowed her the opportunity to sing in bands on the weekends. Many people who knew her socially then, describe her as a nice, kind, elementary school teacher whose goal was settling down to raise children. At times, they acknowledge, she also struggled to get by on a teacher's salary. Other than comments about wanting to go to California someday and \"make it\", and her weekend band gigs, few during this period of her life saw the relentless determination that would someday carry her to multi-millionaire rock stardom. Or if they saw it, they didn't realize they were witnessing a future rock star in training. This time in her life, in retrospect, might accurately be considered by those who knew her then as her \"wilderness years.\"\n\nAfter a couple years of teaching and healing from a broken engagement, she was introduced to a local musician/producer. He had a thriving studio in the basement of his parent's home and helped her by using her in advertising jingles. Her first jingle was a back-to-school spot for the St. Louis department store Famous-Barr. McDonald's and Toyota commercial jingles soon followed. She was recently quoted in her 60 Minutes segment as saying she made $50,000 on her McDonald's commercial alone. This success spurred her into thinking what she could possibly do if she went into music full time.\n\nMotivated by her new-found success, Crow decided to move to Los Angeles in 1986. Using her demo jingle tapes from St. Louis and perservering through constant rejections, she eventually found work as a backup vocalist for many major label acts. She was recruited to perform as a backup singer for Michael Jackson on his Bad tour. Whether she actually crashed the audition, as widely reported at the time, is uncertain. She spent the next 17 months touring the world singing back up and a duet, \"I Just Can't Stop Loving You\" on stage with Jackson. After the tour ended in 1989, she sang back up for Don Henley and in the following year made her first appearance on Saturday Night Live singing back up (\"time, time, take it, take it away\") for Henley. Later she credited Henley for helping her write better songs.\n\nIn 1989, she played keyboards in the touring version of Toy Matinee, which was led by her boyfriend at the time, Kevin Gilbert.\n\nBy 1990, Crow had attracted the attention of A&M Records, eventually leading to her debut album which remains unreleased but widely bootlegged to this day. However, she did not like the slick and well-produced pop sound of the record and implored the label to allow her to start anew. What followed was months of depression that was mentioned years later in People magazine where she stated she felt her career was over. She eventually teamed up professionally with producer Bill Bottrell.\n\nCrow became acquainted with a song writing collective known as \"The Tuesday Night Music Club\" through Bottrell, a member of the club; and dated another member, Kevin Gilbert. There has been much controversy surrounding the credit for Crow's album Tuesday Night Music Club. While Crow has publicly taken credit for much of the album, most notably on The Late Show with David Letterman, members of The Tuesday Night Music Club have disputed this. David Baerwald, a member of TNMC, stated that, ``Everybody was equal, except Sheryl. She wasn't one of us. We helped her make a record.\"[1] Crow later acrimoniously split with most of the musicians in the collective and only Bottrell was involved in her follow-up album. Gilbert wrote a number of memorably excoriating songs such as Leaving Miss Broadway with lines such as And I know that you believe each new invention of the truth and I saw you on my TV taking credit for my work / And I knew if I said anything that I would be the jerk / There's always some ex-boyfriend, some jealous has-been clown / Trying to muscle in the spotlight, trying to keep the lady down.\n\nGilbert also struck back at Crow by re-recording their song Strong Enough under the name Keta Men as a fey, Village People-like disco anthem that was featured on the Dance Across the Universe collection on Universal Records.\n\nThis creative period resulted in her debut album, called Tuesday Night Music Club. She appeared in the New Faces section of Rolling Stone the summer of 1993. The album featured many of the songs written by Crow and her friends, including the first single, Leaving Las Vegas. The album was slow to garner attention until All I Wanna Do became an unexpected smash radio hit in the spring of 1994. As she later stated in People Magazine, she found an old poetry book in a used book store in the L.A. area and used a poem as lyrics in the song. To her and Bottrell's credit, they tracked down the author (Wyn Cooper) and according to People magazine, he ended up being paid over $50,000 in royalties. The singles Run, Baby, Run and Strong Enough were also released. Crow received several Grammy awards in 1994: Best Female Pop Vocal Performance for All I Wanna Do; Record of the Year for All I Wanna Do; and Best New Artist. The album, which sold 7 million copies, was controversial in that there were disputes among the other Tuesday Night Music Club members about not being fairly credited for their contributions.\n\nIn 1996 Crow released her self-titled second album, which earned her the cover of Rolling Stone. The album was darker and grittier and far more political, with songs about abortion (Hard to Make A Stand), homelessness and nuclear war. The debut single If It Makes You Happy became a radio hit, and netted her two Grammy awards for Best Female Pop Vocal Performance and Best Rock Album. Other singles included A Change Would Do You Good, Home and Everyday is a Winding Road. She produced the album herself to quiet critics that had accused her of being a no-talent self promoter on her first album. This album was banned at Wal-Mart because Crow was critical of their policy of selling guns to minors in the track Love Is A Good Thing.\n\nIn 1997 Crow contributed the theme song to the James Bond film Tomorrow Never Dies. The song of the same title was nominated for a Grammy Award for Best Song Written Specifically For a Motion Picture or Television.\n\nIn 1998 Crow released a third album, called The Globe Sessions. She discussed in press interviews having gone through a deep depression, and had a highly publicized relationship with music legend Eric Clapton. The debut single from this album, My Favorite Mistake, was rumored to be about him, though Crow claims otherwise. The album won Best Rock Album at the 1998 Grammy Awards; it was re-released in 1999, with a bonus track, Crow's cover of the Guns N' Roses song Sweet Child O' Mine, which was included on the soundtrack of the film Big Daddy. This song won the 1999 Grammy for Best Female Rock Vocal Performance. Other singles included \"There Goes the Neighborhood\", \"Anything But Down\" and \"The Difficult Kind\". \"There Goes the Neighborhood\" won a Grammy for Best Female Rock Vocal Performance in 2000 when it was included in her album, \"Sheryl Crow and Friends: Live from Central Park.\"\n\nIn 1999, Crow also made her acting debut as ill-fated drifter Laurie Bloom in the suspense/drama The Minus Man, which starred her then-boyfriend Owen Wilson as a serial killer.\n\nShe also released a live album called Sheryl Crow and Friends: Live From Central Park. The record found Crow singing many of her hit singles with new musical spins and guest appearances by many other musicians including Stevie Nicks, the Dixie Chicks, and Eric Clapton.\n\nIn 2002, after a break and some touring, Crow released C'mon, C'mon. Musically unlike any of her other records, the project had a more pop feel. Videos and promotional photos also found Crow more scantily clad than ever before, in bikinis and hot pants. Crow stated she was making a statement that women over 40 were still sexy. Whether a statement or a marketing tool, C'mon, C'mon spawned hits in \"Soak Up the Sun\" and 2002 Best Female Rock Performance Grammy winner \"Steve McQueen\". Crow also performed the song \"Safe & Sound\" from this album at a television benefit for the victims of September 11th, 2001 terrorist attacks and at the MTV Video Music Awards. 2002 also found Crow collaborating with Stevie Nicks, and releasing a successful single called \"Picture\" with rumored boyfriend Kid Rock that peaked at #4 on the Billboard Hot 100. Later Crow said they were good friends.\n\nCrow opposed the 2003 invasion of Iraq, wearing a shirt that read \"I don't believe in your war, Mr. Bush!\" during a performance on Good Morning America and posting an open letter explaining her opposition on her website. Her public stance attracted so many supporters of the war to her website that the message board was closed for a number of days.\n\nIn 2003, Crow released a greatest hits compilation called The Very Best of Sheryl Crow. It featured many of her hit singles, as well as some new tracks. Among them was the ballad \"The First Cut is the Deepest\" (a song originally composed and performed by Cat Stevens), which became her biggest radio hit since her first, \"All I Wanna Do,\" which hit #2 in 1994. The single \"Light In Your Eyes\" was also released, but received limited airplay.\n\n2004 saw Crow appear as a musical theater performer in the Cole Porter biopic De-Lovely. Her performance within the film of the Porter classic \"Begin the Beguine\" was critically panned by film reviewers.\n\nCrow met cycling great Lance Armstrong at a cycling event in October of 2003. They began dating shortly thereafter and announced their engagement in September of 2005. Nearly five months later, however, they announced their surprise break-up in a joint statement issued on February 3, 2006: \"After much thought and consideration we have made a very tough decision to break up. We both have a deep love and respect for each other and we ask that everyone respect our privacy during this very difficult time.\" Previously, Crow denied a break-up, stating that \"when we were rumored to have split, and when our publicists called these magazines to say we haven't split, the magazines were all so disappointed because that's really what's selling, rooting for a couple and then they split. That's what sells the magazines.\"\n\nHer album Wildflower, which had a more slow paced feel than her previous albums, was released in September 2005. Although the album debuted at #2, it received mixed reviews and was not as commercially successful as hoped. In December 2005 the album was nominated for a Best Pop Vocal Album Grammy Award, while Sheryl Crow was nominated for a Best Female Pop Vocal Performance Grammy Award for the first single \"Good Is Good.\" The album got a new boost of life in 2006 when the second single was announced as \"Always on Your Side\", re-recorded with British musician Sting and sent off to radio, where it was quickly embraced at Adult Top 40.\n\nCrow was diagnosed with early-stage breast cancer in late February 2006. Her doctors have stated that \"prognosis for a full recovery is excellent.\" [2]\n\nCrow's first concert since her cancer diagnosis was on May 18 in Orlando, Florida where she played to over 10,000 Information Technology professionals at the SAP Sapphire Convention. Her first public appearance was on June 12, when she performed at the Murat Theater in Indianapolis, Indiana.\n\nCrow was a main stage act at Lilith Fair and has contributed many songs to movie soundtracks and special projects that were never made available elsewhere, among them: \"D'yer Maker\" (Encomium: Led Zeppelin Tribute), \"La Ci Darem la Mano\" from Don Giovanni (Pavarotti & Friends For War Child), and \"Resuscitation\" (The Faculty). In 2006, Crow contributed the opening track to the soundtrack for Disney/Pixar's animated film Cars, \"Real Gone\".\n\nOfficial site:\nwww.sherylcrow.com <a href=\"https://www.last.fm/music/Sheryl+Crow\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T14:36:42.347360",
  "discogs_id": "119840",
  "discogs_url": "https://www.discogs.com/artist/119840",
  "followers": 1299965,
  "formed_date": null,
  "genres": [
    "Pop",
    "female vocalists",
    "rock",
    "pop",
    "singer-songwriter",
    "alternative"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages126/v4/98/a4/aa/98a4aa91-dc52-7041-12bb-9055f59edd29/5d74604a-0452-4774-b795-6c1c0935694c_ami-identity-b5c990246627746d659a7b058c612858-2023-11-02T20-20-48.538Z_cropped.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb962c94da847bcc4ef21c4ad9",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174962c94da847bcc4ef21c4ad9",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178962c94da847bcc4ef21c4ad9",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "80ccfede-c258-4575-a7ad-c982e9932e0f",
  "lastfm_url": "https://www.last.fm/music/Sheryl+Crow",
  "local_images": {
    "hi-res": "public/artist/sheryl-crow/sheryl-crow-hi-res.jpg",
    "medium": "public/artist/sheryl-crow/sheryl-crow-medium.jpg",
    "small": "public/artist/sheryl-crow/sheryl-crow-small.jpg"
  },
  "name": "Sheryl Crow",
  "popularity": 71,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages126/v4/98/a4/aa/98a4aa91-dc52-7041-12bb-9055f59edd29/5d74604a-0452-4774-b795-6c1c0935694c_ami-identity-b5c990246627746d659a7b058c612858-2023-11-02T20-20-48.538Z_cropped.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Pop"
      ],
      "id": "58757",
      "name": "Sheryl Crow",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/sheryl-crow/58757"
    },
    "discogs": {
      "id": 119840,
      "original_name": "Sheryl Crow",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Sheryl Suzanne Crow (born February 11, 1962) is an American blues rock singer, guitarist, bassist, pianist and songwriter. Her music blends country, pop, folk, and blues rock into one mainstream sound, and she has won nine Grammy Awards. Crow is also a noted political activist.\n\nCrow was born in Kennett, Missouri. Her parents were members of a local big band in which her father, an attorney, played trumpet. The family was very musical and owned three pianos.\n\nIn school, she was active in choir, athletics, and school plays. Even at a young age she was a perfectionist who strived to please her parents. In high school she was a drum majorette, member of the Pep Club, the National Honor Society, Future Farmers of America, Freshman Maid, Senior Maid and Paperdoll Queen. When her prom date was later questioned about her fame he said that at the time he thought she \"would be a doctor's wife someday\". She graduated in 1984 from the University of Missouri where she majored in music education with a concentration in piano. Coincidentally, actor Brad Pitt and ABC-TV news anchor Elizabeth Vargas were also students at the University of Missouri at the same time Crow was studying there; however, it is unknown whether or not any of these three future celebrities actually knew each other while they were students.\n\nFollowing college she became an elementary school music teacher in a suburb of St. Louis where she could be located closer to her fiance. Teaching during the day allowed her the opportunity to sing in bands on the weekends. Many people who knew her socially then, describe her as a nice, kind, elementary school teacher whose goal was settling down to raise children. At times, they acknowledge, she also struggled to get by on a teacher's salary. Other than comments about wanting to go to California someday and \"make it\", and her weekend band gigs, few during this period of her life saw the relentless determination that would someday carry her to multi-millionaire rock stardom. Or if they saw it, they didn't realize they were witnessing a future rock star in training. This time in her life, in retrospect, might accurately be considered by those who knew her then as her \"wilderness years.\"\n\nAfter a couple years of teaching and healing from a broken engagement, she was introduced to a local musician/producer. He had a thriving studio in the basement of his parent's home and helped her by using her in advertising jingles. Her first jingle was a back-to-school spot for the St. Louis department store Famous-Barr. McDonald's and Toyota commercial jingles soon followed. She was recently quoted in her 60 Minutes segment as saying she made $50,000 on her McDonald's commercial alone. This success spurred her into thinking what she could possibly do if she went into music full time.\n\nMotivated by her new-found success, Crow decided to move to Los Angeles in 1986. Using her demo jingle tapes from St. Louis and perservering through constant rejections, she eventually found work as a backup vocalist for many major label acts. She was recruited to perform as a backup singer for Michael Jackson on his Bad tour. Whether she actually crashed the audition, as widely reported at the time, is uncertain. She spent the next 17 months touring the world singing back up and a duet, \"I Just Can't Stop Loving You\" on stage with Jackson. After the tour ended in 1989, she sang back up for Don Henley and in the following year made her first appearance on Saturday Night Live singing back up (\"time, time, take it, take it away\") for Henley. Later she credited Henley for helping her write better songs.\n\nIn 1989, she played keyboards in the touring version of Toy Matinee, which was led by her boyfriend at the time, Kevin Gilbert.\n\nBy 1990, Crow had attracted the attention of A&M Records, eventually leading to her debut album which remains unreleased but widely bootlegged to this day. However, she did not like the slick and well-produced pop sound of the record and implored the label to allow her to start anew. What followed was months of depression that was mentioned years later in People magazine where she stated she felt her career was over. She eventually teamed up professionally with producer Bill Bottrell.\n\nCrow became acquainted with a song writing collective known as \"The Tuesday Night Music Club\" through Bottrell, a member of the club; and dated another member, Kevin Gilbert. There has been much controversy surrounding the credit for Crow's album Tuesday Night Music Club. While Crow has publicly taken credit for much of the album, most notably on The Late Show with David Letterman, members of The Tuesday Night Music Club have disputed this. David Baerwald, a member of TNMC, stated that, ``Everybody was equal, except Sheryl. She wasn't one of us. We helped her make a record.\"[1] Crow later acrimoniously split with most of the musicians in the collective and only Bottrell was involved in her follow-up album. Gilbert wrote a number of memorably excoriating songs such as Leaving Miss Broadway with lines such as And I know that you believe each new invention of the truth and I saw you on my TV taking credit for my work / And I knew if I said anything that I would be the jerk / There's always some ex-boyfriend, some jealous has-been clown / Trying to muscle in the spotlight, trying to keep the lady down.\n\nGilbert also struck back at Crow by re-recording their song Strong Enough under the name Keta Men as a fey, Village People-like disco anthem that was featured on the Dance Across the Universe collection on Universal Records.\n\nThis creative period resulted in her debut album, called Tuesday Night Music Club. She appeared in the New Faces section of Rolling Stone the summer of 1993. The album featured many of the songs written by Crow and her friends, including the first single, Leaving Las Vegas. The album was slow to garner attention until All I Wanna Do became an unexpected smash radio hit in the spring of 1994. As she later stated in People Magazine, she found an old poetry book in a used book store in the L.A. area and used a poem as lyrics in the song. To her and Bottrell's credit, they tracked down the author (Wyn Cooper) and according to People magazine, he ended up being paid over $50,000 in royalties. The singles Run, Baby, Run and Strong Enough were also released. Crow received several Grammy awards in 1994: Best Female Pop Vocal Performance for All I Wanna Do; Record of the Year for All I Wanna Do; and Best New Artist. The album, which sold 7 million copies, was controversial in that there were disputes among the other Tuesday Night Music Club members about not being fairly credited for their contributions.\n\nIn 1996 Crow released her self-titled second album, which earned her the cover of Rolling Stone. The album was darker and grittier and far more political, with songs about abortion (Hard to Make A Stand), homelessness and nuclear war. The debut single If It Makes You Happy became a radio hit, and netted her two Grammy awards for Best Female Pop Vocal Performance and Best Rock Album. Other singles included A Change Would Do You Good, Home and Everyday is a Winding Road. She produced the album herself to quiet critics that had accused her of being a no-talent self promoter on her first album. This album was banned at Wal-Mart because Crow was critical of their policy of selling guns to minors in the track Love Is A Good Thing.\n\nIn 1997 Crow contributed the theme song to the James Bond film Tomorrow Never Dies. The song of the same title was nominated for a Grammy Award for Best Song Written Specifically For a Motion Picture or Television.\n\nIn 1998 Crow released a third album, called The Globe Sessions. She discussed in press interviews having gone through a deep depression, and had a highly publicized relationship with music legend Eric Clapton. The debut single from this album, My Favorite Mistake, was rumored to be about him, though Crow claims otherwise. The album won Best Rock Album at the 1998 Grammy Awards; it was re-released in 1999, with a bonus track, Crow's cover of the Guns N' Roses song Sweet Child O' Mine, which was included on the soundtrack of the film Big Daddy. This song won the 1999 Grammy for Best Female Rock Vocal Performance. Other singles included \"There Goes the Neighborhood\", \"Anything But Down\" and \"The Difficult Kind\". \"There Goes the Neighborhood\" won a Grammy for Best Female Rock Vocal Performance in 2000 when it was included in her album, \"Sheryl Crow and Friends: Live from Central Park.\"\n\nIn 1999, Crow also made her acting debut as ill-fated drifter Laurie Bloom in the suspense/drama The Minus Man, which starred her then-boyfriend Owen Wilson as a serial killer.\n\nShe also released a live album called Sheryl Crow and Friends: Live From Central Park. The record found Crow singing many of her hit singles with new musical spins and guest appearances by many other musicians including Stevie Nicks, the Dixie Chicks, and Eric Clapton.\n\nIn 2002, after a break and some touring, Crow released C'mon, C'mon. Musically unlike any of her other records, the project had a more pop feel. Videos and promotional photos also found Crow more scantily clad than ever before, in bikinis and hot pants. Crow stated she was making a statement that women over 40 were still sexy. Whether a statement or a marketing tool, C'mon, C'mon spawned hits in \"Soak Up the Sun\" and 2002 Best Female Rock Performance Grammy winner \"Steve McQueen\". Crow also performed the song \"Safe & Sound\" from this album at a television benefit for the victims of September 11th, 2001 terrorist attacks and at the MTV Video Music Awards. 2002 also found Crow collaborating with Stevie Nicks, and releasing a successful single called \"Picture\" with rumored boyfriend Kid Rock that peaked at #4 on the Billboard Hot 100. Later Crow said they were good friends.\n\nCrow opposed the 2003 invasion of Iraq, wearing a shirt that read \"I don't believe in your war, Mr. Bush!\" during a performance on Good Morning America and posting an open letter explaining her opposition on her website. Her public stance attracted so many supporters of the war to her website that the message board was closed for a number of days.\n\nIn 2003, Crow released a greatest hits compilation called The Very Best of Sheryl Crow. It featured many of her hit singles, as well as some new tracks. Among them was the ballad \"The First Cut is the Deepest\" (a song originally composed and performed by Cat Stevens), which became her biggest radio hit since her first, \"All I Wanna Do,\" which hit #2 in 1994. The single \"Light In Your Eyes\" was also released, but received limited airplay.\n\n2004 saw Crow appear as a musical theater performer in the Cole Porter biopic De-Lovely. Her performance within the film of the Porter classic \"Begin the Beguine\" was critically panned by film reviewers.\n\nCrow met cycling great Lance Armstrong at a cycling event in October of 2003. They began dating shortly thereafter and announced their engagement in September of 2005. Nearly five months later, however, they announced their surprise break-up in a joint statement issued on February 3, 2006: \"After much thought and consideration we have made a very tough decision to break up. We both have a deep love and respect for each other and we ask that everyone respect our privacy during this very difficult time.\" Previously, Crow denied a break-up, stating that \"when we were rumored to have split, and when our publicists called these magazines to say we haven't split, the magazines were all so disappointed because that's really what's selling, rooting for a couple and then they split. That's what sells the magazines.\"\n\nHer album Wildflower, which had a more slow paced feel than her previous albums, was released in September 2005. Although the album debuted at #2, it received mixed reviews and was not as commercially successful as hoped. In December 2005 the album was nominated for a Best Pop Vocal Album Grammy Award, while Sheryl Crow was nominated for a Best Female Pop Vocal Performance Grammy Award for the first single \"Good Is Good.\" The album got a new boost of life in 2006 when the second single was announced as \"Always on Your Side\", re-recorded with British musician Sting and sent off to radio, where it was quickly embraced at Adult Top 40.\n\nCrow was diagnosed with early-stage breast cancer in late February 2006. Her doctors have stated that \"prognosis for a full recovery is excellent.\" [2]\n\nCrow's first concert since her cancer diagnosis was on May 18 in Orlando, Florida where she played to over 10,000 Information Technology professionals at the SAP Sapphire Convention. Her first public appearance was on June 12, when she performed at the Murat Theater in Indianapolis, Indiana.\n\nCrow was a main stage act at Lilith Fair and has contributed many songs to movie soundtracks and special projects that were never made available elsewhere, among them: \"D'yer Maker\" (Encomium: Led Zeppelin Tribute), \"La Ci Darem la Mano\" from Don Giovanni (Pavarotti & Friends For War Child), and \"Resuscitation\" (The Faculty). In 2006, Crow contributed the opening track to the soundtrack for Disney/Pixar's animated film Cars, \"Real Gone\".\n\nOfficial site:\nwww.sherylcrow.com <a href=\"https://www.last.fm/music/Sheryl+Crow\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Sheryl Suzanne Crow (born February 11, 1962) is an American blues rock singer, guitarist, bassist, pianist and songwriter. Her music blends country, pop, folk, and blues rock into one mainstream sound, and she has won nine Grammy Awards. Crow is also a noted political activist.\n\nCrow was born in Kennett, Missouri. Her parents were members of a local big band in which her father, an attorney, played trumpet. The family was very musical and owned three pianos. <a href=\"https://www.last.fm/music/Sheryl+Crow\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 1754057,
      "mbid": "80ccfede-c258-4575-a7ad-c982e9932e0f",
      "name": "Sheryl Crow",
      "playcount": 22690474,
      "similar_artists": [
        {
          "name": "Alanis Morissette",
          "url": "https://www.last.fm/music/Alanis+Morissette"
        },
        {
          "name": "Jewel",
          "url": "https://www.last.fm/music/Jewel"
        },
        {
          "name": "Sarah McLachlan",
          "url": "https://www.last.fm/music/Sarah+McLachlan"
        },
        {
          "name": "Shawn Colvin",
          "url": "https://www.last.fm/music/Shawn+Colvin"
        },
        {
          "name": "Natalie Imbruglia",
          "url": "https://www.last.fm/music/Natalie+Imbruglia"
        }
      ],
      "tags": [
        "female vocalists",
        "rock",
        "pop",
        "singer-songwriter",
        "alternative"
      ],
      "url": "https://www.last.fm/music/Sheryl+Crow"
    },
    "spotify": {
      "followers": 1299965,
      "genres": [],
      "id": "4TKTii6gnOnUXQHyuo9JaD",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb962c94da847bcc4ef21c4ad9",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174962c94da847bcc4ef21c4ad9",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178962c94da847bcc4ef21c4ad9",
          "width": 160
        }
      ],
      "name": "Sheryl Crow",
      "popularity": 71,
      "url": "https://open.spotify.com/artist/4TKTii6gnOnUXQHyuo9JaD"
    }
  },
  "spotify_id": "4TKTii6gnOnUXQHyuo9JaD",
  "spotify_url": "https://open.spotify.com/artist/4TKTii6gnOnUXQHyuo9JaD",
  "updated_at": "2025-07-05T14:36:43.192674",
  "wikipedia_url": null
}