{
  "apple_music_id": "614113",
  "apple_music_url": "https://music.apple.com/gb/artist/scritti-politti/614113",
  "biography": "Initially a left-wing-inspired post-punk British rock group, Scritti Politti developed into a more mainstream pop music project in the early to mid-1980s, enjoying significant success in the record charts in the UK and the US. The group's most successful album, 1985's Cupid & Psyche 85, spawned three UK Top 20 hits with \"Wood Beez (Pray Like Aretha Franklin)\", \"Absolute\", and \"The Word Girl\", as well as a US Top 20 hit with \"Perfect Way\".\nThe band's 1988 album Provision was a UK Top 10 success, though it only produced one UK Top 20 hit single (\"Oh Patti\"). After releasing a couple of non-album singles in 1991, as well as a collaboration with B.E.F., Gartside became disillusioned with the music industry and retired to south Wales for more than seven years. He returned to music-making in the late 1990s, releasing two albums, 1999's Anomie & Bonhomie (which included various rap and hip hop influences) and 2006's stripped-down White Bread, Black Beer which returned to the more experimental era of the band's history.\nScritti Politti's music was characterised by sophisticated studio production, Gartside's sly, punning wordplay and the tension between the polished pop-funk stylings of their music and the subtle radicalism of the political and social messages embedded in their lyrics.\nIn the mid-1970s, Green Gartside was studying fine art at Leeds College of Art and Design (now Leeds College of Art). The Sex Pistols 'Anarchy' tour which included The Damned and The Heartbreakers was launched at Leeds Polytechnic on 6 December 1976, and inspired Gartside to form a band with his childhood friend Nial Jinks, and fellow student Tom Morley.\nScritti Politti originally consisted of Gartside as the lead vocalist, Jinks as bass player, Morley as drummer, and Matthew Kay as the manager who sometimes played the keyboard. Gartside and Jinks had gone to school together in south Wales, and Gartside met Morley at Leeds Polytechnic. For their first public performance in 1976, supporting local Leeds punk group SOS, the group went under the name 'The Against'.\n\nUpon finishing their studies the group relocated to London's Camden Town around 1977, where they lived in a squat. The name Scritti Politti was chosen as a homage to the Italian Marxist writer and political theorist Antonio Gramsci. The correct spelling in Italian to refer to \"Political Writings\" would have produced \"Scritti Politici\". Gartside changed it to \"Scritti Politti\" as he thought it sounded more rock and roll, like the Little Richard song Tutti Frutti.\nAlongside other groups of what has been termed the DIY ethic or movement (notably the Desperate Bicycles and Steve Treatment, the latter being associated with the Swell Maps), Scritti Politti released a DIY record titled \"Skank Bloc Bologna\" on their own St. Pancras label in 1978. To the raw energy of punk, Scritti Politti added a creative spontaneity and a mock-philosophical intelligence in their lyrics, with scholarly allusions to Marx, Bakunin, Derrida, Deleuze, and Lacan. In early tracks, the punk-like fracturing of language and spikiness of the sound were held together by more lyrical melody than the more austere music of other left-field groups from the post-punk scene, such as Gang of Four, London art-rockers This Heat or the Bristol based The Pop Group.\n\"Skank Bloc Bologna\" picked up airplay on John Peel's BBC Radio 1 show, and the band were signed to Rough Trade under Geoff Travis in 1979, making them labelmates with the other Cardiff avant-garde band, Young Marble Giants.Scritti Politti released two EPs in 1979 with singles \"Bibbly-O-Tek\", \"Doubt Beat\", \"OPEC/Immac\" and \"Hegemony\".\n\"Hegemony\" – which Gartside eventually cited as being based on the old English folksong 'Lemady' – led to more melodic songs such as \"Confidence\", which in turn hinted at the direction the band would take in the 1980s. Gartside then slimmed the band down to a three piece.\nBy the time of \"4 A-sides\", (Doubt Beat; Confidence; Bibbly-o-tek; PAs) a blend of strong melody and rhythmic jaggedness had been achieved. The band exhibited an explicit do-it-yourself attitude, which manifested itself in their hand-made record sleeves with detailed breakdowns of production costs, including addresses and phone numbers of record pressing plants, and even their own Camden squat address for feedback.\nWhilst on a UK tour with Gang of Four and Joy Division, Gartside was overcome by the pressures of stage fright and anxiety, leading to what was originally thought to be his first heart attack, but what was really a panic attack at the age of 23. To recover from ill health, he retreated to his native Wales and began writing an album that was to be heavily influenced by the R&B and New York City sound he was listening to.\nGartside recorded a demo of one of his new songs, \"The 'Sweetest Girl'\", in January 1981, and the song was included on the C81 cassette compilation obtained with tokens from the March issues of NME. The song – which features Robert Wyatt on keyboards – received strong reviews. It was cited by The New York Times as one of the ten best singles of the year, but the track did not get a wide release for ten months, by which time momentum was lost, and it only achieved a minor placing in the UK Singles Chart at No. 64. The single was later covered by pop band Madness, with their version reaching No. 35 in the UK singles chart in 1986. Drummer Tom Morley departed Scritti Politti in November 1981.\nThe 'Sweetest Girl' prompted many major labels to offer Gartside record contracts, but he decided to stay with Rough Trade Records. The 'Sweetest Girl' marked a stylistic change toward the more melodic, and was followed by minor hits \"Faithless\" (UK No. 56) and double A-side \"Asylums in Jerusalem\" / \"Jacques Derrida\" (UK No. 43). In a retrospective review, \"Asylums in Jerusalem\" was described by Allmusic journalist Stewart Mason as \"a slick piece of reggae-tinged synth-pop with a twangy electronic bass line and a new playfulness in Green Gartside's politically motivated lyrics.\" The song Jacques Derrida was influenced by Gartside's reading of deconstruction and the work of semiotic analysis from the French philosopher Derrida.\n\nThe debut album, Songs to Remember, was released on Rough Trade in August 1982. Displaying Gartside's previously hidden reggae influence, it was a critical and commercial success, reaching No. 12 in the UK Albums Chart. One of Rough Trade's most unlikely success stories, the album became their biggest selling release to date. Also during this period, Gartside recorded a duet with Annie Lennox on the Eurythmics track \"Wrap It Up\", for their Sweet Dreams (Are Made of This) album released in early 1983.\nGartside became influenced by the new sounds coming out of New York City, especially hip hop. He signed with Virgin Records in 1983 (and with Warner Bros. in the US.) The original line-up was disbanded and Gartside moved to New York.\nCollaborating with veteran producer Arif Mardin, David Gamson and Fred Maher, the first recording to emerge from these sessions was the single: \"Wood Beez (Pray Like Aretha Franklin)\". Released in April 1984, \"Wood Beez\" was an immediate UK hit, peaking at No. 10, and was also successful in Australia, charting at No. 25, and in New-Zealand where it reached No. 26. A series of intricately programmed dance/soul-style hits followed, including \"Absolute\" (UK No. 17), \"Hypnotize\" (UK No. 68 and No. 43 on the US Dance Charts) and the reggae-styled \"The Word Girl\", which became Scritti Politti's biggest UK hit single, climbing to No. 6 in May 1985.\nIn June 1985, Scritti Politti released their second (and most successful) album, Cupid & Psyche 85, with songs produced by Arif Mardin and performances by numerous session musicians. The LP was a Top 5 hit in the UK and also sold well in the US. In addition to the four already released singles, the album included the song, \"Perfect Way\". It was only a minor hit when released in the UK (No. 48) but it became the band's biggest US single, peaking at No. 11.\nThe personnel for the Cupid and Psyche '85 album differed from that of their first album, and featured keyboardist David Gamson and ex-Material drummer Fred Maher, both of whom would collaborate with Gartside on songwriting and production duties. Arif Mardin would also produce three songs for the album. Stylistically, the songs on the album feature dense timbral counterpoint (in fact, nearly every song on the album), using synthesizer chords and effects (as well as \"real\" instruments), programmed largely by David Gamson, creating a style that they would refine in their next album. In the US, \"Wood Beez\" was re-released as the follow-up single to \"Perfect Way\", but it only managed to hit No. 91 (it had previously hit No. 4 on the US Dance Charts in late 1984).\n\nIn 1986, Gartside and Gamson wrote and produced \"Love of a Lifetime\" for Chaka Khan, which appeared on her Destiny album. The same year they also collaborated to write the title track for Al Jarreau's album, L is For Lover.\nIn 1987, Scritti Politti appeared on the Who's That Girl soundtrack with the song \"Best Thing Ever\". This track also appeared on the next Scritti Politti album, 1988's Provision, which continued Gartside's development into synth-funk as well as reggae and other styles. The roster of session players became even more notable, including contributions from Roger Troutman, Marcus Miller and Miles Davis, who performed on the single \"Oh Patti (Don't Feel Sorry For Loverboy)\", a UK No. 13 hit. However, although the album charted in the Top 10 in the UK (No. 8), it did not match the commercial success of Cupid and Psyche '85 in the US, stalling at No. 113.They hit the UK charts again in 1991 with their cover of The Beatles' song, \"She's a Woman\", which featured guest vocals from Shabba Ranks and a remix version by William Orbit. It became Scritti Politti's final UK Top 20 single, peaking at No. 20. This was swiftly followed by the release of \"Take Me in Your Arms And Love Me\"', a cover of the Gladys Knight song, featuring guest vocals from Sweetie Irie, which failed to chart inside the Top 40. A corresponding album never materialised, with Gartside deciding on another hiatus.\nThe hip hop inspired album Anomie and Bonhomie was released in 1999, and involved even more session artists. The now bearded Gartside dived directly into the now commercially accessible hip hop scene, borrowing tradesmen of the genre such as Mos Def and Jimahl amongst others. While considered by many critics to be a return to form, the album was not as commercially successful as their previous output, reaching only No. 33 on the UK Albums Chart.In 2003, Gartside appeared on Kylie Minogue's album Body Language, duetting on the Emiliana Torrini co-write \"Someday\".\n\nIn February 2005, Rough Trade released Early, a compilation album of Scritti Politti's earliest recordings.\nIn early January 2006, Gartside and a new incarnation of Scritti Politti, billed as 'Double G and The Traitorous 3', played a show in Brixton. This was Gartside's first live appearance since 1980. This band, including journalist/musician Rhodri Marsden on keyboards and Dicky Moore on guitar, played a number of concerts previewing a new album, White Bread, Black Beer, which was released on Rough Trade on 29 May 2006. Later that year, White Bread, Black Beer was nominated for the Mercury Music Prize, and gained critical praise.\nThe current line-up toured worldwide (under the Scritti Politti name) on the back of the album's success, and completed a UK tour in November 2006. They appeared at the Bestival music festival in September 2006, and at Summer Sonic Festival in Japan. On 19 December, they played a short set at the Rough Trade Christmas party in London.\n\nIn 2007, Gartside worked on an album with Alexis Taylor, the singer with Hot Chip. The pair met at the Mercury Music Prize ceremony, and played a concert supporting Kieran Hebden and Steve Reid at KOKO in London in March 2007.\n\nGartside joined 'Way to Blue: The Songs of Nick Drake', a 2008 UK and Australian tour featuring interpretations of Nick Drake's songs by amongst others, Robyn Hitchcock, Lisa Hannigan and Teddy Thompson. A subsequent live 15-track CD was released, including Gartside's version of Drake's \"Fruit Tree\".\n\nIn 2009, Gartside participated in 'Very Cellular Songs', a concert at The Barbican celebrating the music of The Incredible String Band, featuring Richard Thompson, Kamila Thompson, Alasdair Roberts, and Dr. Strangely Strange.\n\nOn 28 February 2011, Absolute, a compilation of singles and album tracks was released, with two new tracks both written with David Gamson: \"Day Late and a Dollar Short\" and \"A Place We Both Belong\". Gamson played a part in the recording of both Cupid & Psyche 85 and Provision.",
  "country": null,
  "created_at": "2025-07-05T17:16:03.147958",
  "discogs_id": "24167",
  "discogs_url": "https://www.discogs.com/artist/24167-Scritti-Politti",
  "followers": 107216,
  "formed_date": null,
  "genres": [
    "Pop",
    "synthpop",
    "new wave",
    "80s",
    "post-punk",
    "pop",
    "Sophisti-Pop",
    "New Wave",
    "Rock/Pop"
  ],
  "id": "scritti-politti-1751732165",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/f5/6e/4f/f56e4f47-9ffe-af39-c8b2-80d67260b6f6/mzl.qyuqounz.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb737ffb7d167c72f925108800",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174737ffb7d167c72f925108800",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178737ffb7d167c72f925108800",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/scritti-politti-53218752dc088.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://www.theaudiodb.com/images/media/Artist/fanart/0o7bo31741271438.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://www.theaudiodb.com/images/media/Artist/fanart/aznd2x1741271458.jpg",
      "width": 1920
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/bwjdi41687947466.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/pvLanT-SK1bE4zDkpzvRQMDKKWj-sQb9UfMHUxw6hSY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "a2588b38-6532-4186-b0c8-9aff306d56f5",
  "lastfm_url": "https://www.last.fm/music/Scritti+Politti",
  "local_images": {
    "hi-res": "../public/artist/scritti-politti/scritti-politti-hi-res.jpg",
    "medium": "../public/artist/scritti-politti/scritti-politti-medium.jpg",
    "small": "../public/artist/scritti-politti/scritti-politti-small.jpg"
  },
  "name": "Scritti Politti",
  "popularity": 38,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='614113', url='https://music.apple.com/gb/artist/scritti-politti/614113', name='Scritti Politti', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/f5/6e/4f/f56e4f47-9ffe-af39-c8b2-80d67260b6f6/mzl.qyuqounz.jpg/2000x2000bb.jpg', genres=['Pop'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '614113', 'type': 'artists', 'href': '/v1/catalog/gb/artists/614113', 'attributes': {'name': 'Scritti Politti', 'genreNames': ['Pop'], 'artwork': {'width': 2400, 'height': 2400, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/f5/6e/4f/f56e4f47-9ffe-af39-c8b2-80d67260b6f6/mzl.qyuqounz.jpg/{w}x{h}bb.jpg', 'bgColor': 'dbad72', 'textColor1': '12090d', 'textColor2': '2d1b17', 'textColor3': '3a2921', 'textColor4': '4f3829'}, 'url': 'https://music.apple.com/gb/artist/scritti-politti/614113'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/614113/albums', 'data': [{'id': '1139092963', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1139092963'}, {'id': '1696517815', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1696517815'}, {'id': '1139088821', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1139088821'}, {'id': '259982465', 'type': 'albums', 'href': '/v1/catalog/gb/albums/259982465'}, {'id': '1613812541', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1613812541'}, {'id': '1139089204', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1139089204'}, {'id': '269381425', 'type': 'albums', 'href': '/v1/catalog/gb/albums/269381425'}, {'id': '259880143', 'type': 'albums', 'href': '/v1/catalog/gb/albums/259880143'}, {'id': '260743438', 'type': 'albums', 'href': '/v1/catalog/gb/albums/260743438'}, {'id': '259962281', 'type': 'albums', 'href': '/v1/catalog/gb/albums/259962281'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "24167",
      "images": [
        {
          "height": 462,
          "resource_url": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/pvLanT-SK1bE4zDkpzvRQMDKKWj-sQb9UfMHUxw6hSY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 381,
          "resource_url": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/bTYRhZT4m2NBQ529224Atba2LDs2LJzKOpnzZpfAkV4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
          "width": 567
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
          "uri150": "https://i.discogs.com/QIDUO_kl8G7W-MC-a-EbkHVSErz5RdPclAFMYtgjU7I/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
          "width": 344
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/g0SLIDcncdRZRPwb8BnQtqmENvoLGhfpQ0EmMmkjS2M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 783,
          "resource_url": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/yWzGmTmzHurpz0ixMuWb57WLVTtJmatpOv_StLy2NHg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 1065,
          "resource_url": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/-5vKg_Ioc3L2nbrMeNyQzsuAk5fspWrwguzJ_O_cW9A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 1144,
          "resource_url": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/usTYnPrx45wWGFTknt5jKUo5WK5-ezqSs9rUvc2eqcw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 751,
          "resource_url": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/kWZ-08EO_JmCwfrKhdJfGpkBYgXS28Y6Q_Am-KCatRE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [
        {
          "active": true,
          "id": 25807,
          "name": "Green Gartside",
          "resource_url": "https://api.discogs.com/artists/25807",
          "thumbnail_url": "https://i.discogs.com/zPguFf42hN8Ov9TeWoQDY0Gsko6JZWhDEgKXdjxGnpY/rs:fit/g:sm/q:40/h:598/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1ODA3/LTE2OTg3NzA2MjMt/OTEyMC5wbmc.jpeg"
        },
        {
          "active": false,
          "id": 47970,
          "name": "David Gamson",
          "resource_url": "https://api.discogs.com/artists/47970",
          "thumbnail_url": "https://i.discogs.com/irzB2dpl6ucUjkQuzwGWQyCt0UGGVJp6-ZuGweo6SV8/rs:fit/g:sm/q:40/h:411/w:388/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3OTcw/LTE2NjI1NTg2ODMt/NzM3OC5qcGVn.jpeg"
        },
        {
          "active": false,
          "id": 69826,
          "name": "Fred Maher",
          "resource_url": "https://api.discogs.com/artists/69826",
          "thumbnail_url": "https://i.discogs.com/3UZXvCQfBS_ZW_oOS5yr8HTI93hS-wMrkUbzeKW_2Nw/rs:fit/g:sm/q:40/h:397/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY5ODI2/LTExMDcxNzcyMzUu/anBn.jpeg"
        },
        {
          "active": false,
          "id": 221763,
          "name": "Simon Emmerson",
          "resource_url": "https://api.discogs.com/artists/221763",
          "thumbnail_url": "https://i.discogs.com/MAGOJUaKJ07QeRNYJRjxSBC4YSakSGnmF9_9nkWQi_k/rs:fit/g:sm/q:40/h:376/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIyMTc2/My0xMjg1NTE4MTc4/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 281923,
          "name": "Alan Murphy",
          "resource_url": "https://api.discogs.com/artists/281923",
          "thumbnail_url": "https://i.discogs.com/UrQ4qD9PUONo7abzByAmm_ltnlWL_UTa5-tgHtvi9z0/rs:fit/g:sm/q:40/h:352/w:230/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MTky/My0xMzMyOTYwNDU5/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 375875,
          "name": "Rhodri Marsden",
          "resource_url": "https://api.discogs.com/artists/375875",
          "thumbnail_url": "https://i.discogs.com/9u7vUV3TnUCxy9WqBu2ss7iMqUyupumZ4O3dwkiy_Fw/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3NTg3/NS0xMzA3MzE4NjI4/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 444358,
          "name": "Rob Smoughton",
          "resource_url": "https://api.discogs.com/artists/444358",
          "thumbnail_url": "https://i.discogs.com/9KIYaxAUNURVV267Wv03RR8RSGlSGOHcDqwq-IHy4AQ/rs:fit/g:sm/q:40/h:133/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0NDM1/OC0xNDYxNzU0MzA5/LTMzNzMuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 470550,
          "name": "Niall Jinks",
          "resource_url": "https://api.discogs.com/artists/470550",
          "thumbnail_url": "https://i.discogs.com/S5wwoM4BexBosRM_49t057N346p2V7zpKfTc4mA61Tg/rs:fit/g:sm/q:40/h:397/w:313/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MC0xMjE2NzY0NDQw/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 470551,
          "name": "Tom Morley",
          "resource_url": "https://api.discogs.com/artists/470551",
          "thumbnail_url": "https://i.discogs.com/pmHgbOmqK43TD6_lUI4vAK_A8jzYIC7spyxLGi_yIJU/rs:fit/g:sm/q:40/h:621/w:463/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MS0xNDQxNjE2MzM0/LTY5NTguanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 613132,
          "name": "Joe Cang",
          "resource_url": "https://api.discogs.com/artists/613132",
          "thumbnail_url": "https://i.discogs.com/9Bc4DNzJF_rr_K7UyoaercV7noVoXXyswHPOLQ8oPws/rs:fit/g:sm/q:40/h:797/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYxMzEz/Mi0xMzA4ODMyNzI3/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 806184,
          "name": "Matthew Kay",
          "resource_url": "https://api.discogs.com/artists/806184",
          "thumbnail_url": "https://i.discogs.com/XfXA8xPD9g2Gsf7_2xYLNkmnC_Ljsfu41alk5X4Yuys/rs:fit/g:sm/q:40/h:396/w:311/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgwNjE4/NC0xMjE2NzY0NDgy/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 5392220,
          "name": "Paul Strohmeyer",
          "resource_url": "https://api.discogs.com/artists/5392220",
          "thumbnail_url": "https://i.discogs.com/fzDX9j3dN0diJJ0D5GT34nxRHc7KTV-SCu1hsX9ZvxY/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTUzOTIy/MjAtMTQ5NDU3NjY1/OC04MDE5LmpwZWc.jpeg"
        }
      ],
      "name": "Scritti Politti",
      "namevariations": [
        "Screitti Politti",
        "Scrits",
        "Scritti",
        "Scritti Polit",
        "Scritti Polliti",
        "Scritti Pollitti",
        "Scritty Politty",
        "スクリッティ・ポリッティ"
      ],
      "profile": "British band, originally formed in 1977 in Leeds. Cardiff-born singer-songwriter [a=Green Gartside] was the founding member of the band and the only member to have remained throughout the group's history.",
      "raw_data": {
        "data_quality": "Needs Vote",
        "id": 24167,
        "images": [
          {
            "height": 462,
            "resource_url": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/pvLanT-SK1bE4zDkpzvRQMDKKWj-sQb9UfMHUxw6hSY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 381,
            "resource_url": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/bTYRhZT4m2NBQ529224Atba2LDs2LJzKOpnzZpfAkV4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
            "width": 567
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
            "uri150": "https://i.discogs.com/QIDUO_kl8G7W-MC-a-EbkHVSErz5RdPclAFMYtgjU7I/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
            "width": 344
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/g0SLIDcncdRZRPwb8BnQtqmENvoLGhfpQ0EmMmkjS2M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 783,
            "resource_url": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/yWzGmTmzHurpz0ixMuWb57WLVTtJmatpOv_StLy2NHg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 1065,
            "resource_url": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/-5vKg_Ioc3L2nbrMeNyQzsuAk5fspWrwguzJ_O_cW9A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 1144,
            "resource_url": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/usTYnPrx45wWGFTknt5jKUo5WK5-ezqSs9rUvc2eqcw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 751,
            "resource_url": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/kWZ-08EO_JmCwfrKhdJfGpkBYgXS28Y6Q_Am-KCatRE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
            "width": 600
          }
        ],
        "members": [
          {
            "active": true,
            "id": 25807,
            "name": "Green Gartside",
            "resource_url": "https://api.discogs.com/artists/25807",
            "thumbnail_url": "https://i.discogs.com/zPguFf42hN8Ov9TeWoQDY0Gsko6JZWhDEgKXdjxGnpY/rs:fit/g:sm/q:40/h:598/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1ODA3/LTE2OTg3NzA2MjMt/OTEyMC5wbmc.jpeg"
          },
          {
            "active": false,
            "id": 47970,
            "name": "David Gamson",
            "resource_url": "https://api.discogs.com/artists/47970",
            "thumbnail_url": "https://i.discogs.com/irzB2dpl6ucUjkQuzwGWQyCt0UGGVJp6-ZuGweo6SV8/rs:fit/g:sm/q:40/h:411/w:388/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3OTcw/LTE2NjI1NTg2ODMt/NzM3OC5qcGVn.jpeg"
          },
          {
            "active": false,
            "id": 69826,
            "name": "Fred Maher",
            "resource_url": "https://api.discogs.com/artists/69826",
            "thumbnail_url": "https://i.discogs.com/3UZXvCQfBS_ZW_oOS5yr8HTI93hS-wMrkUbzeKW_2Nw/rs:fit/g:sm/q:40/h:397/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY5ODI2/LTExMDcxNzcyMzUu/anBn.jpeg"
          },
          {
            "active": false,
            "id": 221763,
            "name": "Simon Emmerson",
            "resource_url": "https://api.discogs.com/artists/221763",
            "thumbnail_url": "https://i.discogs.com/MAGOJUaKJ07QeRNYJRjxSBC4YSakSGnmF9_9nkWQi_k/rs:fit/g:sm/q:40/h:376/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIyMTc2/My0xMjg1NTE4MTc4/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 281923,
            "name": "Alan Murphy",
            "resource_url": "https://api.discogs.com/artists/281923",
            "thumbnail_url": "https://i.discogs.com/UrQ4qD9PUONo7abzByAmm_ltnlWL_UTa5-tgHtvi9z0/rs:fit/g:sm/q:40/h:352/w:230/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MTky/My0xMzMyOTYwNDU5/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 375875,
            "name": "Rhodri Marsden",
            "resource_url": "https://api.discogs.com/artists/375875",
            "thumbnail_url": "https://i.discogs.com/9u7vUV3TnUCxy9WqBu2ss7iMqUyupumZ4O3dwkiy_Fw/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3NTg3/NS0xMzA3MzE4NjI4/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 444358,
            "name": "Rob Smoughton",
            "resource_url": "https://api.discogs.com/artists/444358",
            "thumbnail_url": "https://i.discogs.com/9KIYaxAUNURVV267Wv03RR8RSGlSGOHcDqwq-IHy4AQ/rs:fit/g:sm/q:40/h:133/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0NDM1/OC0xNDYxNzU0MzA5/LTMzNzMuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 470550,
            "name": "Niall Jinks",
            "resource_url": "https://api.discogs.com/artists/470550",
            "thumbnail_url": "https://i.discogs.com/S5wwoM4BexBosRM_49t057N346p2V7zpKfTc4mA61Tg/rs:fit/g:sm/q:40/h:397/w:313/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MC0xMjE2NzY0NDQw/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 470551,
            "name": "Tom Morley",
            "resource_url": "https://api.discogs.com/artists/470551",
            "thumbnail_url": "https://i.discogs.com/pmHgbOmqK43TD6_lUI4vAK_A8jzYIC7spyxLGi_yIJU/rs:fit/g:sm/q:40/h:621/w:463/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MS0xNDQxNjE2MzM0/LTY5NTguanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 613132,
            "name": "Joe Cang",
            "resource_url": "https://api.discogs.com/artists/613132",
            "thumbnail_url": "https://i.discogs.com/9Bc4DNzJF_rr_K7UyoaercV7noVoXXyswHPOLQ8oPws/rs:fit/g:sm/q:40/h:797/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYxMzEz/Mi0xMzA4ODMyNzI3/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 806184,
            "name": "Matthew Kay",
            "resource_url": "https://api.discogs.com/artists/806184",
            "thumbnail_url": "https://i.discogs.com/XfXA8xPD9g2Gsf7_2xYLNkmnC_Ljsfu41alk5X4Yuys/rs:fit/g:sm/q:40/h:396/w:311/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgwNjE4/NC0xMjE2NzY0NDgy/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 5392220,
            "name": "Paul Strohmeyer",
            "resource_url": "https://api.discogs.com/artists/5392220",
            "thumbnail_url": "https://i.discogs.com/fzDX9j3dN0diJJ0D5GT34nxRHc7KTV-SCu1hsX9ZvxY/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTUzOTIy/MjAtMTQ5NDU3NjY1/OC04MDE5LmpwZWc.jpeg"
          }
        ],
        "name": "Scritti Politti",
        "namevariations": [
          "Screitti Politti",
          "Scrits",
          "Scritti",
          "Scritti Polit",
          "Scritti Polliti",
          "Scritti Pollitti",
          "Scritty Politty",
          "スクリッティ・ポリッティ"
        ],
        "profile": "British band, originally formed in 1977 in Leeds. Cardiff-born singer-songwriter [a=Green Gartside] was the founding member of the band and the only member to have remained throughout the group's history.",
        "releases_url": "https://api.discogs.com/artists/24167/releases",
        "resource_url": "https://api.discogs.com/artists/24167",
        "uri": "https://www.discogs.com/artist/24167-Scritti-Politti",
        "urls": [
          "https://www.scritti.net/",
          "https://www.facebook.com/scrittinet",
          "https://myspace.com/scrittipolittilife",
          "https://en.wikipedia.org/wiki/Scritti_Politti"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/24167",
      "thumb": "https://i.discogs.com/pvLanT-SK1bE4zDkpzvRQMDKKWj-sQb9UfMHUxw6hSY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/24167-Scritti-Politti",
      "urls": [
        "https://www.scritti.net/",
        "https://www.facebook.com/scrittinet",
        "https://myspace.com/scrittipolittilife",
        "https://en.wikipedia.org/wiki/Scritti_Politti"
      ]
    },
    "lastfm": "ArtistLastFmData(name='Scritti Politti', url='https://www.last.fm/music/Scritti+Politti', mbid='a2588b38-6532-4186-b0c8-9aff306d56f5', listeners=219043, playcount=2208003, bio_summary='Scritti Politti are a musical group that was formed in 1977 in Leeds, England, being primarily a vehicle for singer-songwriter Green Gartside (born Paul Julian Strohmeyer on 22 June 1956, Cardiff, Wales). Initially a left-wing-inspired post-punk rock act, the band developed into a more new wave and mainstream pop based project in the early to mid-80s (following two heavy lineup changes). The group\\'s most successful album, 1985\\'s \\'Cupid & Psyche 85\\' <a href=\"https://www.last.fm/music/Scritti+Politti\">Read more on Last.fm</a>', bio_content='Scritti Politti are a musical group that was formed in 1977 in Leeds, England, being primarily a vehicle for singer-songwriter Green Gartside (born Paul Julian Strohmeyer on 22 June 1956, Cardiff, Wales). Initially a left-wing-inspired post-punk rock act, the band developed into a more new wave and mainstream pop based project in the early to mid-80s (following two heavy lineup changes). The group\\'s most successful album, 1985\\'s \\'Cupid & Psyche 85\\', proved innovative in its early use of the techniques of sampling and MIDI sequencing, also producing hit singles such as \"Perfect Way\", \"The Word Girl\", \"Wood Beez\", and \"Absolute\". \\n\\nReleased on the Rough Trade record label in 1981, \"The Sweetest Girl\" (also known as \"Sweetest Girl\") became Scritti Politti\\'s first song to be a hit, peaking at #64 on the U.K. singles chart. According to the The Sweetest Girl Songfacts, was cited by The New York Times as one of the ten best singles of the year. Scritti Politti went on to enjoy significant success in the music charts in the U.K. and U.S. as the decade went on, rivaling slick new wave contemporaries such as Duran Duran, The Human League, Simple Minds, and others.\\n\\nFollowing this period of fame, however, Gartside became disillusioned with the music industry and the related pressures of being an artist. He retired to the South Wales of his childhood for nearly a decade. He returned to music-making in the late 90s, releasing two critically-acclaimed albums (in 1999 and 2006). As well, the success of the 2006 Mercury Music Prize-nominated \\'White Bread Black Beer\\' release proved to be a major comeback for Gartside. He toured the U.K., Ireland, the U.S.A., and Japan in the same year, these efforts being his first time performing live on stage for about twenty-five years.  \\n\\nGartside is known for his distinctive, whispering vocal style; he was described by one critic as having \"a voice that\\'s eternally 14 years old\". Born in Cardiff in 1956, Gartside attended Leeds Polytechnic and experienced the Sex Pistols\\' infamous \\'Anarchy tour\\' in 1977. Like so many others who saw this musical and cultural car crash, he felt inspired to make music. As well, again like so many others, he swiftly became disillusioned with punk\\'s stylistic parameters of the time. Following years of work evolving Scritti Politti\\'s sound, the group\\'s debut studio album, titled \\'Songs to Remember\\', came out on 3 September 1982. Though not a commercial hit, the relase\\'s eccentric set of influences,including 60s pop rock and 70s soul, and many philosophical lyrical references, with Gartside avoiding direct left-wing preaching in favour of confessional storytelling, brought the band serious critical praise.\\n\\nIn 1989, the British music magazine \\'Record Mirror\\' placed \\'Songs to Remember\\' at number fourteen in their critics\\' list of the best albums of the 80s. Nonetheless, heavy line-up changes occured after that album\\'s release. When 1985\\'s \\'Cupid & Psyche 85\\' came out, that work proved both to be a commercial smash as well as to be innovative in terms its early use of the techniques of sampling and MIDI sequencing. Hit singles such as \"Perfect Way\", \"The Word Girl\", \"Wood Beez\", and \"Absolute\" brought the group legions of fans.\\n\\nAs stated before, Scritti Politti is known for being, at times, a commercially-friendly outfit, particularly during when Gartside worked with American producer and keyboard player David Gamson and drummer Fred Maher, yet its songs still retained a critically acclaimed, heavily poetic look on life (a factor which, no matter what sound or guise Gartside\\'s current band may adopt, has always been carried through).\\n\\nIn a recent BBC Radio 2 interview, Gartside enthusiastically stated that he will be working on two further albums in the future, one being hip-hop based (a la 1999\\'s Anomie & Bonhomie).\\n\\nRecently, Gartside has been performing live with Alexis Taylor of Hot Chip - a fellow Mercury Music Prize nominee - and it is rumoured that the pair are currently writing a joint album. <a href=\"https://www.last.fm/music/Scritti+Politti\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['new wave', '80s', 'post-punk', 'pop', 'Sophisti-Pop'], similar_artists=[{'name': 'Prefab Sprout', 'url': 'https://www.last.fm/music/Prefab+Sprout'}, {'name': 'China Crisis', 'url': 'https://www.last.fm/music/China+Crisis'}, {'name': 'Heaven 17', 'url': 'https://www.last.fm/music/Heaven+17'}, {'name': 'ABC', 'url': 'https://www.last.fm/music/ABC'}, {'name': 'The Human League', 'url': 'https://www.last.fm/music/The+Human+League'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Scritti Politti', 'mbid': 'a2588b38-6532-4186-b0c8-9aff306d56f5', 'url': 'https://www.last.fm/music/Scritti+Politti', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '219043', 'playcount': '2208003'}, 'similar': {'artist': [{'name': 'Prefab Sprout', 'url': 'https://www.last.fm/music/Prefab+Sprout', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'China Crisis', 'url': 'https://www.last.fm/music/China+Crisis', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Heaven 17', 'url': 'https://www.last.fm/music/Heaven+17', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'ABC', 'url': 'https://www.last.fm/music/ABC', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'The Human League', 'url': 'https://www.last.fm/music/The+Human+League', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'new wave', 'url': 'https://www.last.fm/tag/new+wave'}, {'name': '80s', 'url': 'https://www.last.fm/tag/80s'}, {'name': 'post-punk', 'url': 'https://www.last.fm/tag/post-punk'}, {'name': 'pop', 'url': 'https://www.last.fm/tag/pop'}, {'name': 'Sophisti-Pop', 'url': 'https://www.last.fm/tag/Sophisti-Pop'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Scritti+Politti/+wiki'}}, 'published': '12 Aug 2006, 19:59', 'summary': 'Scritti Politti are a musical group that was formed in 1977 in Leeds, England, being primarily a vehicle for singer-songwriter Green Gartside (born Paul Julian Strohmeyer on 22 June 1956, Cardiff, Wales). Initially a left-wing-inspired post-punk rock act, the band developed into a more new wave and mainstream pop based project in the early to mid-80s (following two heavy lineup changes). The group\\'s most successful album, 1985\\'s \\'Cupid & Psyche 85\\' <a href=\"https://www.last.fm/music/Scritti+Politti\">Read more on Last.fm</a>', 'content': 'Scritti Politti are a musical group that was formed in 1977 in Leeds, England, being primarily a vehicle for singer-songwriter Green Gartside (born Paul Julian Strohmeyer on 22 June 1956, Cardiff, Wales). Initially a left-wing-inspired post-punk rock act, the band developed into a more new wave and mainstream pop based project in the early to mid-80s (following two heavy lineup changes). The group\\'s most successful album, 1985\\'s \\'Cupid & Psyche 85\\', proved innovative in its early use of the techniques of sampling and MIDI sequencing, also producing hit singles such as \"Perfect Way\", \"The Word Girl\", \"Wood Beez\", and \"Absolute\". \\n\\nReleased on the Rough Trade record label in 1981, \"The Sweetest Girl\" (also known as \"Sweetest Girl\") became Scritti Politti\\'s first song to be a hit, peaking at #64 on the U.K. singles chart. According to the The Sweetest Girl Songfacts, was cited by The New York Times as one of the ten best singles of the year. Scritti Politti went on to enjoy significant success in the music charts in the U.K. and U.S. as the decade went on, rivaling slick new wave contemporaries such as Duran Duran, The Human League, Simple Minds, and others.\\n\\nFollowing this period of fame, however, Gartside became disillusioned with the music industry and the related pressures of being an artist. He retired to the South Wales of his childhood for nearly a decade. He returned to music-making in the late 90s, releasing two critically-acclaimed albums (in 1999 and 2006). As well, the success of the 2006 Mercury Music Prize-nominated \\'White Bread Black Beer\\' release proved to be a major comeback for Gartside. He toured the U.K., Ireland, the U.S.A., and Japan in the same year, these efforts being his first time performing live on stage for about twenty-five years.  \\n\\nGartside is known for his distinctive, whispering vocal style; he was described by one critic as having \"a voice that\\'s eternally 14 years old\". Born in Cardiff in 1956, Gartside attended Leeds Polytechnic and experienced the Sex Pistols\\' infamous \\'Anarchy tour\\' in 1977. Like so many others who saw this musical and cultural car crash, he felt inspired to make music. As well, again like so many others, he swiftly became disillusioned with punk\\'s stylistic parameters of the time. Following years of work evolving Scritti Politti\\'s sound, the group\\'s debut studio album, titled \\'Songs to Remember\\', came out on 3 September 1982. Though not a commercial hit, the relase\\'s eccentric set of influences,including 60s pop rock and 70s soul, and many philosophical lyrical references, with Gartside avoiding direct left-wing preaching in favour of confessional storytelling, brought the band serious critical praise.\\n\\nIn 1989, the British music magazine \\'Record Mirror\\' placed \\'Songs to Remember\\' at number fourteen in their critics\\' list of the best albums of the 80s. Nonetheless, heavy line-up changes occured after that album\\'s release. When 1985\\'s \\'Cupid & Psyche 85\\' came out, that work proved both to be a commercial smash as well as to be innovative in terms its early use of the techniques of sampling and MIDI sequencing. Hit singles such as \"Perfect Way\", \"The Word Girl\", \"Wood Beez\", and \"Absolute\" brought the group legions of fans.\\n\\nAs stated before, Scritti Politti is known for being, at times, a commercially-friendly outfit, particularly during when Gartside worked with American producer and keyboard player David Gamson and drummer Fred Maher, yet its songs still retained a critically acclaimed, heavily poetic look on life (a factor which, no matter what sound or guise Gartside\\'s current band may adopt, has always been carried through).\\n\\nIn a recent BBC Radio 2 interview, Gartside enthusiastically stated that he will be working on two further albums in the future, one being hip-hop based (a la 1999\\'s Anomie & Bonhomie).\\n\\nRecently, Gartside has been performing live with Alexis Taylor of Hot Chip - a fellow Mercury Music Prize nominee - and it is rumoured that the pair are currently writing a joint album. <a href=\"https://www.last.fm/music/Scritti+Politti\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='59luKpdal8UwxcuLJNoKwS', url='https://open.spotify.com/artist/59luKpdal8UwxcuLJNoKwS', name='Scritti Politti', popularity=38, followers=107216, genres=['synthpop', 'new wave'], images=[{'url': 'https://i.scdn.co/image/ab6761610000e5eb737ffb7d167c72f925108800', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174737ffb7d167c72f925108800', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178737ffb7d167c72f925108800', 'height': 160, 'width': 160}], external_urls={'spotify': 'https://open.spotify.com/artist/59luKpdal8UwxcuLJNoKwS'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/59luKpdal8UwxcuLJNoKwS'}, 'followers': {'href': None, 'total': 107216}, 'genres': ['synthpop', 'new wave'], 'href': 'https://api.spotify.com/v1/artists/59luKpdal8UwxcuLJNoKwS', 'id': '59luKpdal8UwxcuLJNoKwS', 'images': [{'url': 'https://i.scdn.co/image/ab6761610000e5eb737ffb7d167c72f925108800', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174737ffb7d167c72f925108800', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178737ffb7d167c72f925108800', 'height': 160, 'width': 160}], 'name': 'Scritti Politti', 'popularity': 38, 'type': 'artist', 'uri': 'spotify:artist:59luKpdal8UwxcuLJNoKwS'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Initially a left-wing-inspired post-punk British rock group, Scritti Politti developed into a more mainstream pop music project in the early to mid-1980s, enjoying significant success in the record charts in the UK and the US. The group's most successful album, 1985's Cupid & Psyche 85, spawned three UK Top 20 hits with \"Wood Beez (Pray Like Aretha Franklin)\", \"Absolute\", and \"The Word Girl\", as well as a US Top 20 hit with \"Perfect Way\".\nThe band's 1988 album Provision was a UK Top 10 success, though it only produced one UK Top 20 hit single (\"Oh Patti\"). After releasing a couple of non-album singles in 1991, as well as a collaboration with B.E.F., Gartside became disillusioned with the music industry and retired to south Wales for more than seven years. He returned to music-making in the late 1990s, releasing two albums, 1999's Anomie & Bonhomie (which included various rap and hip hop influences) and 2006's stripped-down White Bread, Black Beer which returned to the more experimental era of the band's history.\nScritti Politti's music was characterised by sophisticated studio production, Gartside's sly, punning wordplay and the tension between the polished pop-funk stylings of their music and the subtle radicalism of the political and social messages embedded in their lyrics.\nIn the mid-1970s, Green Gartside was studying fine art at Leeds College of Art and Design (now Leeds College of Art). The Sex Pistols 'Anarchy' tour which included The Damned and The Heartbreakers was launched at Leeds Polytechnic on 6 December 1976, and inspired Gartside to form a band with his childhood friend Nial Jinks, and fellow student Tom Morley.\nScritti Politti originally consisted of Gartside as the lead vocalist, Jinks as bass player, Morley as drummer, and Matthew Kay as the manager who sometimes played the keyboard. Gartside and Jinks had gone to school together in south Wales, and Gartside met Morley at Leeds Polytechnic. For their first public performance in 1976, supporting local Leeds punk group SOS, the group went under the name 'The Against'.\n\nUpon finishing their studies the group relocated to London's Camden Town around 1977, where they lived in a squat. The name Scritti Politti was chosen as a homage to the Italian Marxist writer and political theorist Antonio Gramsci. The correct spelling in Italian to refer to \"Political Writings\" would have produced \"Scritti Politici\". Gartside changed it to \"Scritti Politti\" as he thought it sounded more rock and roll, like the Little Richard song Tutti Frutti.\nAlongside other groups of what has been termed the DIY ethic or movement (notably the Desperate Bicycles and Steve Treatment, the latter being associated with the Swell Maps), Scritti Politti released a DIY record titled \"Skank Bloc Bologna\" on their own St. Pancras label in 1978. To the raw energy of punk, Scritti Politti added a creative spontaneity and a mock-philosophical intelligence in their lyrics, with scholarly allusions to Marx, Bakunin, Derrida, Deleuze, and Lacan. In early tracks, the punk-like fracturing of language and spikiness of the sound were held together by more lyrical melody than the more austere music of other left-field groups from the post-punk scene, such as Gang of Four, London art-rockers This Heat or the Bristol based The Pop Group.\n\"Skank Bloc Bologna\" picked up airplay on John Peel's BBC Radio 1 show, and the band were signed to Rough Trade under Geoff Travis in 1979, making them labelmates with the other Cardiff avant-garde band, Young Marble Giants.Scritti Politti released two EPs in 1979 with singles \"Bibbly-O-Tek\", \"Doubt Beat\", \"OPEC/Immac\" and \"Hegemony\".\n\"Hegemony\" – which Gartside eventually cited as being based on the old English folksong 'Lemady' – led to more melodic songs such as \"Confidence\", which in turn hinted at the direction the band would take in the 1980s. Gartside then slimmed the band down to a three piece.\nBy the time of \"4 A-sides\", (Doubt Beat; Confidence; Bibbly-o-tek; PAs) a blend of strong melody and rhythmic jaggedness had been achieved. The band exhibited an explicit do-it-yourself attitude, which manifested itself in their hand-made record sleeves with detailed breakdowns of production costs, including addresses and phone numbers of record pressing plants, and even their own Camden squat address for feedback.\nWhilst on a UK tour with Gang of Four and Joy Division, Gartside was overcome by the pressures of stage fright and anxiety, leading to what was originally thought to be his first heart attack, but what was really a panic attack at the age of 23. To recover from ill health, he retreated to his native Wales and began writing an album that was to be heavily influenced by the R&B and New York City sound he was listening to.\nGartside recorded a demo of one of his new songs, \"The 'Sweetest Girl'\", in January 1981, and the song was included on the C81 cassette compilation obtained with tokens from the March issues of NME. The song – which features Robert Wyatt on keyboards – received strong reviews. It was cited by The New York Times as one of the ten best singles of the year, but the track did not get a wide release for ten months, by which time momentum was lost, and it only achieved a minor placing in the UK Singles Chart at No. 64. The single was later covered by pop band Madness, with their version reaching No. 35 in the UK singles chart in 1986. Drummer Tom Morley departed Scritti Politti in November 1981.\nThe 'Sweetest Girl' prompted many major labels to offer Gartside record contracts, but he decided to stay with Rough Trade Records. The 'Sweetest Girl' marked a stylistic change toward the more melodic, and was followed by minor hits \"Faithless\" (UK No. 56) and double A-side \"Asylums in Jerusalem\" / \"Jacques Derrida\" (UK No. 43). In a retrospective review, \"Asylums in Jerusalem\" was described by Allmusic journalist Stewart Mason as \"a slick piece of reggae-tinged synth-pop with a twangy electronic bass line and a new playfulness in Green Gartside's politically motivated lyrics.\" The song Jacques Derrida was influenced by Gartside's reading of deconstruction and the work of semiotic analysis from the French philosopher Derrida.\n\nThe debut album, Songs to Remember, was released on Rough Trade in August 1982. Displaying Gartside's previously hidden reggae influence, it was a critical and commercial success, reaching No. 12 in the UK Albums Chart. One of Rough Trade's most unlikely success stories, the album became their biggest selling release to date. Also during this period, Gartside recorded a duet with Annie Lennox on the Eurythmics track \"Wrap It Up\", for their Sweet Dreams (Are Made of This) album released in early 1983.\nGartside became influenced by the new sounds coming out of New York City, especially hip hop. He signed with Virgin Records in 1983 (and with Warner Bros. in the US.) The original line-up was disbanded and Gartside moved to New York.\nCollaborating with veteran producer Arif Mardin, David Gamson and Fred Maher, the first recording to emerge from these sessions was the single: \"Wood Beez (Pray Like Aretha Franklin)\". Released in April 1984, \"Wood Beez\" was an immediate UK hit, peaking at No. 10, and was also successful in Australia, charting at No. 25, and in New-Zealand where it reached No. 26. A series of intricately programmed dance/soul-style hits followed, including \"Absolute\" (UK No. 17), \"Hypnotize\" (UK No. 68 and No. 43 on the US Dance Charts) and the reggae-styled \"The Word Girl\", which became Scritti Politti's biggest UK hit single, climbing to No. 6 in May 1985.\nIn June 1985, Scritti Politti released their second (and most successful) album, Cupid & Psyche 85, with songs produced by Arif Mardin and performances by numerous session musicians. The LP was a Top 5 hit in the UK and also sold well in the US. In addition to the four already released singles, the album included the song, \"Perfect Way\". It was only a minor hit when released in the UK (No. 48) but it became the band's biggest US single, peaking at No. 11.\nThe personnel for the Cupid and Psyche '85 album differed from that of their first album, and featured keyboardist David Gamson and ex-Material drummer Fred Maher, both of whom would collaborate with Gartside on songwriting and production duties. Arif Mardin would also produce three songs for the album. Stylistically, the songs on the album feature dense timbral counterpoint (in fact, nearly every song on the album), using synthesizer chords and effects (as well as \"real\" instruments), programmed largely by David Gamson, creating a style that they would refine in their next album. In the US, \"Wood Beez\" was re-released as the follow-up single to \"Perfect Way\", but it only managed to hit No. 91 (it had previously hit No. 4 on the US Dance Charts in late 1984).\n\nIn 1986, Gartside and Gamson wrote and produced \"Love of a Lifetime\" for Chaka Khan, which appeared on her Destiny album. The same year they also collaborated to write the title track for Al Jarreau's album, L is For Lover.\nIn 1987, Scritti Politti appeared on the Who's That Girl soundtrack with the song \"Best Thing Ever\". This track also appeared on the next Scritti Politti album, 1988's Provision, which continued Gartside's development into synth-funk as well as reggae and other styles. The roster of session players became even more notable, including contributions from Roger Troutman, Marcus Miller and Miles Davis, who performed on the single \"Oh Patti (Don't Feel Sorry For Loverboy)\", a UK No. 13 hit. However, although the album charted in the Top 10 in the UK (No. 8), it did not match the commercial success of Cupid and Psyche '85 in the US, stalling at No. 113.They hit the UK charts again in 1991 with their cover of The Beatles' song, \"She's a Woman\", which featured guest vocals from Shabba Ranks and a remix version by William Orbit. It became Scritti Politti's final UK Top 20 single, peaking at No. 20. This was swiftly followed by the release of \"Take Me in Your Arms And Love Me\"', a cover of the Gladys Knight song, featuring guest vocals from Sweetie Irie, which failed to chart inside the Top 40. A corresponding album never materialised, with Gartside deciding on another hiatus.\nThe hip hop inspired album Anomie and Bonhomie was released in 1999, and involved even more session artists. The now bearded Gartside dived directly into the now commercially accessible hip hop scene, borrowing tradesmen of the genre such as Mos Def and Jimahl amongst others. While considered by many critics to be a return to form, the album was not as commercially successful as their previous output, reaching only No. 33 on the UK Albums Chart.In 2003, Gartside appeared on Kylie Minogue's album Body Language, duetting on the Emiliana Torrini co-write \"Someday\".\n\nIn February 2005, Rough Trade released Early, a compilation album of Scritti Politti's earliest recordings.\nIn early January 2006, Gartside and a new incarnation of Scritti Politti, billed as 'Double G and The Traitorous 3', played a show in Brixton. This was Gartside's first live appearance since 1980. This band, including journalist/musician Rhodri Marsden on keyboards and Dicky Moore on guitar, played a number of concerts previewing a new album, White Bread, Black Beer, which was released on Rough Trade on 29 May 2006. Later that year, White Bread, Black Beer was nominated for the Mercury Music Prize, and gained critical praise.\nThe current line-up toured worldwide (under the Scritti Politti name) on the back of the album's success, and completed a UK tour in November 2006. They appeared at the Bestival music festival in September 2006, and at Summer Sonic Festival in Japan. On 19 December, they played a short set at the Rough Trade Christmas party in London.\n\nIn 2007, Gartside worked on an album with Alexis Taylor, the singer with Hot Chip. The pair met at the Mercury Music Prize ceremony, and played a concert supporting Kieran Hebden and Steve Reid at KOKO in London in March 2007.\n\nGartside joined 'Way to Blue: The Songs of Nick Drake', a 2008 UK and Australian tour featuring interpretations of Nick Drake's songs by amongst others, Robyn Hitchcock, Lisa Hannigan and Teddy Thompson. A subsequent live 15-track CD was released, including Gartside's version of Drake's \"Fruit Tree\".\n\nIn 2009, Gartside participated in 'Very Cellular Songs', a concert at The Barbican celebrating the music of The Incredible String Band, featuring Richard Thompson, Kamila Thompson, Alasdair Roberts, and Dr. Strangely Strange.\n\nOn 28 February 2011, Absolute, a compilation of singles and album tracks was released, with two new tracks both written with David Gamson: \"Day Late and a Dollar Short\" and \"A Place We Both Belong\". Gamson played a part in the recording of both Cupid & Psyche 85 and Provision.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1978",
      "country": "Leeds, England, UK",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1978",
      "gender": "Male",
      "genre": "New Wave",
      "id": "123903",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/scritti-politti-53218752dc088.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://www.theaudiodb.com/images/media/Artist/fanart/0o7bo31741271438.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://www.theaudiodb.com/images/media/Artist/fanart/aznd2x1741271458.jpg",
          "width": 1920
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/bwjdi41687947466.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "Philosophical",
      "music_videos": null,
      "musicbrainz_id": "a2588b38-6532-4186-b0c8-9aff306d56f5",
      "name": "Scritti Politti",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/f5/6e/4f/f56e4f47-9ffe-af39-c8b2-80d67260b6f6/mzl.qyuqounz.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Pop"
      ],
      "id": "614113",
      "name": "Scritti Politti",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/scritti-politti/614113"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "24167",
      "images": [
        {
          "height": 462,
          "resource_url": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/pvLanT-SK1bE4zDkpzvRQMDKKWj-sQb9UfMHUxw6hSY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 381,
          "resource_url": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/bTYRhZT4m2NBQ529224Atba2LDs2LJzKOpnzZpfAkV4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
          "width": 567
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
          "uri150": "https://i.discogs.com/QIDUO_kl8G7W-MC-a-EbkHVSErz5RdPclAFMYtgjU7I/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
          "width": 344
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/g0SLIDcncdRZRPwb8BnQtqmENvoLGhfpQ0EmMmkjS2M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 783,
          "resource_url": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/yWzGmTmzHurpz0ixMuWb57WLVTtJmatpOv_StLy2NHg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 1065,
          "resource_url": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/-5vKg_Ioc3L2nbrMeNyQzsuAk5fspWrwguzJ_O_cW9A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 1144,
          "resource_url": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/usTYnPrx45wWGFTknt5jKUo5WK5-ezqSs9rUvc2eqcw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 751,
          "resource_url": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/kWZ-08EO_JmCwfrKhdJfGpkBYgXS28Y6Q_Am-KCatRE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [
        {
          "active": true,
          "id": 25807,
          "name": "Green Gartside",
          "resource_url": "https://api.discogs.com/artists/25807",
          "thumbnail_url": "https://i.discogs.com/zPguFf42hN8Ov9TeWoQDY0Gsko6JZWhDEgKXdjxGnpY/rs:fit/g:sm/q:40/h:598/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1ODA3/LTE2OTg3NzA2MjMt/OTEyMC5wbmc.jpeg"
        },
        {
          "active": false,
          "id": 47970,
          "name": "David Gamson",
          "resource_url": "https://api.discogs.com/artists/47970",
          "thumbnail_url": "https://i.discogs.com/irzB2dpl6ucUjkQuzwGWQyCt0UGGVJp6-ZuGweo6SV8/rs:fit/g:sm/q:40/h:411/w:388/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3OTcw/LTE2NjI1NTg2ODMt/NzM3OC5qcGVn.jpeg"
        },
        {
          "active": false,
          "id": 69826,
          "name": "Fred Maher",
          "resource_url": "https://api.discogs.com/artists/69826",
          "thumbnail_url": "https://i.discogs.com/3UZXvCQfBS_ZW_oOS5yr8HTI93hS-wMrkUbzeKW_2Nw/rs:fit/g:sm/q:40/h:397/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY5ODI2/LTExMDcxNzcyMzUu/anBn.jpeg"
        },
        {
          "active": false,
          "id": 221763,
          "name": "Simon Emmerson",
          "resource_url": "https://api.discogs.com/artists/221763",
          "thumbnail_url": "https://i.discogs.com/MAGOJUaKJ07QeRNYJRjxSBC4YSakSGnmF9_9nkWQi_k/rs:fit/g:sm/q:40/h:376/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIyMTc2/My0xMjg1NTE4MTc4/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 281923,
          "name": "Alan Murphy",
          "resource_url": "https://api.discogs.com/artists/281923",
          "thumbnail_url": "https://i.discogs.com/UrQ4qD9PUONo7abzByAmm_ltnlWL_UTa5-tgHtvi9z0/rs:fit/g:sm/q:40/h:352/w:230/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MTky/My0xMzMyOTYwNDU5/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 375875,
          "name": "Rhodri Marsden",
          "resource_url": "https://api.discogs.com/artists/375875",
          "thumbnail_url": "https://i.discogs.com/9u7vUV3TnUCxy9WqBu2ss7iMqUyupumZ4O3dwkiy_Fw/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3NTg3/NS0xMzA3MzE4NjI4/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 444358,
          "name": "Rob Smoughton",
          "resource_url": "https://api.discogs.com/artists/444358",
          "thumbnail_url": "https://i.discogs.com/9KIYaxAUNURVV267Wv03RR8RSGlSGOHcDqwq-IHy4AQ/rs:fit/g:sm/q:40/h:133/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0NDM1/OC0xNDYxNzU0MzA5/LTMzNzMuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 470550,
          "name": "Niall Jinks",
          "resource_url": "https://api.discogs.com/artists/470550",
          "thumbnail_url": "https://i.discogs.com/S5wwoM4BexBosRM_49t057N346p2V7zpKfTc4mA61Tg/rs:fit/g:sm/q:40/h:397/w:313/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MC0xMjE2NzY0NDQw/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 470551,
          "name": "Tom Morley",
          "resource_url": "https://api.discogs.com/artists/470551",
          "thumbnail_url": "https://i.discogs.com/pmHgbOmqK43TD6_lUI4vAK_A8jzYIC7spyxLGi_yIJU/rs:fit/g:sm/q:40/h:621/w:463/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MS0xNDQxNjE2MzM0/LTY5NTguanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 613132,
          "name": "Joe Cang",
          "resource_url": "https://api.discogs.com/artists/613132",
          "thumbnail_url": "https://i.discogs.com/9Bc4DNzJF_rr_K7UyoaercV7noVoXXyswHPOLQ8oPws/rs:fit/g:sm/q:40/h:797/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYxMzEz/Mi0xMzA4ODMyNzI3/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 806184,
          "name": "Matthew Kay",
          "resource_url": "https://api.discogs.com/artists/806184",
          "thumbnail_url": "https://i.discogs.com/XfXA8xPD9g2Gsf7_2xYLNkmnC_Ljsfu41alk5X4Yuys/rs:fit/g:sm/q:40/h:396/w:311/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgwNjE4/NC0xMjE2NzY0NDgy/LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 5392220,
          "name": "Paul Strohmeyer",
          "resource_url": "https://api.discogs.com/artists/5392220",
          "thumbnail_url": "https://i.discogs.com/fzDX9j3dN0diJJ0D5GT34nxRHc7KTV-SCu1hsX9ZvxY/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTUzOTIy/MjAtMTQ5NDU3NjY1/OC04MDE5LmpwZWc.jpeg"
        }
      ],
      "name": "Scritti Politti",
      "namevariations": [
        "Screitti Politti",
        "Scrits",
        "Scritti",
        "Scritti Polit",
        "Scritti Polliti",
        "Scritti Pollitti",
        "Scritty Politty",
        "スクリッティ・ポリッティ"
      ],
      "profile": "British band, originally formed in 1977 in Leeds. Cardiff-born singer-songwriter [a=Green Gartside] was the founding member of the band and the only member to have remained throughout the group's history.",
      "raw_data": {
        "data_quality": "Needs Vote",
        "id": 24167,
        "images": [
          {
            "height": 462,
            "resource_url": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/i7HSZlF8JOYRCimQbioRevEBWIkRwDBz0eCwiepFhiM/rs:fit/g:sm/q:90/h:462/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/pvLanT-SK1bE4zDkpzvRQMDKKWj-sQb9UfMHUxw6hSY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 381,
            "resource_url": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/p5xOKsjB74eTMRfGIpvPXdhNFx-gO1SYBdxg0KAExVU/rs:fit/g:sm/q:90/h:381/w:567/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/bTYRhZT4m2NBQ529224Atba2LDs2LJzKOpnzZpfAkV4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEzMTgxNTk2MzQu/anBlZw.jpeg",
            "width": 567
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/KiLwTKYEJbQ82fdvb3VyorL3kxERJn7rYsT0nu9fT50/rs:fit/g:sm/q:90/h:400/w:344/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
            "uri150": "https://i.discogs.com/QIDUO_kl8G7W-MC-a-EbkHVSErz5RdPclAFMYtgjU7I/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTEwNzMyMjgzNDgu/anBn.jpeg",
            "width": 344
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/gL0TB2pNJXaogoYRShQRiznucCyqU2Dn1KEy6ZQbePE/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/g0SLIDcncdRZRPwb8BnQtqmENvoLGhfpQ0EmMmkjS2M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE0NTkxNjE1NDUt/NjE2Mi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 783,
            "resource_url": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/FTh0ciSFoQFM9s3NWn9kDb1i1gMNsrCx-Ci6gvtUmcA/rs:fit/g:sm/q:90/h:783/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/yWzGmTmzHurpz0ixMuWb57WLVTtJmatpOv_StLy2NHg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3OTAt/ODk5NC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 1065,
            "resource_url": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/5HwZch09xcdSZtmba65vrPNaiOgyxJ2M1D-zumSY_yg/rs:fit/g:sm/q:90/h:1065/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/-5vKg_Ioc3L2nbrMeNyQzsuAk5fspWrwguzJ_O_cW9A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDAt/NzAxOS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 1144,
            "resource_url": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/yQ5OhJYAeZm1s285XONKoda9YVLnH6q7_yccQuLyScA/rs:fit/g:sm/q:90/h:1144/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/usTYnPrx45wWGFTknt5jKUo5WK5-ezqSs9rUvc2eqcw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MDYt/MTkyMi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 751,
            "resource_url": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/d1QaK8X3E8hWVb6rIQkBRBYlcxIFw1aui4nihnN75U8/rs:fit/g:sm/q:90/h:751/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/kWZ-08EO_JmCwfrKhdJfGpkBYgXS28Y6Q_Am-KCatRE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM4MTQt/MTQyOC5qcGVn.jpeg",
            "width": 600
          }
        ],
        "members": [
          {
            "active": true,
            "id": 25807,
            "name": "Green Gartside",
            "resource_url": "https://api.discogs.com/artists/25807",
            "thumbnail_url": "https://i.discogs.com/zPguFf42hN8Ov9TeWoQDY0Gsko6JZWhDEgKXdjxGnpY/rs:fit/g:sm/q:40/h:598/w:590/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1ODA3/LTE2OTg3NzA2MjMt/OTEyMC5wbmc.jpeg"
          },
          {
            "active": false,
            "id": 47970,
            "name": "David Gamson",
            "resource_url": "https://api.discogs.com/artists/47970",
            "thumbnail_url": "https://i.discogs.com/irzB2dpl6ucUjkQuzwGWQyCt0UGGVJp6-ZuGweo6SV8/rs:fit/g:sm/q:40/h:411/w:388/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3OTcw/LTE2NjI1NTg2ODMt/NzM3OC5qcGVn.jpeg"
          },
          {
            "active": false,
            "id": 69826,
            "name": "Fred Maher",
            "resource_url": "https://api.discogs.com/artists/69826",
            "thumbnail_url": "https://i.discogs.com/3UZXvCQfBS_ZW_oOS5yr8HTI93hS-wMrkUbzeKW_2Nw/rs:fit/g:sm/q:40/h:397/w:240/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY5ODI2/LTExMDcxNzcyMzUu/anBn.jpeg"
          },
          {
            "active": false,
            "id": 221763,
            "name": "Simon Emmerson",
            "resource_url": "https://api.discogs.com/artists/221763",
            "thumbnail_url": "https://i.discogs.com/MAGOJUaKJ07QeRNYJRjxSBC4YSakSGnmF9_9nkWQi_k/rs:fit/g:sm/q:40/h:376/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIyMTc2/My0xMjg1NTE4MTc4/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 281923,
            "name": "Alan Murphy",
            "resource_url": "https://api.discogs.com/artists/281923",
            "thumbnail_url": "https://i.discogs.com/UrQ4qD9PUONo7abzByAmm_ltnlWL_UTa5-tgHtvi9z0/rs:fit/g:sm/q:40/h:352/w:230/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MTky/My0xMzMyOTYwNDU5/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 375875,
            "name": "Rhodri Marsden",
            "resource_url": "https://api.discogs.com/artists/375875",
            "thumbnail_url": "https://i.discogs.com/9u7vUV3TnUCxy9WqBu2ss7iMqUyupumZ4O3dwkiy_Fw/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM3NTg3/NS0xMzA3MzE4NjI4/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 444358,
            "name": "Rob Smoughton",
            "resource_url": "https://api.discogs.com/artists/444358",
            "thumbnail_url": "https://i.discogs.com/9KIYaxAUNURVV267Wv03RR8RSGlSGOHcDqwq-IHy4AQ/rs:fit/g:sm/q:40/h:133/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ0NDM1/OC0xNDYxNzU0MzA5/LTMzNzMuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 470550,
            "name": "Niall Jinks",
            "resource_url": "https://api.discogs.com/artists/470550",
            "thumbnail_url": "https://i.discogs.com/S5wwoM4BexBosRM_49t057N346p2V7zpKfTc4mA61Tg/rs:fit/g:sm/q:40/h:397/w:313/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MC0xMjE2NzY0NDQw/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 470551,
            "name": "Tom Morley",
            "resource_url": "https://api.discogs.com/artists/470551",
            "thumbnail_url": "https://i.discogs.com/pmHgbOmqK43TD6_lUI4vAK_A8jzYIC7spyxLGi_yIJU/rs:fit/g:sm/q:40/h:621/w:463/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQ3MDU1/MS0xNDQxNjE2MzM0/LTY5NTguanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 613132,
            "name": "Joe Cang",
            "resource_url": "https://api.discogs.com/artists/613132",
            "thumbnail_url": "https://i.discogs.com/9Bc4DNzJF_rr_K7UyoaercV7noVoXXyswHPOLQ8oPws/rs:fit/g:sm/q:40/h:797/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYxMzEz/Mi0xMzA4ODMyNzI3/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 806184,
            "name": "Matthew Kay",
            "resource_url": "https://api.discogs.com/artists/806184",
            "thumbnail_url": "https://i.discogs.com/XfXA8xPD9g2Gsf7_2xYLNkmnC_Ljsfu41alk5X4Yuys/rs:fit/g:sm/q:40/h:396/w:311/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTgwNjE4/NC0xMjE2NzY0NDgy/LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 5392220,
            "name": "Paul Strohmeyer",
            "resource_url": "https://api.discogs.com/artists/5392220",
            "thumbnail_url": "https://i.discogs.com/fzDX9j3dN0diJJ0D5GT34nxRHc7KTV-SCu1hsX9ZvxY/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTUzOTIy/MjAtMTQ5NDU3NjY1/OC04MDE5LmpwZWc.jpeg"
          }
        ],
        "name": "Scritti Politti",
        "namevariations": [
          "Screitti Politti",
          "Scrits",
          "Scritti",
          "Scritti Polit",
          "Scritti Polliti",
          "Scritti Pollitti",
          "Scritty Politty",
          "スクリッティ・ポリッティ"
        ],
        "profile": "British band, originally formed in 1977 in Leeds. Cardiff-born singer-songwriter [a=Green Gartside] was the founding member of the band and the only member to have remained throughout the group's history.",
        "releases_url": "https://api.discogs.com/artists/24167/releases",
        "resource_url": "https://api.discogs.com/artists/24167",
        "uri": "https://www.discogs.com/artist/24167-Scritti-Politti",
        "urls": [
          "https://www.scritti.net/",
          "https://www.facebook.com/scrittinet",
          "https://myspace.com/scrittipolittilife",
          "https://en.wikipedia.org/wiki/Scritti_Politti"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/24167",
      "thumb": "https://i.discogs.com/pvLanT-SK1bE4zDkpzvRQMDKKWj-sQb9UfMHUxw6hSY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0MTY3/LTE1NzkwNjM3NzAt/ODk4NS5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/24167-Scritti-Politti",
      "urls": [
        "https://www.scritti.net/",
        "https://www.facebook.com/scrittinet",
        "https://myspace.com/scrittipolittilife",
        "https://en.wikipedia.org/wiki/Scritti_Politti"
      ]
    },
    "lastfm": {
      "bio_content": "Scritti Politti are a musical group that was formed in 1977 in Leeds, England, being primarily a vehicle for singer-songwriter Green Gartside (born Paul Julian Strohmeyer on 22 June 1956, Cardiff, Wales). Initially a left-wing-inspired post-punk rock act, the band developed into a more new wave and mainstream pop based project in the early to mid-80s (following two heavy lineup changes). The group's most successful album, 1985's 'Cupid & Psyche 85', proved innovative in its early use of the techniques of sampling and MIDI sequencing, also producing hit singles such as \"Perfect Way\", \"The Word Girl\", \"Wood Beez\", and \"Absolute\". \n\nReleased on the Rough Trade record label in 1981, \"The Sweetest Girl\" (also known as \"Sweetest Girl\") became Scritti Politti's first song to be a hit, peaking at #64 on the U.K. singles chart. According to the The Sweetest Girl Songfacts, was cited by The New York Times as one of the ten best singles of the year. Scritti Politti went on to enjoy significant success in the music charts in the U.K. and U.S. as the decade went on, rivaling slick new wave contemporaries such as Duran Duran, The Human League, Simple Minds, and others.\n\nFollowing this period of fame, however, Gartside became disillusioned with the music industry and the related pressures of being an artist. He retired to the South Wales of his childhood for nearly a decade. He returned to music-making in the late 90s, releasing two critically-acclaimed albums (in 1999 and 2006). As well, the success of the 2006 Mercury Music Prize-nominated 'White Bread Black Beer' release proved to be a major comeback for Gartside. He toured the U.K., Ireland, the U.S.A., and Japan in the same year, these efforts being his first time performing live on stage for about twenty-five years.  \n\nGartside is known for his distinctive, whispering vocal style; he was described by one critic as having \"a voice that's eternally 14 years old\". Born in Cardiff in 1956, Gartside attended Leeds Polytechnic and experienced the Sex Pistols' infamous 'Anarchy tour' in 1977. Like so many others who saw this musical and cultural car crash, he felt inspired to make music. As well, again like so many others, he swiftly became disillusioned with punk's stylistic parameters of the time. Following years of work evolving Scritti Politti's sound, the group's debut studio album, titled 'Songs to Remember', came out on 3 September 1982. Though not a commercial hit, the relase's eccentric set of influences,including 60s pop rock and 70s soul, and many philosophical lyrical references, with Gartside avoiding direct left-wing preaching in favour of confessional storytelling, brought the band serious critical praise.\n\nIn 1989, the British music magazine 'Record Mirror' placed 'Songs to Remember' at number fourteen in their critics' list of the best albums of the 80s. Nonetheless, heavy line-up changes occured after that album's release. When 1985's 'Cupid & Psyche 85' came out, that work proved both to be a commercial smash as well as to be innovative in terms its early use of the techniques of sampling and MIDI sequencing. Hit singles such as \"Perfect Way\", \"The Word Girl\", \"Wood Beez\", and \"Absolute\" brought the group legions of fans.\n\nAs stated before, Scritti Politti is known for being, at times, a commercially-friendly outfit, particularly during when Gartside worked with American producer and keyboard player David Gamson and drummer Fred Maher, yet its songs still retained a critically acclaimed, heavily poetic look on life (a factor which, no matter what sound or guise Gartside's current band may adopt, has always been carried through).\n\nIn a recent BBC Radio 2 interview, Gartside enthusiastically stated that he will be working on two further albums in the future, one being hip-hop based (a la 1999's Anomie & Bonhomie).\n\nRecently, Gartside has been performing live with Alexis Taylor of Hot Chip - a fellow Mercury Music Prize nominee - and it is rumoured that the pair are currently writing a joint album. <a href=\"https://www.last.fm/music/Scritti+Politti\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Scritti Politti are a musical group that was formed in 1977 in Leeds, England, being primarily a vehicle for singer-songwriter Green Gartside (born Paul Julian Strohmeyer on 22 June 1956, Cardiff, Wales). Initially a left-wing-inspired post-punk rock act, the band developed into a more new wave and mainstream pop based project in the early to mid-80s (following two heavy lineup changes). The group's most successful album, 1985's 'Cupid & Psyche 85' <a href=\"https://www.last.fm/music/Scritti+Politti\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 219043,
      "mbid": "a2588b38-6532-4186-b0c8-9aff306d56f5",
      "name": "Scritti Politti",
      "playcount": 2208003,
      "similar_artists": [
        {
          "name": "Prefab Sprout",
          "url": "https://www.last.fm/music/Prefab+Sprout"
        },
        {
          "name": "China Crisis",
          "url": "https://www.last.fm/music/China+Crisis"
        },
        {
          "name": "Heaven 17",
          "url": "https://www.last.fm/music/Heaven+17"
        },
        {
          "name": "ABC",
          "url": "https://www.last.fm/music/ABC"
        },
        {
          "name": "The Human League",
          "url": "https://www.last.fm/music/The+Human+League"
        }
      ],
      "tags": [
        "new wave",
        "80s",
        "post-punk",
        "pop",
        "Sophisti-Pop"
      ],
      "url": "https://www.last.fm/music/Scritti+Politti"
    },
    "spotify": {
      "followers": 107216,
      "genres": [
        "synthpop",
        "new wave"
      ],
      "id": "59luKpdal8UwxcuLJNoKwS",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb737ffb7d167c72f925108800",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174737ffb7d167c72f925108800",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178737ffb7d167c72f925108800",
          "width": 160
        }
      ],
      "name": "Scritti Politti",
      "popularity": 38,
      "url": "https://open.spotify.com/artist/59luKpdal8UwxcuLJNoKwS"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Initially a left-wing-inspired post-punk British rock group, Scritti Politti developed into a more mainstream pop music project in the early to mid-1980s, enjoying significant success in the record charts in the UK and the US. The group's most successful album, 1985's Cupid & Psyche 85, spawned three UK Top 20 hits with \"Wood Beez (Pray Like Aretha Franklin)\", \"Absolute\", and \"The Word Girl\", as well as a US Top 20 hit with \"Perfect Way\".\nThe band's 1988 album Provision was a UK Top 10 success, though it only produced one UK Top 20 hit single (\"Oh Patti\"). After releasing a couple of non-album singles in 1991, as well as a collaboration with B.E.F., Gartside became disillusioned with the music industry and retired to south Wales for more than seven years. He returned to music-making in the late 1990s, releasing two albums, 1999's Anomie & Bonhomie (which included various rap and hip hop influences) and 2006's stripped-down White Bread, Black Beer which returned to the more experimental era of the band's history.\nScritti Politti's music was characterised by sophisticated studio production, Gartside's sly, punning wordplay and the tension between the polished pop-funk stylings of their music and the subtle radicalism of the political and social messages embedded in their lyrics.\nIn the mid-1970s, Green Gartside was studying fine art at Leeds College of Art and Design (now Leeds College of Art). The Sex Pistols 'Anarchy' tour which included The Damned and The Heartbreakers was launched at Leeds Polytechnic on 6 December 1976, and inspired Gartside to form a band with his childhood friend Nial Jinks, and fellow student Tom Morley.\nScritti Politti originally consisted of Gartside as the lead vocalist, Jinks as bass player, Morley as drummer, and Matthew Kay as the manager who sometimes played the keyboard. Gartside and Jinks had gone to school together in south Wales, and Gartside met Morley at Leeds Polytechnic. For their first public performance in 1976, supporting local Leeds punk group SOS, the group went under the name 'The Against'.\n\nUpon finishing their studies the group relocated to London's Camden Town around 1977, where they lived in a squat. The name Scritti Politti was chosen as a homage to the Italian Marxist writer and political theorist Antonio Gramsci. The correct spelling in Italian to refer to \"Political Writings\" would have produced \"Scritti Politici\". Gartside changed it to \"Scritti Politti\" as he thought it sounded more rock and roll, like the Little Richard song Tutti Frutti.\nAlongside other groups of what has been termed the DIY ethic or movement (notably the Desperate Bicycles and Steve Treatment, the latter being associated with the Swell Maps), Scritti Politti released a DIY record titled \"Skank Bloc Bologna\" on their own St. Pancras label in 1978. To the raw energy of punk, Scritti Politti added a creative spontaneity and a mock-philosophical intelligence in their lyrics, with scholarly allusions to Marx, Bakunin, Derrida, Deleuze, and Lacan. In early tracks, the punk-like fracturing of language and spikiness of the sound were held together by more lyrical melody than the more austere music of other left-field groups from the post-punk scene, such as Gang of Four, London art-rockers This Heat or the Bristol based The Pop Group.\n\"Skank Bloc Bologna\" picked up airplay on John Peel's BBC Radio 1 show, and the band were signed to Rough Trade under Geoff Travis in 1979, making them labelmates with the other Cardiff avant-garde band, Young Marble Giants.Scritti Politti released two EPs in 1979 with singles \"Bibbly-O-Tek\", \"Doubt Beat\", \"OPEC/Immac\" and \"Hegemony\".\n\"Hegemony\" – which Gartside eventually cited as being based on the old English folksong 'Lemady' – led to more melodic songs such as \"Confidence\", which in turn hinted at the direction the band would take in the 1980s. Gartside then slimmed the band down to a three piece.\nBy the time of \"4 A-sides\", (Doubt Beat; Confidence; Bibbly-o-tek; PAs) a blend of strong melody and rhythmic jaggedness had been achieved. The band exhibited an explicit do-it-yourself attitude, which manifested itself in their hand-made record sleeves with detailed breakdowns of production costs, including addresses and phone numbers of record pressing plants, and even their own Camden squat address for feedback.\nWhilst on a UK tour with Gang of Four and Joy Division, Gartside was overcome by the pressures of stage fright and anxiety, leading to what was originally thought to be his first heart attack, but what was really a panic attack at the age of 23. To recover from ill health, he retreated to his native Wales and began writing an album that was to be heavily influenced by the R&B and New York City sound he was listening to.\nGartside recorded a demo of one of his new songs, \"The 'Sweetest Girl'\", in January 1981, and the song was included on the C81 cassette compilation obtained with tokens from the March issues of NME. The song – which features Robert Wyatt on keyboards – received strong reviews. It was cited by The New York Times as one of the ten best singles of the year, but the track did not get a wide release for ten months, by which time momentum was lost, and it only achieved a minor placing in the UK Singles Chart at No. 64. The single was later covered by pop band Madness, with their version reaching No. 35 in the UK singles chart in 1986. Drummer Tom Morley departed Scritti Politti in November 1981.\nThe 'Sweetest Girl' prompted many major labels to offer Gartside record contracts, but he decided to stay with Rough Trade Records. The 'Sweetest Girl' marked a stylistic change toward the more melodic, and was followed by minor hits \"Faithless\" (UK No. 56) and double A-side \"Asylums in Jerusalem\" / \"Jacques Derrida\" (UK No. 43). In a retrospective review, \"Asylums in Jerusalem\" was described by Allmusic journalist Stewart Mason as \"a slick piece of reggae-tinged synth-pop with a twangy electronic bass line and a new playfulness in Green Gartside's politically motivated lyrics.\" The song Jacques Derrida was influenced by Gartside's reading of deconstruction and the work of semiotic analysis from the French philosopher Derrida.\n\nThe debut album, Songs to Remember, was released on Rough Trade in August 1982. Displaying Gartside's previously hidden reggae influence, it was a critical and commercial success, reaching No. 12 in the UK Albums Chart. One of Rough Trade's most unlikely success stories, the album became their biggest selling release to date. Also during this period, Gartside recorded a duet with Annie Lennox on the Eurythmics track \"Wrap It Up\", for their Sweet Dreams (Are Made of This) album released in early 1983.\nGartside became influenced by the new sounds coming out of New York City, especially hip hop. He signed with Virgin Records in 1983 (and with Warner Bros. in the US.) The original line-up was disbanded and Gartside moved to New York.\nCollaborating with veteran producer Arif Mardin, David Gamson and Fred Maher, the first recording to emerge from these sessions was the single: \"Wood Beez (Pray Like Aretha Franklin)\". Released in April 1984, \"Wood Beez\" was an immediate UK hit, peaking at No. 10, and was also successful in Australia, charting at No. 25, and in New-Zealand where it reached No. 26. A series of intricately programmed dance/soul-style hits followed, including \"Absolute\" (UK No. 17), \"Hypnotize\" (UK No. 68 and No. 43 on the US Dance Charts) and the reggae-styled \"The Word Girl\", which became Scritti Politti's biggest UK hit single, climbing to No. 6 in May 1985.\nIn June 1985, Scritti Politti released their second (and most successful) album, Cupid & Psyche 85, with songs produced by Arif Mardin and performances by numerous session musicians. The LP was a Top 5 hit in the UK and also sold well in the US. In addition to the four already released singles, the album included the song, \"Perfect Way\". It was only a minor hit when released in the UK (No. 48) but it became the band's biggest US single, peaking at No. 11.\nThe personnel for the Cupid and Psyche '85 album differed from that of their first album, and featured keyboardist David Gamson and ex-Material drummer Fred Maher, both of whom would collaborate with Gartside on songwriting and production duties. Arif Mardin would also produce three songs for the album. Stylistically, the songs on the album feature dense timbral counterpoint (in fact, nearly every song on the album), using synthesizer chords and effects (as well as \"real\" instruments), programmed largely by David Gamson, creating a style that they would refine in their next album. In the US, \"Wood Beez\" was re-released as the follow-up single to \"Perfect Way\", but it only managed to hit No. 91 (it had previously hit No. 4 on the US Dance Charts in late 1984).\n\nIn 1986, Gartside and Gamson wrote and produced \"Love of a Lifetime\" for Chaka Khan, which appeared on her Destiny album. The same year they also collaborated to write the title track for Al Jarreau's album, L is For Lover.\nIn 1987, Scritti Politti appeared on the Who's That Girl soundtrack with the song \"Best Thing Ever\". This track also appeared on the next Scritti Politti album, 1988's Provision, which continued Gartside's development into synth-funk as well as reggae and other styles. The roster of session players became even more notable, including contributions from Roger Troutman, Marcus Miller and Miles Davis, who performed on the single \"Oh Patti (Don't Feel Sorry For Loverboy)\", a UK No. 13 hit. However, although the album charted in the Top 10 in the UK (No. 8), it did not match the commercial success of Cupid and Psyche '85 in the US, stalling at No. 113.They hit the UK charts again in 1991 with their cover of The Beatles' song, \"She's a Woman\", which featured guest vocals from Shabba Ranks and a remix version by William Orbit. It became Scritti Politti's final UK Top 20 single, peaking at No. 20. This was swiftly followed by the release of \"Take Me in Your Arms And Love Me\"', a cover of the Gladys Knight song, featuring guest vocals from Sweetie Irie, which failed to chart inside the Top 40. A corresponding album never materialised, with Gartside deciding on another hiatus.\nThe hip hop inspired album Anomie and Bonhomie was released in 1999, and involved even more session artists. The now bearded Gartside dived directly into the now commercially accessible hip hop scene, borrowing tradesmen of the genre such as Mos Def and Jimahl amongst others. While considered by many critics to be a return to form, the album was not as commercially successful as their previous output, reaching only No. 33 on the UK Albums Chart.In 2003, Gartside appeared on Kylie Minogue's album Body Language, duetting on the Emiliana Torrini co-write \"Someday\".\n\nIn February 2005, Rough Trade released Early, a compilation album of Scritti Politti's earliest recordings.\nIn early January 2006, Gartside and a new incarnation of Scritti Politti, billed as 'Double G and The Traitorous 3', played a show in Brixton. This was Gartside's first live appearance since 1980. This band, including journalist/musician Rhodri Marsden on keyboards and Dicky Moore on guitar, played a number of concerts previewing a new album, White Bread, Black Beer, which was released on Rough Trade on 29 May 2006. Later that year, White Bread, Black Beer was nominated for the Mercury Music Prize, and gained critical praise.\nThe current line-up toured worldwide (under the Scritti Politti name) on the back of the album's success, and completed a UK tour in November 2006. They appeared at the Bestival music festival in September 2006, and at Summer Sonic Festival in Japan. On 19 December, they played a short set at the Rough Trade Christmas party in London.\n\nIn 2007, Gartside worked on an album with Alexis Taylor, the singer with Hot Chip. The pair met at the Mercury Music Prize ceremony, and played a concert supporting Kieran Hebden and Steve Reid at KOKO in London in March 2007.\n\nGartside joined 'Way to Blue: The Songs of Nick Drake', a 2008 UK and Australian tour featuring interpretations of Nick Drake's songs by amongst others, Robyn Hitchcock, Lisa Hannigan and Teddy Thompson. A subsequent live 15-track CD was released, including Gartside's version of Drake's \"Fruit Tree\".\n\nIn 2009, Gartside participated in 'Very Cellular Songs', a concert at The Barbican celebrating the music of The Incredible String Band, featuring Richard Thompson, Kamila Thompson, Alasdair Roberts, and Dr. Strangely Strange.\n\nOn 28 February 2011, Absolute, a compilation of singles and album tracks was released, with two new tracks both written with David Gamson: \"Day Late and a Dollar Short\" and \"A Place We Both Belong\". Gamson played a part in the recording of both Cupid & Psyche 85 and Provision.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1978",
      "country": "Leeds, England, UK",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1978",
      "gender": "Male",
      "genre": "New Wave",
      "id": "123903",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/scritti-politti-53218752dc088.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://www.theaudiodb.com/images/media/Artist/fanart/0o7bo31741271438.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://www.theaudiodb.com/images/media/Artist/fanart/aznd2x1741271458.jpg",
          "width": 1920
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/bwjdi41687947466.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "Philosophical",
      "music_videos": null,
      "musicbrainz_id": "a2588b38-6532-4186-b0c8-9aff306d56f5",
      "name": "Scritti Politti",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "spotify_id": "59luKpdal8UwxcuLJNoKwS",
  "spotify_url": "https://open.spotify.com/artist/59luKpdal8UwxcuLJNoKwS",
  "updated_at": "2025-07-08T20:55:37.826649",
  "wikipedia_url": null
}