{
  "apple_music_id": "3085067",
  "apple_music_url": "https://music.apple.com/gb/artist/dennis-wilson/3085067",
  "biography": "Dennis Carl Wilson (December 4, 1944 – December 28, 1983) was an American drummer, singer and songwriter. He is best known as a founding member of the rock band The Beach Boys, alongside his brothers, Brian and Carl, cousin, Mike Love, and Al Jardine. Wilson was a member of the band from its formation until his death in 1983, recording twenty-four studio albums. In 1977, he released a solo album, Pacific Ocean Blue, to widespread critical acclaim.\nBorn in Inglewood, California, Dennis was the middle brother of fellow Beach Boys members Brian Wilson and Carl Wilson. Dennis Wilson was also the only regular surfer of the group, and his personal life exemplified the beach lifestyle that the group's early songs often celebrated. His prominence in the group as a writer and lead vocalist increased as their careers went on into the late 1960s and 1970s.\n\nChildhood years\nWilson was the son of Audree Neva (née Korthof) and Murry Gage Wilson. He spent his family years with his brothers and parents in Hawthorne, California. Dennis' role in the family dynamic, which he himself acknowledged, was that of the black sheep. Though anxiety-filled and aggressive at times, he was also sensitive and generous. He was the most often spanked of the Wilson brothers, by their strong-willed father Murry. Possessed with an abundance of physical energy and a combative nature, Dennis often refused to participate in family singalongs, and likewise avoided vocalizing on the early recordings made by Brian on a portable tape recorder. However, Dennis would sing with his brothers late at night in their shared bedroom on a song Brian later recalled as \"our special one we'd sing,\" titled \"Come Down, Come Down from the Ivory Tower.\" Brian noted of the late night brotherly three-part harmonies: \"We developed a little blend which aided us when we started to get into the Beach Boys stuff.\"\n\nThe Beach Boys\nDennis' mother, Audree, forced Brian to include Dennis in the original lineup of the Beach Boys. Urged by older cousin, Mike Love, Dennis had approached Brian to form a group and compose a song about surfing. The Beach Boys formed in August 1961 and were successful immediately (Murry having taken over guidance of the group as manager). Though the Beach Boys were named for, and developed, an image based on the California surfing culture, Dennis was the only actual surfer in the band.\nDuring the first few years of the Beach Boys, Dennis was given the role of the drummer by his brother, Brian. He quickly learned the basics of drumming at school lessons, and like the other members, he picked up more on the job. Brian Wilson took note of Dennis's limited drumming technique early on and as the mid-60s approached, often hired session drummers such as Hal Blaine to perform on studio recordings (additionally substituting all other players at one time or another, under the demand for the band members on tour). Dennis accepted this situation with equanimity, generally giving high praise to his older brother's work as Brian's compositions became more mature and complex. However, he did have his own stick style; in 1970, at the height of the band's UK popularity, a New Musical Express writer used the phrase, \"as crisp as a Dennis Wilson rim shot.\" Although he rarely sang backing vocals on stage, occasionally taking a lead, his raspy-sounding vocals were a key ingredient to the group's vocal blend in the studio, and in the late Sixties and Seventies his lead vocals lent a much-needed bluesy edge to an updating the Beach Boys' sound, giving their music new dimensions on the retreat of brother Brian's influence in composing and studio production.\nThough given few important lead vocals on the early Beach Boys recordings (\"Little Girl (You're My Miss America)\" and \"This Car of Mine\" as well as the bridge verse on \"Girls on the Beach\") he sang lead on \"Do You Wanna Dance?\", the group's February 1965 hit. Later that year on Beach Boys' Party!, Dennis sang an impressive, faithful rendition of The Beatles' \"You've Got to Hide Your Love Away.\" He accompanied himself on guitar and like the other Beach Boys became a multi-instrumentalist. His piano playing and composing in particular was praised by Daryl Dragon, his frequent collaborator in the late Sixties and early Seventies and was showcased on his Pacific Ocean Blue album.\nAlthough he had helped Brian write a few other songs dating back to 1963 at the age of 18, Dennis Wilson's first major released composition was \"Little Bird,\" the B-side of the \"Friends\" single, coupled with \"Be Still\", also a paean to nature and reflecting on his place in the natural world of which his surfing hobby was only a minuscule part. All at once, aged 23, he revealed a fully matured style that had obviously been incubating inside for some time, away from the other members of the band. From 1968 to 1973, as Brian withdrew more and more from active participation with his group, Dennis stepped up as the major creative force of the Beach Boys, having learnt production techniques from observing his brother and showing cosmic-gothic overtones in composing (influenced by Richard Wagner). At least two of his songs were included on all but one of the six albums released in that five-year period, peaking with four songs on each of 20/20 and Sunflower. When certain territorial jealousies arose within the band over his growing role (as with George Harrison in the Beatles), he began to hold back songs for his own projected solo albums.\nWilson had further compositions featured on later Beach Boys albums such as 20/20 (1969), Sunflower (1970), Carl and the Passions – \"So Tough\" (1972), Holland (1973) as well as others. Sunflower included the track \"Forever,\" which not only was popular with fans but also earned him some much sought praise from brother Brian and father Murry. The album included three other songs written by Wilson which were not originally recorded for the album.\nIn 1971, Dennis injured his hand badly enough to prevent him from playing drums for some time, and Ricky Fataar took over as the group's drummer between 1972 and 1974. During this period Dennis acted as a co-frontman alongside Mike Love, as well as playing keyboards and singing. The 1973 live album The Beach Boys in Concert features only Dennis onstage among thousands of fans on the album cover; however, none of his songs were included in the lineup.\nDuring the three-year recording hiatus following Holland, Dennis's voice deteriorated markedly. By then his onstage antics (including streaking) occasionally disrupted the Beach Boys' live shows.\nIn 1974, concurrent with the success of the '60s hits compilation Endless Summer, Wilson returned to his role behind the drums. According to Dennis's biographer, Jon Stebbins, it was this year that he co-wrote the lyrics and modified part of the melody of \"You Are So Beautiful\" at a party with Billy Preston.\n\nCharles Manson\nSee also: Charles Manson: Involvement with Wilson, Melcher, et al.\nIn 1968, Dennis Wilson was driving through Malibu when he noticed two female hitchhikers, Patricia Krenwinkel and Ella Jo Bailey. He picked them up and dropped them off at their destination. Later on Wilson noticed the same two girls hitchhiking again. This time he took them to his home at 14400 Sunset Boulevard near Will Rogers Park. Wilson then went to a recording session. When he returned at around 3 a.m., he was met in his driveway by a stranger, Charles Manson. When Wilson walked into his home, about a dozen people were occupying the premises, most of them female. Wilson became fascinated by Manson and his followers; the \"Manson Family\" lived with Wilson for a period of time afterwards at his expense.\nInitially impressed by Manson's songwriting talent, Wilson introduced him to a few friends in the music business, including Terry Melcher (the son of Doris Day), whose home at 10050 Cielo Drive would later be rented by director Roman Polanski and his wife, actress Sharon Tate, and Manson family members would later murder Tate and several others at the home.\nManson held recording sessions at the home studio of Dennis' brother, Brian Wilson. Those recordings, if they exist, have never been released. The Beach Boys released a Manson song, originally titled \"Cease To Exist\" but reworked as \"Never Learn Not To Love\", as a single B-side and on the album 20/20.\nAs Dennis Wilson became increasingly aware of Manson's volatile nature and growing tendency to violence, he finally made a break from the friendship by simply moving out of the house and leaving Manson there. When Manson subsequently sought further contact (and money), he left a bullet with Wilson's housekeeper to be delivered with a cryptic message, which Wilson perceived as a threat.\nIn August 1969, Manson Family members perpetrated the Tate/LaBianca murders. Wilson rarely discussed his involvement with the Manson Family, and usually became upset when the subject was broached.\nMovie role\nDennis Wilson starred alongside James Taylor and Warren Oates in the critically acclaimed film Two-Lane Blacktop (1971) as \"The Mechanic\". The film depicts \"The Driver\" (Taylor) and \"The Mechanic\" driving aimlessly across the United States in their 1955 Chevy, surviving on money earned from street drag racing.\nSolo career\nEarly in 1963, Dennis teamed with Brian's former collaborator Gary Usher, a neighbor in Hawthorne who became a prolific creative figure in surf music recording, and later, folk. As a duo writing, producing and performing and calling themselves the Four-Speeds, they released the single \"RPM\"/\"My Stingray\". Both sides got top four-star ratings in \"Billboard\" reviews mid-March '63 and turned out popular enough locally and in spots cross-country to earn and lose Denny, in a drunk-driving crash, a Chevy Corvair sports car. On December 4, 1970, Wilson released his first piece of solo material, a little-known single released only in Europe and the UK under the name \"Dennis Wilson & Rumbo.\" The single featured \"Sound of Free\", on his usual theme of freedom, on the A-side with the romantic \"Lady\" (also known as \"Fallin' In Love\") on the B-side. The song was later covered by American Spring and released as the B-side to their single \"Shyin' Away.\"\nPacific Ocean Blue\nWilson released his debut solo album Pacific Ocean Blue in 1977. His collaborators on the album included Daryl Dragon (the 'Captain' of Captain & Tennille) and Gregg Jakobson. The album peaked at #96 in the U.S. and sold around 300,000 copies, matching that year's Beach Boys album Love You. Dates were booked for a Dennis Wilson solo tour but these were ultimately cancelled. However, Wilson did occasionally perform his solo material on the 1977 Beach Boys tour. Despite Wilson himself claiming the album had \"no substance,\" Pacific Ocean Blue performed well critically and continues to maintain a cult following. Wilson's trademark gravelly and melancholy vocals resonate throughout the work. The album was out of print for more than a decade before being reissued in June 2008. The expanded Sony Legacy edition was voted the 2008 Reissue of the Year in both Rolling Stone and Mojo magazines and made #16 on the British LP charts and #8 and both the Billboard Catalog chart and the Billboard Internet Sales chart.\nBambu\nPacific Ocean Blue's follow-up, Bambu, began production in the year 1978 at Brother Studios in Santa Monica with the collaboration of then Beach Boys keyboardist and Dennis's close friend Carli Muñoz as songwriter and producer. The first four songs that were officially recorded for Bambu were Muñoz's compositions: \"It's Not Too Late\", \"Constant Companion\", \"All Alone\", and \"Under The Moonlight\"; they appear on the final 2008 release. The project was initially scuttled by lack of financing and the distractions of simultaneous Beach Boys projects. Bambu was officially released in 2008 along with the Pacific Ocean Blue reissue.\nTwo songs from the Bambu sessions, \"Love Surrounds Me\" and \"Baby Blue,\" were lifted for the Beach Boys' 1979 L.A. (Light Album). Wilson and brother Brian also recorded together apart from the Beach Boys in 1980 and 1981. These sessions remain unreleased though widely bootlegged as The Cocaine Sessions.\n\nPersonal life\nAt the time of his death, Wilson was married to (but separated from) Shawn Marie Love (born Shawn Marie Harris on 30th December 1964), the mother of his son Gage, born September 3rd 1982. Shawn Marie died aged 38 in September 2003 of liver cancer. Wilson's previous marriages were to Carole Freedman, with whom he had a daughter, Jennifer and whose son, Scott, he adopted; and Barbara Charren, with whom he had two sons, Michael and Carl. Wilson also was married twice to Karen Lamm, the ex-wife of Chicago keyboardist Robert Lamm, once in 1976 and again in 1978. Wilson was quoted in the sleeve notes for the album All Summer Long:\n“\tThey say I live a fast life. Maybe I just like a fast life. I wouldn’t give it up for anything in the world. It won’t last forever, either. But the memories will.\t”\nDennis also had a significant relationship with Christine McVie from 1979 to 1981.\n\nDeath\nSucceeding years saw Wilson battling alcohol abuse. Smoking had taken a toll on his voice, although the resultant gravelly effect helped define him as a singer. On December 28, 1983, shortly after his 39th birthday, Wilson drowned at Marina Del Rey, Los Angeles, after drinking all day and diving in the afternoon to recover items he had thrown overboard at the marina from his yacht three years prior.\nDennis Wilson's body was buried at sea off the California coast (coordinates 33° 53.9 N, 118° 38.8 W) by the U.S. Coast Guard on January 4, 1984. His song \"Farewell My Friend\" was played at the funeral. As non-veterans of the Coast Guard and Navy are not allowed to be buried at sea unless cremated, Dennis' burial was possible due to the intervention of President Reagan. (3 Jan 1984, New York Times link)",
  "country": null,
  "created_at": "2025-07-05T17:19:52.839395",
  "discogs_id": "391245",
  "discogs_url": "https://www.discogs.com/artist/391245-Dennis-Wilson-2",
  "followers": 46025,
  "formed_date": null,
  "genres": [
    "Rock",
    "pop",
    "rock",
    "classic rock",
    "California",
    "Surf"
  ],
  "id": "dennis-wilson-1751732395",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music/4e/06/7d/mzi.kqioeodl.jpg/2000x2000ac.jpg",
      "width": 2000
    },
    {
      "height": 810,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/be4685b5a9fc613afde142972afb3016ff5ce3a1",
      "width": 1000
    },
    {
      "height": 518,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/b8707ef758e93ac01e82271365c1737f8dff3038",
      "width": 640
    },
    {
      "height": 162,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/509f774a36325f1f69afc5fe3c2ef592d86562cb",
      "width": 200
    },
    {
      "height": 52,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/6edfb76926944644aae3126c53d02f0ca896499e",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/yxtqwy1445877955.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/kizwr61665935889.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/ymsy8RxQHd07jKMse208MdKqL3o-KUEIFYQ1-GkTl4U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "86b9a4b4-b6a6-4cb3-973c-af4ed2863350",
  "lastfm_url": "https://www.last.fm/music/Dennis+Wilson",
  "local_images": {
    "hi-res": "../public/artist/dennis-wilson/dennis-wilson-hi-res.jpg",
    "medium": "../public/artist/dennis-wilson/dennis-wilson-medium.jpg",
    "small": "../public/artist/dennis-wilson/dennis-wilson-small.jpg"
  },
  "name": "Dennis Wilson",
  "popularity": 35,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='3085067', url='https://music.apple.com/gb/artist/dennis-wilson/3085067', name='Dennis Wilson', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Music/4e/06/7d/mzi.kqioeodl.jpg/2000x2000ac.jpg', genres=['Rock'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '3085067', 'type': 'artists', 'href': '/v1/catalog/gb/artists/3085067', 'attributes': {'name': 'Dennis Wilson', 'genreNames': ['Rock'], 'artwork': {'width': 600, 'height': 600, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Music/4e/06/7d/mzi.kqioeodl.jpg/{w}x{h}ac.jpg', 'bgColor': 'e8e8d0', 'textColor1': '000000', 'textColor2': '231612', 'textColor3': '2e2e29', 'textColor4': '4a4038'}, 'url': 'https://music.apple.com/gb/artist/dennis-wilson/3085067'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/3085067/albums', 'data': [{'id': '457508820', 'type': 'albums', 'href': '/v1/catalog/gb/albums/457508820'}, {'id': '1459123728', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1459123728'}, {'id': '283132311', 'type': 'albums', 'href': '/v1/catalog/gb/albums/283132311'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "391245",
      "images": [
        {
          "height": 421,
          "resource_url": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/ymsy8RxQHd07jKMse208MdKqL3o-KUEIFYQ1-GkTl4U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 312,
          "resource_url": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/5md9EqZ4qnpJI0z7O39oPD6azwj4J4BDRB_oyIBll94/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
          "width": 360
        },
        {
          "height": 193,
          "resource_url": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/2zP75lWZTkE8Q5YKbryk2LNPQm_V71ihASi51PijFDo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
          "width": 262
        },
        {
          "height": 223,
          "resource_url": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
          "uri150": "https://i.discogs.com/IUKRmH86jBKTf4slQhS0n4r3GSr0uvxW2z4M6sajJYw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
          "width": 226
        },
        {
          "height": 276,
          "resource_url": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
          "uri150": "https://i.discogs.com/-1LUFts61cqgG10Lnf19YVmx_BRVGQLVuIsKcTVMM80/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
          "width": 180
        },
        {
          "height": 905,
          "resource_url": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/NpU6wRUMRU8cGpKlZADr3zsmmS2HgOtJYZb385N6OQc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 454,
          "resource_url": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/2xUWVv8DLSqczspKgVEBLJjTO6oT1CY_i3RLg_sik7M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
          "width": 307
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/EJtGp0fM9oZPTqPsNROzg7a47XwHKc4PxgZL-jS2wKA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 194,
          "resource_url": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
          "uri150": "https://i.discogs.com/oKEefUV2QJnWzd2K-cNSEkKtYhofKIyyTXJA7RDpcjc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
          "width": 259
        },
        {
          "height": 493,
          "resource_url": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/zolKCqnJmJh8MYK1R-zfil6TsPwyVN-B0asmECTvm3k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
          "width": 354
        },
        {
          "height": 553,
          "resource_url": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/owZcw0isOAWmgt_gysp6_pmnPQKO1Myo_YvqiiHWPXA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
          "width": 321
        },
        {
          "height": 595,
          "resource_url": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/h0ymbiqttNJJWa1C3h5sm8DCYsQHpWmO29_qxrEyERE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
          "width": 527
        },
        {
          "height": 331,
          "resource_url": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/f29s4fCw_J3DVsOmmYFBz12VGiPfUJYl6erpzU0987c/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
          "width": 269
        },
        {
          "height": 183,
          "resource_url": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/GjsTpaT91jdvijdyN16NEp9P3gZ1pZT40Oq8ImTvAMs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
          "width": 275
        },
        {
          "height": 200,
          "resource_url": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/3xd1xC5vcgP7dkcKYaDqmfnO7uafyB70JAIS5fPHuKo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
          "width": 184
        },
        {
          "height": 370,
          "resource_url": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/Q8s2NGBWRCw5AxcBa33Bc-U_KWM4P57rRmE21t2LjLY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
          "width": 260
        },
        {
          "height": 286,
          "resource_url": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/WmrhaOGk1DDTt1BuPHb9qn_fy66isYVxKqTGW3e4J84/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
          "width": 252
        },
        {
          "height": 257,
          "resource_url": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/FwGWpZ7E7o5axJWYwuiOV6ibkhWnOLPGppw9Dg_kCR8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
          "width": 263
        }
      ],
      "members": [],
      "name": "Dennis Wilson (2)",
      "namevariations": [
        "C. Wilson",
        "Carl B. Wilson",
        "Charles Manson",
        "D Wilson",
        "D.  Wilson",
        "D. WIlson",
        "D. Wilsom",
        "D. Wilson",
        "D. Wison",
        "D.Wilson",
        "DW",
        "Dave Wilson",
        "Dennis",
        "Dennis C. Wilson",
        "Dennis Carl Wilson",
        "Dennis Wilosn",
        "Dennis Wilson",
        "Taylor Hawkins",
        "WIlson",
        "Wilson"
      ],
      "profile": "Dennis Wilson (born December 4, 1944, Inglewood, California, USA – died December 28, 1983, Marina del Rey, California, USA) was an American musician, singer, and songwriter who co-founded [a70829] along with his brothers [url=https://www.discogs.com/artist/189718-Brian-Wilson]Brian[/url], [url=https://www.discogs.com/artist/260571-Carl-Wilson]Carl[/url] and cousin [a372789]. Son of [a363017] and [a3239364]. Uncle of [a434651] and [a413862].\r\n\r\nDennis served mainly on drums and backing vocals for The Beach Boys from the bands formation in 1961, until his death in 1983. While he was allowed few lead vocals in the 1960's, his prominence as a singer-songwriter increased into the 1970's. He was also known for his brief association in the late 1960's with aspiring songwriter [a58562], who was later convicted of murder conspiracy. In 1971, Dennis starred in the road movie [i]Two-Lane Blacktop[/i]. \r\n\r\nDennis drowned at Marina Del Rey, Los Angeles, after drinking all day and then diving in the afternoon, to recover items he had thrown overboard at the marina from his yacht three years prior.\r\n\r\nHe was married [a=Karen Lamm] twice — first in 1976 and again in 1978.",
      "raw_data": {
        "aliases": [
          {
            "id": 8704813,
            "name": "Bob Delgado & Denis Di Danato",
            "resource_url": "https://api.discogs.com/artists/8704813",
            "thumbnail_url": ""
          }
        ],
        "data_quality": "Needs Vote",
        "groups": [
          {
            "active": false,
            "id": 70829,
            "name": "The Beach Boys",
            "resource_url": "https://api.discogs.com/artists/70829",
            "thumbnail_url": "https://i.discogs.com/6goVnljroLwrxfzYkgul_-_GeH1Gp-xd2VFwAvLkmL8/rs:fit/g:sm/q:40/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcwODI5/LTE2Mzc4Njk1ODMt/MjcxOC5qcGVn.jpeg"
          }
        ],
        "id": 391245,
        "images": [
          {
            "height": 421,
            "resource_url": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/ymsy8RxQHd07jKMse208MdKqL3o-KUEIFYQ1-GkTl4U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 312,
            "resource_url": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/5md9EqZ4qnpJI0z7O39oPD6azwj4J4BDRB_oyIBll94/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
            "width": 360
          },
          {
            "height": 193,
            "resource_url": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/2zP75lWZTkE8Q5YKbryk2LNPQm_V71ihASi51PijFDo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
            "width": 262
          },
          {
            "height": 223,
            "resource_url": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
            "uri150": "https://i.discogs.com/IUKRmH86jBKTf4slQhS0n4r3GSr0uvxW2z4M6sajJYw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
            "width": 226
          },
          {
            "height": 276,
            "resource_url": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
            "uri150": "https://i.discogs.com/-1LUFts61cqgG10Lnf19YVmx_BRVGQLVuIsKcTVMM80/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
            "width": 180
          },
          {
            "height": 905,
            "resource_url": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/NpU6wRUMRU8cGpKlZADr3zsmmS2HgOtJYZb385N6OQc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 454,
            "resource_url": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/2xUWVv8DLSqczspKgVEBLJjTO6oT1CY_i3RLg_sik7M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
            "width": 307
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/EJtGp0fM9oZPTqPsNROzg7a47XwHKc4PxgZL-jS2wKA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 194,
            "resource_url": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
            "uri150": "https://i.discogs.com/oKEefUV2QJnWzd2K-cNSEkKtYhofKIyyTXJA7RDpcjc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
            "width": 259
          },
          {
            "height": 493,
            "resource_url": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/zolKCqnJmJh8MYK1R-zfil6TsPwyVN-B0asmECTvm3k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
            "width": 354
          },
          {
            "height": 553,
            "resource_url": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/owZcw0isOAWmgt_gysp6_pmnPQKO1Myo_YvqiiHWPXA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
            "width": 321
          },
          {
            "height": 595,
            "resource_url": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/h0ymbiqttNJJWa1C3h5sm8DCYsQHpWmO29_qxrEyERE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
            "width": 527
          },
          {
            "height": 331,
            "resource_url": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/f29s4fCw_J3DVsOmmYFBz12VGiPfUJYl6erpzU0987c/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
            "width": 269
          },
          {
            "height": 183,
            "resource_url": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/GjsTpaT91jdvijdyN16NEp9P3gZ1pZT40Oq8ImTvAMs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
            "width": 275
          },
          {
            "height": 200,
            "resource_url": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/3xd1xC5vcgP7dkcKYaDqmfnO7uafyB70JAIS5fPHuKo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
            "width": 184
          },
          {
            "height": 370,
            "resource_url": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/Q8s2NGBWRCw5AxcBa33Bc-U_KWM4P57rRmE21t2LjLY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
            "width": 260
          },
          {
            "height": 286,
            "resource_url": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/WmrhaOGk1DDTt1BuPHb9qn_fy66isYVxKqTGW3e4J84/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
            "width": 252
          },
          {
            "height": 257,
            "resource_url": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/FwGWpZ7E7o5axJWYwuiOV6ibkhWnOLPGppw9Dg_kCR8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
            "width": 263
          }
        ],
        "name": "Dennis Wilson (2)",
        "namevariations": [
          "C. Wilson",
          "Carl B. Wilson",
          "Charles Manson",
          "D Wilson",
          "D.  Wilson",
          "D. WIlson",
          "D. Wilsom",
          "D. Wilson",
          "D. Wison",
          "D.Wilson",
          "DW",
          "Dave Wilson",
          "Dennis",
          "Dennis C. Wilson",
          "Dennis Carl Wilson",
          "Dennis Wilosn",
          "Dennis Wilson",
          "Taylor Hawkins",
          "WIlson",
          "Wilson"
        ],
        "profile": "Dennis Wilson (born December 4, 1944, Inglewood, California, USA – died December 28, 1983, Marina del Rey, California, USA) was an American musician, singer, and songwriter who co-founded [a70829] along with his brothers [url=https://www.discogs.com/artist/189718-Brian-Wilson]Brian[/url], [url=https://www.discogs.com/artist/260571-Carl-Wilson]Carl[/url] and cousin [a372789]. Son of [a363017] and [a3239364]. Uncle of [a434651] and [a413862].\r\n\r\nDennis served mainly on drums and backing vocals for The Beach Boys from the bands formation in 1961, until his death in 1983. While he was allowed few lead vocals in the 1960's, his prominence as a singer-songwriter increased into the 1970's. He was also known for his brief association in the late 1960's with aspiring songwriter [a58562], who was later convicted of murder conspiracy. In 1971, Dennis starred in the road movie [i]Two-Lane Blacktop[/i]. \r\n\r\nDennis drowned at Marina Del Rey, Los Angeles, after drinking all day and then diving in the afternoon, to recover items he had thrown overboard at the marina from his yacht three years prior.\r\n\r\nHe was married [a=Karen Lamm] twice — first in 1976 and again in 1978.",
        "realname": "Dennis Carl Wilson",
        "releases_url": "https://api.discogs.com/artists/391245/releases",
        "resource_url": "https://api.discogs.com/artists/391245",
        "uri": "https://www.discogs.com/artist/391245-Dennis-Wilson-2",
        "urls": [
          "https://en.wikipedia.org/wiki/Dennis_Wilson"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/391245",
      "thumb": "https://i.discogs.com/ymsy8RxQHd07jKMse208MdKqL3o-KUEIFYQ1-GkTl4U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
      "url": "https://www.discogs.com/artist/391245-Dennis-Wilson-2",
      "urls": [
        "https://en.wikipedia.org/wiki/Dennis_Wilson"
      ]
    },
    "lastfm": "ArtistLastFmData(name='Dennis Wilson', url='https://www.last.fm/music/Dennis+Wilson', mbid='86b9a4b4-b6a6-4cb3-973c-af4ed2863350', listeners=165454, playcount=2108511, bio_summary='There are multiple artists named Dennis Wilson:\\n\\n1) American singer-songwriter, musician; founding member of The Beach Boys.\\n2) British composer.\\n---\\n1) Dennis Carl Wilson (December 4, 1944 - December 28, 1983) was an American singer, songwriter, and musician, best known as one of the founding members of The Beach Boys alongside brothers Brian and Carl. The group\\'s drummer and occasional lead singer for much of his life, easily recognized by his bluesy and raspy voice, he later grew to become a gifted songwriter and multi-instrumentalist. <a href=\"https://www.last.fm/music/Dennis+Wilson\">Read more on Last.fm</a>', bio_content='There are multiple artists named Dennis Wilson:\\n\\n1) American singer-songwriter, musician; founding member of The Beach Boys.\\n2) British composer.\\n---\\n1) Dennis Carl Wilson (December 4, 1944 - December 28, 1983) was an American singer, songwriter, and musician, best known as one of the founding members of The Beach Boys alongside brothers Brian and Carl. The group\\'s drummer and occasional lead singer for much of his life, easily recognized by his bluesy and raspy voice, he later grew to become a gifted songwriter and multi-instrumentalist. His only solo album, Pacific Ocean Blue (1977), is regarded as perhaps the finest Beach Boys solo recording.\\n\\nBorn in Hawthorne, California to Murry and Audree Wilson, Dennis Wilson was the Wilsons\\' middle child, and a self-affirmed \"black sheep.\" A rebel from a young age, he was constantly at odds with his domineering father Murry, and would, as a consequence, be the one to suffer most from his abusive parenting techniques. As a teenager, Dennis became enamored with the burgeoning surfing scene; when the group that would become The Beach Boys was first formed, it was at Dennis\\' suggestion that they decided to capitalize on what would in short time become a national phenomenon. Thus, the idyllic notion of sun, surf, and sand that has become emblematic of the state of California, can, by and large, be attributed to the group\\'s impending nationwide and international success, foreseen by Dennis.\\n\\nAs The Beach Boys grew in popularity, Dennis quickly became the sex symbol heartthrob of the group. Ironically, at the time Dennis had little faith in his own ability as a performer, and his earliest lead vocal,  \"Little Girl (You\\'re My Miss America)\", is noticeably shy and restrained compared to his later efforts. His vocal spots would remain few and far between for the first five years of the band\\'s existence; however, his importance to the group\\'s vocal blend, as well as his lively surf-inflected drumming, was a cornerstone of the group\\'s sound. By 1965, Dennis had seemingly overcome his shyness, resulting in a star turn as lead singer of the group\\'s hit single \"Do You Wanna Dance?\". \\n\\nOn the 1966 album Beach Boys\\' Party!, an acoustic recording session recorded as a stopgap measure in order to give Brian more time to complete his ambitious Pet Sounds album, Dennis sang a cover version of The Beatles\\' \"You\\'ve Got to Hide Your Love Away\", on which he accompanied himself on guitar. By this time, he had also learned to play the piano, though it would take a while for his newfound talents to be put to use in the studio. As brother Brian became progressively more reliant on studio musicians, session drummers were often hired in Dennis\\' place, who by his own admission had limits to what he could do on a drum kit. He did, however, retain his position as drummer for live performances.\\n\\nAs the \\'60s progressed, Brian\\'s involvement in studio affairs became increasingly lessened as a result of personal issues. His brothers both jumped at the chance for a more active role in recording; Carl became de facto leader of the group, and Dennis composed some of his first notable songs for the 1968 album Friends. He would maintain a steady pace of new compositions, often with one or more co-writers, for the remainder of his life. The song \"Forever\", co-written with Gregg Jakobson, \"Forever\", would become Dennis\\' most enduring and iconic work, awash with Dennis\\' distinctively loving and melancholy aesthetics.\\n\\nIn the late \\'60s, Dennis became involved with Charles Manson and his \"family,\" who stayed in his house for a period of time. Dennis tried to get Manson a record deal through his music business connections, but it failed to materialize. Secretly, Dennis recorded Manson\\'s song \"Cease to Exist\" as \"Never Learn Not to Love\" for The Beach Boys\\' 1969 album 20/20, without crediting Manson. Upon learning this, Manson was incensed, and broke of all ties with Dennis (who had already come to suspect Manson\\'s ill intent and began distancing himself from Manson) not too long before the infamous Tate-LaBianca murders. Dennis\\' involvement in the affair would haunt him for the rest of his days, and he declined to answer any questions asked about this period, partially out of fear of retaliation from the \"family.\"\\n\\nFor The Beach Boys\\' then-unnamed 1971 album, Dennis recorded the song \"(Wouldn\\'t It Be Nice To) Live Again\". He wanted the song to serve as the album\\'s closing track, but his wish was vetoed by Carl in favor of \"Surf\\'s Up\"--a partially re-recorded remnant from Brian\\'s unfinished SMiLE album--which would eventually be the derivation for the album\\'s name. Hurt and frustrated, Dennis decided to leave the song off the album altogether; over four decades later, it was finally unearthed (as part of a career-spanning Beach Boys box set), instantly regarded as some of Dennis\\' finest work.\\n\\nIn 1971, Dennis co-starred in the film Two-Lane Blacktop alongside James Taylor; this would be the only acting credit for either man. Having suffered a debilitating hand injury in the early \\'70s, Dennis was by necessity replaced by Ricky Fataar as drummer. No longer stuck behind a drum kit, Dennis rose to the occasion to become co-frontman alongside Love, as well as playing keyboards and singing. During the mid-\\'70s, Dennis\\' voice deteriorated markedly as a result of smoking and drinking. His onstage antics would also become more edgy and unpredictable around this time.\\n\\nAround the mid-\\'70s, The Beach Boys split into two factions: one stuck on oldies and nostalgia (Love and Al Jardine), and one bent on progress and evolution (Dennis and Carl; brother Brian would remain a neutral party). As a result, Dennis withdrew from the group to record a solo album. Songwriting partners included Carl, Love, and Jakobson. The recording sessions were decidedly sporadic, to the point where much recording date documentation was lost, or never documented in the first place. Though Dennis dismissed Pacific Ocean Blue as having \"no substance,\" it sold surprisingly well (rivaling the recent Beach Boys album Love You in sales), and remains critically well-regarded to this day. A subsequent solo tour was planned, but ultimately cancelled; Dennis would, however, occasionally perform material from his solo album during Beach Boys live performances. \\n\\nAlmost immediately after the release of his first album, Dennis eagerly planned his follow-up, Bambu. A good number of songs were recorded, but the album never materialized due to Dennis\\' increasing financial problems, as well as commitment to Beach Boys-related projects; some of the material recorded for his second album were salvaged for use on Beach Boys albums. At the turn of the decade, Dennis had all but become persona non grata to the group he had given a sense of identity so many years before, as a result of his increasingly erratic and self-destructive behavior. Outside of the context of his former group, Dennis got together with Brian to record; though never released, their sessions together were widely bootlegged.\\n\\nOn December 25, 1983, Dennis Wilson, at the time all but homeless, drowned after diving off a pier in Marina Del Rey in search of personal items he had thrown off his boat, the Harmony, many years prior. He was granted the unique honor of a burial at sea, a privilege usually reserved for war heroes . Some of Dennis\\' songs and vocal spots are still performed by other band members to this day; during The Beach Boys\\' 50th anniversary tour, performances of \"Forever\" utilized archival video and audio footage of Dennis performing his signature song.\\n---\\n2) Dennis Miller Wilson (1920–1989) was a British pianist, composer, arranger and conductor born 16 February 1920 in Leicester.\\n\\nBiography:\\nDuring his schooldays in his native town of Leicester, Wilson played the piano for the school orchestra before he was sixteen years old. After leaving school, he played in local bands and when the Army claimed him in 1939, he was eventually posted to India where until 1946, he directed the music at one of the garrison theatres.\\n\\nHis next move was to join Harry Parry\\'s Sextet for three years, after which he featured in several of the popular bands of the period, including those of Harry Hayes and Kenny Baker. From 1949 he was free-lance with recording, radio and television orchestras and has also had much to do with film music.\\n\\nHe was with George Melachrino, Malcolm Lockyer, Peter Yorke and other well-known orchestra leaders, as well as having his own set-up for some popular radio series, such as “ Educating Archie\" and \"Pertwee\\'s Progress\". He later joined the B.B.C. Show Band and in addition played for commercial T.V. He was an outstandingly good pianist and made numerous recordings playing in combos as trio, quartet, quintet, octet and with his own orchestra. His album Dennis Plus Three was originally released in 1957 and remastered in Aug 2013.\\n\\nHe was married in 1950, lived at Beckenham, Kent and had two children - Nicholas and Penelope. His principal hobbies were sailing and gardening. He died 15 July 1989 in Cambridge.\\n\\nHe composed the theme music for a number of television series and sitcoms:\\nMarriage Lines (1961)\\nSteptoe and Son (1962) (music for some episodes, but not the theme music)\\nMeet the Wife (1963)\\nTill Death Us Do Part (1965)\\nBirds on the Wing (1971)\\nMy Wife Next Door (1972)\\nRising Damp (1974)\\nMy Honourable Mrs (1975)\\nFawlty Towers (1975 - 1979) <a href=\"https://www.last.fm/music/Dennis+Wilson\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['pop', 'rock', 'classic rock', 'California', 'Surf'], similar_artists=[{'name': 'The Beach Boys', 'url': 'https://www.last.fm/music/The+Beach+Boys'}, {'name': 'Brian Wilson', 'url': 'https://www.last.fm/music/Brian+Wilson'}, {'name': 'Bee Gees', 'url': 'https://www.last.fm/music/Bee+Gees'}, {'name': 'Todd Rundgren', 'url': 'https://www.last.fm/music/Todd+Rundgren'}, {'name': 'Harry Nilsson', 'url': 'https://www.last.fm/music/Harry+Nilsson'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Dennis Wilson', 'mbid': '86b9a4b4-b6a6-4cb3-973c-af4ed2863350', 'url': 'https://www.last.fm/music/Dennis+Wilson', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '165454', 'playcount': '2108511'}, 'similar': {'artist': [{'name': 'The Beach Boys', 'url': 'https://www.last.fm/music/The+Beach+Boys', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Brian Wilson', 'url': 'https://www.last.fm/music/Brian+Wilson', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Bee Gees', 'url': 'https://www.last.fm/music/Bee+Gees', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Todd Rundgren', 'url': 'https://www.last.fm/music/Todd+Rundgren', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Harry Nilsson', 'url': 'https://www.last.fm/music/Harry+Nilsson', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'pop', 'url': 'https://www.last.fm/tag/pop'}, {'name': 'rock', 'url': 'https://www.last.fm/tag/rock'}, {'name': 'classic rock', 'url': 'https://www.last.fm/tag/classic+rock'}, {'name': 'California', 'url': 'https://www.last.fm/tag/California'}, {'name': 'Surf', 'url': 'https://www.last.fm/tag/Surf'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Dennis+Wilson/+wiki'}}, 'published': '27 Jun 2006, 19:56', 'summary': 'There are multiple artists named Dennis Wilson:\\n\\n1) American singer-songwriter, musician; founding member of The Beach Boys.\\n2) British composer.\\n---\\n1) Dennis Carl Wilson (December 4, 1944 - December 28, 1983) was an American singer, songwriter, and musician, best known as one of the founding members of The Beach Boys alongside brothers Brian and Carl. The group\\'s drummer and occasional lead singer for much of his life, easily recognized by his bluesy and raspy voice, he later grew to become a gifted songwriter and multi-instrumentalist. <a href=\"https://www.last.fm/music/Dennis+Wilson\">Read more on Last.fm</a>', 'content': 'There are multiple artists named Dennis Wilson:\\n\\n1) American singer-songwriter, musician; founding member of The Beach Boys.\\n2) British composer.\\n---\\n1) Dennis Carl Wilson (December 4, 1944 - December 28, 1983) was an American singer, songwriter, and musician, best known as one of the founding members of The Beach Boys alongside brothers Brian and Carl. The group\\'s drummer and occasional lead singer for much of his life, easily recognized by his bluesy and raspy voice, he later grew to become a gifted songwriter and multi-instrumentalist. His only solo album, Pacific Ocean Blue (1977), is regarded as perhaps the finest Beach Boys solo recording.\\n\\nBorn in Hawthorne, California to Murry and Audree Wilson, Dennis Wilson was the Wilsons\\' middle child, and a self-affirmed \"black sheep.\" A rebel from a young age, he was constantly at odds with his domineering father Murry, and would, as a consequence, be the one to suffer most from his abusive parenting techniques. As a teenager, Dennis became enamored with the burgeoning surfing scene; when the group that would become The Beach Boys was first formed, it was at Dennis\\' suggestion that they decided to capitalize on what would in short time become a national phenomenon. Thus, the idyllic notion of sun, surf, and sand that has become emblematic of the state of California, can, by and large, be attributed to the group\\'s impending nationwide and international success, foreseen by Dennis.\\n\\nAs The Beach Boys grew in popularity, Dennis quickly became the sex symbol heartthrob of the group. Ironically, at the time Dennis had little faith in his own ability as a performer, and his earliest lead vocal,  \"Little Girl (You\\'re My Miss America)\", is noticeably shy and restrained compared to his later efforts. His vocal spots would remain few and far between for the first five years of the band\\'s existence; however, his importance to the group\\'s vocal blend, as well as his lively surf-inflected drumming, was a cornerstone of the group\\'s sound. By 1965, Dennis had seemingly overcome his shyness, resulting in a star turn as lead singer of the group\\'s hit single \"Do You Wanna Dance?\". \\n\\nOn the 1966 album Beach Boys\\' Party!, an acoustic recording session recorded as a stopgap measure in order to give Brian more time to complete his ambitious Pet Sounds album, Dennis sang a cover version of The Beatles\\' \"You\\'ve Got to Hide Your Love Away\", on which he accompanied himself on guitar. By this time, he had also learned to play the piano, though it would take a while for his newfound talents to be put to use in the studio. As brother Brian became progressively more reliant on studio musicians, session drummers were often hired in Dennis\\' place, who by his own admission had limits to what he could do on a drum kit. He did, however, retain his position as drummer for live performances.\\n\\nAs the \\'60s progressed, Brian\\'s involvement in studio affairs became increasingly lessened as a result of personal issues. His brothers both jumped at the chance for a more active role in recording; Carl became de facto leader of the group, and Dennis composed some of his first notable songs for the 1968 album Friends. He would maintain a steady pace of new compositions, often with one or more co-writers, for the remainder of his life. The song \"Forever\", co-written with Gregg Jakobson, \"Forever\", would become Dennis\\' most enduring and iconic work, awash with Dennis\\' distinctively loving and melancholy aesthetics.\\n\\nIn the late \\'60s, Dennis became involved with Charles Manson and his \"family,\" who stayed in his house for a period of time. Dennis tried to get Manson a record deal through his music business connections, but it failed to materialize. Secretly, Dennis recorded Manson\\'s song \"Cease to Exist\" as \"Never Learn Not to Love\" for The Beach Boys\\' 1969 album 20/20, without crediting Manson. Upon learning this, Manson was incensed, and broke of all ties with Dennis (who had already come to suspect Manson\\'s ill intent and began distancing himself from Manson) not too long before the infamous Tate-LaBianca murders. Dennis\\' involvement in the affair would haunt him for the rest of his days, and he declined to answer any questions asked about this period, partially out of fear of retaliation from the \"family.\"\\n\\nFor The Beach Boys\\' then-unnamed 1971 album, Dennis recorded the song \"(Wouldn\\'t It Be Nice To) Live Again\". He wanted the song to serve as the album\\'s closing track, but his wish was vetoed by Carl in favor of \"Surf\\'s Up\"--a partially re-recorded remnant from Brian\\'s unfinished SMiLE album--which would eventually be the derivation for the album\\'s name. Hurt and frustrated, Dennis decided to leave the song off the album altogether; over four decades later, it was finally unearthed (as part of a career-spanning Beach Boys box set), instantly regarded as some of Dennis\\' finest work.\\n\\nIn 1971, Dennis co-starred in the film Two-Lane Blacktop alongside James Taylor; this would be the only acting credit for either man. Having suffered a debilitating hand injury in the early \\'70s, Dennis was by necessity replaced by Ricky Fataar as drummer. No longer stuck behind a drum kit, Dennis rose to the occasion to become co-frontman alongside Love, as well as playing keyboards and singing. During the mid-\\'70s, Dennis\\' voice deteriorated markedly as a result of smoking and drinking. His onstage antics would also become more edgy and unpredictable around this time.\\n\\nAround the mid-\\'70s, The Beach Boys split into two factions: one stuck on oldies and nostalgia (Love and Al Jardine), and one bent on progress and evolution (Dennis and Carl; brother Brian would remain a neutral party). As a result, Dennis withdrew from the group to record a solo album. Songwriting partners included Carl, Love, and Jakobson. The recording sessions were decidedly sporadic, to the point where much recording date documentation was lost, or never documented in the first place. Though Dennis dismissed Pacific Ocean Blue as having \"no substance,\" it sold surprisingly well (rivaling the recent Beach Boys album Love You in sales), and remains critically well-regarded to this day. A subsequent solo tour was planned, but ultimately cancelled; Dennis would, however, occasionally perform material from his solo album during Beach Boys live performances. \\n\\nAlmost immediately after the release of his first album, Dennis eagerly planned his follow-up, Bambu. A good number of songs were recorded, but the album never materialized due to Dennis\\' increasing financial problems, as well as commitment to Beach Boys-related projects; some of the material recorded for his second album were salvaged for use on Beach Boys albums. At the turn of the decade, Dennis had all but become persona non grata to the group he had given a sense of identity so many years before, as a result of his increasingly erratic and self-destructive behavior. Outside of the context of his former group, Dennis got together with Brian to record; though never released, their sessions together were widely bootlegged.\\n\\nOn December 25, 1983, Dennis Wilson, at the time all but homeless, drowned after diving off a pier in Marina Del Rey in search of personal items he had thrown off his boat, the Harmony, many years prior. He was granted the unique honor of a burial at sea, a privilege usually reserved for war heroes . Some of Dennis\\' songs and vocal spots are still performed by other band members to this day; during The Beach Boys\\' 50th anniversary tour, performances of \"Forever\" utilized archival video and audio footage of Dennis performing his signature song.\\n---\\n2) Dennis Miller Wilson (1920–1989) was a British pianist, composer, arranger and conductor born 16 February 1920 in Leicester.\\n\\nBiography:\\nDuring his schooldays in his native town of Leicester, Wilson played the piano for the school orchestra before he was sixteen years old. After leaving school, he played in local bands and when the Army claimed him in 1939, he was eventually posted to India where until 1946, he directed the music at one of the garrison theatres.\\n\\nHis next move was to join Harry Parry\\'s Sextet for three years, after which he featured in several of the popular bands of the period, including those of Harry Hayes and Kenny Baker. From 1949 he was free-lance with recording, radio and television orchestras and has also had much to do with film music.\\n\\nHe was with George Melachrino, Malcolm Lockyer, Peter Yorke and other well-known orchestra leaders, as well as having his own set-up for some popular radio series, such as “ Educating Archie\" and \"Pertwee\\'s Progress\". He later joined the B.B.C. Show Band and in addition played for commercial T.V. He was an outstandingly good pianist and made numerous recordings playing in combos as trio, quartet, quintet, octet and with his own orchestra. His album Dennis Plus Three was originally released in 1957 and remastered in Aug 2013.\\n\\nHe was married in 1950, lived at Beckenham, Kent and had two children - Nicholas and Penelope. His principal hobbies were sailing and gardening. He died 15 July 1989 in Cambridge.\\n\\nHe composed the theme music for a number of television series and sitcoms:\\nMarriage Lines (1961)\\nSteptoe and Son (1962) (music for some episodes, but not the theme music)\\nMeet the Wife (1963)\\nTill Death Us Do Part (1965)\\nBirds on the Wing (1971)\\nMy Wife Next Door (1972)\\nRising Damp (1974)\\nMy Honourable Mrs (1975)\\nFawlty Towers (1975 - 1979) <a href=\"https://www.last.fm/music/Dennis+Wilson\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='5gl6pfPwJ1coivVUMZPiS9', url='https://open.spotify.com/artist/5gl6pfPwJ1coivVUMZPiS9', name='Dennis Wilson', popularity=35, followers=46025, genres=[], images=[{'url': 'https://i.scdn.co/image/be4685b5a9fc613afde142972afb3016ff5ce3a1', 'height': 810, 'width': 1000}, {'url': 'https://i.scdn.co/image/b8707ef758e93ac01e82271365c1737f8dff3038', 'height': 518, 'width': 640}, {'url': 'https://i.scdn.co/image/509f774a36325f1f69afc5fe3c2ef592d86562cb', 'height': 162, 'width': 200}, {'url': 'https://i.scdn.co/image/6edfb76926944644aae3126c53d02f0ca896499e', 'height': 52, 'width': 64}], external_urls={'spotify': 'https://open.spotify.com/artist/5gl6pfPwJ1coivVUMZPiS9'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/5gl6pfPwJ1coivVUMZPiS9'}, 'followers': {'href': None, 'total': 46025}, 'genres': [], 'href': 'https://api.spotify.com/v1/artists/5gl6pfPwJ1coivVUMZPiS9', 'id': '5gl6pfPwJ1coivVUMZPiS9', 'images': [{'url': 'https://i.scdn.co/image/be4685b5a9fc613afde142972afb3016ff5ce3a1', 'height': 810, 'width': 1000}, {'url': 'https://i.scdn.co/image/b8707ef758e93ac01e82271365c1737f8dff3038', 'height': 518, 'width': 640}, {'url': 'https://i.scdn.co/image/509f774a36325f1f69afc5fe3c2ef592d86562cb', 'height': 162, 'width': 200}, {'url': 'https://i.scdn.co/image/6edfb76926944644aae3126c53d02f0ca896499e', 'height': 52, 'width': 64}], 'name': 'Dennis Wilson', 'popularity': 35, 'type': 'artist', 'uri': 'spotify:artist:5gl6pfPwJ1coivVUMZPiS9'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Dennis Carl Wilson (December 4, 1944 – December 28, 1983) was an American drummer, singer and songwriter. He is best known as a founding member of the rock band The Beach Boys, alongside his brothers, Brian and Carl, cousin, Mike Love, and Al Jardine. Wilson was a member of the band from its formation until his death in 1983, recording twenty-four studio albums. In 1977, he released a solo album, Pacific Ocean Blue, to widespread critical acclaim.\nBorn in Inglewood, California, Dennis was the middle brother of fellow Beach Boys members Brian Wilson and Carl Wilson. Dennis Wilson was also the only regular surfer of the group, and his personal life exemplified the beach lifestyle that the group's early songs often celebrated. His prominence in the group as a writer and lead vocalist increased as their careers went on into the late 1960s and 1970s.\n\nChildhood years\nWilson was the son of Audree Neva (née Korthof) and Murry Gage Wilson. He spent his family years with his brothers and parents in Hawthorne, California. Dennis' role in the family dynamic, which he himself acknowledged, was that of the black sheep. Though anxiety-filled and aggressive at times, he was also sensitive and generous. He was the most often spanked of the Wilson brothers, by their strong-willed father Murry. Possessed with an abundance of physical energy and a combative nature, Dennis often refused to participate in family singalongs, and likewise avoided vocalizing on the early recordings made by Brian on a portable tape recorder. However, Dennis would sing with his brothers late at night in their shared bedroom on a song Brian later recalled as \"our special one we'd sing,\" titled \"Come Down, Come Down from the Ivory Tower.\" Brian noted of the late night brotherly three-part harmonies: \"We developed a little blend which aided us when we started to get into the Beach Boys stuff.\"\n\nThe Beach Boys\nDennis' mother, Audree, forced Brian to include Dennis in the original lineup of the Beach Boys. Urged by older cousin, Mike Love, Dennis had approached Brian to form a group and compose a song about surfing. The Beach Boys formed in August 1961 and were successful immediately (Murry having taken over guidance of the group as manager). Though the Beach Boys were named for, and developed, an image based on the California surfing culture, Dennis was the only actual surfer in the band.\nDuring the first few years of the Beach Boys, Dennis was given the role of the drummer by his brother, Brian. He quickly learned the basics of drumming at school lessons, and like the other members, he picked up more on the job. Brian Wilson took note of Dennis's limited drumming technique early on and as the mid-60s approached, often hired session drummers such as Hal Blaine to perform on studio recordings (additionally substituting all other players at one time or another, under the demand for the band members on tour). Dennis accepted this situation with equanimity, generally giving high praise to his older brother's work as Brian's compositions became more mature and complex. However, he did have his own stick style; in 1970, at the height of the band's UK popularity, a New Musical Express writer used the phrase, \"as crisp as a Dennis Wilson rim shot.\" Although he rarely sang backing vocals on stage, occasionally taking a lead, his raspy-sounding vocals were a key ingredient to the group's vocal blend in the studio, and in the late Sixties and Seventies his lead vocals lent a much-needed bluesy edge to an updating the Beach Boys' sound, giving their music new dimensions on the retreat of brother Brian's influence in composing and studio production.\nThough given few important lead vocals on the early Beach Boys recordings (\"Little Girl (You're My Miss America)\" and \"This Car of Mine\" as well as the bridge verse on \"Girls on the Beach\") he sang lead on \"Do You Wanna Dance?\", the group's February 1965 hit. Later that year on Beach Boys' Party!, Dennis sang an impressive, faithful rendition of The Beatles' \"You've Got to Hide Your Love Away.\" He accompanied himself on guitar and like the other Beach Boys became a multi-instrumentalist. His piano playing and composing in particular was praised by Daryl Dragon, his frequent collaborator in the late Sixties and early Seventies and was showcased on his Pacific Ocean Blue album.\nAlthough he had helped Brian write a few other songs dating back to 1963 at the age of 18, Dennis Wilson's first major released composition was \"Little Bird,\" the B-side of the \"Friends\" single, coupled with \"Be Still\", also a paean to nature and reflecting on his place in the natural world of which his surfing hobby was only a minuscule part. All at once, aged 23, he revealed a fully matured style that had obviously been incubating inside for some time, away from the other members of the band. From 1968 to 1973, as Brian withdrew more and more from active participation with his group, Dennis stepped up as the major creative force of the Beach Boys, having learnt production techniques from observing his brother and showing cosmic-gothic overtones in composing (influenced by Richard Wagner). At least two of his songs were included on all but one of the six albums released in that five-year period, peaking with four songs on each of 20/20 and Sunflower. When certain territorial jealousies arose within the band over his growing role (as with George Harrison in the Beatles), he began to hold back songs for his own projected solo albums.\nWilson had further compositions featured on later Beach Boys albums such as 20/20 (1969), Sunflower (1970), Carl and the Passions – \"So Tough\" (1972), Holland (1973) as well as others. Sunflower included the track \"Forever,\" which not only was popular with fans but also earned him some much sought praise from brother Brian and father Murry. The album included three other songs written by Wilson which were not originally recorded for the album.\nIn 1971, Dennis injured his hand badly enough to prevent him from playing drums for some time, and Ricky Fataar took over as the group's drummer between 1972 and 1974. During this period Dennis acted as a co-frontman alongside Mike Love, as well as playing keyboards and singing. The 1973 live album The Beach Boys in Concert features only Dennis onstage among thousands of fans on the album cover; however, none of his songs were included in the lineup.\nDuring the three-year recording hiatus following Holland, Dennis's voice deteriorated markedly. By then his onstage antics (including streaking) occasionally disrupted the Beach Boys' live shows.\nIn 1974, concurrent with the success of the '60s hits compilation Endless Summer, Wilson returned to his role behind the drums. According to Dennis's biographer, Jon Stebbins, it was this year that he co-wrote the lyrics and modified part of the melody of \"You Are So Beautiful\" at a party with Billy Preston.\n\nCharles Manson\nSee also: Charles Manson: Involvement with Wilson, Melcher, et al.\nIn 1968, Dennis Wilson was driving through Malibu when he noticed two female hitchhikers, Patricia Krenwinkel and Ella Jo Bailey. He picked them up and dropped them off at their destination. Later on Wilson noticed the same two girls hitchhiking again. This time he took them to his home at 14400 Sunset Boulevard near Will Rogers Park. Wilson then went to a recording session. When he returned at around 3 a.m., he was met in his driveway by a stranger, Charles Manson. When Wilson walked into his home, about a dozen people were occupying the premises, most of them female. Wilson became fascinated by Manson and his followers; the \"Manson Family\" lived with Wilson for a period of time afterwards at his expense.\nInitially impressed by Manson's songwriting talent, Wilson introduced him to a few friends in the music business, including Terry Melcher (the son of Doris Day), whose home at 10050 Cielo Drive would later be rented by director Roman Polanski and his wife, actress Sharon Tate, and Manson family members would later murder Tate and several others at the home.\nManson held recording sessions at the home studio of Dennis' brother, Brian Wilson. Those recordings, if they exist, have never been released. The Beach Boys released a Manson song, originally titled \"Cease To Exist\" but reworked as \"Never Learn Not To Love\", as a single B-side and on the album 20/20.\nAs Dennis Wilson became increasingly aware of Manson's volatile nature and growing tendency to violence, he finally made a break from the friendship by simply moving out of the house and leaving Manson there. When Manson subsequently sought further contact (and money), he left a bullet with Wilson's housekeeper to be delivered with a cryptic message, which Wilson perceived as a threat.\nIn August 1969, Manson Family members perpetrated the Tate/LaBianca murders. Wilson rarely discussed his involvement with the Manson Family, and usually became upset when the subject was broached.\nMovie role\nDennis Wilson starred alongside James Taylor and Warren Oates in the critically acclaimed film Two-Lane Blacktop (1971) as \"The Mechanic\". The film depicts \"The Driver\" (Taylor) and \"The Mechanic\" driving aimlessly across the United States in their 1955 Chevy, surviving on money earned from street drag racing.\nSolo career\nEarly in 1963, Dennis teamed with Brian's former collaborator Gary Usher, a neighbor in Hawthorne who became a prolific creative figure in surf music recording, and later, folk. As a duo writing, producing and performing and calling themselves the Four-Speeds, they released the single \"RPM\"/\"My Stingray\". Both sides got top four-star ratings in \"Billboard\" reviews mid-March '63 and turned out popular enough locally and in spots cross-country to earn and lose Denny, in a drunk-driving crash, a Chevy Corvair sports car. On December 4, 1970, Wilson released his first piece of solo material, a little-known single released only in Europe and the UK under the name \"Dennis Wilson & Rumbo.\" The single featured \"Sound of Free\", on his usual theme of freedom, on the A-side with the romantic \"Lady\" (also known as \"Fallin' In Love\") on the B-side. The song was later covered by American Spring and released as the B-side to their single \"Shyin' Away.\"\nPacific Ocean Blue\nWilson released his debut solo album Pacific Ocean Blue in 1977. His collaborators on the album included Daryl Dragon (the 'Captain' of Captain & Tennille) and Gregg Jakobson. The album peaked at #96 in the U.S. and sold around 300,000 copies, matching that year's Beach Boys album Love You. Dates were booked for a Dennis Wilson solo tour but these were ultimately cancelled. However, Wilson did occasionally perform his solo material on the 1977 Beach Boys tour. Despite Wilson himself claiming the album had \"no substance,\" Pacific Ocean Blue performed well critically and continues to maintain a cult following. Wilson's trademark gravelly and melancholy vocals resonate throughout the work. The album was out of print for more than a decade before being reissued in June 2008. The expanded Sony Legacy edition was voted the 2008 Reissue of the Year in both Rolling Stone and Mojo magazines and made #16 on the British LP charts and #8 and both the Billboard Catalog chart and the Billboard Internet Sales chart.\nBambu\nPacific Ocean Blue's follow-up, Bambu, began production in the year 1978 at Brother Studios in Santa Monica with the collaboration of then Beach Boys keyboardist and Dennis's close friend Carli Muñoz as songwriter and producer. The first four songs that were officially recorded for Bambu were Muñoz's compositions: \"It's Not Too Late\", \"Constant Companion\", \"All Alone\", and \"Under The Moonlight\"; they appear on the final 2008 release. The project was initially scuttled by lack of financing and the distractions of simultaneous Beach Boys projects. Bambu was officially released in 2008 along with the Pacific Ocean Blue reissue.\nTwo songs from the Bambu sessions, \"Love Surrounds Me\" and \"Baby Blue,\" were lifted for the Beach Boys' 1979 L.A. (Light Album). Wilson and brother Brian also recorded together apart from the Beach Boys in 1980 and 1981. These sessions remain unreleased though widely bootlegged as The Cocaine Sessions.\n\nPersonal life\nAt the time of his death, Wilson was married to (but separated from) Shawn Marie Love (born Shawn Marie Harris on 30th December 1964), the mother of his son Gage, born September 3rd 1982. Shawn Marie died aged 38 in September 2003 of liver cancer. Wilson's previous marriages were to Carole Freedman, with whom he had a daughter, Jennifer and whose son, Scott, he adopted; and Barbara Charren, with whom he had two sons, Michael and Carl. Wilson also was married twice to Karen Lamm, the ex-wife of Chicago keyboardist Robert Lamm, once in 1976 and again in 1978. Wilson was quoted in the sleeve notes for the album All Summer Long:\n“\tThey say I live a fast life. Maybe I just like a fast life. I wouldn’t give it up for anything in the world. It won’t last forever, either. But the memories will.\t”\nDennis also had a significant relationship with Christine McVie from 1979 to 1981.\n\nDeath\nSucceeding years saw Wilson battling alcohol abuse. Smoking had taken a toll on his voice, although the resultant gravelly effect helped define him as a singer. On December 28, 1983, shortly after his 39th birthday, Wilson drowned at Marina Del Rey, Los Angeles, after drinking all day and diving in the afternoon to recover items he had thrown overboard at the marina from his yacht three years prior.\nDennis Wilson's body was buried at sea off the California coast (coordinates 33° 53.9 N, 118° 38.8 W) by the U.S. Coast Guard on January 4, 1984. His song \"Farewell My Friend\" was played at the funeral. As non-veterans of the Coast Guard and Navy are not allowed to be buried at sea unless cremated, Dennis' burial was possible due to the intervention of President Reagan. (3 Jan 1984, New York Times link)",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1944",
      "country": "Inglewood, CA",
      "country_code": "US",
      "died_year": "1983",
      "disbanded": false,
      "facebook": "",
      "formed_year": null,
      "gender": "Male",
      "genre": "",
      "id": "130789",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/yxtqwy1445877955.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/kizwr61665935889.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "4051f6bf-6a59-4d23-bd8b-2fddb1389dc0",
      "name": "Dennis Wilson",
      "raw_data": {},
      "style": "",
      "twitter": "1",
      "website": ""
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music/4e/06/7d/mzi.kqioeodl.jpg/2000x2000ac.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "3085067",
      "name": "Dennis Wilson",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/dennis-wilson/3085067"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "391245",
      "images": [
        {
          "height": 421,
          "resource_url": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/ymsy8RxQHd07jKMse208MdKqL3o-KUEIFYQ1-GkTl4U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 312,
          "resource_url": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/5md9EqZ4qnpJI0z7O39oPD6azwj4J4BDRB_oyIBll94/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
          "width": 360
        },
        {
          "height": 193,
          "resource_url": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/2zP75lWZTkE8Q5YKbryk2LNPQm_V71ihASi51PijFDo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
          "width": 262
        },
        {
          "height": 223,
          "resource_url": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
          "uri150": "https://i.discogs.com/IUKRmH86jBKTf4slQhS0n4r3GSr0uvxW2z4M6sajJYw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
          "width": 226
        },
        {
          "height": 276,
          "resource_url": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
          "uri150": "https://i.discogs.com/-1LUFts61cqgG10Lnf19YVmx_BRVGQLVuIsKcTVMM80/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
          "width": 180
        },
        {
          "height": 905,
          "resource_url": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/NpU6wRUMRU8cGpKlZADr3zsmmS2HgOtJYZb385N6OQc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 454,
          "resource_url": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/2xUWVv8DLSqczspKgVEBLJjTO6oT1CY_i3RLg_sik7M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
          "width": 307
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/EJtGp0fM9oZPTqPsNROzg7a47XwHKc4PxgZL-jS2wKA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 194,
          "resource_url": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
          "uri150": "https://i.discogs.com/oKEefUV2QJnWzd2K-cNSEkKtYhofKIyyTXJA7RDpcjc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
          "width": 259
        },
        {
          "height": 493,
          "resource_url": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/zolKCqnJmJh8MYK1R-zfil6TsPwyVN-B0asmECTvm3k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
          "width": 354
        },
        {
          "height": 553,
          "resource_url": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/owZcw0isOAWmgt_gysp6_pmnPQKO1Myo_YvqiiHWPXA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
          "width": 321
        },
        {
          "height": 595,
          "resource_url": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/h0ymbiqttNJJWa1C3h5sm8DCYsQHpWmO29_qxrEyERE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
          "width": 527
        },
        {
          "height": 331,
          "resource_url": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/f29s4fCw_J3DVsOmmYFBz12VGiPfUJYl6erpzU0987c/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
          "width": 269
        },
        {
          "height": 183,
          "resource_url": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/GjsTpaT91jdvijdyN16NEp9P3gZ1pZT40Oq8ImTvAMs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
          "width": 275
        },
        {
          "height": 200,
          "resource_url": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/3xd1xC5vcgP7dkcKYaDqmfnO7uafyB70JAIS5fPHuKo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
          "width": 184
        },
        {
          "height": 370,
          "resource_url": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/Q8s2NGBWRCw5AxcBa33Bc-U_KWM4P57rRmE21t2LjLY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
          "width": 260
        },
        {
          "height": 286,
          "resource_url": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/WmrhaOGk1DDTt1BuPHb9qn_fy66isYVxKqTGW3e4J84/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
          "width": 252
        },
        {
          "height": 257,
          "resource_url": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/FwGWpZ7E7o5axJWYwuiOV6ibkhWnOLPGppw9Dg_kCR8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
          "width": 263
        }
      ],
      "members": [],
      "name": "Dennis Wilson (2)",
      "namevariations": [
        "C. Wilson",
        "Carl B. Wilson",
        "Charles Manson",
        "D Wilson",
        "D.  Wilson",
        "D. WIlson",
        "D. Wilsom",
        "D. Wilson",
        "D. Wison",
        "D.Wilson",
        "DW",
        "Dave Wilson",
        "Dennis",
        "Dennis C. Wilson",
        "Dennis Carl Wilson",
        "Dennis Wilosn",
        "Dennis Wilson",
        "Taylor Hawkins",
        "WIlson",
        "Wilson"
      ],
      "profile": "Dennis Wilson (born December 4, 1944, Inglewood, California, USA – died December 28, 1983, Marina del Rey, California, USA) was an American musician, singer, and songwriter who co-founded [a70829] along with his brothers [url=https://www.discogs.com/artist/189718-Brian-Wilson]Brian[/url], [url=https://www.discogs.com/artist/260571-Carl-Wilson]Carl[/url] and cousin [a372789]. Son of [a363017] and [a3239364]. Uncle of [a434651] and [a413862].\r\n\r\nDennis served mainly on drums and backing vocals for The Beach Boys from the bands formation in 1961, until his death in 1983. While he was allowed few lead vocals in the 1960's, his prominence as a singer-songwriter increased into the 1970's. He was also known for his brief association in the late 1960's with aspiring songwriter [a58562], who was later convicted of murder conspiracy. In 1971, Dennis starred in the road movie [i]Two-Lane Blacktop[/i]. \r\n\r\nDennis drowned at Marina Del Rey, Los Angeles, after drinking all day and then diving in the afternoon, to recover items he had thrown overboard at the marina from his yacht three years prior.\r\n\r\nHe was married [a=Karen Lamm] twice — first in 1976 and again in 1978.",
      "raw_data": {
        "aliases": [
          {
            "id": 8704813,
            "name": "Bob Delgado & Denis Di Danato",
            "resource_url": "https://api.discogs.com/artists/8704813",
            "thumbnail_url": ""
          }
        ],
        "data_quality": "Needs Vote",
        "groups": [
          {
            "active": false,
            "id": 70829,
            "name": "The Beach Boys",
            "resource_url": "https://api.discogs.com/artists/70829",
            "thumbnail_url": "https://i.discogs.com/6goVnljroLwrxfzYkgul_-_GeH1Gp-xd2VFwAvLkmL8/rs:fit/g:sm/q:40/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcwODI5/LTE2Mzc4Njk1ODMt/MjcxOC5qcGVn.jpeg"
          }
        ],
        "id": 391245,
        "images": [
          {
            "height": 421,
            "resource_url": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/eRWDooNKAjixxZsybzdY9eiYcmMosrdBe7feDfWyz70/rs:fit/g:sm/q:90/h:421/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/ymsy8RxQHd07jKMse208MdKqL3o-KUEIFYQ1-GkTl4U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 312,
            "resource_url": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/s4HNNTamST8Vf3Zll_VbIGZI3A4Qfv1Hg67e_4xowcc/rs:fit/g:sm/q:90/h:312/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/5md9EqZ4qnpJI0z7O39oPD6azwj4J4BDRB_oyIBll94/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg2ODA0/LTU4MjYuanBlZw.jpeg",
            "width": 360
          },
          {
            "height": 193,
            "resource_url": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/KdtxM4nOkuoB5zD-5gNYz6_pVJmnBx7pxOthn7V0hN8/rs:fit/g:sm/q:90/h:193/w:262/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/2zP75lWZTkE8Q5YKbryk2LNPQm_V71ihASi51PijFDo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTczMjkuanBlZw.jpeg",
            "width": 262
          },
          {
            "height": 223,
            "resource_url": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aY420a762te0Fe3kEIXwqZUYwwEpVsKNr1QrBlZMyLw/rs:fit/g:sm/q:90/h:223/w:226/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
            "uri150": "https://i.discogs.com/IUKRmH86jBKTf4slQhS0n4r3GSr0uvxW2z4M6sajJYw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTM2MTguanBlZw.jpeg",
            "width": 226
          },
          {
            "height": 276,
            "resource_url": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/R4OqoY6HK1JQZmTnL9lD9N-tjBI14UE6_ahJjyRdVMg/rs:fit/g:sm/q:90/h:276/w:180/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
            "uri150": "https://i.discogs.com/-1LUFts61cqgG10Lnf19YVmx_BRVGQLVuIsKcTVMM80/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMjkz/LTMyOTguanBlZw.jpeg",
            "width": 180
          },
          {
            "height": 905,
            "resource_url": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aAHpVhO3sL-X4os8OqPdVD40ZtIio-ZrHKuqxb3k6W4/rs:fit/g:sm/q:90/h:905/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/NpU6wRUMRU8cGpKlZADr3zsmmS2HgOtJYZb385N6OQc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTUx/LTY4NjYuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 454,
            "resource_url": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/-zRZBXHd3aDcmTY_ISL_5Vtw_X25Ze-3BuBb_pKyhsg/rs:fit/g:sm/q:90/h:454/w:307/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/2xUWVv8DLSqczspKgVEBLJjTO6oT1CY_i3RLg_sik7M/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODE0/LmpwZWc.jpeg",
            "width": 307
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/b91iVFa509Ftr0kRE7YqcufABlkjUdqI6rDrePuBWkY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/EJtGp0fM9oZPTqPsNROzg7a47XwHKc4PxgZL-jS2wKA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNDU2MjUwMjI2/LTI2MzIuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 194,
            "resource_url": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/8cP4uKwjb9cMp_XF7vkDZ-hbm6-y-gLhHJMs1TOpzzo/rs:fit/g:sm/q:90/h:194/w:259/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
            "uri150": "https://i.discogs.com/oKEefUV2QJnWzd2K-cNSEkKtYhofKIyyTXJA7RDpcjc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA0/LTkyNzguanBlZw.jpeg",
            "width": 259
          },
          {
            "height": 493,
            "resource_url": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Q8-eYvLzaVG-DQQF9rJ-ch7_Ba7Q2FMBLI0c_Ra5kn8/rs:fit/g:sm/q:90/h:493/w:354/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/zolKCqnJmJh8MYK1R-zfil6TsPwyVN-B0asmECTvm3k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODY0/LmpwZWc.jpeg",
            "width": 354
          },
          {
            "height": 553,
            "resource_url": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/WNhZCKAjBi4riSpxyMP4eZIUt2Qr0QtU9nSWmhOUMMs/rs:fit/g:sm/q:90/h:553/w:321/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/owZcw0isOAWmgt_gysp6_pmnPQKO1Myo_YvqiiHWPXA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODg4/LmpwZWc.jpeg",
            "width": 321
          },
          {
            "height": 595,
            "resource_url": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/xlwmGwqnwWNtu5kpCLUBVReJiCxesSA3nSQzbH1HU94/rs:fit/g:sm/q:90/h:595/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/h0ymbiqttNJJWa1C3h5sm8DCYsQHpWmO29_qxrEyERE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTAx/LmpwZWc.jpeg",
            "width": 527
          },
          {
            "height": 331,
            "resource_url": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/qkECAYePCwzhHlFKMUtCUIunTQufQVpci5L3XuHQdsY/rs:fit/g:sm/q:90/h:331/w:269/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/f29s4fCw_J3DVsOmmYFBz12VGiPfUJYl6erpzU0987c/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODc2/LmpwZWc.jpeg",
            "width": 269
          },
          {
            "height": 183,
            "resource_url": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/SuV8Pi1Et8Mn73IKSR1HkCOvCUs6TrhEQYAquw-WzVs/rs:fit/g:sm/q:90/h:183/w:275/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/GjsTpaT91jdvijdyN16NEp9P3gZ1pZT40Oq8ImTvAMs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzMxMzEyMzA1/LTU1NDQuanBlZw.jpeg",
            "width": 275
          },
          {
            "height": 200,
            "resource_url": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/iZ8B7qHMX8V8TXE3DJ2Gusfx1IEaCph-okWxkUhVXF0/rs:fit/g:sm/q:90/h:200/w:184/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/3xd1xC5vcgP7dkcKYaDqmfnO7uafyB70JAIS5fPHuKo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMzU5NDAwMjkw/LTcyNjEuanBlZw.jpeg",
            "width": 184
          },
          {
            "height": 370,
            "resource_url": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/mB9vXZcyWwWv7NhCJDjCAwOiVIyVVgfYcIaQi1PDZZ4/rs:fit/g:sm/q:90/h:370/w:260/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/Q8s2NGBWRCw5AxcBa33Bc-U_KWM4P57rRmE21t2LjLY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODM5/LmpwZWc.jpeg",
            "width": 260
          },
          {
            "height": 286,
            "resource_url": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/BUfRsqs3EQooDFJHulA2QrnNJSgE01TpmAS5gKV8hYU/rs:fit/g:sm/q:90/h:286/w:252/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/WmrhaOGk1DDTt1BuPHb9qn_fy66isYVxKqTGW3e4J84/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5ODUy/LmpwZWc.jpeg",
            "width": 252
          },
          {
            "height": 257,
            "resource_url": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/gFNKxrrsOaGC5uEcD-rytv20YlF78YXatqqFrtAlmsc/rs:fit/g:sm/q:90/h:257/w:263/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/FwGWpZ7E7o5axJWYwuiOV6ibkhWnOLPGppw9Dg_kCR8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xMTQzMjM5OTI2/LmpwZWc.jpeg",
            "width": 263
          }
        ],
        "name": "Dennis Wilson (2)",
        "namevariations": [
          "C. Wilson",
          "Carl B. Wilson",
          "Charles Manson",
          "D Wilson",
          "D.  Wilson",
          "D. WIlson",
          "D. Wilsom",
          "D. Wilson",
          "D. Wison",
          "D.Wilson",
          "DW",
          "Dave Wilson",
          "Dennis",
          "Dennis C. Wilson",
          "Dennis Carl Wilson",
          "Dennis Wilosn",
          "Dennis Wilson",
          "Taylor Hawkins",
          "WIlson",
          "Wilson"
        ],
        "profile": "Dennis Wilson (born December 4, 1944, Inglewood, California, USA – died December 28, 1983, Marina del Rey, California, USA) was an American musician, singer, and songwriter who co-founded [a70829] along with his brothers [url=https://www.discogs.com/artist/189718-Brian-Wilson]Brian[/url], [url=https://www.discogs.com/artist/260571-Carl-Wilson]Carl[/url] and cousin [a372789]. Son of [a363017] and [a3239364]. Uncle of [a434651] and [a413862].\r\n\r\nDennis served mainly on drums and backing vocals for The Beach Boys from the bands formation in 1961, until his death in 1983. While he was allowed few lead vocals in the 1960's, his prominence as a singer-songwriter increased into the 1970's. He was also known for his brief association in the late 1960's with aspiring songwriter [a58562], who was later convicted of murder conspiracy. In 1971, Dennis starred in the road movie [i]Two-Lane Blacktop[/i]. \r\n\r\nDennis drowned at Marina Del Rey, Los Angeles, after drinking all day and then diving in the afternoon, to recover items he had thrown overboard at the marina from his yacht three years prior.\r\n\r\nHe was married [a=Karen Lamm] twice — first in 1976 and again in 1978.",
        "realname": "Dennis Carl Wilson",
        "releases_url": "https://api.discogs.com/artists/391245/releases",
        "resource_url": "https://api.discogs.com/artists/391245",
        "uri": "https://www.discogs.com/artist/391245-Dennis-Wilson-2",
        "urls": [
          "https://en.wikipedia.org/wiki/Dennis_Wilson"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/391245",
      "thumb": "https://i.discogs.com/ymsy8RxQHd07jKMse208MdKqL3o-KUEIFYQ1-GkTl4U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5MTI0/NS0xNzM4ODg3MTQ4/LTQ1MTcuanBlZw.jpeg",
      "url": "https://www.discogs.com/artist/391245-Dennis-Wilson-2",
      "urls": [
        "https://en.wikipedia.org/wiki/Dennis_Wilson"
      ]
    },
    "lastfm": {
      "bio_content": "There are multiple artists named Dennis Wilson:\n\n1) American singer-songwriter, musician; founding member of The Beach Boys.\n2) British composer.\n---\n1) Dennis Carl Wilson (December 4, 1944 - December 28, 1983) was an American singer, songwriter, and musician, best known as one of the founding members of The Beach Boys alongside brothers Brian and Carl. The group's drummer and occasional lead singer for much of his life, easily recognized by his bluesy and raspy voice, he later grew to become a gifted songwriter and multi-instrumentalist. His only solo album, Pacific Ocean Blue (1977), is regarded as perhaps the finest Beach Boys solo recording.\n\nBorn in Hawthorne, California to Murry and Audree Wilson, Dennis Wilson was the Wilsons' middle child, and a self-affirmed \"black sheep.\" A rebel from a young age, he was constantly at odds with his domineering father Murry, and would, as a consequence, be the one to suffer most from his abusive parenting techniques. As a teenager, Dennis became enamored with the burgeoning surfing scene; when the group that would become The Beach Boys was first formed, it was at Dennis' suggestion that they decided to capitalize on what would in short time become a national phenomenon. Thus, the idyllic notion of sun, surf, and sand that has become emblematic of the state of California, can, by and large, be attributed to the group's impending nationwide and international success, foreseen by Dennis.\n\nAs The Beach Boys grew in popularity, Dennis quickly became the sex symbol heartthrob of the group. Ironically, at the time Dennis had little faith in his own ability as a performer, and his earliest lead vocal,  \"Little Girl (You're My Miss America)\", is noticeably shy and restrained compared to his later efforts. His vocal spots would remain few and far between for the first five years of the band's existence; however, his importance to the group's vocal blend, as well as his lively surf-inflected drumming, was a cornerstone of the group's sound. By 1965, Dennis had seemingly overcome his shyness, resulting in a star turn as lead singer of the group's hit single \"Do You Wanna Dance?\". \n\nOn the 1966 album Beach Boys' Party!, an acoustic recording session recorded as a stopgap measure in order to give Brian more time to complete his ambitious Pet Sounds album, Dennis sang a cover version of The Beatles' \"You've Got to Hide Your Love Away\", on which he accompanied himself on guitar. By this time, he had also learned to play the piano, though it would take a while for his newfound talents to be put to use in the studio. As brother Brian became progressively more reliant on studio musicians, session drummers were often hired in Dennis' place, who by his own admission had limits to what he could do on a drum kit. He did, however, retain his position as drummer for live performances.\n\nAs the '60s progressed, Brian's involvement in studio affairs became increasingly lessened as a result of personal issues. His brothers both jumped at the chance for a more active role in recording; Carl became de facto leader of the group, and Dennis composed some of his first notable songs for the 1968 album Friends. He would maintain a steady pace of new compositions, often with one or more co-writers, for the remainder of his life. The song \"Forever\", co-written with Gregg Jakobson, \"Forever\", would become Dennis' most enduring and iconic work, awash with Dennis' distinctively loving and melancholy aesthetics.\n\nIn the late '60s, Dennis became involved with Charles Manson and his \"family,\" who stayed in his house for a period of time. Dennis tried to get Manson a record deal through his music business connections, but it failed to materialize. Secretly, Dennis recorded Manson's song \"Cease to Exist\" as \"Never Learn Not to Love\" for The Beach Boys' 1969 album 20/20, without crediting Manson. Upon learning this, Manson was incensed, and broke of all ties with Dennis (who had already come to suspect Manson's ill intent and began distancing himself from Manson) not too long before the infamous Tate-LaBianca murders. Dennis' involvement in the affair would haunt him for the rest of his days, and he declined to answer any questions asked about this period, partially out of fear of retaliation from the \"family.\"\n\nFor The Beach Boys' then-unnamed 1971 album, Dennis recorded the song \"(Wouldn't It Be Nice To) Live Again\". He wanted the song to serve as the album's closing track, but his wish was vetoed by Carl in favor of \"Surf's Up\"--a partially re-recorded remnant from Brian's unfinished SMiLE album--which would eventually be the derivation for the album's name. Hurt and frustrated, Dennis decided to leave the song off the album altogether; over four decades later, it was finally unearthed (as part of a career-spanning Beach Boys box set), instantly regarded as some of Dennis' finest work.\n\nIn 1971, Dennis co-starred in the film Two-Lane Blacktop alongside James Taylor; this would be the only acting credit for either man. Having suffered a debilitating hand injury in the early '70s, Dennis was by necessity replaced by Ricky Fataar as drummer. No longer stuck behind a drum kit, Dennis rose to the occasion to become co-frontman alongside Love, as well as playing keyboards and singing. During the mid-'70s, Dennis' voice deteriorated markedly as a result of smoking and drinking. His onstage antics would also become more edgy and unpredictable around this time.\n\nAround the mid-'70s, The Beach Boys split into two factions: one stuck on oldies and nostalgia (Love and Al Jardine), and one bent on progress and evolution (Dennis and Carl; brother Brian would remain a neutral party). As a result, Dennis withdrew from the group to record a solo album. Songwriting partners included Carl, Love, and Jakobson. The recording sessions were decidedly sporadic, to the point where much recording date documentation was lost, or never documented in the first place. Though Dennis dismissed Pacific Ocean Blue as having \"no substance,\" it sold surprisingly well (rivaling the recent Beach Boys album Love You in sales), and remains critically well-regarded to this day. A subsequent solo tour was planned, but ultimately cancelled; Dennis would, however, occasionally perform material from his solo album during Beach Boys live performances. \n\nAlmost immediately after the release of his first album, Dennis eagerly planned his follow-up, Bambu. A good number of songs were recorded, but the album never materialized due to Dennis' increasing financial problems, as well as commitment to Beach Boys-related projects; some of the material recorded for his second album were salvaged for use on Beach Boys albums. At the turn of the decade, Dennis had all but become persona non grata to the group he had given a sense of identity so many years before, as a result of his increasingly erratic and self-destructive behavior. Outside of the context of his former group, Dennis got together with Brian to record; though never released, their sessions together were widely bootlegged.\n\nOn December 25, 1983, Dennis Wilson, at the time all but homeless, drowned after diving off a pier in Marina Del Rey in search of personal items he had thrown off his boat, the Harmony, many years prior. He was granted the unique honor of a burial at sea, a privilege usually reserved for war heroes . Some of Dennis' songs and vocal spots are still performed by other band members to this day; during The Beach Boys' 50th anniversary tour, performances of \"Forever\" utilized archival video and audio footage of Dennis performing his signature song.\n---\n2) Dennis Miller Wilson (1920–1989) was a British pianist, composer, arranger and conductor born 16 February 1920 in Leicester.\n\nBiography:\nDuring his schooldays in his native town of Leicester, Wilson played the piano for the school orchestra before he was sixteen years old. After leaving school, he played in local bands and when the Army claimed him in 1939, he was eventually posted to India where until 1946, he directed the music at one of the garrison theatres.\n\nHis next move was to join Harry Parry's Sextet for three years, after which he featured in several of the popular bands of the period, including those of Harry Hayes and Kenny Baker. From 1949 he was free-lance with recording, radio and television orchestras and has also had much to do with film music.\n\nHe was with George Melachrino, Malcolm Lockyer, Peter Yorke and other well-known orchestra leaders, as well as having his own set-up for some popular radio series, such as “ Educating Archie\" and \"Pertwee's Progress\". He later joined the B.B.C. Show Band and in addition played for commercial T.V. He was an outstandingly good pianist and made numerous recordings playing in combos as trio, quartet, quintet, octet and with his own orchestra. His album Dennis Plus Three was originally released in 1957 and remastered in Aug 2013.\n\nHe was married in 1950, lived at Beckenham, Kent and had two children - Nicholas and Penelope. His principal hobbies were sailing and gardening. He died 15 July 1989 in Cambridge.\n\nHe composed the theme music for a number of television series and sitcoms:\nMarriage Lines (1961)\nSteptoe and Son (1962) (music for some episodes, but not the theme music)\nMeet the Wife (1963)\nTill Death Us Do Part (1965)\nBirds on the Wing (1971)\nMy Wife Next Door (1972)\nRising Damp (1974)\nMy Honourable Mrs (1975)\nFawlty Towers (1975 - 1979) <a href=\"https://www.last.fm/music/Dennis+Wilson\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "There are multiple artists named Dennis Wilson:\n\n1) American singer-songwriter, musician; founding member of The Beach Boys.\n2) British composer.\n---\n1) Dennis Carl Wilson (December 4, 1944 - December 28, 1983) was an American singer, songwriter, and musician, best known as one of the founding members of The Beach Boys alongside brothers Brian and Carl. The group's drummer and occasional lead singer for much of his life, easily recognized by his bluesy and raspy voice, he later grew to become a gifted songwriter and multi-instrumentalist. <a href=\"https://www.last.fm/music/Dennis+Wilson\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 165454,
      "mbid": "86b9a4b4-b6a6-4cb3-973c-af4ed2863350",
      "name": "Dennis Wilson",
      "playcount": 2108511,
      "similar_artists": [
        {
          "name": "The Beach Boys",
          "url": "https://www.last.fm/music/The+Beach+Boys"
        },
        {
          "name": "Brian Wilson",
          "url": "https://www.last.fm/music/Brian+Wilson"
        },
        {
          "name": "Bee Gees",
          "url": "https://www.last.fm/music/Bee+Gees"
        },
        {
          "name": "Todd Rundgren",
          "url": "https://www.last.fm/music/Todd+Rundgren"
        },
        {
          "name": "Harry Nilsson",
          "url": "https://www.last.fm/music/Harry+Nilsson"
        }
      ],
      "tags": [
        "pop",
        "rock",
        "classic rock",
        "California",
        "Surf"
      ],
      "url": "https://www.last.fm/music/Dennis+Wilson"
    },
    "spotify": {
      "followers": 46025,
      "genres": [],
      "id": "5gl6pfPwJ1coivVUMZPiS9",
      "images": [
        {
          "height": 810,
          "url": "https://i.scdn.co/image/be4685b5a9fc613afde142972afb3016ff5ce3a1",
          "width": 1000
        },
        {
          "height": 518,
          "url": "https://i.scdn.co/image/b8707ef758e93ac01e82271365c1737f8dff3038",
          "width": 640
        },
        {
          "height": 162,
          "url": "https://i.scdn.co/image/509f774a36325f1f69afc5fe3c2ef592d86562cb",
          "width": 200
        },
        {
          "height": 52,
          "url": "https://i.scdn.co/image/6edfb76926944644aae3126c53d02f0ca896499e",
          "width": 64
        }
      ],
      "name": "Dennis Wilson",
      "popularity": 35,
      "url": "https://open.spotify.com/artist/5gl6pfPwJ1coivVUMZPiS9"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Dennis Carl Wilson (December 4, 1944 – December 28, 1983) was an American drummer, singer and songwriter. He is best known as a founding member of the rock band The Beach Boys, alongside his brothers, Brian and Carl, cousin, Mike Love, and Al Jardine. Wilson was a member of the band from its formation until his death in 1983, recording twenty-four studio albums. In 1977, he released a solo album, Pacific Ocean Blue, to widespread critical acclaim.\nBorn in Inglewood, California, Dennis was the middle brother of fellow Beach Boys members Brian Wilson and Carl Wilson. Dennis Wilson was also the only regular surfer of the group, and his personal life exemplified the beach lifestyle that the group's early songs often celebrated. His prominence in the group as a writer and lead vocalist increased as their careers went on into the late 1960s and 1970s.\n\nChildhood years\nWilson was the son of Audree Neva (née Korthof) and Murry Gage Wilson. He spent his family years with his brothers and parents in Hawthorne, California. Dennis' role in the family dynamic, which he himself acknowledged, was that of the black sheep. Though anxiety-filled and aggressive at times, he was also sensitive and generous. He was the most often spanked of the Wilson brothers, by their strong-willed father Murry. Possessed with an abundance of physical energy and a combative nature, Dennis often refused to participate in family singalongs, and likewise avoided vocalizing on the early recordings made by Brian on a portable tape recorder. However, Dennis would sing with his brothers late at night in their shared bedroom on a song Brian later recalled as \"our special one we'd sing,\" titled \"Come Down, Come Down from the Ivory Tower.\" Brian noted of the late night brotherly three-part harmonies: \"We developed a little blend which aided us when we started to get into the Beach Boys stuff.\"\n\nThe Beach Boys\nDennis' mother, Audree, forced Brian to include Dennis in the original lineup of the Beach Boys. Urged by older cousin, Mike Love, Dennis had approached Brian to form a group and compose a song about surfing. The Beach Boys formed in August 1961 and were successful immediately (Murry having taken over guidance of the group as manager). Though the Beach Boys were named for, and developed, an image based on the California surfing culture, Dennis was the only actual surfer in the band.\nDuring the first few years of the Beach Boys, Dennis was given the role of the drummer by his brother, Brian. He quickly learned the basics of drumming at school lessons, and like the other members, he picked up more on the job. Brian Wilson took note of Dennis's limited drumming technique early on and as the mid-60s approached, often hired session drummers such as Hal Blaine to perform on studio recordings (additionally substituting all other players at one time or another, under the demand for the band members on tour). Dennis accepted this situation with equanimity, generally giving high praise to his older brother's work as Brian's compositions became more mature and complex. However, he did have his own stick style; in 1970, at the height of the band's UK popularity, a New Musical Express writer used the phrase, \"as crisp as a Dennis Wilson rim shot.\" Although he rarely sang backing vocals on stage, occasionally taking a lead, his raspy-sounding vocals were a key ingredient to the group's vocal blend in the studio, and in the late Sixties and Seventies his lead vocals lent a much-needed bluesy edge to an updating the Beach Boys' sound, giving their music new dimensions on the retreat of brother Brian's influence in composing and studio production.\nThough given few important lead vocals on the early Beach Boys recordings (\"Little Girl (You're My Miss America)\" and \"This Car of Mine\" as well as the bridge verse on \"Girls on the Beach\") he sang lead on \"Do You Wanna Dance?\", the group's February 1965 hit. Later that year on Beach Boys' Party!, Dennis sang an impressive, faithful rendition of The Beatles' \"You've Got to Hide Your Love Away.\" He accompanied himself on guitar and like the other Beach Boys became a multi-instrumentalist. His piano playing and composing in particular was praised by Daryl Dragon, his frequent collaborator in the late Sixties and early Seventies and was showcased on his Pacific Ocean Blue album.\nAlthough he had helped Brian write a few other songs dating back to 1963 at the age of 18, Dennis Wilson's first major released composition was \"Little Bird,\" the B-side of the \"Friends\" single, coupled with \"Be Still\", also a paean to nature and reflecting on his place in the natural world of which his surfing hobby was only a minuscule part. All at once, aged 23, he revealed a fully matured style that had obviously been incubating inside for some time, away from the other members of the band. From 1968 to 1973, as Brian withdrew more and more from active participation with his group, Dennis stepped up as the major creative force of the Beach Boys, having learnt production techniques from observing his brother and showing cosmic-gothic overtones in composing (influenced by Richard Wagner). At least two of his songs were included on all but one of the six albums released in that five-year period, peaking with four songs on each of 20/20 and Sunflower. When certain territorial jealousies arose within the band over his growing role (as with George Harrison in the Beatles), he began to hold back songs for his own projected solo albums.\nWilson had further compositions featured on later Beach Boys albums such as 20/20 (1969), Sunflower (1970), Carl and the Passions – \"So Tough\" (1972), Holland (1973) as well as others. Sunflower included the track \"Forever,\" which not only was popular with fans but also earned him some much sought praise from brother Brian and father Murry. The album included three other songs written by Wilson which were not originally recorded for the album.\nIn 1971, Dennis injured his hand badly enough to prevent him from playing drums for some time, and Ricky Fataar took over as the group's drummer between 1972 and 1974. During this period Dennis acted as a co-frontman alongside Mike Love, as well as playing keyboards and singing. The 1973 live album The Beach Boys in Concert features only Dennis onstage among thousands of fans on the album cover; however, none of his songs were included in the lineup.\nDuring the three-year recording hiatus following Holland, Dennis's voice deteriorated markedly. By then his onstage antics (including streaking) occasionally disrupted the Beach Boys' live shows.\nIn 1974, concurrent with the success of the '60s hits compilation Endless Summer, Wilson returned to his role behind the drums. According to Dennis's biographer, Jon Stebbins, it was this year that he co-wrote the lyrics and modified part of the melody of \"You Are So Beautiful\" at a party with Billy Preston.\n\nCharles Manson\nSee also: Charles Manson: Involvement with Wilson, Melcher, et al.\nIn 1968, Dennis Wilson was driving through Malibu when he noticed two female hitchhikers, Patricia Krenwinkel and Ella Jo Bailey. He picked them up and dropped them off at their destination. Later on Wilson noticed the same two girls hitchhiking again. This time he took them to his home at 14400 Sunset Boulevard near Will Rogers Park. Wilson then went to a recording session. When he returned at around 3 a.m., he was met in his driveway by a stranger, Charles Manson. When Wilson walked into his home, about a dozen people were occupying the premises, most of them female. Wilson became fascinated by Manson and his followers; the \"Manson Family\" lived with Wilson for a period of time afterwards at his expense.\nInitially impressed by Manson's songwriting talent, Wilson introduced him to a few friends in the music business, including Terry Melcher (the son of Doris Day), whose home at 10050 Cielo Drive would later be rented by director Roman Polanski and his wife, actress Sharon Tate, and Manson family members would later murder Tate and several others at the home.\nManson held recording sessions at the home studio of Dennis' brother, Brian Wilson. Those recordings, if they exist, have never been released. The Beach Boys released a Manson song, originally titled \"Cease To Exist\" but reworked as \"Never Learn Not To Love\", as a single B-side and on the album 20/20.\nAs Dennis Wilson became increasingly aware of Manson's volatile nature and growing tendency to violence, he finally made a break from the friendship by simply moving out of the house and leaving Manson there. When Manson subsequently sought further contact (and money), he left a bullet with Wilson's housekeeper to be delivered with a cryptic message, which Wilson perceived as a threat.\nIn August 1969, Manson Family members perpetrated the Tate/LaBianca murders. Wilson rarely discussed his involvement with the Manson Family, and usually became upset when the subject was broached.\nMovie role\nDennis Wilson starred alongside James Taylor and Warren Oates in the critically acclaimed film Two-Lane Blacktop (1971) as \"The Mechanic\". The film depicts \"The Driver\" (Taylor) and \"The Mechanic\" driving aimlessly across the United States in their 1955 Chevy, surviving on money earned from street drag racing.\nSolo career\nEarly in 1963, Dennis teamed with Brian's former collaborator Gary Usher, a neighbor in Hawthorne who became a prolific creative figure in surf music recording, and later, folk. As a duo writing, producing and performing and calling themselves the Four-Speeds, they released the single \"RPM\"/\"My Stingray\". Both sides got top four-star ratings in \"Billboard\" reviews mid-March '63 and turned out popular enough locally and in spots cross-country to earn and lose Denny, in a drunk-driving crash, a Chevy Corvair sports car. On December 4, 1970, Wilson released his first piece of solo material, a little-known single released only in Europe and the UK under the name \"Dennis Wilson & Rumbo.\" The single featured \"Sound of Free\", on his usual theme of freedom, on the A-side with the romantic \"Lady\" (also known as \"Fallin' In Love\") on the B-side. The song was later covered by American Spring and released as the B-side to their single \"Shyin' Away.\"\nPacific Ocean Blue\nWilson released his debut solo album Pacific Ocean Blue in 1977. His collaborators on the album included Daryl Dragon (the 'Captain' of Captain & Tennille) and Gregg Jakobson. The album peaked at #96 in the U.S. and sold around 300,000 copies, matching that year's Beach Boys album Love You. Dates were booked for a Dennis Wilson solo tour but these were ultimately cancelled. However, Wilson did occasionally perform his solo material on the 1977 Beach Boys tour. Despite Wilson himself claiming the album had \"no substance,\" Pacific Ocean Blue performed well critically and continues to maintain a cult following. Wilson's trademark gravelly and melancholy vocals resonate throughout the work. The album was out of print for more than a decade before being reissued in June 2008. The expanded Sony Legacy edition was voted the 2008 Reissue of the Year in both Rolling Stone and Mojo magazines and made #16 on the British LP charts and #8 and both the Billboard Catalog chart and the Billboard Internet Sales chart.\nBambu\nPacific Ocean Blue's follow-up, Bambu, began production in the year 1978 at Brother Studios in Santa Monica with the collaboration of then Beach Boys keyboardist and Dennis's close friend Carli Muñoz as songwriter and producer. The first four songs that were officially recorded for Bambu were Muñoz's compositions: \"It's Not Too Late\", \"Constant Companion\", \"All Alone\", and \"Under The Moonlight\"; they appear on the final 2008 release. The project was initially scuttled by lack of financing and the distractions of simultaneous Beach Boys projects. Bambu was officially released in 2008 along with the Pacific Ocean Blue reissue.\nTwo songs from the Bambu sessions, \"Love Surrounds Me\" and \"Baby Blue,\" were lifted for the Beach Boys' 1979 L.A. (Light Album). Wilson and brother Brian also recorded together apart from the Beach Boys in 1980 and 1981. These sessions remain unreleased though widely bootlegged as The Cocaine Sessions.\n\nPersonal life\nAt the time of his death, Wilson was married to (but separated from) Shawn Marie Love (born Shawn Marie Harris on 30th December 1964), the mother of his son Gage, born September 3rd 1982. Shawn Marie died aged 38 in September 2003 of liver cancer. Wilson's previous marriages were to Carole Freedman, with whom he had a daughter, Jennifer and whose son, Scott, he adopted; and Barbara Charren, with whom he had two sons, Michael and Carl. Wilson also was married twice to Karen Lamm, the ex-wife of Chicago keyboardist Robert Lamm, once in 1976 and again in 1978. Wilson was quoted in the sleeve notes for the album All Summer Long:\n“\tThey say I live a fast life. Maybe I just like a fast life. I wouldn’t give it up for anything in the world. It won’t last forever, either. But the memories will.\t”\nDennis also had a significant relationship with Christine McVie from 1979 to 1981.\n\nDeath\nSucceeding years saw Wilson battling alcohol abuse. Smoking had taken a toll on his voice, although the resultant gravelly effect helped define him as a singer. On December 28, 1983, shortly after his 39th birthday, Wilson drowned at Marina Del Rey, Los Angeles, after drinking all day and diving in the afternoon to recover items he had thrown overboard at the marina from his yacht three years prior.\nDennis Wilson's body was buried at sea off the California coast (coordinates 33° 53.9 N, 118° 38.8 W) by the U.S. Coast Guard on January 4, 1984. His song \"Farewell My Friend\" was played at the funeral. As non-veterans of the Coast Guard and Navy are not allowed to be buried at sea unless cremated, Dennis' burial was possible due to the intervention of President Reagan. (3 Jan 1984, New York Times link)",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1944",
      "country": "Inglewood, CA",
      "country_code": "US",
      "died_year": "1983",
      "disbanded": false,
      "facebook": "",
      "formed_year": null,
      "gender": "Male",
      "genre": "",
      "id": "130789",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/yxtqwy1445877955.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/kizwr61665935889.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "4051f6bf-6a59-4d23-bd8b-2fddb1389dc0",
      "name": "Dennis Wilson",
      "raw_data": {},
      "style": "",
      "twitter": "1",
      "website": ""
    }
  },
  "spotify_id": "5gl6pfPwJ1coivVUMZPiS9",
  "spotify_url": "https://open.spotify.com/artist/5gl6pfPwJ1coivVUMZPiS9",
  "updated_at": "2025-07-08T20:45:02.431537",
  "wikipedia_url": null
}