{
  "apple_music_id": "1440786233",
  "apple_music_url": "https://music.apple.com/gb/album/american-fool-bonus-track-2005-remaster/1440786233",
  "artists": [
    {
      "apple_music_id": "52690176",
      "biography": "John Cougar Mellencamp, is the third stage name of John Mellencamp, who had previously been known as Johnny Cougar and then John Cougar.  Mellencamp, (born October 7, 1951, in Seymour, Indiana) is a Grammy-winning American rock singer-songwriter, musician, artist and occasional actor.\n\nMellencamp was inducted into the Rock and Roll Hall of Fame on March 10, 2008, by Billy Joel.[1] His biggest musical influences are Bob Dylan, Woody Guthrie and The Rolling Stones.\n\nMellencamp who was born, with a mild form of spina bifida which necessitated a lengthy stay in the hospital as a baby. He is descended from German immigrant Johann Herman Möhlenkamp who came to the White Creek area of Bartholomew County, Indiana in the United States in 1855.\n\nMellencamp had trouble with the law as a teeneager and formed his first band at the age of 14. He eloped with his pregnant girlfriend at the age of 17[2] and had his first child (Michelle) just six months after graduating from high school in 1970. In 1974, he graduated from Vincennes University, a two-year college in Vincennes, Indiana, and took a job at a telephone company in his hometown of Seymour, Indiana before deciding to go to New York in an attempt to land a record deal,[2] which he finally managed to do in late 1975.\n\nThe John Cougar years (1976–1982)\nAfter about 18 months of traveling back and forth from Indiana to New York City in 1974 and '75, Mellencamp finally found someone receptive to his music and image in Tony DeFries of MainMan Management (at the time well-known for representing David Bowie, one of Mellencamp's musical idols at the time[citation needed]). DeFries insisted that Mellencamp's first album, Chestnut Street Incident, a collection of covers and derivative originals (Mellencamp had written just a handful of songs prior to landing a record deal and was still very raw), be released under the stage name Johnny Cougar, a move Mellencamp claims was made without his knowledge and against his wishes. The album was a failure, selling just 12,000 copies.\n\nMellencamp recorded The Kid Inside in 1977, the follow-up to Chestnut Street Incident, but DeFries eventually decided against releasing the album and Mellencamp was dropped from MCA records. He worked with Rod Stewart's manager Billy Gaff after parting ways with DeFries and was signed to the tiny Riva Records label. At Gaff's request, Mellencamp moved to London, England for nearly a year to record, promote and tour behind 1978's A Biography. The record wasn't released in the United States, but yielded a No. 1 hit in Australia with \"I Need a Lover.\"[citation needed] Riva Records added \"I Need a Lover\" to Mellencamp's next album released in the United States, 1979's John Cougar, where the song became a Number 28 single in late 1979. Rocker Pat Benatar recorded \"I Need a Lover\" on her debut album In the Heat of the Night, and her version garnered a good deal of FM radio airplay even though it was not issued as a single in the United States.\n\nIn 1980, Mellencamp returned with the Steve Cropper-produced Nothin' Matters And What If It Did, which yielded two Top 40 singles — \"This Time\" (Number 27) and \"Ain't Even Done With The Night\" (No. 17) — and showed continued improvement in both his songwriting and singing. However, Mellencamp was not particularly fond of the album or its two hit singles.\n\n\"The singles were stupid little pop songs,\" he told Record Magazine in 1983. \"I take no credit for that record. It wasn't like the title was made up — it wasn't supposed to be punky or cocky like some people thought. Toward the end, I didn't even go to the studio. Me and the guys in the band thought we were finished, anyway. It was the most expensive record I ever made. It cost $280,000, do you believe that? The worst thing was that I could have gone on making records like that for hundreds of years. Hell, as long as you sell a few records and the record company isn't putting lot of money into promotion, you're making money for 'em and that's all they care about. PolyGram loved Nothin' Matters. They thought I was going to turn into the next Neil Diamond.\"\n\nIn 1982, Mellencamp released his breakthrough album, American Fool (see 1982 in music). The album had a rootsy, garage-rock vibe and spawned the hit singles \"Hurts So Good,\" which spent four weeks at No. 2, and \"Jack and Diane,\" which stayed at Number One for four weeks. Those mega-hits sent American Fool to the top of the charts. A third single, \"Hand To Hold On To,\" made it to Number 19 and was a staple in his concerts throughout the 1980s. Additionally, \"Hurts So Good\" spent 16 weeks in the Top Ten (more than any other single in the 1980s); and \"Jack and Diane\" is, to date, Mellencamp's only single ever to top the Billboard Hot 100. \"Hurts So Good\" went on to win the Grammy Award for Best Male Rock Vocal Performance at the 25th Grammys. Despite the fact that American Fool made Mellencamp a superstar, he doesn't consider it anywhere close to a masterpiece.\n\n\"To be real honest, there's three good songs on that record, and the rest is just sort of filler,\" Mellencamp told Creem magazine in 1984. \"It was too labored over, too thought about, and it wasn't organic enough. The record company thought it would bomb, but I think the reason it took off was – not that the songs were better than my others – but people liked the sound of it, the 'bam-bam-bam' drums. It was a different sound.\"\n\nIn early 1983, after Mellencamp had broken through to stardom with American Fool, DeFries finally released The Kid Inside in an attempt to cash in on the singer's newfound success. \"If he'd have been smart about it, he'd have worked with us because I've got other records that never came out in America,\" Mellencamp told Creem magazine in 1984. \"We could've put together a compilation. But it was the way he did it. He released it right on the tail of American Fool, and it confused a lot of people.\"\n\n\nThe John Cougar Mellencamp years (1983–1990)\nFinally having enough commercial success to give him some clout, Mellencamp forced the record company to add his real surname to his stage moniker. The first album he recorded as John Cougar Mellencamp was 1983's Uh-Huh, a top-10 hit that spawned the hit singles \"Pink Houses,\" \"Crumblin' Down\" (both of which made the top 10) and \"Authority Song,\" which Mellencamp called \"our new version of 'I Fought The Law'.\" During the recording of Uh-Huh, Mellencamp's backing band settled on the lineup it would retain for the next several albums: Kenny Aronoff on drums and percussion, Larry Crane and Mike Wanchic on guitars, Toby Myers on bass and John Cascella on keyboards. In 1988 Rolling Stone magazine called this version of Mellencamp's band \"one of the most powerful and versatile live bands ever assembled.\" On the 1984 Uh-Huh Tour, Mellencamp opened his shows with cover versions of songs he loved growing up, such as Elvis Presley's \"Heartbreak Hotel,\" the Animals' \"Don't Let Me Be Misunderstood,\" Lee Dorsey's \"Ya Ya,\" and the Left Banke's \"Pretty Ballerina.\"\n\nIn 1985, Mellencamp released Scarecrow -- an organic record with socially aware lyrics and filled with songs focusing on the plight of the American family farmer, small-town life, and the state of the nation. Scarecrow is now considered a classic American rock album and marked the true beginning of Mellencamp as a serious social commentator. Shortly after finishing Scarecrow, Mellencamp helped organize the first Farm Aid benefit concert with Willie Nelson and Neil Young in Champaign, Illinois on September 22, 1985. The Farm Aid concerts remain an annual event and have raised over $30 million for struggling family farmers through 2008.\n\nScarecrow was an enormous success, peaking at No. 2 in the fall of '85 and spawning five Top 40 singles. \"Lonely Ol' Night,\" \"Small Town,\" and \"R.O.C.K. in the U.S.A.\" all became Top 10 hits, and \"Rain On The Scarecrow\" and \"Rumbleseat\" cracked the Top 40 and garnered considerable play on album-rock stations. Scarecrow was also the first album Mellencamp recorded at his own recording studio, located in Belmont, Indiana and built in 1984. All of his subsequent albums after Scarecrow have also been recorded there. Mellencamp dubbed the studio the Belmont Mall, because Belmont is a tiny municipality that not only has no shopping mall, but features little more than a gas station.\n\nBefore recording Scarecrow, Mellencamp forced his band to learn numerous vintage rock, R&B, and soul songs inside and out so that they could put some of the grit and knowledge they derived from those classics into his own songs. He articulated in a 1986 interview with Creem magazine just how his band learning those songs help shape the sound of Scarecrow, citing the track \"Face of the Nation\" as an example.\n\n\"Learning those songs did a lot of positive things. We realized more than ever what a big melting pot of all different types of music the '60s were. Take an old Rascals song for example – there's everything from marching band beats to soul music to country sounds in one song. Learning those opened the band's vision to try new things on my songs. It wasn't let's go back and try to make this part fit into my song, but I wanted to capture the same feeling – the way those songs used to make you feel. After a while, we didn't even have to talk about it anymore. If you listen to the lead Larry (Crane) plays on 'Face The Nation', he never would have played that 'cause he didn't really know who the Animals were. He's young, and he grew up on Grand Funk Railroad. You hear it, and it's like 'where did that come from?' It had to be from hearing those old records.\"\n\nPrior to the 1985-86 Scarecrow Tour, during which he covered a bunch of those same 1960s rock and soul songs he and his band rehearsed prior to the recording of Scarecrow, Mellencamp added fiddle player Lisa Germano to his band to accent and deepen his overall sound. Germano would remain in Mellencamp's band until 1994, when she left to pursue a solo career.\n\nGermano played a big role in Mellencamp's next LP, 1987's The Lonesome Jubilee, which was departure from his earlier material as it incorporated country and folk influences. It generated several more hit singles, \"Paper in Fire,\" \"Cherry Bomb,\" and \"Check It Out,\" along with hit album tracks like \"Hard Times For An Honest Man\" and \"The Real Life,\" and was considered one of the finest albums of the 1980s.\n\n\"We were on the road for a long time after Scarecrow, so we were together a lot as a band,\" Mellencamp said in a 1987 Creem magazine feature. \"For the first time ever, we talked about the record before we started. We had a very distinct vision of what should be happening here. At one point, The Lonesome Jubilee was supposed to be a double album, but at least 10 of the songs I'd written just didn't stick together with the idea and the sound we had in mind. So I just put those songs on a shelf, and cut it back down to a single record. Now, in the past, it was always 'Let's make it up as we go along' – and we did make some of The Lonesome Jubilee up as we went along. But we had a very clear idea of what we wanted it to sound like, even before it was written, right through to the day it was mastered.\"\n\nDuring the 1987-88 Lonesome Jubilee Tour, Mellencamp was joined onstage by surprise guest Bruce Springsteen at the end of his May 26, 1988 gig in Irvine, California for a rousing duet of the Bob Dylan classic \"Like a Rolling Stone,\" which Mellencamp performed as the penultimate song during each show on that tour.\n\nAfter The Lonesome Jubilee Tour, Mellencamp went through an acrimonious divorce from his second wife, Vicki, and entered a somewhat dark period in his life, although he is not known to drink or take drugs. Those who have been with Mellencamp since the beginning of his career say they've never seen him touch a drug or drink a drop of alcohol. \"John is a complete teetotaller and always has been,\" Mike Wanchic, who has been Mellencamp's rhythm guitar player since 1976, told NUVO.net in 2002. \"Never seen him take a drink of alcohol, never seen him do a drug in his entire life. Not since day one.\" Mellencamp's only vice is his four-pack-a-day cigarette habit (a 1994 heart attack forced him to cut down to about one pack a day).\n\nIn 1989, Mellencamp released Big Daddy, a quieter, mostly acoustic venture filled with introspective songs reflecting his mood of the time. However somber, Big Daddy still contained standout tunes like \"Jackie Brown,\" \"Big Daddy of Them All\" and \"Void in My Heart,\" along with the top 15 single \"Pop Singer.\" The album, which Mellencamp called at the time the most \"earthy\" record he'd ever made, is also the last to feature both the \"Cougar\" moniker and the innovative, fiddle-based Appalachian sound he first tried with The Lonesome Jubilee. Mellencamp was heavily involved in painting at this time in his life, and decided not to tour behind Big Daddy so that he could fully explore his newfound passion. It would be two years before he was heard from again.\n\n\n[edit] The John Mellencamp years (1991–present)\nMellencamp's 1991 album, the hard-rocking Whenever We Wanted, was the first whose cover was billed to just John Mellencamp. It yielded the Top 40 hits \"Get A Leg Up\" and \"Again Tonight,\" along with the mainstream rock hits \"Last Chance,\" \"Love and Happiness\" and \"Now More Than Ever.\" \"It's very rock 'n' roll,\" Mellencamp said of Whenever We Wanted. \"I just wanted to get back to the basics.\"\n\nIn 1993, he released Human Wheels, one of his most critically-acclaimed albums, although the title track peaked at a disappointing No. 48 on the Billboard singles charts, a fact that Mellencamp directly attributes to his label's refusal to spend another $30,000 on promotion for the song. Still, Human Wheels has widely been regarded as one of his strongest works.\n\n\"To me, this record is very urban,\" Mellencamp told Billboard magazine of Human Wheels in the summer of '93. \"We had a lot of discussions about the rhythm and blues music of the day. We explored what a lot of these (current) bands are doing — these young black bands that are doing more than just sampling.\n\n\"The rhythms in songs like 'When Jesus Left Birmingham' or 'French Shoes' or 'Junior' are R&B, but to me R&B is the basic beat that propels the human body. Sly & the Family Stone also deserve a tip of the hat here, because as a kid when I heard Sly sing 'hot fun at the country fair,' I said, 'Man, that's for me!' Years later, I saw that there was a lot more subtlety and intensity to his music than I first realized. And whether you hear the influence in Tone Loc or Arrested Development, Sly remains an undercredited inspiration in '90s rock'n'roll. He made street music, and I wanted things like 'Birmingham' to have the rhythm of the streets.\"\n\nMellencamp returned to the upper reaches of the charts in 1994, when his quickly-recorded, 29-minute Dance Naked album yielded his biggest hit since \"R.O.C.K in the USA\" in 1986 with a cover of Van Morrison's \"Wild Night\" as a duet with Me'Shell NdegeOcello, an avowed Mellencamp fan. \"One reason I liked him was that lyrically, he's simple, but at the same time complex,\" NdegeOcello told Billboard magazine in 1994. \"His songs talked to me about life in a language I could understand, while musically they had that raw energy which I thrive on, which is great to dance to. He's a real groovesman, and a very strong vocalist: Like a hip-hopper, he's a viber—he's got to feel the music to make him sing the way he wants to sing.\"\n\nThe stripped-down Dance Naked also contained two protest songs in \"L.U.V.\" and \"Another Sunny Day 12/25,\" in addition to the title track, which hit No. 41 on the Billboard Hot 100 in the summer of '94.\n\n\"This is as naked a rock record as you're going to hear,\" Mellencamp said of Dance Naked in a 1994 Billboard magazine interview. \"All the vocals are first or second takes, and half the songs don't even have bass parts. Others have just one guitar, bass, and drums, which I haven't done since 'American Fool.' 'Hurts So Good' had one guitar, bass, and drums, and I think one tambourine.\"\n\nMellencamp launched his Dance Naked Tour in the summer of '94, but a minor heart attack suffered after a show at Jones Beach in New York on Aug. 8 of that year forced him to cancel the last few weeks of the tour (he wound up playing through Sept. 2 before seeing a doctor and being diagnosed as having suffered a heart attack. All dates after Sept. 2 were canceled). Mellencamp blamed his minor myocardial infarction on his four-pack-a-day cigarette habit and poor diet.\n\n\"It's nobody else's fault,\" he told Rolling Stone magazine in late 1994. \"It's my fault. I'm a smoking machine. Hell, sometimes I wake up 10, 15 times a night to smoke a cigarette. The moral of my story is that 80 cigarettes a day and a cholesterol level of 300 is like a loaded gun.\"\n\nMellencamp cut down his cigarette intake considerably and changed his diet overnight, helping him regain his health. He returned to the concert stage in early 1995 by playing a series of dates in small Midwestern clubs under the pseudonym Pearl Doggie. Back by the core of his band, Mellencamp featured a cover-heavy set at these rare shows that included songs such as the Stooges' \"No Fun,\" John Lennon's \"Cold Turkey,\" Bob Dylan's \"All Along the Watchtower,\" Neil Young's \"Down by the River,\" the Rolling Stones' \"You Can't Always Get What You Want,\" Van Morrison's \"Gloria,\" Count Five's \"Psychotic Reaction,\" and Arlo Guthrie's \"Coming Into Los Angeles\" along with a handful of his own hits.\n\nMellencamp began working in earnest on his next album in 1995 after the Pearl Doggie shows, and the record came out in September 1996 under the title Mr. Happy Go Lucky — a critically-acclaimed album that saw him integrate strains of dance music (thanks to production by renowned dance producer Junior Vasquez) into his heartland rock sound.\n\n\"It's been fascinating to me how urban records use rhythm and electronics, and it's terribly challenging to make that work in the context of a rock band,\" Mellencamp told Billboard magazine in 1996. \"But we took it further than an urban record. The arrangements are more ambitious, with programs and loops going right along with real drums and guitars.\"\n\nMr. Happy Go Lucky spawned the No. 14 single \"Key West Intermezzo (I Saw You First)\" — Mellencamp's last Top 40 hit — and the exuberant \"Just Another Day,\" which peaked at No. 46. Mellencamp left Mercury records after Mr. Happy Go Lucky and signed a four-album deal with Columbia Records (he wound up making only three albums for the label).\n\nIssued a day before his 47th birthday in 1998, his self-titled debut for Columbia Records included the singles \"Your Life is Now\" and \"I'm Not Running Anymore,\" along with album tracks such as \"Eden Is Burning,\" \"Miss Missy,\" \"It All Comes True\" and \"Chance Meeting At The Tarantula.\" The switch in labels coincided with Dane Clark replacing Aronoff on drums, but the finished product wound up pretty far away from Mellencamp's initial vision for the album.\n\n\"On this record, we ended up quite a-bit away from where we started,\" Mellencamp told Guitar World Acoustic in 1998. \"Initially, I wanted to make a record that barely had drums on it. Donovan made a record (in 1966), Sunshine Superman, and I wanted to start with that same kind of vibe--Eastern, very grand stories, fairy tales. We ended up with a few Eastern instruments. But everybody prepared to make that record. After the last tour, I gave everybody Sunshine Superman, and I said, “Listen to this record, because you’re going to need to know it.” So a lot of the guys, like Andy [York], really took it to heart.\"\n\nIn 1999 Mellencamp covered his own songs as well as those by Bob Dylan and the Drifters for his album Rough Harvest (recorded in 1997), one of two albums he owed Mercury Records to fulfill his contract (the other was The Best That I Could Do, a best-of collection). Mellencamp put an acoustic spin on his re-recorded originals, but the song that got the most attention was his previously hard-to-find cover of the Drifters' \"Under The Boardwalk,\" as Mercury released the song to radio in the summer of '99 and it got a fair amount of airplay -- just as it did in 1986 when Mellencamp originally released it as the B-side to \"R.O.C.K. in the USA.\" \"God bless the Drifters, but I thought the song was a little slow,\" Mellencamp told the St. Louis Post-Dispatch in 1999. \"I think that suited the times very well. I was a kid at the time, and that groove was a very urban groove, a very black groove, and what I did was take that groove and record it with a rock groove.\"\n\nThe early 21st century found Mellencamp teaming up with artists such as Chuck D and India.Arie to deliver his second Columbia album, Cuttin' Heads, which spawned the radio hit \"Peaceful World\" — a duet with Arie (a live acoustic version of the tune sung solo by Mellencamp was included on the benefit album God Bless America). Cuttin' Heads also included a duet with Trisha Yearwood on the harmony-drenched love song \"Deep Blue Heart.\" \"He played me this song,\" Yearwood told country.com, \"and he said, 'I kind of have an idea of like when Emmylou Harris sang on Bob Dylan's record, just kind of harmony all the way through.' So, he flew me to Bloomington, [Ind.], and I sang on it. ... It was really great.\"\n\nMellencamp embarked on the Cuttin' Heads Tour in the summer of 2001, before the album was even released. He opened each show on this tour with a cover of the Rolling Stones' \"Gimme Shelter\" and also played a solo acoustic version of the humorous Cuttin' Heads track \"Women Seem\" at each show.\n\nIn 2003, he released Trouble No More, a quickly-recorded collection of folk and blues covers originally done by artists such as Robert Johnson, Son House, Lucinda Williams and Hoagie Carmichael. The album was also dedicated to Mellencamp's friend, Billboard magazine editor-in-chief Timothy White, who died from a heart attack in 2002. In October 2002, Mellencamp performed the Robert Johnson song \"Stones In My Passway\" at two benefit concerts for White. Columbia Records executives were at the shows and were so taken with Mellencamp's performance of this classic blues tune, that they persuaded him to record an album of vintage American songs. Ironically enough, Mellencamp sang the classic gospel song \"Will The Circle Be Unbroken\" at White's funeral on July 2, 2002.\n\nMellencamp participated in the Vote for Change tour in October 2004 leading up to the 2004 U.S. Presidential election. That same month he released the two-disc career hits retrospective Words & Music: John Mellencamp's Greatest Hits, which contained 35 of his radio singles (including all 22 of his Top 40 hits) along with two new tunes, the socially conscious, R&B-tinged single \"Walk Tall\" along with \"Thank You\" — both produced by Babyface but written by Mellencamp. Throughout 2003 and early 2004, Mellencamp's music was frequently heard at campaign rallies for then-presidential candidate John Edwards. The two most frequently heard songs were \"Your Life Is Now\" and \"Small Town,\" which was Edwards' official campaign song. Mellencamp was also a contributor to Edwards' campaign, contributing $2,000 to his effort in December 2003. Edwards was in the presidential race again in 2007, and during Mellencamp's November 9, 2007 concert in Des Moines, Iowa he joined the rock star onstage in the middle of a solo acoustic rendition of \"Small Town.\"\n\nIn 2005, Mellencamp got the opportunity to tour with two of his idols — Donovan and John Fogerty. The first leg of what was called the Words and Music Tour in the spring of '05 featured Donovan playing in the middle of Mellencamp's set instead of serving as a traditional opening act. Mellencamp would play a handful of songs before introducing Donovan and then duetting with him on the 1966 classic \"Sunshine Superman\" (Mellencamp has cited the album Sunshine Superman as one of his all-time favorite records). Mellencamp would leave the stage as Donovan played seven or eight of his songs (backed by Mellencamp's band), and then returned to finish off his own set after Donovan departed. On the second leg of the tour in the summer of '05, Fogerty co-headlined with Mellencamp at outdoor amphitheaters across the United States. Fogerty played a full set of his own and after a brief intermission, Mellencamp took the stage for his own full set, during which Fogerty would join him for front-porch style duets on the Creedence Clearwater Revival classic \"Green River,\" and Mellencamp's own \"Rain on the Scarecrow.\" During this tour Mellencamp featured a greatest-hits set and dusted off two of his seminal hits for the first time in many years. \"I Need A Lover\" was played live for the first time since the 1994 Dance Naked Tour, while the 1981 hit \"Ain't Even Done With The Night\" was in his setlists for the first time since the Scarecrow Tour two decades earlier.\n\nMellencamp released the critically acclaimed Freedom's Road on January 23, 2007. \"Our Country,\" the first single from the album, hit radio in the fall of 2006. The song was played as the opening song on Mellencamp's 2006 spring tour, and the band that opened for him on that tour, Little Big Town, was called on to record harmonies on the studio version of \"Our Country,\" as well as seven other songs on Freedom's Road. \"Our Country\" began being featured in Chevy Silverado TV commercials in late September of 2006, mostly during football games and big-time sporting events on major American televisions networks. Mellencamp hoped that including the song in the ads would bring it in front of a mass audience, since aging rockers such as himself get little, if any, radio airplay on their new material.\n\nMellencamp shot the music video for \"Our Country\" in Savannah, Georgia on September 17-18, 2006. He also sang the song to open Game 2 of the 2006 World Series. \"Our Country\" was nominated for a 2008 Grammy Award in the category Best Solo Rock Vocal Performance but lost out to Bruce Springsteen's \"Radio Nowhere.\"\n\nMellencamp wrote and produced all 10 songs on Freedom's Road, and the record peaked at No. 5 on the Billboard 200 album chart by selling 56,000 copies in its first week on the market, marking his highest charting release since Scarecrow went to No. 2 in the fall of '85. Notable tunes on Freedom's Road include \"Jim Crow\" — a duet with folk icon Joan Baez and another song about racism — the harmony-soaked \"Forgiveness,\" the acoustically arranged \"Rural Route,\" and the opener \"Someday,\" which was the album's second single.\n\nMellencamp has been working on a musical with horror author Stephen King, entitled Ghost Brothers of Darkland County, since 2000. The play was scheduled to open at Atlanta's Alliance Theatre on April 15, 2009, but the Alliance released a statement on May 5, 2008 that said it's been postponed because of \"unanticipated scheduling problems which could not be resolved in time for the production.\" The statement also said that members of the creative team \"realized the script would not be ready by spring 2009.\" The Alliance now hopes to run the play during its 2009-2010 season. In early 2009, Mellencamp's official website reported that T Bone Burnett is now on board as the musical director of Ghost Brothers of Darkland County.\n\nThe Alliance Theatre originally described Ghost Brothers of Darkland County as \"a sultry Southern gothic mystery with a blues-tinged, guitar-driven score.\" Ryan D'Agostino of Esquire Magazine sat in on a New York rehearsal of Ghost Brothers of Darkland County in the fall of 2007 and had this to say in his review: \"Musicals aren't usually a guy thing. This one, though, is not only tolerable, it's good. It may be the first-ever musical written by men for men. There's no orchestra, just two twangy acoustic guitars, an accordion, and a fiddle. The songs are both haunting and all-American.\" The story is set in the fictional town of Lake Belle Reve, Miss., and centers on the deaths in 1957 of two brothers and a young girl and the legend that grows out of the tragedy.\n\nOn August 13, 2007, Mellencamp began recording his 18th album of original material, titled Life, Death, Love and Freedom (the original title of the album was The Company We Keep, but Mellencamp decided in early 2008 to change it). The album, which was released on July 15, 2008, was produced by T Bone Burnett and has a very folksy, bluesy feel, as most of the songs deal with such topics as death and loneliness. The first song with video, \"Jena,\" was introduced on Mellencamp's web site in October 2007. The song, about the Jena 6 trial in Jena, Louisiana, proved controversial; it was criticized by Jena's mayor, Murphy R. McMillan, who said it unfairly characterized the town as a hotbed of racism. He also called the video \"inflammatory.\"\n\nMike Wanchic, Mellencamp's longtime guitar player, told Billboard Magazine of Life, Death, Love and Freedom in December 2007: \"It's very, very, very organic — upright basses, cocktail (drum) kits, lots of acoustic guitars, really very atmospheric, absolutely one of the coolest sounding records that I've ever heard, of ours or anybody else's.\" In an interview with the Bloomington Herald-Times in March 2008, Mellencamp dubbed the album \"The best record I've ever made.\" He signed with Starbucks' Hear Music label to distribute the album and said, \"they think it's a fucking masterpiece.\" The album's first single is \"My Sweet Love.\" A video for the song was filmed in Savannah, GA on June 9. Karen Fairchild of Little Big Town is featured in the video. She harmonizes with Mellencamp on \"My Sweet Love\" and provides background vocals to three other songs on Life, Death, Love and Freedom, which became the ninth Top 10 album of Mellencamp's career when it debuted at No. 7 on the Billboard 200 the week of August 2, 2008. Like Freedom's Road, Life, Death, Love and Freedom sold 56,000 copies in its first week on the market.\n\nMellencamp made a guest appearance at Billy Joel's July 16, 2008 concert at Shea Stadium in New York, in the second-to-last concert ever performed at the historic venue (Joel played one final show there on July 18 to accommodate the overwhelming ticket demand). He sang \"Pink Houses\" in front of a sold-out crowd of nearly 60,000 people.\n\n \nJohn Mellencamp and Sheryl Crow perform Mellencamp's 2008 single \"My Sweet Love\" in Hunter Valley, New South Wales, Australia on Nov. 29, 2008.On September 3, 2008, Mellencamp made available on his website a home-video recording of his solo acoustic cover of Bob Dylan's \"The Times They Are a-Changin'\" — recorded just a day earlier on a web-cam (explaining the reverse image of the video, in which Mellencamp appears to be playing the guitar left-handed) — as a sign that the 2008 Presidential Election is going to bring about change in America.\n\nMellencamp filmed a concert at the Crump Theatre in Columbus, Indiana on September 23, 2008 for a new A&E Biography series called \"Homeward Bound.\" The show, which features performers returning to small venues they performed at during the early stages of their careers (Mellencamp last played at the Crump Theatre on Oct. 4, 1976 -- just his second concert after becoming a major-label recording artist), aired on Dec. 11, 2008 and also featured an in-depth documentary tracing Mellencamp's roots. During the Columbus concert, Mellencamp performed partial solo acoustic versions of rarely-played songs like \"I Need A Lover\" and songs he hasn't played in years such as \"To M.G. (Wherever She May Be),\" \"Taxi Dancer\" and even a brief snippet of \"Chestnut Street,\" from his 1976 debut album.\n\nMellencamp toured Australia and New Zealand with opening act Sheryl Crow from November 15-December 7, 2008. It marked the first time since 1992 that Mellencamp toured Australia. In fact, it's the first time since '92 that he toured anywhere outside North America. After not collaborating for the first half of the tour, Crow joined Mellencamp on stage to duet on \"My Sweet Love\" during the last seven shows of the trek.\n\nIn its list of the 50 best albums of 2008, Rolling Stone magazine named Life, Death, Love and Freedom No. 5 overall and also dubbed \"Troubled Land\" No. 48 among the 100 best singles of the year.\n\nIn a fall 2008 radio special, Mellencamp said he was unsure of his plans for 2009 but mentioned that T Bone Burnett wants to make another album with him. In February 2009, Mellencamp told the Bloomington Herald Times that the idea of a triple-bill concert tour with him, Willie Nelson and Bob Dylan has been discussed. \"That would be interesting,” Mellencamp said. It was reported on his official website in early 2009 that we will see the release of a long-rumored box set (previously scheduled to be titled \"Nothing Like We Planned\") sometime in '09, in addition to a video for the Life, Death, Love and Freedom track \"A Ride Back Home.\" The video for \"A Ride Back Home\" was shot at the Beck Chapel on the campus of Indiana University on Feb. 16, 2009. Karen Fairchild of Little Big Town is once again featured in this video, as she duets with Mellencamp on the studio version of the song.\n\n\nMovie career\nMellencamp has had a brief career as an actor, appearing in four films: Falling from Grace (which he also directed) (1992), Madison (2001, narration only), After Image (2001), and Lone Star State of Mind (2002). John's older brother Joe Mellencamp appears in Falling from Grace as the bandleader during the country club scene.\n\n\nPersonal life\nMellencamp lives in Bloomington, Indiana and has been married to former supermodel Elaine Irwin Mellencamp since September 5, 1992. Mellencamp has five children from his three marriages: Michelle from his first marriage to Priscilla Esterline (1970-81); daughters Teddi Jo and Justice from his second marriage to Victoria Granucci (1981-89); and sons Hud and Speck from his current marriage.\n\nMellencamp is known to be a big fan of Indiana University basketball and is regularly seen in attendance at home games. He has been a staunch supporter of Indiana University itself for a number of years, having contributed a significant amount of money to the University's cultural and educational programs. In 2000, he gave the IU commencement address, in which he advised graduates to \"play it like you feel it!\" and that \"you'll be all right.\" Following the delivery of his address, Indiana University bestowed upon him an honorary doctorate of Musical Arts.\n\nA popular fixture in and around Bloomington, Mellencamp is often seen dining out in one of his favorite local restaurants, shopping at local farmer's markets and co-ops, and attending musical/artistic events in town. Despite his constant presence, however, Mellencamp is known among citizens for his desire for privacy and \"a normal life,\" often expressing dismay at being approached for autographs or greetings while shopping, dining out, or relaxing with his family (though he is noted to be very cordial and appreciative to those fans who approach him at \"appropriate\" times.) Accordingly, \"Mellencamp sightings\" among Bloomington residents and IU students are a common, though usually anticlimactic, occurrence.\n\nFor recreation, Mellencamp enjoys playing flag football with his family, friends, bandmates and crew members, and the spirited nature of these contests has become legendary. In the late '80s and early '90s, Mellencamp and his band engaged in some serious football competition. \"In the MFL [Mellencamp Football League], we had hired refs,\" guitarist Mike Wanchic told NUVO.net in 2002. \"On the road, on days off, we'd play the crew and get our asses kicked.\"\n\nThese games often took on a much more serious tone than a typical lighthearted pickup game.\n\n\"In the off season in the MFL, we'd play other cities,\" Wanchic said. \"Cincinnati's firemen championship team, we played the New York City flag football team, Jam Promotions in Chicago put together a team with the Bears starting quarterback. We played Polygram (Mellencamp's record label in the '80s and '90s) a couple times. At one point, Tommy Motolla, when he was still managing John, challenged us, he and John had a big bet on the game. Motolla showed up with a New York championship flag team, and these motherfuckers were brutal, all serious college players, semi-professional rugby players. They annihilated us, beat us 70 to nothing, the worst ass-kicking I've ever had in my life. So, then the challenge was on. At one point, Mark Gastineau was on our team.\"\n\nWhile inducting Mellencamp into the Rock and Roll Hall of Fame in March 2008, Billy Joel shared a humorous anecdote about his 1986 brush with Mellencamp's serious brand of flag football.\n\n\"I’m doing a concert in Indianapolis,\" Joel said. \"I get a message that John wants to invite us out to his neck of the woods to play a game of flag football. So we thought, this might be a lot of fun since we have a day off after the show and we take him up on it. We get out to John’s place. I had a talk with the guys in the band. I said, 'Listen, take it easy on John. Don’t rough him up or anything. We don’t want to hurt the guy who writes the songs, right. Just score enough points to win but not by too much because the deal is, whoever loses has to buy a steak dinner for both teams.'\n\n\"Well as it turns out, we didn’t need to be worrying about John getting hurt. He’s all over the field. Throwing passes, catching passes, running, blocking, intercepting, going 'nan nan nan nan nan.' You name it, he did it and we got creamed. The score was something like 63 to zip right up to the very last play when his team laid down on the field and let us score a touchdown. Class.\"\n\nIn an October 2008 interview with hometown radio station WTTS-FM in Bloomington, Mellencamp said he recently played football with new Indiana University head basketball coach Tom Crean. \"If his competitive nature is half of what it was on that little football field that day, we're in good hands,\" Mellencamp said of Indiana's basketball program under Crean's direction. Mellencamp also noted that he still plays football every Sunday during football season and plays \"until it's so cold outside that you can't stand it anymore,\" although the nature of the games nowadays isn't \"as vigorous as it once was.\"\n\n\n Politics\nAccording to a February 8, 2008 Associated Press report, Mellencamp suggested that the campaign for presidential candidate Sen. John McCain stop using his songs, including \"Our Country\" and \"Pink Houses,\" during their campaign events. McCain's campaign responded by pulling the songs from their playlist. Mellencamp's publicist, Bob Merlis, noted to the Associated Press that \"if (McCain is) such a true conservative, why (is he) playing songs that have a very populist pro-labor message written by a guy who would find no argument if you characterized him as left of center?\" [4]\n\nMellencamp, an ardent Democrat, performed \"Small Town\" at a Barack Obama rally in Evansville, Indiana on April 22, the night of the 2008 Pennsylvania primary.[5]\n\nMellencamp also performed \"Our Country\" at a rally for Hillary Clinton in Indianapolis, IN on May 3, 2008, although he never came out in support of either Obama or Clinton during the primaries. \"Neither candidate is as liberal as he would prefer, but he's happy to contribute what he can,\" Merlis said.\n\nHowever, Mellencamp did publicly support Obama once he earned the Democratic nomination and had this to say on his official website on Nov. 5, 2008 -- the day after Obama was elected the 44th President of the United States:\n\nThis, for me, is something I never thought I would see in my life.\n\nI remember the assassination of Martin Luther King and the marches in Selma, Alabama, and seeing Rosa Parks, demonstrators getting sprayed by fire hoses and attacked by police dogs and all the other horrible things that happened at that time in our country. Then I played at the 2004 Democratic Convention, which was my first introduction to Barack Obama, and after his keynote address I looked at my wife Elaine and said, ‘Man, what a poet! He could be president of the United States!’ And that’s absolutely verbatim.\n\nBut even I, who have written countless songs about race, could not believe that a man of color could be president of the United States. But today I am so proud of America. I am so happy for all Americans, that we have finally started to fulfill our obligation to the immortal words of our Declaration of Independence, that all men are created equal. We cannot expect this man to immediately change the last eight years of fear and deception, but I think we can rejoice in the fact that there is someone speaking not just for his own interests, now, but hopefully as a voice for us all.\n\nOn Sunday, January 18, 2009, Mellencamp performed \"Pink Houses\" at the We Are One: The Obama Inaugural Celebration at the Lincoln Memorial.\n\n\n[edit] Honors and awards\nMellencamp has won one Grammy Award (Best Male Rock Performer for \"Hurts So Good\" in 1982) and been nominated for 12 others. He has also been bestowed with the Nordoff-Robbins Silver Clef Special Music Industry Humanitarian Award (1991), the Billboard Century Award (2001), the Woody Guthrie Award (2003), and the ASCAP Foundation Champion Award (2007). On October 6, 2008, Mellencamp won the prestigious Classic Songwriter Award at the 2008 Q Awards in London, England. Mellencamp has been nominated for induction into the Songwriters Hall of Fame and will find out in February 2009 if he's been selected.\n\nMellencamp's biggest honor came when was inducted into the Rock and Roll Hall of Fame's Class of 2008. The induction ceremony took place in New York City on March 10, and Mellencamp was inducted by good friend Billy Joel, who asked Mellencamp to induct him into the Rock Hall back in 1999 (Mellencamp had to opt out because of another commitment, so Ray Charles inducted Joel). During his induction speech for Mellencamp, Joel said:\n\nDon't let this club membership change you, John. Stay ornery, stay mean. We need you to be pissed off, and restless, because no matter what they tell us - we know, this country is going to hell in a handcart. This country's been hijacked. You know it, and I know it. People are worried. People are scared, and people are angry. People need to hear a voice like yours that's out there to echo the discontent that's out there in the heartland. They need to hear stories about it. They need to hear stories about frustration, alienation and desperation. They need to know that somewhere out there somebody feels the way that they do, in the small towns and in the big cities. They need to hear it. And it doesn't matter if they hear it on a jukebox, in the local gin mill, or in a goddamn truck commercial, because they ain't gonna hear it on the radio anymore. They don't care how they hear it, as long as they hear it good and loud and clear -- the way you've always been saying it all along. You're right John, this is still our country.\n\nFun Fact:\nMatthew McConaughey's music background started when his brother Pat woke Matthew up to go outside (in his underwear!!!) to  listen to John Cougar Mellencam's \"Warmer place to sleep\". <a href=\"https://www.last.fm/music/+noredirect/John+Cougar+Mellencamp\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "237890",
      "discogs_original_name": "John Cougar Mellencamp",
      "id": null,
      "lastfm_mbid": "0aad6b52-fd93-4ea4-9c5d-1f66e1bc9f0a",
      "name": "John Cougar Mellencamp",
      "role": "",
      "spotify_id": "3lPQ2Fk5JOwGWAF3ORFCqH",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "John Cougar Mellencamp": {
      "biography": "John Cougar Mellencamp, is the third stage name of John Mellencamp, who had previously been known as Johnny Cougar and then John Cougar.  Mellencamp, (born October 7, 1951, in Seymour, Indiana) is a Grammy-winning American rock singer-songwriter, musician, artist and occasional actor.\n\nMellencamp was inducted into the Rock and Roll Hall of Fame on March 10, 2008, by Billy Joel.[1] His biggest musical influences are Bob Dylan, Woody Guthrie and The Rolling Stones.\n\nMellencamp who was born, with a mild form of spina bifida which necessitated a lengthy stay in the hospital as a baby. He is descended from German immigrant Johann Herman Möhlenkamp who came to the White Creek area of Bartholomew County, Indiana in the United States in 1855.\n\nMellencamp had trouble with the law as a teeneager and formed his first band at the age of 14. He eloped with his pregnant girlfriend at the age of 17[2] and had his first child (Michelle) just six months after graduating from high school in 1970. In 1974, he graduated from Vincennes University, a two-year college in Vincennes, Indiana, and took a job at a telephone company in his hometown of Seymour, Indiana before deciding to go to New York in an attempt to land a record deal,[2] which he finally managed to do in late 1975.\n\nThe John Cougar years (1976–1982)\nAfter about 18 months of traveling back and forth from Indiana to New York City in 1974 and '75, Mellencamp finally found someone receptive to his music and image in Tony DeFries of MainMan Management (at the time well-known for representing David Bowie, one of Mellencamp's musical idols at the time[citation needed]). DeFries insisted that Mellencamp's first album, Chestnut Street Incident, a collection of covers and derivative originals (Mellencamp had written just a handful of songs prior to landing a record deal and was still very raw), be released under the stage name Johnny Cougar, a move Mellencamp claims was made without his knowledge and against his wishes. The album was a failure, selling just 12,000 copies.\n\nMellencamp recorded The Kid Inside in 1977, the follow-up to Chestnut Street Incident, but DeFries eventually decided against releasing the album and Mellencamp was dropped from MCA records. He worked with Rod Stewart's manager Billy Gaff after parting ways with DeFries and was signed to the tiny Riva Records label. At Gaff's request, Mellencamp moved to London, England for nearly a year to record, promote and tour behind 1978's A Biography. The record wasn't released in the United States, but yielded a No. 1 hit in Australia with \"I Need a Lover.\"[citation needed] Riva Records added \"I Need a Lover\" to Mellencamp's next album released in the United States, 1979's John Cougar, where the song became a Number 28 single in late 1979. Rocker Pat Benatar recorded \"I Need a Lover\" on her debut album In the Heat of the Night, and her version garnered a good deal of FM radio airplay even though it was not issued as a single in the United States.\n\nIn 1980, Mellencamp returned with the Steve Cropper-produced Nothin' Matters And What If It Did, which yielded two Top 40 singles — \"This Time\" (Number 27) and \"Ain't Even Done With The Night\" (No. 17) — and showed continued improvement in both his songwriting and singing. However, Mellencamp was not particularly fond of the album or its two hit singles.\n\n\"The singles were stupid little pop songs,\" he told Record Magazine in 1983. \"I take no credit for that record. It wasn't like the title was made up — it wasn't supposed to be punky or cocky like some people thought. Toward the end, I didn't even go to the studio. Me and the guys in the band thought we were finished, anyway. It was the most expensive record I ever made. It cost $280,000, do you believe that? The worst thing was that I could have gone on making records like that for hundreds of years. Hell, as long as you sell a few records and the record company isn't putting lot of money into promotion, you're making money for 'em and that's all they care about. PolyGram loved Nothin' Matters. They thought I was going to turn into the next Neil Diamond.\"\n\nIn 1982, Mellencamp released his breakthrough album, American Fool (see 1982 in music). The album had a rootsy, garage-rock vibe and spawned the hit singles \"Hurts So Good,\" which spent four weeks at No. 2, and \"Jack and Diane,\" which stayed at Number One for four weeks. Those mega-hits sent American Fool to the top of the charts. A third single, \"Hand To Hold On To,\" made it to Number 19 and was a staple in his concerts throughout the 1980s. Additionally, \"Hurts So Good\" spent 16 weeks in the Top Ten (more than any other single in the 1980s); and \"Jack and Diane\" is, to date, Mellencamp's only single ever to top the Billboard Hot 100. \"Hurts So Good\" went on to win the Grammy Award for Best Male Rock Vocal Performance at the 25th Grammys. Despite the fact that American Fool made Mellencamp a superstar, he doesn't consider it anywhere close to a masterpiece.\n\n\"To be real honest, there's three good songs on that record, and the rest is just sort of filler,\" Mellencamp told Creem magazine in 1984. \"It was too labored over, too thought about, and it wasn't organic enough. The record company thought it would bomb, but I think the reason it took off was – not that the songs were better than my others – but people liked the sound of it, the 'bam-bam-bam' drums. It was a different sound.\"\n\nIn early 1983, after Mellencamp had broken through to stardom with American Fool, DeFries finally released The Kid Inside in an attempt to cash in on the singer's newfound success. \"If he'd have been smart about it, he'd have worked with us because I've got other records that never came out in America,\" Mellencamp told Creem magazine in 1984. \"We could've put together a compilation. But it was the way he did it. He released it right on the tail of American Fool, and it confused a lot of people.\"\n\n\nThe John Cougar Mellencamp years (1983–1990)\nFinally having enough commercial success to give him some clout, Mellencamp forced the record company to add his real surname to his stage moniker. The first album he recorded as John Cougar Mellencamp was 1983's Uh-Huh, a top-10 hit that spawned the hit singles \"Pink Houses,\" \"Crumblin' Down\" (both of which made the top 10) and \"Authority Song,\" which Mellencamp called \"our new version of 'I Fought The Law'.\" During the recording of Uh-Huh, Mellencamp's backing band settled on the lineup it would retain for the next several albums: Kenny Aronoff on drums and percussion, Larry Crane and Mike Wanchic on guitars, Toby Myers on bass and John Cascella on keyboards. In 1988 Rolling Stone magazine called this version of Mellencamp's band \"one of the most powerful and versatile live bands ever assembled.\" On the 1984 Uh-Huh Tour, Mellencamp opened his shows with cover versions of songs he loved growing up, such as Elvis Presley's \"Heartbreak Hotel,\" the Animals' \"Don't Let Me Be Misunderstood,\" Lee Dorsey's \"Ya Ya,\" and the Left Banke's \"Pretty Ballerina.\"\n\nIn 1985, Mellencamp released Scarecrow -- an organic record with socially aware lyrics and filled with songs focusing on the plight of the American family farmer, small-town life, and the state of the nation. Scarecrow is now considered a classic American rock album and marked the true beginning of Mellencamp as a serious social commentator. Shortly after finishing Scarecrow, Mellencamp helped organize the first Farm Aid benefit concert with Willie Nelson and Neil Young in Champaign, Illinois on September 22, 1985. The Farm Aid concerts remain an annual event and have raised over $30 million for struggling family farmers through 2008.\n\nScarecrow was an enormous success, peaking at No. 2 in the fall of '85 and spawning five Top 40 singles. \"Lonely Ol' Night,\" \"Small Town,\" and \"R.O.C.K. in the U.S.A.\" all became Top 10 hits, and \"Rain On The Scarecrow\" and \"Rumbleseat\" cracked the Top 40 and garnered considerable play on album-rock stations. Scarecrow was also the first album Mellencamp recorded at his own recording studio, located in Belmont, Indiana and built in 1984. All of his subsequent albums after Scarecrow have also been recorded there. Mellencamp dubbed the studio the Belmont Mall, because Belmont is a tiny municipality that not only has no shopping mall, but features little more than a gas station.\n\nBefore recording Scarecrow, Mellencamp forced his band to learn numerous vintage rock, R&B, and soul songs inside and out so that they could put some of the grit and knowledge they derived from those classics into his own songs. He articulated in a 1986 interview with Creem magazine just how his band learning those songs help shape the sound of Scarecrow, citing the track \"Face of the Nation\" as an example.\n\n\"Learning those songs did a lot of positive things. We realized more than ever what a big melting pot of all different types of music the '60s were. Take an old Rascals song for example – there's everything from marching band beats to soul music to country sounds in one song. Learning those opened the band's vision to try new things on my songs. It wasn't let's go back and try to make this part fit into my song, but I wanted to capture the same feeling – the way those songs used to make you feel. After a while, we didn't even have to talk about it anymore. If you listen to the lead Larry (Crane) plays on 'Face The Nation', he never would have played that 'cause he didn't really know who the Animals were. He's young, and he grew up on Grand Funk Railroad. You hear it, and it's like 'where did that come from?' It had to be from hearing those old records.\"\n\nPrior to the 1985-86 Scarecrow Tour, during which he covered a bunch of those same 1960s rock and soul songs he and his band rehearsed prior to the recording of Scarecrow, Mellencamp added fiddle player Lisa Germano to his band to accent and deepen his overall sound. Germano would remain in Mellencamp's band until 1994, when she left to pursue a solo career.\n\nGermano played a big role in Mellencamp's next LP, 1987's The Lonesome Jubilee, which was departure from his earlier material as it incorporated country and folk influences. It generated several more hit singles, \"Paper in Fire,\" \"Cherry Bomb,\" and \"Check It Out,\" along with hit album tracks like \"Hard Times For An Honest Man\" and \"The Real Life,\" and was considered one of the finest albums of the 1980s.\n\n\"We were on the road for a long time after Scarecrow, so we were together a lot as a band,\" Mellencamp said in a 1987 Creem magazine feature. \"For the first time ever, we talked about the record before we started. We had a very distinct vision of what should be happening here. At one point, The Lonesome Jubilee was supposed to be a double album, but at least 10 of the songs I'd written just didn't stick together with the idea and the sound we had in mind. So I just put those songs on a shelf, and cut it back down to a single record. Now, in the past, it was always 'Let's make it up as we go along' – and we did make some of The Lonesome Jubilee up as we went along. But we had a very clear idea of what we wanted it to sound like, even before it was written, right through to the day it was mastered.\"\n\nDuring the 1987-88 Lonesome Jubilee Tour, Mellencamp was joined onstage by surprise guest Bruce Springsteen at the end of his May 26, 1988 gig in Irvine, California for a rousing duet of the Bob Dylan classic \"Like a Rolling Stone,\" which Mellencamp performed as the penultimate song during each show on that tour.\n\nAfter The Lonesome Jubilee Tour, Mellencamp went through an acrimonious divorce from his second wife, Vicki, and entered a somewhat dark period in his life, although he is not known to drink or take drugs. Those who have been with Mellencamp since the beginning of his career say they've never seen him touch a drug or drink a drop of alcohol. \"John is a complete teetotaller and always has been,\" Mike Wanchic, who has been Mellencamp's rhythm guitar player since 1976, told NUVO.net in 2002. \"Never seen him take a drink of alcohol, never seen him do a drug in his entire life. Not since day one.\" Mellencamp's only vice is his four-pack-a-day cigarette habit (a 1994 heart attack forced him to cut down to about one pack a day).\n\nIn 1989, Mellencamp released Big Daddy, a quieter, mostly acoustic venture filled with introspective songs reflecting his mood of the time. However somber, Big Daddy still contained standout tunes like \"Jackie Brown,\" \"Big Daddy of Them All\" and \"Void in My Heart,\" along with the top 15 single \"Pop Singer.\" The album, which Mellencamp called at the time the most \"earthy\" record he'd ever made, is also the last to feature both the \"Cougar\" moniker and the innovative, fiddle-based Appalachian sound he first tried with The Lonesome Jubilee. Mellencamp was heavily involved in painting at this time in his life, and decided not to tour behind Big Daddy so that he could fully explore his newfound passion. It would be two years before he was heard from again.\n\n\n[edit] The John Mellencamp years (1991–present)\nMellencamp's 1991 album, the hard-rocking Whenever We Wanted, was the first whose cover was billed to just John Mellencamp. It yielded the Top 40 hits \"Get A Leg Up\" and \"Again Tonight,\" along with the mainstream rock hits \"Last Chance,\" \"Love and Happiness\" and \"Now More Than Ever.\" \"It's very rock 'n' roll,\" Mellencamp said of Whenever We Wanted. \"I just wanted to get back to the basics.\"\n\nIn 1993, he released Human Wheels, one of his most critically-acclaimed albums, although the title track peaked at a disappointing No. 48 on the Billboard singles charts, a fact that Mellencamp directly attributes to his label's refusal to spend another $30,000 on promotion for the song. Still, Human Wheels has widely been regarded as one of his strongest works.\n\n\"To me, this record is very urban,\" Mellencamp told Billboard magazine of Human Wheels in the summer of '93. \"We had a lot of discussions about the rhythm and blues music of the day. We explored what a lot of these (current) bands are doing — these young black bands that are doing more than just sampling.\n\n\"The rhythms in songs like 'When Jesus Left Birmingham' or 'French Shoes' or 'Junior' are R&B, but to me R&B is the basic beat that propels the human body. Sly & the Family Stone also deserve a tip of the hat here, because as a kid when I heard Sly sing 'hot fun at the country fair,' I said, 'Man, that's for me!' Years later, I saw that there was a lot more subtlety and intensity to his music than I first realized. And whether you hear the influence in Tone Loc or Arrested Development, Sly remains an undercredited inspiration in '90s rock'n'roll. He made street music, and I wanted things like 'Birmingham' to have the rhythm of the streets.\"\n\nMellencamp returned to the upper reaches of the charts in 1994, when his quickly-recorded, 29-minute Dance Naked album yielded his biggest hit since \"R.O.C.K in the USA\" in 1986 with a cover of Van Morrison's \"Wild Night\" as a duet with Me'Shell NdegeOcello, an avowed Mellencamp fan. \"One reason I liked him was that lyrically, he's simple, but at the same time complex,\" NdegeOcello told Billboard magazine in 1994. \"His songs talked to me about life in a language I could understand, while musically they had that raw energy which I thrive on, which is great to dance to. He's a real groovesman, and a very strong vocalist: Like a hip-hopper, he's a viber—he's got to feel the music to make him sing the way he wants to sing.\"\n\nThe stripped-down Dance Naked also contained two protest songs in \"L.U.V.\" and \"Another Sunny Day 12/25,\" in addition to the title track, which hit No. 41 on the Billboard Hot 100 in the summer of '94.\n\n\"This is as naked a rock record as you're going to hear,\" Mellencamp said of Dance Naked in a 1994 Billboard magazine interview. \"All the vocals are first or second takes, and half the songs don't even have bass parts. Others have just one guitar, bass, and drums, which I haven't done since 'American Fool.' 'Hurts So Good' had one guitar, bass, and drums, and I think one tambourine.\"\n\nMellencamp launched his Dance Naked Tour in the summer of '94, but a minor heart attack suffered after a show at Jones Beach in New York on Aug. 8 of that year forced him to cancel the last few weeks of the tour (he wound up playing through Sept. 2 before seeing a doctor and being diagnosed as having suffered a heart attack. All dates after Sept. 2 were canceled). Mellencamp blamed his minor myocardial infarction on his four-pack-a-day cigarette habit and poor diet.\n\n\"It's nobody else's fault,\" he told Rolling Stone magazine in late 1994. \"It's my fault. I'm a smoking machine. Hell, sometimes I wake up 10, 15 times a night to smoke a cigarette. The moral of my story is that 80 cigarettes a day and a cholesterol level of 300 is like a loaded gun.\"\n\nMellencamp cut down his cigarette intake considerably and changed his diet overnight, helping him regain his health. He returned to the concert stage in early 1995 by playing a series of dates in small Midwestern clubs under the pseudonym Pearl Doggie. Back by the core of his band, Mellencamp featured a cover-heavy set at these rare shows that included songs such as the Stooges' \"No Fun,\" John Lennon's \"Cold Turkey,\" Bob Dylan's \"All Along the Watchtower,\" Neil Young's \"Down by the River,\" the Rolling Stones' \"You Can't Always Get What You Want,\" Van Morrison's \"Gloria,\" Count Five's \"Psychotic Reaction,\" and Arlo Guthrie's \"Coming Into Los Angeles\" along with a handful of his own hits.\n\nMellencamp began working in earnest on his next album in 1995 after the Pearl Doggie shows, and the record came out in September 1996 under the title Mr. Happy Go Lucky — a critically-acclaimed album that saw him integrate strains of dance music (thanks to production by renowned dance producer Junior Vasquez) into his heartland rock sound.\n\n\"It's been fascinating to me how urban records use rhythm and electronics, and it's terribly challenging to make that work in the context of a rock band,\" Mellencamp told Billboard magazine in 1996. \"But we took it further than an urban record. The arrangements are more ambitious, with programs and loops going right along with real drums and guitars.\"\n\nMr. Happy Go Lucky spawned the No. 14 single \"Key West Intermezzo (I Saw You First)\" — Mellencamp's last Top 40 hit — and the exuberant \"Just Another Day,\" which peaked at No. 46. Mellencamp left Mercury records after Mr. Happy Go Lucky and signed a four-album deal with Columbia Records (he wound up making only three albums for the label).\n\nIssued a day before his 47th birthday in 1998, his self-titled debut for Columbia Records included the singles \"Your Life is Now\" and \"I'm Not Running Anymore,\" along with album tracks such as \"Eden Is Burning,\" \"Miss Missy,\" \"It All Comes True\" and \"Chance Meeting At The Tarantula.\" The switch in labels coincided with Dane Clark replacing Aronoff on drums, but the finished product wound up pretty far away from Mellencamp's initial vision for the album.\n\n\"On this record, we ended up quite a-bit away from where we started,\" Mellencamp told Guitar World Acoustic in 1998. \"Initially, I wanted to make a record that barely had drums on it. Donovan made a record (in 1966), Sunshine Superman, and I wanted to start with that same kind of vibe--Eastern, very grand stories, fairy tales. We ended up with a few Eastern instruments. But everybody prepared to make that record. After the last tour, I gave everybody Sunshine Superman, and I said, “Listen to this record, because you’re going to need to know it.” So a lot of the guys, like Andy [York], really took it to heart.\"\n\nIn 1999 Mellencamp covered his own songs as well as those by Bob Dylan and the Drifters for his album Rough Harvest (recorded in 1997), one of two albums he owed Mercury Records to fulfill his contract (the other was The Best That I Could Do, a best-of collection). Mellencamp put an acoustic spin on his re-recorded originals, but the song that got the most attention was his previously hard-to-find cover of the Drifters' \"Under The Boardwalk,\" as Mercury released the song to radio in the summer of '99 and it got a fair amount of airplay -- just as it did in 1986 when Mellencamp originally released it as the B-side to \"R.O.C.K. in the USA.\" \"God bless the Drifters, but I thought the song was a little slow,\" Mellencamp told the St. Louis Post-Dispatch in 1999. \"I think that suited the times very well. I was a kid at the time, and that groove was a very urban groove, a very black groove, and what I did was take that groove and record it with a rock groove.\"\n\nThe early 21st century found Mellencamp teaming up with artists such as Chuck D and India.Arie to deliver his second Columbia album, Cuttin' Heads, which spawned the radio hit \"Peaceful World\" — a duet with Arie (a live acoustic version of the tune sung solo by Mellencamp was included on the benefit album God Bless America). Cuttin' Heads also included a duet with Trisha Yearwood on the harmony-drenched love song \"Deep Blue Heart.\" \"He played me this song,\" Yearwood told country.com, \"and he said, 'I kind of have an idea of like when Emmylou Harris sang on Bob Dylan's record, just kind of harmony all the way through.' So, he flew me to Bloomington, [Ind.], and I sang on it. ... It was really great.\"\n\nMellencamp embarked on the Cuttin' Heads Tour in the summer of 2001, before the album was even released. He opened each show on this tour with a cover of the Rolling Stones' \"Gimme Shelter\" and also played a solo acoustic version of the humorous Cuttin' Heads track \"Women Seem\" at each show.\n\nIn 2003, he released Trouble No More, a quickly-recorded collection of folk and blues covers originally done by artists such as Robert Johnson, Son House, Lucinda Williams and Hoagie Carmichael. The album was also dedicated to Mellencamp's friend, Billboard magazine editor-in-chief Timothy White, who died from a heart attack in 2002. In October 2002, Mellencamp performed the Robert Johnson song \"Stones In My Passway\" at two benefit concerts for White. Columbia Records executives were at the shows and were so taken with Mellencamp's performance of this classic blues tune, that they persuaded him to record an album of vintage American songs. Ironically enough, Mellencamp sang the classic gospel song \"Will The Circle Be Unbroken\" at White's funeral on July 2, 2002.\n\nMellencamp participated in the Vote for Change tour in October 2004 leading up to the 2004 U.S. Presidential election. That same month he released the two-disc career hits retrospective Words & Music: John Mellencamp's Greatest Hits, which contained 35 of his radio singles (including all 22 of his Top 40 hits) along with two new tunes, the socially conscious, R&B-tinged single \"Walk Tall\" along with \"Thank You\" — both produced by Babyface but written by Mellencamp. Throughout 2003 and early 2004, Mellencamp's music was frequently heard at campaign rallies for then-presidential candidate John Edwards. The two most frequently heard songs were \"Your Life Is Now\" and \"Small Town,\" which was Edwards' official campaign song. Mellencamp was also a contributor to Edwards' campaign, contributing $2,000 to his effort in December 2003. Edwards was in the presidential race again in 2007, and during Mellencamp's November 9, 2007 concert in Des Moines, Iowa he joined the rock star onstage in the middle of a solo acoustic rendition of \"Small Town.\"\n\nIn 2005, Mellencamp got the opportunity to tour with two of his idols — Donovan and John Fogerty. The first leg of what was called the Words and Music Tour in the spring of '05 featured Donovan playing in the middle of Mellencamp's set instead of serving as a traditional opening act. Mellencamp would play a handful of songs before introducing Donovan and then duetting with him on the 1966 classic \"Sunshine Superman\" (Mellencamp has cited the album Sunshine Superman as one of his all-time favorite records). Mellencamp would leave the stage as Donovan played seven or eight of his songs (backed by Mellencamp's band), and then returned to finish off his own set after Donovan departed. On the second leg of the tour in the summer of '05, Fogerty co-headlined with Mellencamp at outdoor amphitheaters across the United States. Fogerty played a full set of his own and after a brief intermission, Mellencamp took the stage for his own full set, during which Fogerty would join him for front-porch style duets on the Creedence Clearwater Revival classic \"Green River,\" and Mellencamp's own \"Rain on the Scarecrow.\" During this tour Mellencamp featured a greatest-hits set and dusted off two of his seminal hits for the first time in many years. \"I Need A Lover\" was played live for the first time since the 1994 Dance Naked Tour, while the 1981 hit \"Ain't Even Done With The Night\" was in his setlists for the first time since the Scarecrow Tour two decades earlier.\n\nMellencamp released the critically acclaimed Freedom's Road on January 23, 2007. \"Our Country,\" the first single from the album, hit radio in the fall of 2006. The song was played as the opening song on Mellencamp's 2006 spring tour, and the band that opened for him on that tour, Little Big Town, was called on to record harmonies on the studio version of \"Our Country,\" as well as seven other songs on Freedom's Road. \"Our Country\" began being featured in Chevy Silverado TV commercials in late September of 2006, mostly during football games and big-time sporting events on major American televisions networks. Mellencamp hoped that including the song in the ads would bring it in front of a mass audience, since aging rockers such as himself get little, if any, radio airplay on their new material.\n\nMellencamp shot the music video for \"Our Country\" in Savannah, Georgia on September 17-18, 2006. He also sang the song to open Game 2 of the 2006 World Series. \"Our Country\" was nominated for a 2008 Grammy Award in the category Best Solo Rock Vocal Performance but lost out to Bruce Springsteen's \"Radio Nowhere.\"\n\nMellencamp wrote and produced all 10 songs on Freedom's Road, and the record peaked at No. 5 on the Billboard 200 album chart by selling 56,000 copies in its first week on the market, marking his highest charting release since Scarecrow went to No. 2 in the fall of '85. Notable tunes on Freedom's Road include \"Jim Crow\" — a duet with folk icon Joan Baez and another song about racism — the harmony-soaked \"Forgiveness,\" the acoustically arranged \"Rural Route,\" and the opener \"Someday,\" which was the album's second single.\n\nMellencamp has been working on a musical with horror author Stephen King, entitled Ghost Brothers of Darkland County, since 2000. The play was scheduled to open at Atlanta's Alliance Theatre on April 15, 2009, but the Alliance released a statement on May 5, 2008 that said it's been postponed because of \"unanticipated scheduling problems which could not be resolved in time for the production.\" The statement also said that members of the creative team \"realized the script would not be ready by spring 2009.\" The Alliance now hopes to run the play during its 2009-2010 season. In early 2009, Mellencamp's official website reported that T Bone Burnett is now on board as the musical director of Ghost Brothers of Darkland County.\n\nThe Alliance Theatre originally described Ghost Brothers of Darkland County as \"a sultry Southern gothic mystery with a blues-tinged, guitar-driven score.\" Ryan D'Agostino of Esquire Magazine sat in on a New York rehearsal of Ghost Brothers of Darkland County in the fall of 2007 and had this to say in his review: \"Musicals aren't usually a guy thing. This one, though, is not only tolerable, it's good. It may be the first-ever musical written by men for men. There's no orchestra, just two twangy acoustic guitars, an accordion, and a fiddle. The songs are both haunting and all-American.\" The story is set in the fictional town of Lake Belle Reve, Miss., and centers on the deaths in 1957 of two brothers and a young girl and the legend that grows out of the tragedy.\n\nOn August 13, 2007, Mellencamp began recording his 18th album of original material, titled Life, Death, Love and Freedom (the original title of the album was The Company We Keep, but Mellencamp decided in early 2008 to change it). The album, which was released on July 15, 2008, was produced by T Bone Burnett and has a very folksy, bluesy feel, as most of the songs deal with such topics as death and loneliness. The first song with video, \"Jena,\" was introduced on Mellencamp's web site in October 2007. The song, about the Jena 6 trial in Jena, Louisiana, proved controversial; it was criticized by Jena's mayor, Murphy R. McMillan, who said it unfairly characterized the town as a hotbed of racism. He also called the video \"inflammatory.\"\n\nMike Wanchic, Mellencamp's longtime guitar player, told Billboard Magazine of Life, Death, Love and Freedom in December 2007: \"It's very, very, very organic — upright basses, cocktail (drum) kits, lots of acoustic guitars, really very atmospheric, absolutely one of the coolest sounding records that I've ever heard, of ours or anybody else's.\" In an interview with the Bloomington Herald-Times in March 2008, Mellencamp dubbed the album \"The best record I've ever made.\" He signed with Starbucks' Hear Music label to distribute the album and said, \"they think it's a fucking masterpiece.\" The album's first single is \"My Sweet Love.\" A video for the song was filmed in Savannah, GA on June 9. Karen Fairchild of Little Big Town is featured in the video. She harmonizes with Mellencamp on \"My Sweet Love\" and provides background vocals to three other songs on Life, Death, Love and Freedom, which became the ninth Top 10 album of Mellencamp's career when it debuted at No. 7 on the Billboard 200 the week of August 2, 2008. Like Freedom's Road, Life, Death, Love and Freedom sold 56,000 copies in its first week on the market.\n\nMellencamp made a guest appearance at Billy Joel's July 16, 2008 concert at Shea Stadium in New York, in the second-to-last concert ever performed at the historic venue (Joel played one final show there on July 18 to accommodate the overwhelming ticket demand). He sang \"Pink Houses\" in front of a sold-out crowd of nearly 60,000 people.\n\n \nJohn Mellencamp and Sheryl Crow perform Mellencamp's 2008 single \"My Sweet Love\" in Hunter Valley, New South Wales, Australia on Nov. 29, 2008.On September 3, 2008, Mellencamp made available on his website a home-video recording of his solo acoustic cover of Bob Dylan's \"The Times They Are a-Changin'\" — recorded just a day earlier on a web-cam (explaining the reverse image of the video, in which Mellencamp appears to be playing the guitar left-handed) — as a sign that the 2008 Presidential Election is going to bring about change in America.\n\nMellencamp filmed a concert at the Crump Theatre in Columbus, Indiana on September 23, 2008 for a new A&E Biography series called \"Homeward Bound.\" The show, which features performers returning to small venues they performed at during the early stages of their careers (Mellencamp last played at the Crump Theatre on Oct. 4, 1976 -- just his second concert after becoming a major-label recording artist), aired on Dec. 11, 2008 and also featured an in-depth documentary tracing Mellencamp's roots. During the Columbus concert, Mellencamp performed partial solo acoustic versions of rarely-played songs like \"I Need A Lover\" and songs he hasn't played in years such as \"To M.G. (Wherever She May Be),\" \"Taxi Dancer\" and even a brief snippet of \"Chestnut Street,\" from his 1976 debut album.\n\nMellencamp toured Australia and New Zealand with opening act Sheryl Crow from November 15-December 7, 2008. It marked the first time since 1992 that Mellencamp toured Australia. In fact, it's the first time since '92 that he toured anywhere outside North America. After not collaborating for the first half of the tour, Crow joined Mellencamp on stage to duet on \"My Sweet Love\" during the last seven shows of the trek.\n\nIn its list of the 50 best albums of 2008, Rolling Stone magazine named Life, Death, Love and Freedom No. 5 overall and also dubbed \"Troubled Land\" No. 48 among the 100 best singles of the year.\n\nIn a fall 2008 radio special, Mellencamp said he was unsure of his plans for 2009 but mentioned that T Bone Burnett wants to make another album with him. In February 2009, Mellencamp told the Bloomington Herald Times that the idea of a triple-bill concert tour with him, Willie Nelson and Bob Dylan has been discussed. \"That would be interesting,” Mellencamp said. It was reported on his official website in early 2009 that we will see the release of a long-rumored box set (previously scheduled to be titled \"Nothing Like We Planned\") sometime in '09, in addition to a video for the Life, Death, Love and Freedom track \"A Ride Back Home.\" The video for \"A Ride Back Home\" was shot at the Beck Chapel on the campus of Indiana University on Feb. 16, 2009. Karen Fairchild of Little Big Town is once again featured in this video, as she duets with Mellencamp on the studio version of the song.\n\n\nMovie career\nMellencamp has had a brief career as an actor, appearing in four films: Falling from Grace (which he also directed) (1992), Madison (2001, narration only), After Image (2001), and Lone Star State of Mind (2002). John's older brother Joe Mellencamp appears in Falling from Grace as the bandleader during the country club scene.\n\n\nPersonal life\nMellencamp lives in Bloomington, Indiana and has been married to former supermodel Elaine Irwin Mellencamp since September 5, 1992. Mellencamp has five children from his three marriages: Michelle from his first marriage to Priscilla Esterline (1970-81); daughters Teddi Jo and Justice from his second marriage to Victoria Granucci (1981-89); and sons Hud and Speck from his current marriage.\n\nMellencamp is known to be a big fan of Indiana University basketball and is regularly seen in attendance at home games. He has been a staunch supporter of Indiana University itself for a number of years, having contributed a significant amount of money to the University's cultural and educational programs. In 2000, he gave the IU commencement address, in which he advised graduates to \"play it like you feel it!\" and that \"you'll be all right.\" Following the delivery of his address, Indiana University bestowed upon him an honorary doctorate of Musical Arts.\n\nA popular fixture in and around Bloomington, Mellencamp is often seen dining out in one of his favorite local restaurants, shopping at local farmer's markets and co-ops, and attending musical/artistic events in town. Despite his constant presence, however, Mellencamp is known among citizens for his desire for privacy and \"a normal life,\" often expressing dismay at being approached for autographs or greetings while shopping, dining out, or relaxing with his family (though he is noted to be very cordial and appreciative to those fans who approach him at \"appropriate\" times.) Accordingly, \"Mellencamp sightings\" among Bloomington residents and IU students are a common, though usually anticlimactic, occurrence.\n\nFor recreation, Mellencamp enjoys playing flag football with his family, friends, bandmates and crew members, and the spirited nature of these contests has become legendary. In the late '80s and early '90s, Mellencamp and his band engaged in some serious football competition. \"In the MFL [Mellencamp Football League], we had hired refs,\" guitarist Mike Wanchic told NUVO.net in 2002. \"On the road, on days off, we'd play the crew and get our asses kicked.\"\n\nThese games often took on a much more serious tone than a typical lighthearted pickup game.\n\n\"In the off season in the MFL, we'd play other cities,\" Wanchic said. \"Cincinnati's firemen championship team, we played the New York City flag football team, Jam Promotions in Chicago put together a team with the Bears starting quarterback. We played Polygram (Mellencamp's record label in the '80s and '90s) a couple times. At one point, Tommy Motolla, when he was still managing John, challenged us, he and John had a big bet on the game. Motolla showed up with a New York championship flag team, and these motherfuckers were brutal, all serious college players, semi-professional rugby players. They annihilated us, beat us 70 to nothing, the worst ass-kicking I've ever had in my life. So, then the challenge was on. At one point, Mark Gastineau was on our team.\"\n\nWhile inducting Mellencamp into the Rock and Roll Hall of Fame in March 2008, Billy Joel shared a humorous anecdote about his 1986 brush with Mellencamp's serious brand of flag football.\n\n\"I’m doing a concert in Indianapolis,\" Joel said. \"I get a message that John wants to invite us out to his neck of the woods to play a game of flag football. So we thought, this might be a lot of fun since we have a day off after the show and we take him up on it. We get out to John’s place. I had a talk with the guys in the band. I said, 'Listen, take it easy on John. Don’t rough him up or anything. We don’t want to hurt the guy who writes the songs, right. Just score enough points to win but not by too much because the deal is, whoever loses has to buy a steak dinner for both teams.'\n\n\"Well as it turns out, we didn’t need to be worrying about John getting hurt. He’s all over the field. Throwing passes, catching passes, running, blocking, intercepting, going 'nan nan nan nan nan.' You name it, he did it and we got creamed. The score was something like 63 to zip right up to the very last play when his team laid down on the field and let us score a touchdown. Class.\"\n\nIn an October 2008 interview with hometown radio station WTTS-FM in Bloomington, Mellencamp said he recently played football with new Indiana University head basketball coach Tom Crean. \"If his competitive nature is half of what it was on that little football field that day, we're in good hands,\" Mellencamp said of Indiana's basketball program under Crean's direction. Mellencamp also noted that he still plays football every Sunday during football season and plays \"until it's so cold outside that you can't stand it anymore,\" although the nature of the games nowadays isn't \"as vigorous as it once was.\"\n\n\n Politics\nAccording to a February 8, 2008 Associated Press report, Mellencamp suggested that the campaign for presidential candidate Sen. John McCain stop using his songs, including \"Our Country\" and \"Pink Houses,\" during their campaign events. McCain's campaign responded by pulling the songs from their playlist. Mellencamp's publicist, Bob Merlis, noted to the Associated Press that \"if (McCain is) such a true conservative, why (is he) playing songs that have a very populist pro-labor message written by a guy who would find no argument if you characterized him as left of center?\" [4]\n\nMellencamp, an ardent Democrat, performed \"Small Town\" at a Barack Obama rally in Evansville, Indiana on April 22, the night of the 2008 Pennsylvania primary.[5]\n\nMellencamp also performed \"Our Country\" at a rally for Hillary Clinton in Indianapolis, IN on May 3, 2008, although he never came out in support of either Obama or Clinton during the primaries. \"Neither candidate is as liberal as he would prefer, but he's happy to contribute what he can,\" Merlis said.\n\nHowever, Mellencamp did publicly support Obama once he earned the Democratic nomination and had this to say on his official website on Nov. 5, 2008 -- the day after Obama was elected the 44th President of the United States:\n\nThis, for me, is something I never thought I would see in my life.\n\nI remember the assassination of Martin Luther King and the marches in Selma, Alabama, and seeing Rosa Parks, demonstrators getting sprayed by fire hoses and attacked by police dogs and all the other horrible things that happened at that time in our country. Then I played at the 2004 Democratic Convention, which was my first introduction to Barack Obama, and after his keynote address I looked at my wife Elaine and said, ‘Man, what a poet! He could be president of the United States!’ And that’s absolutely verbatim.\n\nBut even I, who have written countless songs about race, could not believe that a man of color could be president of the United States. But today I am so proud of America. I am so happy for all Americans, that we have finally started to fulfill our obligation to the immortal words of our Declaration of Independence, that all men are created equal. We cannot expect this man to immediately change the last eight years of fear and deception, but I think we can rejoice in the fact that there is someone speaking not just for his own interests, now, but hopefully as a voice for us all.\n\nOn Sunday, January 18, 2009, Mellencamp performed \"Pink Houses\" at the We Are One: The Obama Inaugural Celebration at the Lincoln Memorial.\n\n\n[edit] Honors and awards\nMellencamp has won one Grammy Award (Best Male Rock Performer for \"Hurts So Good\" in 1982) and been nominated for 12 others. He has also been bestowed with the Nordoff-Robbins Silver Clef Special Music Industry Humanitarian Award (1991), the Billboard Century Award (2001), the Woody Guthrie Award (2003), and the ASCAP Foundation Champion Award (2007). On October 6, 2008, Mellencamp won the prestigious Classic Songwriter Award at the 2008 Q Awards in London, England. Mellencamp has been nominated for induction into the Songwriters Hall of Fame and will find out in February 2009 if he's been selected.\n\nMellencamp's biggest honor came when was inducted into the Rock and Roll Hall of Fame's Class of 2008. The induction ceremony took place in New York City on March 10, and Mellencamp was inducted by good friend Billy Joel, who asked Mellencamp to induct him into the Rock Hall back in 1999 (Mellencamp had to opt out because of another commitment, so Ray Charles inducted Joel). During his induction speech for Mellencamp, Joel said:\n\nDon't let this club membership change you, John. Stay ornery, stay mean. We need you to be pissed off, and restless, because no matter what they tell us - we know, this country is going to hell in a handcart. This country's been hijacked. You know it, and I know it. People are worried. People are scared, and people are angry. People need to hear a voice like yours that's out there to echo the discontent that's out there in the heartland. They need to hear stories about it. They need to hear stories about frustration, alienation and desperation. They need to know that somewhere out there somebody feels the way that they do, in the small towns and in the big cities. They need to hear it. And it doesn't matter if they hear it on a jukebox, in the local gin mill, or in a goddamn truck commercial, because they ain't gonna hear it on the radio anymore. They don't care how they hear it, as long as they hear it good and loud and clear -- the way you've always been saying it all along. You're right John, this is still our country.\n\nFun Fact:\nMatthew McConaughey's music background started when his brother Pat woke Matthew up to go outside (in his underwear!!!) to  listen to John Cougar Mellencam's \"Warmer place to sleep\". <a href=\"https://www.last.fm/music/+noredirect/John+Cougar+Mellencamp\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "US",
  "created_at": "2025-07-05T17:21:21.493385",
  "date_added": "2017-04-09T14:18:06-07:00",
  "discogs_id": "8668868",
  "discogs_url": "https://www.discogs.com/release/8668868-John-Cougar-American-Fool",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock"
  ],
  "id": "8668868",
  "images": [
    {
      "height": 466,
      "resource_url": "https://i.discogs.com/2egG2AcbyeE1IBuCxqzDHoRJwkKoX231a2_1fL8z18g/rs:fit/g:sm/q:90/h:466/w:466/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTg2Njg4/NjgtMTQ2NjI2NDE0/NC01NjA3LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/2egG2AcbyeE1IBuCxqzDHoRJwkKoX231a2_1fL8z18g/rs:fit/g:sm/q:90/h:466/w:466/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTg2Njg4/NjgtMTQ2NjI2NDE0/NC01NjA3LmpwZWc.jpeg",
      "width": 466
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/7c/a8/38/7ca83867-fed2-55cb-be03-73a182100b00/06UMGIM12400.rgb.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "Riva (2)"
  ],
  "lastfm_mbid": null,
  "lastfm_url": null,
  "local_images": {
    "hi-res": "public/album/american-fool-8668868/american-fool-8668868-hi-res.jpg",
    "medium": "public/album/american-fool-8668868/american-fool-8668868-medium.jpg",
    "small": "public/album/american-fool-8668868/american-fool-8668868-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T17:21:22.850461",
    "services_used": [
      "discogs",
      "apple_music",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "American Fool (Bonus Track) [2005 Remaster]",
  "release_name_discogs": "American Fool",
  "release_name_spotify": null,
  "released": "2016-06-10",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/7c/a8/38/7ca83867-fed2-55cb-be03-73a182100b00/06UMGIM12400.rgb.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 2005 Riva Recordings, Inc., under exclusive license to UMG Recordings, Inc. and Primary Wave Music IV",
      "editorial_notes": null,
      "id": "1440786233",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "John Cougar",
        "artwork": {
          "bgColor": "845537",
          "height": 1435,
          "textColor1": "ffffff",
          "textColor2": "f4dec9",
          "textColor3": "e6ddd7",
          "textColor4": "ddc2ac",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music125/v4/7c/a8/38/7ca83867-fed2-55cb-be03-73a182100b00/06UMGIM12400.rgb.jpg/{w}x{h}bb.jpg",
          "width": 1447
        },
        "copyright": "℗ 2005 Riva Recordings, Inc., under exclusive license to UMG Recordings, Inc. and Primary Wave Music IV",
        "genreNames": [
          "Rock",
          "Music",
          "American Trad Rock",
          "Arena Rock"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "American Fool (Bonus Track) [2005 Remaster]",
        "playParams": {
          "id": "1440786233",
          "kind": "album"
        },
        "recordLabel": "John Mellencamp 2023 (Island)",
        "releaseDate": "1982-04-12",
        "trackCount": 10,
        "upc": "00602498801376",
        "url": "https://music.apple.com/gb/album/american-fool-bonus-track-2005-remaster/1440786233"
      },
      "url": "https://music.apple.com/gb/album/american-fool-bonus-track-2005-remaster/1440786233"
    }
  },
  "spotify_id": null,
  "spotify_url": null,
  "styles": [
    "Southern Rock"
  ],
  "title": "American Fool",
  "tracklist": [
    {
      "artists": [],
      "duration": "3:35",
      "position": "A1",
      "title": "Hurts So Good"
    },
    {
      "artists": [],
      "duration": "4:16",
      "position": "A2",
      "title": "Jack & Diane"
    },
    {
      "artists": [],
      "duration": "3:24",
      "position": "A3",
      "title": "Hand To Hold On To"
    },
    {
      "artists": [],
      "duration": "4:30",
      "position": "A4",
      "title": "Danger List"
    },
    {
      "artists": [],
      "duration": "3:30",
      "position": "A5",
      "title": "Can You Take It"
    },
    {
      "artists": [],
      "duration": "3:40",
      "position": "B1",
      "title": "Thundering Hearts"
    },
    {
      "artists": [],
      "duration": "3:32",
      "position": "B2",
      "title": "China Girl"
    },
    {
      "artists": [],
      "duration": "3:37",
      "position": "B3",
      "title": "Close Enough"
    },
    {
      "artists": [],
      "duration": "4:07",
      "position": "B4",
      "title": "Weakest Moments"
    }
  ],
  "updated_at": "2025-07-05T17:21:22.092547",
  "year": 2016
}