{
  "apple_music_id": "2581513",
  "apple_music_url": "https://music.apple.com/gb/artist/michael-franti/2581513",
  "biography": "Michael Franti (born April 21, 1966) is an American poet, musician, and composer. He is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including funk, reggae, jazz, folk, and rock. He is also an outspoken supporter for a wide spectrum of peace and social justice issues.\n\nEarly life\nMichael Franti was born in Oakland, California. His mother had Irish, German, and French ancestry, and his father, Thomas Hopkins was of African-American and Native American descent. However, his mother made an adoption plan for him because she was afraid her family would not accept him. He was adopted by Carole Wisti and Charles Franti, a Finnish-American couple in Oakland, who had three biological children and two adopted African American sons. Charles Franti was a professor in the department of epidemiology and preventive medicine of the UC Davis School of Veterinary Medicine and died in 2003. Michael's four siblings are named Rebecca, Sara, Dan, and Matthew. Michael spent his grade 9 school year in Edmonton, Alberta.[better source needed] He then attended Davis Senior High School and graduated from the University of San Francisco. During his time at school there he met a priest who taught him how to tell a story on paper, and soon he was writing poetry. He purchased a bass at a pawn shop and started creating music inspired by hip hop, punk, and reggae that was being played on the campus radio station.\n\nCareer\nBeatnigs (1986–1990)\nFranti began his music career in 1986 as part of the industrial punk/spoken word band The Beatnigs. While attending the University of San Francisco and living above KUSF he developed a fascination with music and decided to start a band. The Beatnigs included dancer and percussionist Rono Tse; the band released a self-titled LP and an EP Television on Alternative Tentacles records. The records received some critical acclaim but little fame beyond the San Francisco Bay Area.\n\nThe 1988 LP release The Beatnigs was recorded at Dancin' Dog Studio in Emeryville and distributed by Alternative Tentacles. In addition to Michael Franti and Ron Tse, the band included Henry Flood on percussion, Andre Flores on keyboards, and Kevin on vocals. All of the band members made multiple instrumental contributions, including industrial percussion.\n\nDisposable Heroes (1991–1993)\nHis next project, The Disposable Heroes of Hiphoprisy, found Franti continuing his collaboration with Tse, and working with jazz guitarist Charlie Hunter, and electronic musicians Mark Pistel (Consolidated) and Jack Dangers (Meat Beat Manifesto). The Disposable Heroes of Hiphoprisy wrote politically charged lyrics that railed against the injustices of the world, set to a fusion of industrial music and hip hop. Their first album, Hypocrisy is the Greatest Luxury (on Island Records), won plaudits for its social commentary, and they were chosen by U2 to open for their Zoo TV Tour.\n\nFranti and the Disposable Heroes put together another record of music accompanying novelist William Burroughs' readings for an album entitled Spare Ass Annie and Other Tales. This album diverged greatly from the style of the band's previous work, as they were largely providing musical background and accompaniment to Burroughs' spoken readings from several of his books.\n\nMichael Franti & Spearhead (1994–present)[edit]\n\n\nMichael Franti and Spearhead performing at Wakarusa 2006.\nIn 1994, Franti formed a new band called Spearhead with a few studio musicians, including mainstay Carl Young, and announced the dissolution of Disposable Heroes of Hiphoprisy. Their first release, Home, in September 1994, was a departure from the politically charged rap of the Disposable Heroes and drew more from funk and soul music. The album was produced by Franti and Joe Nicolo. The song \"Positive\", also from the album Home, appeared on the Stolen Moments: Red Hot + Cool compilation album by the Red Hot Organization. In 1998, Spearhead recorded \"I Got Plenty 'o Nuthin\" with Ernest Ranglin for the Red Hot Organization's compilation album Red Hot + Rhapsody.\n\nTheir follow up album Chocolate Supa Highway was released in March 1997, with several changes in band members between releases. This album featured a return to hip hop elements and a pronounced reggae influence and included guest appearances by notables like Stephen Marley and Joan Osborne.\n\nAfter releasing the two albums, the band split with Capitol Records (reportedly prompted by the label's repeated urging to perform with other artists like Will Smith). The band instead decided to create its own record label, Boo Boo Wax. Since Capitol Records owned the rights to the name \"Spearhead\", subsequent albums were all released as \"Michael Franti & Spearhead.\"\n\nHis song \"Sometimes\" was included on the soundtrack to the 1999 film, Mystery Men, as well as the soundtrack to the 2006 film, Last Holiday. Also, under the \"Spearhead\" name, their cover version of The Police's 1979 No. 32 hit, \"Roxanne\", was featured on the soundtrack to the 1997 film Good Burger, the full-length feature film starring Kenan Thompson & Kel Mitchell based on their characters from the popular 'Good Burger' sketch featured on the Nickelodeon series All That.\n\nMichael Franti & Spearhead released Stay Human in 2000 under their own label Boo Boo Wax in alignment with indie music label Six Degrees Records. The album's central theme was the unjust nature of the death penalty and other major themes included mass media monopolization, the prison-industrial complex and corporate globalization.\n\nIn an interview, Franti talked about the message of Stay Human: \"Half the record is songs about what's happening in the world right now, and the other half is about how we cope with it as people who are concerned about what's going on\", he said. \"This specter of war, intimidation, this nation vs. the rest of the world, it wears us out. Half the record is a healthy dose of venting anger about that, and the other half is about how do we hold on to our spirituality, our community and our connectedness to each other.\" Franti left Six Degrees due to the labels' inability to properly promote the project, for poor record sales and frequent disagreements with the labels' founder Pat Berry.. In 2001 Franti was featured on Lamb's album What Sound, providing backing vocals on the track \"I Cry\".\n\nEveryone Deserves Music was released in 2003. Franti composed many of the songs from his guitar and, like fellow 21st century cultural globalists Manu Chao and Ozomatli, continues to synthesize his eclectic influences. In a departure from the industrial sounds of the Beatnigs and Disposable Heroes, and the minimalism of early Spearhead, Franti's affirming lyrics are now set to swelling rock chords, while keeping a world-wise groove nodding towards reggae, dancehall, bossa nova, Afrobeat, and funk. Anthems like the title track \"Everyone Deserves Music\", \"Yes I Will\" and \"Bomb The World\" are constructed with a nod to the 1980s rock of The Clash and U2, as well as to classic soul from Stax and Motown. The song \"We Don't Stop\" (featuring Gift of Gab from Blackalicious and Spearhead's rapper/beatbox technician Radioactive) bridges the two sounds in a \"Magnificent Seven\" style mash-up. And on \"Love Why Did You Go Away\" and \"What I Be\", Franti reveals an alluring, sensual singing voice. \"Pray For Grace\" and \"Bomb The World (Armageddon Version)\" pair Franti with the reggae/funk giants Sly and Robbie (Grace Jones, Rolling Stones, Black Uhuru, No Doubt).\n\nAlso in 2003, Franti released a mostly acoustic album, Songs from the Front Porch containing rearranged versions of older songs from Chocolate Supa Highway, Stay Human and Everyone Deserves Music as well as a couple of new tracks.\n\n\n\nMichael Franti at the Bonnaroo Festival, 2007 Photo: Raj Gupta\nOn July 25, 2006, Michael Franti & Spearhead released Yell Fire!, inspired by Franti's trip to Israel, Baghdad, the West Bank, and the Gaza Strip. In an effort to share his experiences from his trip and to explore the human cost of war, Franti produced a movie entitled I Know I'm Not Alone, using the songs from his album Yell Fire! as a soundtrack. \"One Step Closer To You\" from Yell Fire! features Pink on backing vocals.\n\nFranti and Spearhead have gained a worldwide audience through touring and appearances in alternative media like Mother Jones magazine and Democracy Now!. Franti continues to tour in addition to producing the annual Power to the Peaceful festival each year since 1998. The festival originated as a way of supporting Mumia Abu-Jamal, who has been convicted of murdering a policeman but is considered by some on the Left to be a political prisoner. Michael Franti continues to gain influence in both popular music and social movements largely through extensive touring and word of mouth fan support. Lyrics from his song \"Bomb The World\", written in the dark aftermath of September 11 such as \"You can bomb the world to pieces, but you can't bomb it into peace\" have found their way onto protest signs and t-shirts all over the world from Los Angeles to Berlin, San Francisco to CNN, at demonstrations for peace large and small.\n\nThe song \"Light Up Ya Lighter\" by Michael Franti & Spearhead was included on the soundtrack to Body of War, an award-winning documentary about Tomas Young, a paralyzed Iraq War veteran.\n\nSongs from Yell Fire and All Rebel Rockers are on the soundtrack to The Edge of Never, a documentary about extreme skiers mentoring 15-year-old Kye Peterson in his quest to ski the route in Chamonix, France that killed his father, Trevor Peterson, nine years earlier.\n\nThe album All Rebel Rockers was released on September 9, 2008 and was largely recorded in Jamaica at the Anchor studio in St Andrew. The band worked with ubiquitous rhythm team Sly and Robbie and featured multi-talented vocalist Cherine Anderson on the set which entered the Billboard 200 pop chart in September at number 38. The single 'Say Hey (I Love You)' also reached Number 18 on the US Hot 100, providing Franti with his first US Top 20 single. Michael Franti was featured on Aux.tv's show Volume where he spoke about U.S. politics and his efforts to make the world a better place.\n\nFranti played three different events to commemorate President Barack Obama's inauguration: The Green Ball, The Peace Ball and the Rock the Vote Party.\n\nFranti announced in November 2009 that he would be joining musician John Mayer on the Battle Studies Tour in spring 2010.\n\nAs part of the band's commitment to environmentalism, Michael Franti and Spearhead avoid the use of water bottles on national tours and run their tour bus on biodiesel.\n\nFranti announced the release of The Sound of Sunshine on his official website in July 2010. It features 12 tracks including two versions of the title track, the new hit single, \"Shake It\", and staples of his recent live performances including \"Hey Hey Hey\", \"Anytime You Need Me\", \"The Thing That Helps Me Get Through\", and the anthemic arena-rock ballad \"I'll Be Waiting\". The album was originally set to be released on August 24, but was pushed back to September 21 to give the album \"more runway.\"\n\nIn 2012, he joined the 11th annual Independent Music Awards judging panel to assist independent musicians' careers.\n\nMichael Franti started the recording process for The Sound of Sunshine in Jamaica but then continued to mix tracks and record in Bali before choosing to bring a portable studio on the road. He continued to record on the road and then test his ideas in front of live audiences to see if they liked it before going back and revamping it the next day. He has since been quoted as saying 90% of the album ended up being recorded on his laptop.\n\nIn 2013, Michael Franti released his album titled as All People, which features his latest single \"I'm Alive (Life Sounds Like)\". It was released July 30, 2013.\n\nHis new single I'm Alive (Life Sounds Like) was featured on The Sims 4 and Rayman Legends game trailers.\n\nPolitics\nFranti is also an advocate for peace in the Middle East. His film I Know I'm Not Alone features footage of Iraq, the Palestinian territories, and Israel. Franti decided to embark on this three week journey with friends to view the cost of war in the Middle East first-hand. Franti states, \"This film came out of my frustration with watching the nightly news and hearing generals, politicians, and pundits explaining the political and economic cost of the war in the Middle East, without ever mentioning the human cost. I wanted to hear about the war by the people affected by it most: doctors, nurses, poets, artists, soldiers, and my personal favorite, musicians.\"[19] The film aims to speak multiple generations and to give people a better understanding of the people who still live in war-torn countries. He did not embark on the trip for the film with any special government groups or organizations, but instead bought plane tickets and headed off to Iraq, the Palestinian territories, and Israel armed with nothing more than his guitar and an extreme passion for music and a love of people. He says, \"When I first had the idea for this journey, I had no idea how to get to Iraq and almost no idea how to make a film. After discovering that all you need to get into Iraq is a plane ticket, I prayed that movie making would be that simple...\"\n\nIn 2001 Franti was awarded the Domestic Human Rights Award by Global Exchange, an international NGO based in San Francisco, for his work to end war.\n\nIn 2006, he was invited by Australian Labour MP Jenny Macklin to show the film at Australia's Parliament House, Canberra.\n\nPersonal life\nFranti has two sons: Ade and Cappy. Michael is in a relationship with emergency room nurse and jewelry designer Sara Agah whose company, SaraLua Designs, makes jewelry and accessories from bamboo and other sustainable materials.\n\nInspired by his son, Michael became a vegan.\n\nIn 2000, Franti decided not to wear any shoes, initially for three days. Since then, Franti has chosen to go barefoot except for occasionally wearing flip-flops as required to board an airplane or to be served in a restaurant.[24] Franti prefers to go barefoot,",
  "country": null,
  "created_at": "2025-07-05T16:35:30.549284",
  "discogs_id": "28584",
  "discogs_url": "https://www.discogs.com/artist/28584-Michael-Franti-And-Spearhead",
  "followers": 68682,
  "formed_date": null,
  "genres": [
    "Reggae",
    "singer-songwriter",
    "chill music",
    "Hip-Hop",
    "pop",
    "male vocalists"
  ],
  "id": "michael-franti-and-spearhead-1751729737",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features114/v4/01/14/71/01147134-3245-f2bd-2593-71a772c8c056/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb8b54e39103378c82ffc2a8c8",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab676161000051748b54e39103378c82ffc2a8c8",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f1788b54e39103378c82ffc2a8c8",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/franti-michael--spearhead-50316b3e07ac3.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b2ca0.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b34c5.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b4861.jpg",
      "width": 1920
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/franti-michael--spearhead-50bc73838cfa3.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/h-OWWXwovrfFzvjw9X-KN-uZQ1B7ucTM_JkbhTbjlrs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "e23eac42-f904-47da-8599-823ff431bea4",
  "lastfm_url": "https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead",
  "local_images": {
    "hi-res": "../public/artist/michael-franti-and-spearhead/michael-franti-and-spearhead-hi-res.jpg",
    "medium": "../public/artist/michael-franti-and-spearhead/michael-franti-and-spearhead-medium.jpg",
    "small": "../public/artist/michael-franti-and-spearhead/michael-franti-and-spearhead-small.jpg"
  },
  "name": "Michael Franti And Spearhead",
  "popularity": 39,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='2581513', url='https://music.apple.com/gb/artist/michael-franti/2581513', name='Michael Franti', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Features114/v4/01/14/71/01147134-3245-f2bd-2593-71a772c8c056/pr_source.png/2000x2000bb.jpg', genres=['Reggae'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '2581513', 'type': 'artists', 'href': '/v1/catalog/gb/artists/2581513', 'attributes': {'name': 'Michael Franti', 'genreNames': ['Reggae'], 'artwork': {'width': 2400, 'height': 2400, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Features114/v4/01/14/71/01147134-3245-f2bd-2593-71a772c8c056/pr_source.png/{w}x{h}bb.jpg', 'bgColor': 'd6cab0', 'textColor1': '100809', 'textColor2': '4c0704', 'textColor3': '382e2a', 'textColor4': '672e26'}, 'url': 'https://music.apple.com/gb/artist/michael-franti/2581513'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/2581513/albums', 'data': [{'id': '1440946789', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1440946789'}, {'id': '868864186', 'type': 'albums', 'href': '/v1/catalog/gb/albums/868864186'}, {'id': '1521266261', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1521266261'}, {'id': '219047265', 'type': 'albums', 'href': '/v1/catalog/gb/albums/219047265'}, {'id': '400480864', 'type': 'albums', 'href': '/v1/catalog/gb/albums/400480864'}, {'id': '1559260822', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1559260822'}, {'id': '1559235100', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1559235100'}, {'id': '1559233834', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1559233834'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "28584",
      "images": [
        {
          "height": 267,
          "resource_url": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/h-OWWXwovrfFzvjw9X-KN-uZQ1B7ucTM_JkbhTbjlrs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
          "width": 267
        }
      ],
      "members": [
        {
          "active": true,
          "id": 28585,
          "name": "Michael Franti",
          "resource_url": "https://api.discogs.com/artists/28585",
          "thumbnail_url": "https://i.discogs.com/zUl6oXoD34C-MDqjyJ7I_Hekn_Mg00gipjTb1g1Gmig/rs:fit/g:sm/q:40/h:455/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg1/LTExNzQ4NjAxNzAu/anBlZw.jpeg"
        },
        {
          "active": false,
          "id": 91417,
          "name": "Dave Shul",
          "resource_url": "https://api.discogs.com/artists/91417",
          "thumbnail_url": "https://i.discogs.com/czMgDlbVAoJlyNj-59960-UEuKbDELtrX7kcFOtxbB8/rs:fit/g:sm/q:40/h:325/w:427/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNDE3/LTExNTUzMDQ2NTku/anBlZw.jpeg"
        },
        {
          "active": false,
          "id": 106327,
          "name": "Cherine Anderson",
          "resource_url": "https://api.discogs.com/artists/106327",
          "thumbnail_url": "https://i.discogs.com/vaiyaDlgAAzk5YBi5QntQxSodwbYBJeG4xhHJKxO8i4/rs:fit/g:sm/q:40/h:584/w:516/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwNjMy/Ny0xNDUxMzU0OTUy/LTU2NTIuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 238331,
          "name": "Victor Castro",
          "resource_url": "https://api.discogs.com/artists/238331",
          "thumbnail_url": ""
        },
        {
          "active": false,
          "id": 268051,
          "name": "Bob Crawford (2)",
          "resource_url": "https://api.discogs.com/artists/268051",
          "thumbnail_url": "https://i.discogs.com/n5-5mzGQN9ZH0q_RFv8Ou4u1m_eWAsmM7Dx3Y_M85L0/rs:fit/g:sm/q:40/h:199/w:253/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI2ODA1/MS0xNTQ3MDUzMTUz/LTcxNDUuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 326334,
          "name": "Jay Bowman",
          "resource_url": "https://api.discogs.com/artists/326334",
          "thumbnail_url": "https://i.discogs.com/S1CZlNHPIFOPvtsPtuMb5RcOtzLHsCPLNrHaBzODojI/rs:fit/g:sm/q:40/h:275/w:183/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNjMz/NC0xNTU2NzAxNTg0/LTE1MDguanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 346949,
          "name": "Carl Young",
          "resource_url": "https://api.discogs.com/artists/346949",
          "thumbnail_url": "https://i.discogs.com/fWSCk11V9gP0mqtsfcfhcpRr_BVbLnPy9hRd8oMdNAM/rs:fit/g:sm/q:40/h:297/w:197/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM0Njk0/OS0xMTU1MzA0ODA3/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 386769,
          "name": "Roberto Quintana",
          "resource_url": "https://api.discogs.com/artists/386769",
          "thumbnail_url": ""
        },
        {
          "active": false,
          "id": 654090,
          "name": "Anthony Robustelli",
          "resource_url": "https://api.discogs.com/artists/654090",
          "thumbnail_url": "https://i.discogs.com/dOcullslcw46sPetX_iotbqLSl9DcG6aoEZv_yZzrbc/rs:fit/g:sm/q:40/h:240/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY1NDA5/MC0xNzE2Njg3Nzc3/LTc5OTQuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 1010651,
          "name": "Raliegh Neal",
          "resource_url": "https://api.discogs.com/artists/1010651",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 1155219,
          "name": "Manas Itiene",
          "resource_url": "https://api.discogs.com/artists/1155219",
          "thumbnail_url": ""
        },
        {
          "active": false,
          "id": 1337240,
          "name": "W. Farguheson",
          "resource_url": "https://api.discogs.com/artists/1337240",
          "thumbnail_url": "https://i.discogs.com/sIS0qKVl4WCeo8_Zq50wuDtrmtpRNodaYg7IqBSvFcI/rs:fit/g:sm/q:40/h:245/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEzMzcy/NDAtMTY4MjAxODEy/MC0zNjg5LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 2759492,
          "name": "Jolene Rust",
          "resource_url": "https://api.discogs.com/artists/2759492",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 4167703,
          "name": "Mike Blankenship",
          "resource_url": "https://api.discogs.com/artists/4167703",
          "thumbnail_url": "https://i.discogs.com/aHjfkC2uL-W1g1VlBlCNWldxEnN1vgenaf34OFPbNOE/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxNjc3/MDMtMTY0NDA3NzIz/OS01OTM4LmpwZWc.jpeg"
        }
      ],
      "name": "Michael Franti And Spearhead",
      "namevariations": [
        "Michael Franti & Spearhead",
        "Michael Franti &Spearhead",
        "Michael Franti + Spearhead",
        "Michael Franti / Spearhead",
        "Michael Franti Spearhead",
        "Michael Franti • Spearhead",
        "Michael Franti/Spearhead",
        "Michaerl Franti & Spearhead",
        "Michal Franti And Spearhead",
        "Micheal Franti & Spearhead",
        "Spearhead",
        "Spearhead & Franti",
        "Spearhead & Michael Franti"
      ],
      "profile": "American band from San Francisco fronted by [a=Michael Franti], evolving from [a=Spearhead] in the late 1990s/early 2000s after leaving [l=Capitol Records].",
      "raw_data": {
        "aliases": [
          {
            "id": 66041,
            "name": "Spearhead",
            "resource_url": "https://api.discogs.com/artists/66041",
            "thumbnail_url": "https://i.discogs.com/etDSTFIb7TW-0ZzSd1YwsHWjy83IHWIERQlbN7eepyE/rs:fit/g:sm/q:40/h:228/w:350/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY2MDQx/LTExNTc5MTE2Nzku/anBlZw.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 28584,
        "images": [
          {
            "height": 267,
            "resource_url": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/h-OWWXwovrfFzvjw9X-KN-uZQ1B7ucTM_JkbhTbjlrs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
            "width": 267
          }
        ],
        "members": [
          {
            "active": true,
            "id": 28585,
            "name": "Michael Franti",
            "resource_url": "https://api.discogs.com/artists/28585",
            "thumbnail_url": "https://i.discogs.com/zUl6oXoD34C-MDqjyJ7I_Hekn_Mg00gipjTb1g1Gmig/rs:fit/g:sm/q:40/h:455/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg1/LTExNzQ4NjAxNzAu/anBlZw.jpeg"
          },
          {
            "active": false,
            "id": 91417,
            "name": "Dave Shul",
            "resource_url": "https://api.discogs.com/artists/91417",
            "thumbnail_url": "https://i.discogs.com/czMgDlbVAoJlyNj-59960-UEuKbDELtrX7kcFOtxbB8/rs:fit/g:sm/q:40/h:325/w:427/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNDE3/LTExNTUzMDQ2NTku/anBlZw.jpeg"
          },
          {
            "active": false,
            "id": 106327,
            "name": "Cherine Anderson",
            "resource_url": "https://api.discogs.com/artists/106327",
            "thumbnail_url": "https://i.discogs.com/vaiyaDlgAAzk5YBi5QntQxSodwbYBJeG4xhHJKxO8i4/rs:fit/g:sm/q:40/h:584/w:516/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwNjMy/Ny0xNDUxMzU0OTUy/LTU2NTIuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 238331,
            "name": "Victor Castro",
            "resource_url": "https://api.discogs.com/artists/238331",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 268051,
            "name": "Bob Crawford (2)",
            "resource_url": "https://api.discogs.com/artists/268051",
            "thumbnail_url": "https://i.discogs.com/n5-5mzGQN9ZH0q_RFv8Ou4u1m_eWAsmM7Dx3Y_M85L0/rs:fit/g:sm/q:40/h:199/w:253/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI2ODA1/MS0xNTQ3MDUzMTUz/LTcxNDUuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 326334,
            "name": "Jay Bowman",
            "resource_url": "https://api.discogs.com/artists/326334",
            "thumbnail_url": "https://i.discogs.com/S1CZlNHPIFOPvtsPtuMb5RcOtzLHsCPLNrHaBzODojI/rs:fit/g:sm/q:40/h:275/w:183/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNjMz/NC0xNTU2NzAxNTg0/LTE1MDguanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 346949,
            "name": "Carl Young",
            "resource_url": "https://api.discogs.com/artists/346949",
            "thumbnail_url": "https://i.discogs.com/fWSCk11V9gP0mqtsfcfhcpRr_BVbLnPy9hRd8oMdNAM/rs:fit/g:sm/q:40/h:297/w:197/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM0Njk0/OS0xMTU1MzA0ODA3/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 386769,
            "name": "Roberto Quintana",
            "resource_url": "https://api.discogs.com/artists/386769",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 654090,
            "name": "Anthony Robustelli",
            "resource_url": "https://api.discogs.com/artists/654090",
            "thumbnail_url": "https://i.discogs.com/dOcullslcw46sPetX_iotbqLSl9DcG6aoEZv_yZzrbc/rs:fit/g:sm/q:40/h:240/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY1NDA5/MC0xNzE2Njg3Nzc3/LTc5OTQuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 1010651,
            "name": "Raliegh Neal",
            "resource_url": "https://api.discogs.com/artists/1010651",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 1155219,
            "name": "Manas Itiene",
            "resource_url": "https://api.discogs.com/artists/1155219",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 1337240,
            "name": "W. Farguheson",
            "resource_url": "https://api.discogs.com/artists/1337240",
            "thumbnail_url": "https://i.discogs.com/sIS0qKVl4WCeo8_Zq50wuDtrmtpRNodaYg7IqBSvFcI/rs:fit/g:sm/q:40/h:245/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEzMzcy/NDAtMTY4MjAxODEy/MC0zNjg5LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 2759492,
            "name": "Jolene Rust",
            "resource_url": "https://api.discogs.com/artists/2759492",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 4167703,
            "name": "Mike Blankenship",
            "resource_url": "https://api.discogs.com/artists/4167703",
            "thumbnail_url": "https://i.discogs.com/aHjfkC2uL-W1g1VlBlCNWldxEnN1vgenaf34OFPbNOE/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxNjc3/MDMtMTY0NDA3NzIz/OS01OTM4LmpwZWc.jpeg"
          }
        ],
        "name": "Michael Franti And Spearhead",
        "namevariations": [
          "Michael Franti & Spearhead",
          "Michael Franti &Spearhead",
          "Michael Franti + Spearhead",
          "Michael Franti / Spearhead",
          "Michael Franti Spearhead",
          "Michael Franti • Spearhead",
          "Michael Franti/Spearhead",
          "Michaerl Franti & Spearhead",
          "Michal Franti And Spearhead",
          "Micheal Franti & Spearhead",
          "Spearhead",
          "Spearhead & Franti",
          "Spearhead & Michael Franti"
        ],
        "profile": "American band from San Francisco fronted by [a=Michael Franti], evolving from [a=Spearhead] in the late 1990s/early 2000s after leaving [l=Capitol Records].",
        "releases_url": "https://api.discogs.com/artists/28584/releases",
        "resource_url": "https://api.discogs.com/artists/28584",
        "uri": "https://www.discogs.com/artist/28584-Michael-Franti-And-Spearhead",
        "urls": [
          "https://www.michaelfranti.com/",
          "http://www.myspace.com/spearheadvibrations  ",
          "https://de-de.facebook.com/michaelfranti/"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/28584",
      "thumb": "https://i.discogs.com/h-OWWXwovrfFzvjw9X-KN-uZQ1B7ucTM_JkbhTbjlrs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
      "url": "https://www.discogs.com/artist/28584-Michael-Franti-And-Spearhead",
      "urls": [
        "https://www.michaelfranti.com/",
        "http://www.myspace.com/spearheadvibrations  ",
        "https://de-de.facebook.com/michaelfranti/"
      ]
    },
    "lastfm": "ArtistLastFmData(name='Michael Franti and Spearhead', url='https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead', mbid='e23eac42-f904-47da-8599-823ff431bea4', listeners=344, playcount=3356, bio_summary='Michael Franti (born April 21, 1966, in Oakland, California) is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including reggae, jazz, folk and funk.\\nFranti developed a fascination with music and decided to start a band. He began his music career in 1986 as part of the industrial punk band The Beatnigs. Their records received some critical acclaim but little notoriety beyond the San Francisco Bay Area. <a href=\"https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead\">Read more on Last.fm</a>', bio_content='Michael Franti (born April 21, 1966, in Oakland, California) is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including reggae, jazz, folk and funk.\\nFranti developed a fascination with music and decided to start a band. He began his music career in 1986 as part of the industrial punk band The Beatnigs. Their records received some critical acclaim but little notoriety beyond the San Francisco Bay Area.\\nIn 1994, Franti formed a new band called Spearhead with a few studio musicians, including mainstay Carl Young. <a href=\"https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['singer-songwriter', 'chill music', 'Hip-Hop', 'pop', 'male vocalists'], similar_artists=[], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Michael Franti and Spearhead', 'mbid': 'e23eac42-f904-47da-8599-823ff431bea4', 'url': 'https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '344', 'playcount': '3356'}, 'similar': {'artist': []}, 'tags': {'tag': [{'name': 'singer-songwriter', 'url': 'https://www.last.fm/tag/singer-songwriter'}, {'name': 'chill music', 'url': 'https://www.last.fm/tag/chill+music'}, {'name': 'Hip-Hop', 'url': 'https://www.last.fm/tag/Hip-Hop'}, {'name': 'pop', 'url': 'https://www.last.fm/tag/pop'}, {'name': 'male vocalists', 'url': 'https://www.last.fm/tag/male+vocalists'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/+noredirect/Michael+Franti+and+Spearhead/+wiki'}}, 'published': '16 Oct 2009, 08:09', 'summary': 'Michael Franti (born April 21, 1966, in Oakland, California) is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including reggae, jazz, folk and funk.\\nFranti developed a fascination with music and decided to start a band. He began his music career in 1986 as part of the industrial punk band The Beatnigs. Their records received some critical acclaim but little notoriety beyond the San Francisco Bay Area. <a href=\"https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead\">Read more on Last.fm</a>', 'content': 'Michael Franti (born April 21, 1966, in Oakland, California) is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including reggae, jazz, folk and funk.\\nFranti developed a fascination with music and decided to start a band. He began his music career in 1986 as part of the industrial punk band The Beatnigs. Their records received some critical acclaim but little notoriety beyond the San Francisco Bay Area.\\nIn 1994, Franti formed a new band called Spearhead with a few studio musicians, including mainstay Carl Young. <a href=\"https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='4vCYwGCNg2XUsdi9IVMzwo', url='https://open.spotify.com/artist/4vCYwGCNg2XUsdi9IVMzwo', name='Michael Franti', popularity=39, followers=68682, genres=[], images=[{'url': 'https://i.scdn.co/image/ab6761610000e5eb8b54e39103378c82ffc2a8c8', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab676161000051748b54e39103378c82ffc2a8c8', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f1788b54e39103378c82ffc2a8c8', 'height': 160, 'width': 160}], external_urls={'spotify': 'https://open.spotify.com/artist/4vCYwGCNg2XUsdi9IVMzwo'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/4vCYwGCNg2XUsdi9IVMzwo'}, 'followers': {'href': None, 'total': 68682}, 'genres': [], 'href': 'https://api.spotify.com/v1/artists/4vCYwGCNg2XUsdi9IVMzwo', 'id': '4vCYwGCNg2XUsdi9IVMzwo', 'images': [{'url': 'https://i.scdn.co/image/ab6761610000e5eb8b54e39103378c82ffc2a8c8', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab676161000051748b54e39103378c82ffc2a8c8', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f1788b54e39103378c82ffc2a8c8', 'height': 160, 'width': 160}], 'name': 'Michael Franti', 'popularity': 39, 'type': 'artist', 'uri': 'spotify:artist:4vCYwGCNg2XUsdi9IVMzwo'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Michael Franti (born April 21, 1966) is an American poet, musician, and composer. He is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including funk, reggae, jazz, folk, and rock. He is also an outspoken supporter for a wide spectrum of peace and social justice issues.\n\nEarly life\nMichael Franti was born in Oakland, California. His mother had Irish, German, and French ancestry, and his father, Thomas Hopkins was of African-American and Native American descent. However, his mother made an adoption plan for him because she was afraid her family would not accept him. He was adopted by Carole Wisti and Charles Franti, a Finnish-American couple in Oakland, who had three biological children and two adopted African American sons. Charles Franti was a professor in the department of epidemiology and preventive medicine of the UC Davis School of Veterinary Medicine and died in 2003. Michael's four siblings are named Rebecca, Sara, Dan, and Matthew. Michael spent his grade 9 school year in Edmonton, Alberta.[better source needed] He then attended Davis Senior High School and graduated from the University of San Francisco. During his time at school there he met a priest who taught him how to tell a story on paper, and soon he was writing poetry. He purchased a bass at a pawn shop and started creating music inspired by hip hop, punk, and reggae that was being played on the campus radio station.\n\nCareer\nBeatnigs (1986–1990)\nFranti began his music career in 1986 as part of the industrial punk/spoken word band The Beatnigs. While attending the University of San Francisco and living above KUSF he developed a fascination with music and decided to start a band. The Beatnigs included dancer and percussionist Rono Tse; the band released a self-titled LP and an EP Television on Alternative Tentacles records. The records received some critical acclaim but little fame beyond the San Francisco Bay Area.\n\nThe 1988 LP release The Beatnigs was recorded at Dancin' Dog Studio in Emeryville and distributed by Alternative Tentacles. In addition to Michael Franti and Ron Tse, the band included Henry Flood on percussion, Andre Flores on keyboards, and Kevin on vocals. All of the band members made multiple instrumental contributions, including industrial percussion.\n\nDisposable Heroes (1991–1993)\nHis next project, The Disposable Heroes of Hiphoprisy, found Franti continuing his collaboration with Tse, and working with jazz guitarist Charlie Hunter, and electronic musicians Mark Pistel (Consolidated) and Jack Dangers (Meat Beat Manifesto). The Disposable Heroes of Hiphoprisy wrote politically charged lyrics that railed against the injustices of the world, set to a fusion of industrial music and hip hop. Their first album, Hypocrisy is the Greatest Luxury (on Island Records), won plaudits for its social commentary, and they were chosen by U2 to open for their Zoo TV Tour.\n\nFranti and the Disposable Heroes put together another record of music accompanying novelist William Burroughs' readings for an album entitled Spare Ass Annie and Other Tales. This album diverged greatly from the style of the band's previous work, as they were largely providing musical background and accompaniment to Burroughs' spoken readings from several of his books.\n\nMichael Franti & Spearhead (1994–present)[edit]\n\n\nMichael Franti and Spearhead performing at Wakarusa 2006.\nIn 1994, Franti formed a new band called Spearhead with a few studio musicians, including mainstay Carl Young, and announced the dissolution of Disposable Heroes of Hiphoprisy. Their first release, Home, in September 1994, was a departure from the politically charged rap of the Disposable Heroes and drew more from funk and soul music. The album was produced by Franti and Joe Nicolo. The song \"Positive\", also from the album Home, appeared on the Stolen Moments: Red Hot + Cool compilation album by the Red Hot Organization. In 1998, Spearhead recorded \"I Got Plenty 'o Nuthin\" with Ernest Ranglin for the Red Hot Organization's compilation album Red Hot + Rhapsody.\n\nTheir follow up album Chocolate Supa Highway was released in March 1997, with several changes in band members between releases. This album featured a return to hip hop elements and a pronounced reggae influence and included guest appearances by notables like Stephen Marley and Joan Osborne.\n\nAfter releasing the two albums, the band split with Capitol Records (reportedly prompted by the label's repeated urging to perform with other artists like Will Smith). The band instead decided to create its own record label, Boo Boo Wax. Since Capitol Records owned the rights to the name \"Spearhead\", subsequent albums were all released as \"Michael Franti & Spearhead.\"\n\nHis song \"Sometimes\" was included on the soundtrack to the 1999 film, Mystery Men, as well as the soundtrack to the 2006 film, Last Holiday. Also, under the \"Spearhead\" name, their cover version of The Police's 1979 No. 32 hit, \"Roxanne\", was featured on the soundtrack to the 1997 film Good Burger, the full-length feature film starring Kenan Thompson & Kel Mitchell based on their characters from the popular 'Good Burger' sketch featured on the Nickelodeon series All That.\n\nMichael Franti & Spearhead released Stay Human in 2000 under their own label Boo Boo Wax in alignment with indie music label Six Degrees Records. The album's central theme was the unjust nature of the death penalty and other major themes included mass media monopolization, the prison-industrial complex and corporate globalization.\n\nIn an interview, Franti talked about the message of Stay Human: \"Half the record is songs about what's happening in the world right now, and the other half is about how we cope with it as people who are concerned about what's going on\", he said. \"This specter of war, intimidation, this nation vs. the rest of the world, it wears us out. Half the record is a healthy dose of venting anger about that, and the other half is about how do we hold on to our spirituality, our community and our connectedness to each other.\" Franti left Six Degrees due to the labels' inability to properly promote the project, for poor record sales and frequent disagreements with the labels' founder Pat Berry.. In 2001 Franti was featured on Lamb's album What Sound, providing backing vocals on the track \"I Cry\".\n\nEveryone Deserves Music was released in 2003. Franti composed many of the songs from his guitar and, like fellow 21st century cultural globalists Manu Chao and Ozomatli, continues to synthesize his eclectic influences. In a departure from the industrial sounds of the Beatnigs and Disposable Heroes, and the minimalism of early Spearhead, Franti's affirming lyrics are now set to swelling rock chords, while keeping a world-wise groove nodding towards reggae, dancehall, bossa nova, Afrobeat, and funk. Anthems like the title track \"Everyone Deserves Music\", \"Yes I Will\" and \"Bomb The World\" are constructed with a nod to the 1980s rock of The Clash and U2, as well as to classic soul from Stax and Motown. The song \"We Don't Stop\" (featuring Gift of Gab from Blackalicious and Spearhead's rapper/beatbox technician Radioactive) bridges the two sounds in a \"Magnificent Seven\" style mash-up. And on \"Love Why Did You Go Away\" and \"What I Be\", Franti reveals an alluring, sensual singing voice. \"Pray For Grace\" and \"Bomb The World (Armageddon Version)\" pair Franti with the reggae/funk giants Sly and Robbie (Grace Jones, Rolling Stones, Black Uhuru, No Doubt).\n\nAlso in 2003, Franti released a mostly acoustic album, Songs from the Front Porch containing rearranged versions of older songs from Chocolate Supa Highway, Stay Human and Everyone Deserves Music as well as a couple of new tracks.\n\n\n\nMichael Franti at the Bonnaroo Festival, 2007 Photo: Raj Gupta\nOn July 25, 2006, Michael Franti & Spearhead released Yell Fire!, inspired by Franti's trip to Israel, Baghdad, the West Bank, and the Gaza Strip. In an effort to share his experiences from his trip and to explore the human cost of war, Franti produced a movie entitled I Know I'm Not Alone, using the songs from his album Yell Fire! as a soundtrack. \"One Step Closer To You\" from Yell Fire! features Pink on backing vocals.\n\nFranti and Spearhead have gained a worldwide audience through touring and appearances in alternative media like Mother Jones magazine and Democracy Now!. Franti continues to tour in addition to producing the annual Power to the Peaceful festival each year since 1998. The festival originated as a way of supporting Mumia Abu-Jamal, who has been convicted of murdering a policeman but is considered by some on the Left to be a political prisoner. Michael Franti continues to gain influence in both popular music and social movements largely through extensive touring and word of mouth fan support. Lyrics from his song \"Bomb The World\", written in the dark aftermath of September 11 such as \"You can bomb the world to pieces, but you can't bomb it into peace\" have found their way onto protest signs and t-shirts all over the world from Los Angeles to Berlin, San Francisco to CNN, at demonstrations for peace large and small.\n\nThe song \"Light Up Ya Lighter\" by Michael Franti & Spearhead was included on the soundtrack to Body of War, an award-winning documentary about Tomas Young, a paralyzed Iraq War veteran.\n\nSongs from Yell Fire and All Rebel Rockers are on the soundtrack to The Edge of Never, a documentary about extreme skiers mentoring 15-year-old Kye Peterson in his quest to ski the route in Chamonix, France that killed his father, Trevor Peterson, nine years earlier.\n\nThe album All Rebel Rockers was released on September 9, 2008 and was largely recorded in Jamaica at the Anchor studio in St Andrew. The band worked with ubiquitous rhythm team Sly and Robbie and featured multi-talented vocalist Cherine Anderson on the set which entered the Billboard 200 pop chart in September at number 38. The single 'Say Hey (I Love You)' also reached Number 18 on the US Hot 100, providing Franti with his first US Top 20 single. Michael Franti was featured on Aux.tv's show Volume where he spoke about U.S. politics and his efforts to make the world a better place.\n\nFranti played three different events to commemorate President Barack Obama's inauguration: The Green Ball, The Peace Ball and the Rock the Vote Party.\n\nFranti announced in November 2009 that he would be joining musician John Mayer on the Battle Studies Tour in spring 2010.\n\nAs part of the band's commitment to environmentalism, Michael Franti and Spearhead avoid the use of water bottles on national tours and run their tour bus on biodiesel.\n\nFranti announced the release of The Sound of Sunshine on his official website in July 2010. It features 12 tracks including two versions of the title track, the new hit single, \"Shake It\", and staples of his recent live performances including \"Hey Hey Hey\", \"Anytime You Need Me\", \"The Thing That Helps Me Get Through\", and the anthemic arena-rock ballad \"I'll Be Waiting\". The album was originally set to be released on August 24, but was pushed back to September 21 to give the album \"more runway.\"\n\nIn 2012, he joined the 11th annual Independent Music Awards judging panel to assist independent musicians' careers.\n\nMichael Franti started the recording process for The Sound of Sunshine in Jamaica but then continued to mix tracks and record in Bali before choosing to bring a portable studio on the road. He continued to record on the road and then test his ideas in front of live audiences to see if they liked it before going back and revamping it the next day. He has since been quoted as saying 90% of the album ended up being recorded on his laptop.\n\nIn 2013, Michael Franti released his album titled as All People, which features his latest single \"I'm Alive (Life Sounds Like)\". It was released July 30, 2013.\n\nHis new single I'm Alive (Life Sounds Like) was featured on The Sims 4 and Rayman Legends game trailers.\n\nPolitics\nFranti is also an advocate for peace in the Middle East. His film I Know I'm Not Alone features footage of Iraq, the Palestinian territories, and Israel. Franti decided to embark on this three week journey with friends to view the cost of war in the Middle East first-hand. Franti states, \"This film came out of my frustration with watching the nightly news and hearing generals, politicians, and pundits explaining the political and economic cost of the war in the Middle East, without ever mentioning the human cost. I wanted to hear about the war by the people affected by it most: doctors, nurses, poets, artists, soldiers, and my personal favorite, musicians.\"[19] The film aims to speak multiple generations and to give people a better understanding of the people who still live in war-torn countries. He did not embark on the trip for the film with any special government groups or organizations, but instead bought plane tickets and headed off to Iraq, the Palestinian territories, and Israel armed with nothing more than his guitar and an extreme passion for music and a love of people. He says, \"When I first had the idea for this journey, I had no idea how to get to Iraq and almost no idea how to make a film. After discovering that all you need to get into Iraq is a plane ticket, I prayed that movie making would be that simple...\"\n\nIn 2001 Franti was awarded the Domestic Human Rights Award by Global Exchange, an international NGO based in San Francisco, for his work to end war.\n\nIn 2006, he was invited by Australian Labour MP Jenny Macklin to show the film at Australia's Parliament House, Canberra.\n\nPersonal life\nFranti has two sons: Ade and Cappy. Michael is in a relationship with emergency room nurse and jewelry designer Sara Agah whose company, SaraLua Designs, makes jewelry and accessories from bamboo and other sustainable materials.\n\nInspired by his son, Michael became a vegan.\n\nIn 2000, Franti decided not to wear any shoes, initially for three days. Since then, Franti has chosen to go barefoot except for occasionally wearing flip-flops as required to board an airplane or to be served in a restaurant.[24] Franti prefers to go barefoot,",
      "biography_es": null,
      "biography_fr": "Michael Franti (né le 21 avril 1966) est un poète, musicien et compositeur américain. Il est le créateur et le chanteur principal de Michael Franti & Spearhead, un groupe qui mélange le hip hop avec une variété d'autres styles, notamment le funk, le reggae, le jazz, le folk et le rock. Il est également un ardent défenseur d'un large éventail de questions de paix et de justice sociale.",
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1966",
      "country": "San Francisco, USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1994",
      "gender": "Male",
      "genre": "Reggae",
      "id": "128003",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/franti-michael--spearhead-50316b3e07ac3.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b2ca0.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b34c5.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b4861.jpg",
          "width": 1920
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/franti-michael--spearhead-50bc73838cfa3.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "5",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "e23eac42-f904-47da-8599-823ff431bea4",
      "name": "Michael Franti & Spearhead",
      "raw_data": {},
      "style": "Reggae",
      "twitter": "1",
      "website": ""
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features114/v4/01/14/71/01147134-3245-f2bd-2593-71a772c8c056/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Reggae"
      ],
      "id": "2581513",
      "name": "Michael Franti",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/michael-franti/2581513"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "28584",
      "images": [
        {
          "height": 267,
          "resource_url": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/h-OWWXwovrfFzvjw9X-KN-uZQ1B7ucTM_JkbhTbjlrs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
          "width": 267
        }
      ],
      "members": [
        {
          "active": true,
          "id": 28585,
          "name": "Michael Franti",
          "resource_url": "https://api.discogs.com/artists/28585",
          "thumbnail_url": "https://i.discogs.com/zUl6oXoD34C-MDqjyJ7I_Hekn_Mg00gipjTb1g1Gmig/rs:fit/g:sm/q:40/h:455/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg1/LTExNzQ4NjAxNzAu/anBlZw.jpeg"
        },
        {
          "active": false,
          "id": 91417,
          "name": "Dave Shul",
          "resource_url": "https://api.discogs.com/artists/91417",
          "thumbnail_url": "https://i.discogs.com/czMgDlbVAoJlyNj-59960-UEuKbDELtrX7kcFOtxbB8/rs:fit/g:sm/q:40/h:325/w:427/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNDE3/LTExNTUzMDQ2NTku/anBlZw.jpeg"
        },
        {
          "active": false,
          "id": 106327,
          "name": "Cherine Anderson",
          "resource_url": "https://api.discogs.com/artists/106327",
          "thumbnail_url": "https://i.discogs.com/vaiyaDlgAAzk5YBi5QntQxSodwbYBJeG4xhHJKxO8i4/rs:fit/g:sm/q:40/h:584/w:516/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwNjMy/Ny0xNDUxMzU0OTUy/LTU2NTIuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 238331,
          "name": "Victor Castro",
          "resource_url": "https://api.discogs.com/artists/238331",
          "thumbnail_url": ""
        },
        {
          "active": false,
          "id": 268051,
          "name": "Bob Crawford (2)",
          "resource_url": "https://api.discogs.com/artists/268051",
          "thumbnail_url": "https://i.discogs.com/n5-5mzGQN9ZH0q_RFv8Ou4u1m_eWAsmM7Dx3Y_M85L0/rs:fit/g:sm/q:40/h:199/w:253/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI2ODA1/MS0xNTQ3MDUzMTUz/LTcxNDUuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 326334,
          "name": "Jay Bowman",
          "resource_url": "https://api.discogs.com/artists/326334",
          "thumbnail_url": "https://i.discogs.com/S1CZlNHPIFOPvtsPtuMb5RcOtzLHsCPLNrHaBzODojI/rs:fit/g:sm/q:40/h:275/w:183/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNjMz/NC0xNTU2NzAxNTg0/LTE1MDguanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 346949,
          "name": "Carl Young",
          "resource_url": "https://api.discogs.com/artists/346949",
          "thumbnail_url": "https://i.discogs.com/fWSCk11V9gP0mqtsfcfhcpRr_BVbLnPy9hRd8oMdNAM/rs:fit/g:sm/q:40/h:297/w:197/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM0Njk0/OS0xMTU1MzA0ODA3/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 386769,
          "name": "Roberto Quintana",
          "resource_url": "https://api.discogs.com/artists/386769",
          "thumbnail_url": ""
        },
        {
          "active": false,
          "id": 654090,
          "name": "Anthony Robustelli",
          "resource_url": "https://api.discogs.com/artists/654090",
          "thumbnail_url": "https://i.discogs.com/dOcullslcw46sPetX_iotbqLSl9DcG6aoEZv_yZzrbc/rs:fit/g:sm/q:40/h:240/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY1NDA5/MC0xNzE2Njg3Nzc3/LTc5OTQuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 1010651,
          "name": "Raliegh Neal",
          "resource_url": "https://api.discogs.com/artists/1010651",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 1155219,
          "name": "Manas Itiene",
          "resource_url": "https://api.discogs.com/artists/1155219",
          "thumbnail_url": ""
        },
        {
          "active": false,
          "id": 1337240,
          "name": "W. Farguheson",
          "resource_url": "https://api.discogs.com/artists/1337240",
          "thumbnail_url": "https://i.discogs.com/sIS0qKVl4WCeo8_Zq50wuDtrmtpRNodaYg7IqBSvFcI/rs:fit/g:sm/q:40/h:245/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEzMzcy/NDAtMTY4MjAxODEy/MC0zNjg5LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 2759492,
          "name": "Jolene Rust",
          "resource_url": "https://api.discogs.com/artists/2759492",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 4167703,
          "name": "Mike Blankenship",
          "resource_url": "https://api.discogs.com/artists/4167703",
          "thumbnail_url": "https://i.discogs.com/aHjfkC2uL-W1g1VlBlCNWldxEnN1vgenaf34OFPbNOE/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxNjc3/MDMtMTY0NDA3NzIz/OS01OTM4LmpwZWc.jpeg"
        }
      ],
      "name": "Michael Franti And Spearhead",
      "namevariations": [
        "Michael Franti & Spearhead",
        "Michael Franti &Spearhead",
        "Michael Franti + Spearhead",
        "Michael Franti / Spearhead",
        "Michael Franti Spearhead",
        "Michael Franti • Spearhead",
        "Michael Franti/Spearhead",
        "Michaerl Franti & Spearhead",
        "Michal Franti And Spearhead",
        "Micheal Franti & Spearhead",
        "Spearhead",
        "Spearhead & Franti",
        "Spearhead & Michael Franti"
      ],
      "profile": "American band from San Francisco fronted by [a=Michael Franti], evolving from [a=Spearhead] in the late 1990s/early 2000s after leaving [l=Capitol Records].",
      "raw_data": {
        "aliases": [
          {
            "id": 66041,
            "name": "Spearhead",
            "resource_url": "https://api.discogs.com/artists/66041",
            "thumbnail_url": "https://i.discogs.com/etDSTFIb7TW-0ZzSd1YwsHWjy83IHWIERQlbN7eepyE/rs:fit/g:sm/q:40/h:228/w:350/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY2MDQx/LTExNTc5MTE2Nzku/anBlZw.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 28584,
        "images": [
          {
            "height": 267,
            "resource_url": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/_Utbk2b3FijReEf-kV_UYiUdOK1kV7WwOMVKU5TzGjw/rs:fit/g:sm/q:90/h:267/w:267/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/h-OWWXwovrfFzvjw9X-KN-uZQ1B7ucTM_JkbhTbjlrs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
            "width": 267
          }
        ],
        "members": [
          {
            "active": true,
            "id": 28585,
            "name": "Michael Franti",
            "resource_url": "https://api.discogs.com/artists/28585",
            "thumbnail_url": "https://i.discogs.com/zUl6oXoD34C-MDqjyJ7I_Hekn_Mg00gipjTb1g1Gmig/rs:fit/g:sm/q:40/h:455/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg1/LTExNzQ4NjAxNzAu/anBlZw.jpeg"
          },
          {
            "active": false,
            "id": 91417,
            "name": "Dave Shul",
            "resource_url": "https://api.discogs.com/artists/91417",
            "thumbnail_url": "https://i.discogs.com/czMgDlbVAoJlyNj-59960-UEuKbDELtrX7kcFOtxbB8/rs:fit/g:sm/q:40/h:325/w:427/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNDE3/LTExNTUzMDQ2NTku/anBlZw.jpeg"
          },
          {
            "active": false,
            "id": 106327,
            "name": "Cherine Anderson",
            "resource_url": "https://api.discogs.com/artists/106327",
            "thumbnail_url": "https://i.discogs.com/vaiyaDlgAAzk5YBi5QntQxSodwbYBJeG4xhHJKxO8i4/rs:fit/g:sm/q:40/h:584/w:516/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwNjMy/Ny0xNDUxMzU0OTUy/LTU2NTIuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 238331,
            "name": "Victor Castro",
            "resource_url": "https://api.discogs.com/artists/238331",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 268051,
            "name": "Bob Crawford (2)",
            "resource_url": "https://api.discogs.com/artists/268051",
            "thumbnail_url": "https://i.discogs.com/n5-5mzGQN9ZH0q_RFv8Ou4u1m_eWAsmM7Dx3Y_M85L0/rs:fit/g:sm/q:40/h:199/w:253/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI2ODA1/MS0xNTQ3MDUzMTUz/LTcxNDUuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 326334,
            "name": "Jay Bowman",
            "resource_url": "https://api.discogs.com/artists/326334",
            "thumbnail_url": "https://i.discogs.com/S1CZlNHPIFOPvtsPtuMb5RcOtzLHsCPLNrHaBzODojI/rs:fit/g:sm/q:40/h:275/w:183/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMyNjMz/NC0xNTU2NzAxNTg0/LTE1MDguanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 346949,
            "name": "Carl Young",
            "resource_url": "https://api.discogs.com/artists/346949",
            "thumbnail_url": "https://i.discogs.com/fWSCk11V9gP0mqtsfcfhcpRr_BVbLnPy9hRd8oMdNAM/rs:fit/g:sm/q:40/h:297/w:197/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM0Njk0/OS0xMTU1MzA0ODA3/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 386769,
            "name": "Roberto Quintana",
            "resource_url": "https://api.discogs.com/artists/386769",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 654090,
            "name": "Anthony Robustelli",
            "resource_url": "https://api.discogs.com/artists/654090",
            "thumbnail_url": "https://i.discogs.com/dOcullslcw46sPetX_iotbqLSl9DcG6aoEZv_yZzrbc/rs:fit/g:sm/q:40/h:240/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTY1NDA5/MC0xNzE2Njg3Nzc3/LTc5OTQuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 1010651,
            "name": "Raliegh Neal",
            "resource_url": "https://api.discogs.com/artists/1010651",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 1155219,
            "name": "Manas Itiene",
            "resource_url": "https://api.discogs.com/artists/1155219",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 1337240,
            "name": "W. Farguheson",
            "resource_url": "https://api.discogs.com/artists/1337240",
            "thumbnail_url": "https://i.discogs.com/sIS0qKVl4WCeo8_Zq50wuDtrmtpRNodaYg7IqBSvFcI/rs:fit/g:sm/q:40/h:245/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEzMzcy/NDAtMTY4MjAxODEy/MC0zNjg5LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 2759492,
            "name": "Jolene Rust",
            "resource_url": "https://api.discogs.com/artists/2759492",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 4167703,
            "name": "Mike Blankenship",
            "resource_url": "https://api.discogs.com/artists/4167703",
            "thumbnail_url": "https://i.discogs.com/aHjfkC2uL-W1g1VlBlCNWldxEnN1vgenaf34OFPbNOE/rs:fit/g:sm/q:40/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxNjc3/MDMtMTY0NDA3NzIz/OS01OTM4LmpwZWc.jpeg"
          }
        ],
        "name": "Michael Franti And Spearhead",
        "namevariations": [
          "Michael Franti & Spearhead",
          "Michael Franti &Spearhead",
          "Michael Franti + Spearhead",
          "Michael Franti / Spearhead",
          "Michael Franti Spearhead",
          "Michael Franti • Spearhead",
          "Michael Franti/Spearhead",
          "Michaerl Franti & Spearhead",
          "Michal Franti And Spearhead",
          "Micheal Franti & Spearhead",
          "Spearhead",
          "Spearhead & Franti",
          "Spearhead & Michael Franti"
        ],
        "profile": "American band from San Francisco fronted by [a=Michael Franti], evolving from [a=Spearhead] in the late 1990s/early 2000s after leaving [l=Capitol Records].",
        "releases_url": "https://api.discogs.com/artists/28584/releases",
        "resource_url": "https://api.discogs.com/artists/28584",
        "uri": "https://www.discogs.com/artist/28584-Michael-Franti-And-Spearhead",
        "urls": [
          "https://www.michaelfranti.com/",
          "http://www.myspace.com/spearheadvibrations  ",
          "https://de-de.facebook.com/michaelfranti/"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/28584",
      "thumb": "https://i.discogs.com/h-OWWXwovrfFzvjw9X-KN-uZQ1B7ucTM_JkbhTbjlrs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4NTg0/LTExODY1Mjg3MTku/anBlZw.jpeg",
      "url": "https://www.discogs.com/artist/28584-Michael-Franti-And-Spearhead",
      "urls": [
        "https://www.michaelfranti.com/",
        "http://www.myspace.com/spearheadvibrations  ",
        "https://de-de.facebook.com/michaelfranti/"
      ]
    },
    "lastfm": {
      "bio_content": "Michael Franti (born April 21, 1966, in Oakland, California) is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including reggae, jazz, folk and funk.\nFranti developed a fascination with music and decided to start a band. He began his music career in 1986 as part of the industrial punk band The Beatnigs. Their records received some critical acclaim but little notoriety beyond the San Francisco Bay Area.\nIn 1994, Franti formed a new band called Spearhead with a few studio musicians, including mainstay Carl Young. <a href=\"https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Michael Franti (born April 21, 1966, in Oakland, California) is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including reggae, jazz, folk and funk.\nFranti developed a fascination with music and decided to start a band. He began his music career in 1986 as part of the industrial punk band The Beatnigs. Their records received some critical acclaim but little notoriety beyond the San Francisco Bay Area. <a href=\"https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 344,
      "mbid": "e23eac42-f904-47da-8599-823ff431bea4",
      "name": "Michael Franti and Spearhead",
      "playcount": 3356,
      "similar_artists": [],
      "tags": [
        "singer-songwriter",
        "chill music",
        "Hip-Hop",
        "pop",
        "male vocalists"
      ],
      "url": "https://www.last.fm/music/+noredirect/Michael+Franti+and+Spearhead"
    },
    "spotify": {
      "followers": 68682,
      "genres": [],
      "id": "4vCYwGCNg2XUsdi9IVMzwo",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb8b54e39103378c82ffc2a8c8",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab676161000051748b54e39103378c82ffc2a8c8",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f1788b54e39103378c82ffc2a8c8",
          "width": 160
        }
      ],
      "name": "Michael Franti",
      "popularity": 39,
      "url": "https://open.spotify.com/artist/4vCYwGCNg2XUsdi9IVMzwo"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Michael Franti (born April 21, 1966) is an American poet, musician, and composer. He is the creator and lead vocalist of Michael Franti & Spearhead, a band that blends hip hop with a variety of other styles including funk, reggae, jazz, folk, and rock. He is also an outspoken supporter for a wide spectrum of peace and social justice issues.\n\nEarly life\nMichael Franti was born in Oakland, California. His mother had Irish, German, and French ancestry, and his father, Thomas Hopkins was of African-American and Native American descent. However, his mother made an adoption plan for him because she was afraid her family would not accept him. He was adopted by Carole Wisti and Charles Franti, a Finnish-American couple in Oakland, who had three biological children and two adopted African American sons. Charles Franti was a professor in the department of epidemiology and preventive medicine of the UC Davis School of Veterinary Medicine and died in 2003. Michael's four siblings are named Rebecca, Sara, Dan, and Matthew. Michael spent his grade 9 school year in Edmonton, Alberta.[better source needed] He then attended Davis Senior High School and graduated from the University of San Francisco. During his time at school there he met a priest who taught him how to tell a story on paper, and soon he was writing poetry. He purchased a bass at a pawn shop and started creating music inspired by hip hop, punk, and reggae that was being played on the campus radio station.\n\nCareer\nBeatnigs (1986–1990)\nFranti began his music career in 1986 as part of the industrial punk/spoken word band The Beatnigs. While attending the University of San Francisco and living above KUSF he developed a fascination with music and decided to start a band. The Beatnigs included dancer and percussionist Rono Tse; the band released a self-titled LP and an EP Television on Alternative Tentacles records. The records received some critical acclaim but little fame beyond the San Francisco Bay Area.\n\nThe 1988 LP release The Beatnigs was recorded at Dancin' Dog Studio in Emeryville and distributed by Alternative Tentacles. In addition to Michael Franti and Ron Tse, the band included Henry Flood on percussion, Andre Flores on keyboards, and Kevin on vocals. All of the band members made multiple instrumental contributions, including industrial percussion.\n\nDisposable Heroes (1991–1993)\nHis next project, The Disposable Heroes of Hiphoprisy, found Franti continuing his collaboration with Tse, and working with jazz guitarist Charlie Hunter, and electronic musicians Mark Pistel (Consolidated) and Jack Dangers (Meat Beat Manifesto). The Disposable Heroes of Hiphoprisy wrote politically charged lyrics that railed against the injustices of the world, set to a fusion of industrial music and hip hop. Their first album, Hypocrisy is the Greatest Luxury (on Island Records), won plaudits for its social commentary, and they were chosen by U2 to open for their Zoo TV Tour.\n\nFranti and the Disposable Heroes put together another record of music accompanying novelist William Burroughs' readings for an album entitled Spare Ass Annie and Other Tales. This album diverged greatly from the style of the band's previous work, as they were largely providing musical background and accompaniment to Burroughs' spoken readings from several of his books.\n\nMichael Franti & Spearhead (1994–present)[edit]\n\n\nMichael Franti and Spearhead performing at Wakarusa 2006.\nIn 1994, Franti formed a new band called Spearhead with a few studio musicians, including mainstay Carl Young, and announced the dissolution of Disposable Heroes of Hiphoprisy. Their first release, Home, in September 1994, was a departure from the politically charged rap of the Disposable Heroes and drew more from funk and soul music. The album was produced by Franti and Joe Nicolo. The song \"Positive\", also from the album Home, appeared on the Stolen Moments: Red Hot + Cool compilation album by the Red Hot Organization. In 1998, Spearhead recorded \"I Got Plenty 'o Nuthin\" with Ernest Ranglin for the Red Hot Organization's compilation album Red Hot + Rhapsody.\n\nTheir follow up album Chocolate Supa Highway was released in March 1997, with several changes in band members between releases. This album featured a return to hip hop elements and a pronounced reggae influence and included guest appearances by notables like Stephen Marley and Joan Osborne.\n\nAfter releasing the two albums, the band split with Capitol Records (reportedly prompted by the label's repeated urging to perform with other artists like Will Smith). The band instead decided to create its own record label, Boo Boo Wax. Since Capitol Records owned the rights to the name \"Spearhead\", subsequent albums were all released as \"Michael Franti & Spearhead.\"\n\nHis song \"Sometimes\" was included on the soundtrack to the 1999 film, Mystery Men, as well as the soundtrack to the 2006 film, Last Holiday. Also, under the \"Spearhead\" name, their cover version of The Police's 1979 No. 32 hit, \"Roxanne\", was featured on the soundtrack to the 1997 film Good Burger, the full-length feature film starring Kenan Thompson & Kel Mitchell based on their characters from the popular 'Good Burger' sketch featured on the Nickelodeon series All That.\n\nMichael Franti & Spearhead released Stay Human in 2000 under their own label Boo Boo Wax in alignment with indie music label Six Degrees Records. The album's central theme was the unjust nature of the death penalty and other major themes included mass media monopolization, the prison-industrial complex and corporate globalization.\n\nIn an interview, Franti talked about the message of Stay Human: \"Half the record is songs about what's happening in the world right now, and the other half is about how we cope with it as people who are concerned about what's going on\", he said. \"This specter of war, intimidation, this nation vs. the rest of the world, it wears us out. Half the record is a healthy dose of venting anger about that, and the other half is about how do we hold on to our spirituality, our community and our connectedness to each other.\" Franti left Six Degrees due to the labels' inability to properly promote the project, for poor record sales and frequent disagreements with the labels' founder Pat Berry.. In 2001 Franti was featured on Lamb's album What Sound, providing backing vocals on the track \"I Cry\".\n\nEveryone Deserves Music was released in 2003. Franti composed many of the songs from his guitar and, like fellow 21st century cultural globalists Manu Chao and Ozomatli, continues to synthesize his eclectic influences. In a departure from the industrial sounds of the Beatnigs and Disposable Heroes, and the minimalism of early Spearhead, Franti's affirming lyrics are now set to swelling rock chords, while keeping a world-wise groove nodding towards reggae, dancehall, bossa nova, Afrobeat, and funk. Anthems like the title track \"Everyone Deserves Music\", \"Yes I Will\" and \"Bomb The World\" are constructed with a nod to the 1980s rock of The Clash and U2, as well as to classic soul from Stax and Motown. The song \"We Don't Stop\" (featuring Gift of Gab from Blackalicious and Spearhead's rapper/beatbox technician Radioactive) bridges the two sounds in a \"Magnificent Seven\" style mash-up. And on \"Love Why Did You Go Away\" and \"What I Be\", Franti reveals an alluring, sensual singing voice. \"Pray For Grace\" and \"Bomb The World (Armageddon Version)\" pair Franti with the reggae/funk giants Sly and Robbie (Grace Jones, Rolling Stones, Black Uhuru, No Doubt).\n\nAlso in 2003, Franti released a mostly acoustic album, Songs from the Front Porch containing rearranged versions of older songs from Chocolate Supa Highway, Stay Human and Everyone Deserves Music as well as a couple of new tracks.\n\n\n\nMichael Franti at the Bonnaroo Festival, 2007 Photo: Raj Gupta\nOn July 25, 2006, Michael Franti & Spearhead released Yell Fire!, inspired by Franti's trip to Israel, Baghdad, the West Bank, and the Gaza Strip. In an effort to share his experiences from his trip and to explore the human cost of war, Franti produced a movie entitled I Know I'm Not Alone, using the songs from his album Yell Fire! as a soundtrack. \"One Step Closer To You\" from Yell Fire! features Pink on backing vocals.\n\nFranti and Spearhead have gained a worldwide audience through touring and appearances in alternative media like Mother Jones magazine and Democracy Now!. Franti continues to tour in addition to producing the annual Power to the Peaceful festival each year since 1998. The festival originated as a way of supporting Mumia Abu-Jamal, who has been convicted of murdering a policeman but is considered by some on the Left to be a political prisoner. Michael Franti continues to gain influence in both popular music and social movements largely through extensive touring and word of mouth fan support. Lyrics from his song \"Bomb The World\", written in the dark aftermath of September 11 such as \"You can bomb the world to pieces, but you can't bomb it into peace\" have found their way onto protest signs and t-shirts all over the world from Los Angeles to Berlin, San Francisco to CNN, at demonstrations for peace large and small.\n\nThe song \"Light Up Ya Lighter\" by Michael Franti & Spearhead was included on the soundtrack to Body of War, an award-winning documentary about Tomas Young, a paralyzed Iraq War veteran.\n\nSongs from Yell Fire and All Rebel Rockers are on the soundtrack to The Edge of Never, a documentary about extreme skiers mentoring 15-year-old Kye Peterson in his quest to ski the route in Chamonix, France that killed his father, Trevor Peterson, nine years earlier.\n\nThe album All Rebel Rockers was released on September 9, 2008 and was largely recorded in Jamaica at the Anchor studio in St Andrew. The band worked with ubiquitous rhythm team Sly and Robbie and featured multi-talented vocalist Cherine Anderson on the set which entered the Billboard 200 pop chart in September at number 38. The single 'Say Hey (I Love You)' also reached Number 18 on the US Hot 100, providing Franti with his first US Top 20 single. Michael Franti was featured on Aux.tv's show Volume where he spoke about U.S. politics and his efforts to make the world a better place.\n\nFranti played three different events to commemorate President Barack Obama's inauguration: The Green Ball, The Peace Ball and the Rock the Vote Party.\n\nFranti announced in November 2009 that he would be joining musician John Mayer on the Battle Studies Tour in spring 2010.\n\nAs part of the band's commitment to environmentalism, Michael Franti and Spearhead avoid the use of water bottles on national tours and run their tour bus on biodiesel.\n\nFranti announced the release of The Sound of Sunshine on his official website in July 2010. It features 12 tracks including two versions of the title track, the new hit single, \"Shake It\", and staples of his recent live performances including \"Hey Hey Hey\", \"Anytime You Need Me\", \"The Thing That Helps Me Get Through\", and the anthemic arena-rock ballad \"I'll Be Waiting\". The album was originally set to be released on August 24, but was pushed back to September 21 to give the album \"more runway.\"\n\nIn 2012, he joined the 11th annual Independent Music Awards judging panel to assist independent musicians' careers.\n\nMichael Franti started the recording process for The Sound of Sunshine in Jamaica but then continued to mix tracks and record in Bali before choosing to bring a portable studio on the road. He continued to record on the road and then test his ideas in front of live audiences to see if they liked it before going back and revamping it the next day. He has since been quoted as saying 90% of the album ended up being recorded on his laptop.\n\nIn 2013, Michael Franti released his album titled as All People, which features his latest single \"I'm Alive (Life Sounds Like)\". It was released July 30, 2013.\n\nHis new single I'm Alive (Life Sounds Like) was featured on The Sims 4 and Rayman Legends game trailers.\n\nPolitics\nFranti is also an advocate for peace in the Middle East. His film I Know I'm Not Alone features footage of Iraq, the Palestinian territories, and Israel. Franti decided to embark on this three week journey with friends to view the cost of war in the Middle East first-hand. Franti states, \"This film came out of my frustration with watching the nightly news and hearing generals, politicians, and pundits explaining the political and economic cost of the war in the Middle East, without ever mentioning the human cost. I wanted to hear about the war by the people affected by it most: doctors, nurses, poets, artists, soldiers, and my personal favorite, musicians.\"[19] The film aims to speak multiple generations and to give people a better understanding of the people who still live in war-torn countries. He did not embark on the trip for the film with any special government groups or organizations, but instead bought plane tickets and headed off to Iraq, the Palestinian territories, and Israel armed with nothing more than his guitar and an extreme passion for music and a love of people. He says, \"When I first had the idea for this journey, I had no idea how to get to Iraq and almost no idea how to make a film. After discovering that all you need to get into Iraq is a plane ticket, I prayed that movie making would be that simple...\"\n\nIn 2001 Franti was awarded the Domestic Human Rights Award by Global Exchange, an international NGO based in San Francisco, for his work to end war.\n\nIn 2006, he was invited by Australian Labour MP Jenny Macklin to show the film at Australia's Parliament House, Canberra.\n\nPersonal life\nFranti has two sons: Ade and Cappy. Michael is in a relationship with emergency room nurse and jewelry designer Sara Agah whose company, SaraLua Designs, makes jewelry and accessories from bamboo and other sustainable materials.\n\nInspired by his son, Michael became a vegan.\n\nIn 2000, Franti decided not to wear any shoes, initially for three days. Since then, Franti has chosen to go barefoot except for occasionally wearing flip-flops as required to board an airplane or to be served in a restaurant.[24] Franti prefers to go barefoot,",
      "biography_es": null,
      "biography_fr": "Michael Franti (né le 21 avril 1966) est un poète, musicien et compositeur américain. Il est le créateur et le chanteur principal de Michael Franti & Spearhead, un groupe qui mélange le hip hop avec une variété d'autres styles, notamment le funk, le reggae, le jazz, le folk et le rock. Il est également un ardent défenseur d'un large éventail de questions de paix et de justice sociale.",
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1966",
      "country": "San Francisco, USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1994",
      "gender": "Male",
      "genre": "Reggae",
      "id": "128003",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/franti-michael--spearhead-50316b3e07ac3.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b2ca0.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b34c5.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/franti-michael--spearhead-50316ab5b4861.jpg",
          "width": 1920
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/franti-michael--spearhead-50bc73838cfa3.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "5",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "e23eac42-f904-47da-8599-823ff431bea4",
      "name": "Michael Franti & Spearhead",
      "raw_data": {},
      "style": "Reggae",
      "twitter": "1",
      "website": ""
    }
  },
  "spotify_id": "4vCYwGCNg2XUsdi9IVMzwo",
  "spotify_url": "https://open.spotify.com/artist/4vCYwGCNg2XUsdi9IVMzwo",
  "updated_at": "2025-07-08T21:00:21.732136",
  "wikipedia_url": null
}