{
  "apple_music_id": "103814",
  "apple_music_url": "https://music.apple.com/gb/artist/david-ruffin/103814",
  "biography": "Davis Eli \"David\" Ruffin (January 18, 1941 – June 1, 1991) was an American soul singer and musician most famous for his work as one of the lead singers of the Temptations from 1964 to 1968 (or the group's \"Classic Five\" period as it was later known). He was the lead voice on such famous songs as \"My Girl\" and \"Ain't Too Proud to Beg.\"\nKnown for his unique raspy and anguished tenor vocals, Ruffin was ranked as one of the 100 Greatest Singers of All Time by Rolling Stone magazine in 2008. He was inducted into the Rock and Roll Hall of Fame in 1989 for his work with the Temptations. Fellow Motown recording artist Marvin Gaye once said admiringly of Ruffin that, \"I heard [in his voice] a strength my own voice lacked.\"\n\nRuffin was born Davis Eli Ruffin in the rural unincorporated community of Whynot, Mississippi, fifteen miles from Meridian, Mississippi. He was the third born son of Elias \"Eli\" Ruffin, a Baptist minister, and Ophelia Ruffin (née Davis). His siblings were Quincy B. Ruffin, Rita Ruffin, and Jimmy L. Ruffin. His parents were both natives of Mississippi. His father Eli worked as a truck driver at a lumber mill and his mother Ophelia worked out of their home. As far as the ancestry of the Ruffin family, Eli's parents had moved from Alabama to Mississippi, due to the harsh circumstances of living after the American Civil War. Prior to living in Alabama, David Ruffin's great grandparents, John Ruffin and Clara Ruffin, had moved from Bertie County, North Carolina. John Ruffin was a Civil War Veteran, fighting with the 14th United States Colored Heavy Artillery Regiment.\nRuffin's father was strict and at times violently abusive. Ruffin's mother died just months after his birth and his father married a schoolteacher, Earline, in 1942. As a young child, Ruffin, along with his other siblings (older brothers Quincy and Jimmy, and sister Rita Mae), traveled with their father and their stepmother as a family gospel group, opening shows for Mahalia Jackson and The Five Blind Boys of Mississippi, among others. Ruffin sang in the choir at Mount Salem Methodist Church, talent shows, and wherever else he could. In 1955, at the age of fourteen, he left home under the guardianship of a minister and went to Memphis, Tennessee with the purpose of pursuing the ministry.\nAt age 15, Ruffin went to Hot Springs, Arkansas with the jazz musician Phineas Newborn, Sr. There they played at the Fifty Grand Ballroom and Casino. Ruffin continued to sing at talent shows, worked with horses at a jockey club and eventually became a member of the Dixie Nightingales. He also sang with the Soul Stirrers briefly after the departure of Johnnie Taylor. It was in Ruffin's travels as a teenager that he met such later popular personalities as Elvis Presley, Little Richard, Frankie Lymon, Bobby Womack, the Staple Singers, the Swan Silvertones and the Dixie Hummingbirds.\nAfter some of his singing idols like Sam Cooke and Jackie Wilson had left gospel music and gone secular, Ruffin also turned in that direction. The 16-year-old Ruffin met and came under the guardianship of Eddie Bush and his wife Dorothy Helen, who took the teenager to Detroit, Michigan, where his brother Jimmy was pursuing a career in music while working at the Ford Motor Company.\n\nAfter moving to Detroit with the Bushes, Ruffin recorded his first released records with the songs \"You and I\" (1958) b/w \"Believe Me\" (1958) and the original version of \"Statue of a Fool.\" These songs were recorded at Vega Records and released under the name \"Little David Bush\", using the last name of the man he was living with at the time, Eddie Bush. Ruffin would later recall how he initially recorded \"a different kind of music\", strongly influenced by the smoother pop and R&B of the time, when he first recorded in Detroit for Vega.\nIn 1957, Ruffin met Berry Gordy, Jr., then a songwriter with ambitions of running his own label. Ruffin lived with Gordy's father, a contractor, and helped \"Pops\" Gordy do construction work on the building that would become Hitsville USA, the headquarters for Gordy's Tamla Records (later Motown Records) label. Ruffin's brother Jimmy would eventually be signed to Tamla's Miracle Records label as an artist.\nRuffin also worked alongside another ambitious singer, Marvin Gaye, as an apprentice at Anna Records, a Chess-distributed label run by Gordy's sister Gwen Gordy Fuqua and his songwriting partner Billy Davis. Asked about Ruffin in the Detroit Free Press in 1988, Gordy Fuqua said, \"He was very much a gentleman, yes ma'am and no ma'am, but the thing that really impressed me about David was that he was one of the only artists I've seen who rehearsed like he was on stage.\"\nEventually, Ruffin started recording at Anna Records, and recorded the song \"I'm in Love\" b/w \"One of These Days\" (1961), with the Voice Masters, which included future Motown producer Lamont Dozier and members of the singing group the Originals Ty Hunter, C.P. Spencer, Hank Dixon and Voice Masters and The Originals founder Walter Gaines (and, at one time, it also had another future Temptations member, Melvin Franklin, one of numerous people David would claim as a cousin).\nRuffin eventually met an up-and-coming local group by the name of The Temptations. His older brother Jimmy Ruffin went on a Motortown Revue tour with the Temptations, and he told David that they needed someone to sing tenor in their group. Ruffin showed interest in joining the group to Otis Williams whom he lived very close to in Detroit. In January 1964, Ruffin became a member of the Temptations after founding member Elbridge \"Al\" Bryant was fired from the group (Ruffin's first recording session with the group was January 9, 1964). Though both David and his brother Jimmy were considered, David was given an edge over Jimmy thanks to his performance skills, which David displayed when he joined the Temptations on-stage during the New Year's Eve party in 1963.\n\nThe bespectacled Ruffin initially sang backgrounds, while the role of lead singer mostly alternated between Eddie Kendricks and Paul Williams. He did sing a few lead parts both on stage and in the studio during his first year with the group, but his leads on these studio tracks would not be released for over a year, as they were considered not good enough to showcase Ruffin's vocals. Smokey Robinson, who produced and co-wrote most of the Temptations' material at this point, saw Ruffin during this period as a \"sleeping giant\" in the group with a unique voice that was, \"mellow,\" yet, \"gruff.\" Robinson thought that if he could write just the perfect song for Ruffin's voice, then he could have a smash hit. The song was to be something that Ruffin could \"belt out\" yet something that was also \"melodic and sweet\". That song, \"My Girl\", was recorded in November 1964 and released a month later, became the group's first number-one single in 1965. \"My Girl\" became the Temptations' signature song and elevated Ruffin to the role of lead singer and front man.\nThe follow-ups to \"My Girl\" were also extremely successful singles, including the Ruffin-led hits \"It's Growing\" (1965), \"Since I Lost My Baby\" (1965), \"My Baby\" (1965), \"Ain't Too Proud to Beg\" (1966), \"Beauty Is Only Skin Deep\" (1966), \"(I Know) I'm Losing You\" (1966), \"All I Need\" (1967), \"(Loneliness Made Me Realize) It's You That I Need\" (1967), \"I Wish It Would Rain\" (1967), and \"I Could Never Love Another (After Loving You)\" (1968). Ruffin also shared lead vocals on the 1967 hit single \"You're My Everything\" with Eddie Kendricks. The tall, 6'3\", Ruffin's passionate and dramatic performances endeared him to the Temptations' audiences and fans. According to Otis Williams, Ruffin (playfully nicknamed \"Ruff\" by the group) was initially a natural comedian and a hard-working singer when he first joined the group. Ruffin's most notable non-vocal contribution to the Temptations was the masterminding of their trademark four-headed microphone stand.\n\nBy 1967, however, ego problems with Ruffin became an issue for the group. He became addicted to cocaine and began missing rehearsals and performances. Refusing to travel with the other Temptations, Ruffin and his then-girlfriend Tammi Terrell traveled in a custom limo (with the image of his trademark black rimmed glasses painted on the door). After the Supremes had their name changed to Diana Ross & the Supremes in early 1967, Ruffin felt that he should become the focal point of the Temptations, just as Diana Ross was for her group and began demanding that the group name be changed to David Ruffin & the Temptations. This led to a number of disagreements between Ruffin and the group's de facto leader, Otis Williams. In addition to the group's problems with Ruffin's ego, he began inquiring into the Temptations' financial records, demanding an accounting of the group's money. This caused friction between Ruffin and Gordy.\nIn June 1968, the Temptations agreed that Ruffin had finally crossed the line when he missed a June 22 Cleveland, Ohio date with the Temptations to instead attend a performance by his new girlfriend, Barbara Gail Martin (Dean Martin's daughter). Ruffin was fired on June 27 and replaced with Dennis Edwards, a former member of The Contours who had been a friend of Ruffin and the group as a whole beforehand. Though Ruffin himself personally encouraged Edwards to take his place, Ruffin began turning up unannounced at Temptations' concerts during Edwards' first few dates with the group. When the group started to perform a Ruffin-era song such as \"My Girl\" or \"Ain't Too Proud to Beg\", Ruffin would suddenly walk on to the stage, take the microphone from Edwards' hands, and steal the show, embarrassing the group but entertaining the fans. According to Edwards, the adulation and Ruffin's pleas convinced the other four Temptations to give Ruffin a second chance, but when he arrived late to what was to be his return show with the group in Gaithersburg, Maryland, The Temptations decided to keep Edwards and drop considerations of rehiring Ruffin.\nIn October 1968, Ruffin filed suit against Motown Records, seeking a release from the label and an accounting of his money. Motown counter-sued to keep the singer from leaving the label and eventually the case was settled. The settlement required Ruffin to remain with Motown to finish out his initial contract (Ruffin joined Motown as a solo artist and always had a separate contract from the other Temptations, which some felt caused a lot of the in-fighting within the group).\n\nRuffin's first solo single was a song originally intended for the Temptations, \"My Whole World Ended (The Moment You Left Me)\". The single from the album entitled My Whole World Ended was released in 1969 followed soon by the album Feelin' Good. The single reached the US Pop & R&B \"Top Ten.\" A third album, titled David, was recorded in 1970-71, but was shelved by Motown and did not see a commercial release until 2004; his next official release for Motown did not arrive until 1973, when David Ruffin was released. His final Top Ten hit was 1975's \"Walk Away from Love\", produced by Van McCoy, which reached number nine on the Pop chart. It sold over one million copies, and was awarded a gold disc by the R.I.A.A. in February 1976. Other notable recordings from Ruffin's solo career include \"I Lost Everything I've Ever Loved\" (1969); the gospel-inflected \"I'm So Glad I Fell For You\" (1970); \"Blood Donors Needed (Give All You Can)\" (1973); \"Common Man\" (1973) (which was sampled on the 2001 Jay-Z song \"Never Change\"); \"No Matter Where\" (1974); \"Who I Am\" (1975); \"Statue of a Fool\" (1975); and cover versions of the Jackson Five's \"I Want You Back\", \"Rainy Night in Georgia\" popularized by Brook Benton (both recorded for the shelved 1970 album); and Harold Melvin and the Blue Notes' \"I Miss You\", featuring Eddie Kendrick (1973).\n\nIn 1970 Ruffin recorded an album with his brother Jimmy, I am My Brother's Keeper, for which they had minor hits with \"When My Love Hand (Comes Tumbling Down)\" and \"Your Love Was Worth Waiting For\". While his solo career initially showed promise, Ruffin reportedly went into decline in part because of his cocaine addiction and the lack of support from Motown.\nAfter leaving Motown in 1977, Ruffin recorded for Warner Bros. Records releasing the albums So Soon We Change (1979) and Gentleman Ruffin (1980), and later signed with RCA Records, accompanied by former Temptations band-mate Eddie Kendrick, who chose to rekindle their friendship when Kendrick himself started experiencing problems with the Temptations.\nIn 1982, Ruffin and Eddie Kendricks re-joined the Temptations for the recording of their album Reunion and the tour to promote the album. Reunion included the R&B hit \"Standing on the Top\" with Rick James. The reunion tour, however, was short lived as Ruffin started to miss shows due to his cocaine addiction, leading the group to be fined thousands of dollars. Otis Williams fired Ruffin for the second and final time from the group along with Kendricks (whose voice was weakened due to heavy chain smoking) by Christmas 1982. Ruffin started touring with Kendrick (who dropped the \"s\" from his last name at this time) as a duo act in 1985.\nIn 1982, Ruffin was sentenced to six months in a low-security prison in Terre Haute, Indiana, for failing to pay taxes during the mid-1970s. On May 19, 1986, he pleaded no contest to a charge of receiving and concealing stolen property worth less than $100 (a Colt .32-caliber handgun) and was fined $50 plus $100 in court costs. Charges of assault and battery and receiving stolen property worth more than $100 were dropped. A 1987 cocaine arrest landed him in jail for repeated parole violations.\nIn 1985, longtime Temptations fans Hall & Oates teamed up with Ruffin and Kendrick to perform at the re-opening of the Apollo Theater in New York. Their performance was released as a relatively successful live album and single. The four singers also sang a medley of Temptations hits at Live Aid on July 13, 1985. John Oates later wrote a minor hit single for Ruffin and Kendrick, but the two duos fell out, allegedly due to Daryl Hall's objections to Ruffin's heavy drug use. After being inducted into the Rock and Roll Hall of Fame, in 1989, with the other Temptations, Ruffin, Kendrick and Dennis Edwards began touring and recording as \"Ruffin/Kendrick/Edwards: Former Leads of The Temptations\". On August 17, 2013 in Cleveland, Ohio The Official R&B Music Hall of Fame inducted David Ruffin as a solo artist and also a member of The Temptations. His family was on hand for this great honor.\n\nRuffin was married twice. His first marriage was to Sandra Ruffin in 1961 with whom he had three daughters, Cheryl, Nedra and Kimberly. In 1976, Ruffin married Joy Hamilton. He also had one son he named David Ruffin Junior with his former girlfriend Genna Sapia, who--after his death--would add \"Ruffin\" to her last name in tribute to their long-term relationship, as well as to the fact that they had a son together. The two lived as husband and wife, but were never legally married.\nRuffin also had a well publicized relationship with Motown label mate and Marvin Gaye duet partner, singer Tammi Terrell.\n\nAfter a successful month-long tour of England with Kendrick and Edwards, Ruffin died on June 1, 1991, in a Philadelphia, Pennsylvania, hospital of \"an adverse reaction to drugs\" - namely cocaine. Although the cause of death was ruled an accident, Ruffin's family and friends suspected foul play, claiming that a money belt containing the proceeds from the tour ($300,000) was missing from his body. He had just finished recording the single \"Hurt the One You Love\" for Motorcity Records.\nIn The Temptations television miniseries, Ruffin's beaten body is depicted as being thrown from a moving car in front of a hospital, where he dies. Also stated in the mini-series was that his body remained unclaimed in a morgue for a week after his death. As a result, Ruffin's estate filed suit against NBC and other major players involved in the making of the series, claiming defamation. According to the plaintiffs in the case, Ruffin was actually taken to the hospital by a limousine and was escorted to the waiting area by his driver, who informed the attendants of his identity. The Ruffin children further state that his body was claimed by one of them within a few days after his death. (Ruffin's estate lost the lawsuit; the ruling against them was upheld on appeal.)\n\nRuffin had many admirers among his fellow artists, mainly for the emotive power he brought to every song he sang. \"Nobody could sing like David Ruffin,\" said his close friend and colleague Martha Reeves (of Martha and the Vandellas fame). His contemporary, label-mate, and long-time acquaintance Marvin Gaye was particularly impressed with the virility of Ruffin's voice. Gaye said Ruffin's work \"made me remember that when a lot of women listen to music, they want to feel the power of a real man.\"\nDaryl Hall of Hall & Oates, one of Ruffin's biggest fans, said, \"His voice had a certain glorious anguish that spoke to people on many emotional levels\". Ruffin himself said, \"I don't know what kind of voice I have, I really don't\"...it's just about \"the feeling I get for the song.\"\nThe raspy-voiced Rod Stewart fell in love with Ruffin's voice after he heard \"I Wish It Would Rain\". \"It jumped out of the speakers and ravished my soul,\" Stewart exclaimed. Stewart would later become friends with Ruffin. \"His voice was so powerful -- like a foghorn on the Queen Mary,\" Stewart told Rolling Stone magazine.\nFor all of his nearly forty years in the music business, much of it with modest success, Ruffin is remembered almost exclusively for his relatively brief stint in the Temptations. The cover art of his last album Gentleman Ruffin was the inspiration on the art of rapper Wiz Khalifa's mixtape Kush and Orange Juice.\n\nIn 1998, NBC aired The Temptations, a four-hour television miniseries about the group's career. Ruffin was portrayed by Leon Robinson (who uses the professional name \"Leon\"). The actor won high praise for his portrayal of Ruffin, but Ruffin's family was upset by the way the miniseries portrayed Ruffin and filed a lawsuit against the producers of the miniseries and also Otis Williams, whose memoir had been the source material for the miniseries. The case was dismissed in favor of the defendants, with Williams later claiming that he had no real control over the presentation of the material.\nGrand Puba of Brand Nubian referenced the singer on the 1990 single \"All for One\", stating: \"I hit a beat and swing a note as if my name was David Ruffin\".\nRapper Machine Gun Kelly also referenced the singer on his 2013 song \"See My Tears\" stating:\"Fought every temptation shit, I guess I’m David Ruffin huh?\"\nThe first song on Fall Out Boy's 2005 CD From Under the Cork Tree was to have been titled \"My Name is David Ruffin...and These are The Temptations\" but for legal reasons, the name was changed (to \"Our Lawyer Made Us Change the Name of This Song So We Wouldn't Get Sued\").\nHotstylz used Ruffin's song and referred his name on their hip-hop single \"Lookin' Boy\".\nAmerican rap rock group Gym Class Heroes references Ruffin in the 2008 song \"Like Father, Like Son (Papa's Song)\" from their album The Quilt stating: \"I never understood temptation. But I guess we both got a little David Ruffin in us.\"\n <a href=\"https://www.last.fm/music/David+Ruffin\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T16:09:36.097470",
  "discogs_id": "86101",
  "discogs_url": "https://www.discogs.com/artist/86101-David-Ruffin",
  "followers": 239403,
  "formed_date": null,
  "genres": [
    "R&B/Soul",
    "motown",
    "northern soul",
    "classic soul",
    "soul",
    "philly soul",
    "funk",
    "rhythm and blues",
    "rnb"
  ],
  "id": "david-ruffin-1751728181",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/3c/2c/7f/3c2c7fe1-96e5-2acc-c08b-d9822e0272bc/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 642,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/b380a73e72a5f4ced0b236c57b0ef610c6c7f13f",
      "width": 999
    },
    {
      "height": 411,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/754a82b8b772c43efb08bd6521055d6e64a9d51c",
      "width": 640
    },
    {
      "height": 128,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/4f5f4e4c4a57e0cb35b7b8c959d7c0939c425d93",
      "width": 199
    },
    {
      "height": 41,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/7c2783c7e641c527153ae8f748bdfd9a3f1e667b",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/sT2zG7AGgkbhck6VfHkMO91PmvS-9oreWSEBnw0Y304/rs:fit/g:sm/q:90/h:528/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/-n_-tyC_WEKGJJHh7ToxNyXQ0aV0Ixg4IxKsWz4fVWs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "3d2ac089-fdc8-4381-a4b5-fcdc7fc36590",
  "lastfm_url": "https://www.last.fm/music/David+Ruffin",
  "local_images": {
    "hi-res": "../public/artist/david-ruffin/david-ruffin-hi-res.jpg",
    "medium": "../public/artist/david-ruffin/david-ruffin-medium.jpg",
    "small": "../public/artist/david-ruffin/david-ruffin-small.jpg"
  },
  "name": "David Ruffin",
  "popularity": 42,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/3c/2c/7f/3c2c7fe1-96e5-2acc-c08b-d9822e0272bc/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "R&B/Soul"
      ],
      "id": "103814",
      "name": "David Ruffin",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/david-ruffin/103814"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/sT2zG7AGgkbhck6VfHkMO91PmvS-9oreWSEBnw0Y304/rs:fit/g:sm/q:90/h:528/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "86101",
      "images": [
        {
          "height": 528,
          "resource_url": "https://i.discogs.com/sT2zG7AGgkbhck6VfHkMO91PmvS-9oreWSEBnw0Y304/rs:fit/g:sm/q:90/h:528/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/sT2zG7AGgkbhck6VfHkMO91PmvS-9oreWSEBnw0Y304/rs:fit/g:sm/q:90/h:528/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/-n_-tyC_WEKGJJHh7ToxNyXQ0aV0Ixg4IxKsWz4fVWs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
          "width": 532
        },
        {
          "height": 198,
          "resource_url": "https://i.discogs.com/AWljJ_kI1CuGc_OB5WR3Zns79sgvcE4E4Y2yun7oLyQ/rs:fit/g:sm/q:90/h:198/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExMjY1Mjg0Mzcu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/AWljJ_kI1CuGc_OB5WR3Zns79sgvcE4E4Y2yun7oLyQ/rs:fit/g:sm/q:90/h:198/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExMjY1Mjg0Mzcu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/s470QPWj5gVEwUWjierTTVVSwl4A1a2jyTHaWyBumnM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExMjY1Mjg0Mzcu/anBlZw.jpeg",
          "width": 360
        },
        {
          "height": 332,
          "resource_url": "https://i.discogs.com/h7qSilfPIEMRJlDXutCftkKHugLHqCUAvKp8O0CWNPQ/rs:fit/g:sm/q:90/h:332/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzNjIu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/h7qSilfPIEMRJlDXutCftkKHugLHqCUAvKp8O0CWNPQ/rs:fit/g:sm/q:90/h:332/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzNjIu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/lky7gAkjo9di0TO6d9YynWjwjLofzQ7rBBiy8vrTVK8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzNjIu/anBlZw.jpeg",
          "width": 282
        },
        {
          "height": 317,
          "resource_url": "https://i.discogs.com/v2mqgMi7AkbzmxRpLnpgOQuwQWz9J03lS0-BAkWSWc0/rs:fit/g:sm/q:90/h:317/w:249/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzOTku/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/v2mqgMi7AkbzmxRpLnpgOQuwQWz9J03lS0-BAkWSWc0/rs:fit/g:sm/q:90/h:317/w:249/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzOTku/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/7RjgsIXv78xxbxYk2KaxnNKXt6w5qFt9PiKg2bcvK_A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzOTku/anBlZw.jpeg",
          "width": 249
        },
        {
          "height": 198,
          "resource_url": "https://i.discogs.com/C4vlEaxChu4Qv-7xhdioFWSg-CuI-r1iXLqkpBMfAME/rs:fit/g:sm/q:90/h:198/w:166/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzE0NjIu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/C4vlEaxChu4Qv-7xhdioFWSg-CuI-r1iXLqkpBMfAME/rs:fit/g:sm/q:90/h:198/w:166/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzE0NjIu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/PUtJozV4glWzq3en__Xm6ikI78OkqCnIUFJTZ0i5Snk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzE0NjIu/anBlZw.jpeg",
          "width": 166
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/5CsbybIunXV9OIpzi-a67J6LympbbwO5qcXYkKxNiNE/rs:fit/g:sm/q:90/h:600/w:478/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTEzOTg5NjE4OTYt/MTI1OC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/5CsbybIunXV9OIpzi-a67J6LympbbwO5qcXYkKxNiNE/rs:fit/g:sm/q:90/h:600/w:478/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTEzOTg5NjE4OTYt/MTI1OC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/VGfaVdLRjqAy87VINXsTteAJo02BBHtR4HPmVd4D3D0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTEzOTg5NjE4OTYt/MTI1OC5qcGVn.jpeg",
          "width": 478
        },
        {
          "height": 411,
          "resource_url": "https://i.discogs.com/8zPMwf3W8a6dqQgFcdLT_JJSlHy8jcTyKrTfmfXhCmc/rs:fit/g:sm/q:90/h:411/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE2Nzc2ODc1Mjgt/MjM2OC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/8zPMwf3W8a6dqQgFcdLT_JJSlHy8jcTyKrTfmfXhCmc/rs:fit/g:sm/q:90/h:411/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE2Nzc2ODc1Mjgt/MjM2OC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/de6DYLkmbHYFO12kBwLf8muv8pA2WzEswNvZ7Fv6cms/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE2Nzc2ODc1Mjgt/MjM2OC5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "David Ruffin",
      "namevariations": [
        "D. Ruffin",
        "David",
        "David Rufin",
        "David!",
        "Ruffin"
      ],
      "profile": "b. 01/18/1941 in Whynot, Mississippi, U.S.A.\r\nd. 06/01/1991 in Philadelphia, Pennsylvania, U.S.A.\r\n\r\nGruff-voiced soul singer signed to [l=Motown], scored hits as lead singer of [a=The Temptations] and solo, in the 1960s and 1970s. Brother of fellow Motown singer [a=Jimmy Ruffin].",
      "raw_data": {
        "aliases": [
          {
            "id": 1796074,
            "name": "Little David Bush",
            "resource_url": "https://api.discogs.com/artists/1796074",
            "thumbnail_url": "https://i.discogs.com/lgMTicvBWqPfGGizeRKrGSDb_s6ZHt-VIw7RDOiE5jo/rs:fit/g:sm/q:40/h:528/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE3OTYw/NzQtMTUxMjIwNDAw/OS0yNDk3LmpwZWc.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "groups": [
          {
            "active": false,
            "id": 28332,
            "name": "The Temptations",
            "resource_url": "https://api.discogs.com/artists/28332",
            "thumbnail_url": "https://i.discogs.com/-9jANTUgLik12RuqZNcaOZGr4Bg4dAZlK9yhzST8URc/rs:fit/g:sm/q:40/h:536/w:383/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MzMy/LTE0MDU2OTQwODUt/MzA0Ny5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 886125,
            "name": "The Ruffin Brothers",
            "resource_url": "https://api.discogs.com/artists/886125",
            "thumbnail_url": "https://i.discogs.com/w4oEeYE8WATZ2OdoqECDikdJjMh3JK3cKZfokogHUwo/rs:fit/g:sm/q:40/h:497/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg4NjEy/NS0xMzUxODU3Njkz/LTU3NDUuanBlZw.jpeg"
          }
        ],
        "id": 86101,
        "images": [
          {
            "height": 528,
            "resource_url": "https://i.discogs.com/sT2zG7AGgkbhck6VfHkMO91PmvS-9oreWSEBnw0Y304/rs:fit/g:sm/q:90/h:528/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/sT2zG7AGgkbhck6VfHkMO91PmvS-9oreWSEBnw0Y304/rs:fit/g:sm/q:90/h:528/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/-n_-tyC_WEKGJJHh7ToxNyXQ0aV0Ixg4IxKsWz4fVWs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
            "width": 532
          },
          {
            "height": 198,
            "resource_url": "https://i.discogs.com/AWljJ_kI1CuGc_OB5WR3Zns79sgvcE4E4Y2yun7oLyQ/rs:fit/g:sm/q:90/h:198/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExMjY1Mjg0Mzcu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/AWljJ_kI1CuGc_OB5WR3Zns79sgvcE4E4Y2yun7oLyQ/rs:fit/g:sm/q:90/h:198/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExMjY1Mjg0Mzcu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/s470QPWj5gVEwUWjierTTVVSwl4A1a2jyTHaWyBumnM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExMjY1Mjg0Mzcu/anBlZw.jpeg",
            "width": 360
          },
          {
            "height": 332,
            "resource_url": "https://i.discogs.com/h7qSilfPIEMRJlDXutCftkKHugLHqCUAvKp8O0CWNPQ/rs:fit/g:sm/q:90/h:332/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzNjIu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/h7qSilfPIEMRJlDXutCftkKHugLHqCUAvKp8O0CWNPQ/rs:fit/g:sm/q:90/h:332/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzNjIu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/lky7gAkjo9di0TO6d9YynWjwjLofzQ7rBBiy8vrTVK8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzNjIu/anBlZw.jpeg",
            "width": 282
          },
          {
            "height": 317,
            "resource_url": "https://i.discogs.com/v2mqgMi7AkbzmxRpLnpgOQuwQWz9J03lS0-BAkWSWc0/rs:fit/g:sm/q:90/h:317/w:249/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzOTku/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/v2mqgMi7AkbzmxRpLnpgOQuwQWz9J03lS0-BAkWSWc0/rs:fit/g:sm/q:90/h:317/w:249/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzOTku/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/7RjgsIXv78xxbxYk2KaxnNKXt6w5qFt9PiKg2bcvK_A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzEzOTku/anBlZw.jpeg",
            "width": 249
          },
          {
            "height": 198,
            "resource_url": "https://i.discogs.com/C4vlEaxChu4Qv-7xhdioFWSg-CuI-r1iXLqkpBMfAME/rs:fit/g:sm/q:90/h:198/w:166/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzE0NjIu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/C4vlEaxChu4Qv-7xhdioFWSg-CuI-r1iXLqkpBMfAME/rs:fit/g:sm/q:90/h:198/w:166/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzE0NjIu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/PUtJozV4glWzq3en__Xm6ikI78OkqCnIUFJTZ0i5Snk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTExNjgyMzE0NjIu/anBlZw.jpeg",
            "width": 166
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/5CsbybIunXV9OIpzi-a67J6LympbbwO5qcXYkKxNiNE/rs:fit/g:sm/q:90/h:600/w:478/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTEzOTg5NjE4OTYt/MTI1OC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/5CsbybIunXV9OIpzi-a67J6LympbbwO5qcXYkKxNiNE/rs:fit/g:sm/q:90/h:600/w:478/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTEzOTg5NjE4OTYt/MTI1OC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/VGfaVdLRjqAy87VINXsTteAJo02BBHtR4HPmVd4D3D0/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTEzOTg5NjE4OTYt/MTI1OC5qcGVn.jpeg",
            "width": 478
          },
          {
            "height": 411,
            "resource_url": "https://i.discogs.com/8zPMwf3W8a6dqQgFcdLT_JJSlHy8jcTyKrTfmfXhCmc/rs:fit/g:sm/q:90/h:411/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE2Nzc2ODc1Mjgt/MjM2OC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/8zPMwf3W8a6dqQgFcdLT_JJSlHy8jcTyKrTfmfXhCmc/rs:fit/g:sm/q:90/h:411/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE2Nzc2ODc1Mjgt/MjM2OC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/de6DYLkmbHYFO12kBwLf8muv8pA2WzEswNvZ7Fv6cms/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE2Nzc2ODc1Mjgt/MjM2OC5qcGVn.jpeg",
            "width": 600
          }
        ],
        "name": "David Ruffin",
        "namevariations": [
          "D. Ruffin",
          "David",
          "David Rufin",
          "David!",
          "Ruffin"
        ],
        "profile": "b. 01/18/1941 in Whynot, Mississippi, U.S.A.\r\nd. 06/01/1991 in Philadelphia, Pennsylvania, U.S.A.\r\n\r\nGruff-voiced soul singer signed to [l=Motown], scored hits as lead singer of [a=The Temptations] and solo, in the 1960s and 1970s. Brother of fellow Motown singer [a=Jimmy Ruffin].",
        "realname": "Davis Eli Ruffin",
        "releases_url": "https://api.discogs.com/artists/86101/releases",
        "resource_url": "https://api.discogs.com/artists/86101",
        "uri": "https://www.discogs.com/artist/86101-David-Ruffin",
        "urls": [
          "http://en.wikipedia.org/wiki/David_Ruffin",
          "http://www.allmusic.com/artist/david-ruffin-mn0000811598",
          "http://www.whosampled.com/David-Ruffin/",
          "http://marvellousmotown.com/motown-artists/david-ruffin"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/86101",
      "thumb": "https://i.discogs.com/-n_-tyC_WEKGJJHh7ToxNyXQ0aV0Ixg4IxKsWz4fVWs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg2MTAx/LTE1MDY1MDAyNDgt/NTQ0MC5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/86101-David-Ruffin",
      "urls": [
        "http://en.wikipedia.org/wiki/David_Ruffin",
        "http://www.allmusic.com/artist/david-ruffin-mn0000811598",
        "http://www.whosampled.com/David-Ruffin/",
        "http://marvellousmotown.com/motown-artists/david-ruffin"
      ]
    },
    "lastfm": {
      "bio_content": "Davis Eli \"David\" Ruffin (January 18, 1941 – June 1, 1991) was an American soul singer and musician most famous for his work as one of the lead singers of the Temptations from 1964 to 1968 (or the group's \"Classic Five\" period as it was later known). He was the lead voice on such famous songs as \"My Girl\" and \"Ain't Too Proud to Beg.\"\nKnown for his unique raspy and anguished tenor vocals, Ruffin was ranked as one of the 100 Greatest Singers of All Time by Rolling Stone magazine in 2008. He was inducted into the Rock and Roll Hall of Fame in 1989 for his work with the Temptations. Fellow Motown recording artist Marvin Gaye once said admiringly of Ruffin that, \"I heard [in his voice] a strength my own voice lacked.\"\n\nRuffin was born Davis Eli Ruffin in the rural unincorporated community of Whynot, Mississippi, fifteen miles from Meridian, Mississippi. He was the third born son of Elias \"Eli\" Ruffin, a Baptist minister, and Ophelia Ruffin (née Davis). His siblings were Quincy B. Ruffin, Rita Ruffin, and Jimmy L. Ruffin. His parents were both natives of Mississippi. His father Eli worked as a truck driver at a lumber mill and his mother Ophelia worked out of their home. As far as the ancestry of the Ruffin family, Eli's parents had moved from Alabama to Mississippi, due to the harsh circumstances of living after the American Civil War. Prior to living in Alabama, David Ruffin's great grandparents, John Ruffin and Clara Ruffin, had moved from Bertie County, North Carolina. John Ruffin was a Civil War Veteran, fighting with the 14th United States Colored Heavy Artillery Regiment.\nRuffin's father was strict and at times violently abusive. Ruffin's mother died just months after his birth and his father married a schoolteacher, Earline, in 1942. As a young child, Ruffin, along with his other siblings (older brothers Quincy and Jimmy, and sister Rita Mae), traveled with their father and their stepmother as a family gospel group, opening shows for Mahalia Jackson and The Five Blind Boys of Mississippi, among others. Ruffin sang in the choir at Mount Salem Methodist Church, talent shows, and wherever else he could. In 1955, at the age of fourteen, he left home under the guardianship of a minister and went to Memphis, Tennessee with the purpose of pursuing the ministry.\nAt age 15, Ruffin went to Hot Springs, Arkansas with the jazz musician Phineas Newborn, Sr. There they played at the Fifty Grand Ballroom and Casino. Ruffin continued to sing at talent shows, worked with horses at a jockey club and eventually became a member of the Dixie Nightingales. He also sang with the Soul Stirrers briefly after the departure of Johnnie Taylor. It was in Ruffin's travels as a teenager that he met such later popular personalities as Elvis Presley, Little Richard, Frankie Lymon, Bobby Womack, the Staple Singers, the Swan Silvertones and the Dixie Hummingbirds.\nAfter some of his singing idols like Sam Cooke and Jackie Wilson had left gospel music and gone secular, Ruffin also turned in that direction. The 16-year-old Ruffin met and came under the guardianship of Eddie Bush and his wife Dorothy Helen, who took the teenager to Detroit, Michigan, where his brother Jimmy was pursuing a career in music while working at the Ford Motor Company.\n\nAfter moving to Detroit with the Bushes, Ruffin recorded his first released records with the songs \"You and I\" (1958) b/w \"Believe Me\" (1958) and the original version of \"Statue of a Fool.\" These songs were recorded at Vega Records and released under the name \"Little David Bush\", using the last name of the man he was living with at the time, Eddie Bush. Ruffin would later recall how he initially recorded \"a different kind of music\", strongly influenced by the smoother pop and R&B of the time, when he first recorded in Detroit for Vega.\nIn 1957, Ruffin met Berry Gordy, Jr., then a songwriter with ambitions of running his own label. Ruffin lived with Gordy's father, a contractor, and helped \"Pops\" Gordy do construction work on the building that would become Hitsville USA, the headquarters for Gordy's Tamla Records (later Motown Records) label. Ruffin's brother Jimmy would eventually be signed to Tamla's Miracle Records label as an artist.\nRuffin also worked alongside another ambitious singer, Marvin Gaye, as an apprentice at Anna Records, a Chess-distributed label run by Gordy's sister Gwen Gordy Fuqua and his songwriting partner Billy Davis. Asked about Ruffin in the Detroit Free Press in 1988, Gordy Fuqua said, \"He was very much a gentleman, yes ma'am and no ma'am, but the thing that really impressed me about David was that he was one of the only artists I've seen who rehearsed like he was on stage.\"\nEventually, Ruffin started recording at Anna Records, and recorded the song \"I'm in Love\" b/w \"One of These Days\" (1961), with the Voice Masters, which included future Motown producer Lamont Dozier and members of the singing group the Originals Ty Hunter, C.P. Spencer, Hank Dixon and Voice Masters and The Originals founder Walter Gaines (and, at one time, it also had another future Temptations member, Melvin Franklin, one of numerous people David would claim as a cousin).\nRuffin eventually met an up-and-coming local group by the name of The Temptations. His older brother Jimmy Ruffin went on a Motortown Revue tour with the Temptations, and he told David that they needed someone to sing tenor in their group. Ruffin showed interest in joining the group to Otis Williams whom he lived very close to in Detroit. In January 1964, Ruffin became a member of the Temptations after founding member Elbridge \"Al\" Bryant was fired from the group (Ruffin's first recording session with the group was January 9, 1964). Though both David and his brother Jimmy were considered, David was given an edge over Jimmy thanks to his performance skills, which David displayed when he joined the Temptations on-stage during the New Year's Eve party in 1963.\n\nThe bespectacled Ruffin initially sang backgrounds, while the role of lead singer mostly alternated between Eddie Kendricks and Paul Williams. He did sing a few lead parts both on stage and in the studio during his first year with the group, but his leads on these studio tracks would not be released for over a year, as they were considered not good enough to showcase Ruffin's vocals. Smokey Robinson, who produced and co-wrote most of the Temptations' material at this point, saw Ruffin during this period as a \"sleeping giant\" in the group with a unique voice that was, \"mellow,\" yet, \"gruff.\" Robinson thought that if he could write just the perfect song for Ruffin's voice, then he could have a smash hit. The song was to be something that Ruffin could \"belt out\" yet something that was also \"melodic and sweet\". That song, \"My Girl\", was recorded in November 1964 and released a month later, became the group's first number-one single in 1965. \"My Girl\" became the Temptations' signature song and elevated Ruffin to the role of lead singer and front man.\nThe follow-ups to \"My Girl\" were also extremely successful singles, including the Ruffin-led hits \"It's Growing\" (1965), \"Since I Lost My Baby\" (1965), \"My Baby\" (1965), \"Ain't Too Proud to Beg\" (1966), \"Beauty Is Only Skin Deep\" (1966), \"(I Know) I'm Losing You\" (1966), \"All I Need\" (1967), \"(Loneliness Made Me Realize) It's You That I Need\" (1967), \"I Wish It Would Rain\" (1967), and \"I Could Never Love Another (After Loving You)\" (1968). Ruffin also shared lead vocals on the 1967 hit single \"You're My Everything\" with Eddie Kendricks. The tall, 6'3\", Ruffin's passionate and dramatic performances endeared him to the Temptations' audiences and fans. According to Otis Williams, Ruffin (playfully nicknamed \"Ruff\" by the group) was initially a natural comedian and a hard-working singer when he first joined the group. Ruffin's most notable non-vocal contribution to the Temptations was the masterminding of their trademark four-headed microphone stand.\n\nBy 1967, however, ego problems with Ruffin became an issue for the group. He became addicted to cocaine and began missing rehearsals and performances. Refusing to travel with the other Temptations, Ruffin and his then-girlfriend Tammi Terrell traveled in a custom limo (with the image of his trademark black rimmed glasses painted on the door). After the Supremes had their name changed to Diana Ross & the Supremes in early 1967, Ruffin felt that he should become the focal point of the Temptations, just as Diana Ross was for her group and began demanding that the group name be changed to David Ruffin & the Temptations. This led to a number of disagreements between Ruffin and the group's de facto leader, Otis Williams. In addition to the group's problems with Ruffin's ego, he began inquiring into the Temptations' financial records, demanding an accounting of the group's money. This caused friction between Ruffin and Gordy.\nIn June 1968, the Temptations agreed that Ruffin had finally crossed the line when he missed a June 22 Cleveland, Ohio date with the Temptations to instead attend a performance by his new girlfriend, Barbara Gail Martin (Dean Martin's daughter). Ruffin was fired on June 27 and replaced with Dennis Edwards, a former member of The Contours who had been a friend of Ruffin and the group as a whole beforehand. Though Ruffin himself personally encouraged Edwards to take his place, Ruffin began turning up unannounced at Temptations' concerts during Edwards' first few dates with the group. When the group started to perform a Ruffin-era song such as \"My Girl\" or \"Ain't Too Proud to Beg\", Ruffin would suddenly walk on to the stage, take the microphone from Edwards' hands, and steal the show, embarrassing the group but entertaining the fans. According to Edwards, the adulation and Ruffin's pleas convinced the other four Temptations to give Ruffin a second chance, but when he arrived late to what was to be his return show with the group in Gaithersburg, Maryland, The Temptations decided to keep Edwards and drop considerations of rehiring Ruffin.\nIn October 1968, Ruffin filed suit against Motown Records, seeking a release from the label and an accounting of his money. Motown counter-sued to keep the singer from leaving the label and eventually the case was settled. The settlement required Ruffin to remain with Motown to finish out his initial contract (Ruffin joined Motown as a solo artist and always had a separate contract from the other Temptations, which some felt caused a lot of the in-fighting within the group).\n\nRuffin's first solo single was a song originally intended for the Temptations, \"My Whole World Ended (The Moment You Left Me)\". The single from the album entitled My Whole World Ended was released in 1969 followed soon by the album Feelin' Good. The single reached the US Pop & R&B \"Top Ten.\" A third album, titled David, was recorded in 1970-71, but was shelved by Motown and did not see a commercial release until 2004; his next official release for Motown did not arrive until 1973, when David Ruffin was released. His final Top Ten hit was 1975's \"Walk Away from Love\", produced by Van McCoy, which reached number nine on the Pop chart. It sold over one million copies, and was awarded a gold disc by the R.I.A.A. in February 1976. Other notable recordings from Ruffin's solo career include \"I Lost Everything I've Ever Loved\" (1969); the gospel-inflected \"I'm So Glad I Fell For You\" (1970); \"Blood Donors Needed (Give All You Can)\" (1973); \"Common Man\" (1973) (which was sampled on the 2001 Jay-Z song \"Never Change\"); \"No Matter Where\" (1974); \"Who I Am\" (1975); \"Statue of a Fool\" (1975); and cover versions of the Jackson Five's \"I Want You Back\", \"Rainy Night in Georgia\" popularized by Brook Benton (both recorded for the shelved 1970 album); and Harold Melvin and the Blue Notes' \"I Miss You\", featuring Eddie Kendrick (1973).\n\nIn 1970 Ruffin recorded an album with his brother Jimmy, I am My Brother's Keeper, for which they had minor hits with \"When My Love Hand (Comes Tumbling Down)\" and \"Your Love Was Worth Waiting For\". While his solo career initially showed promise, Ruffin reportedly went into decline in part because of his cocaine addiction and the lack of support from Motown.\nAfter leaving Motown in 1977, Ruffin recorded for Warner Bros. Records releasing the albums So Soon We Change (1979) and Gentleman Ruffin (1980), and later signed with RCA Records, accompanied by former Temptations band-mate Eddie Kendrick, who chose to rekindle their friendship when Kendrick himself started experiencing problems with the Temptations.\nIn 1982, Ruffin and Eddie Kendricks re-joined the Temptations for the recording of their album Reunion and the tour to promote the album. Reunion included the R&B hit \"Standing on the Top\" with Rick James. The reunion tour, however, was short lived as Ruffin started to miss shows due to his cocaine addiction, leading the group to be fined thousands of dollars. Otis Williams fired Ruffin for the second and final time from the group along with Kendricks (whose voice was weakened due to heavy chain smoking) by Christmas 1982. Ruffin started touring with Kendrick (who dropped the \"s\" from his last name at this time) as a duo act in 1985.\nIn 1982, Ruffin was sentenced to six months in a low-security prison in Terre Haute, Indiana, for failing to pay taxes during the mid-1970s. On May 19, 1986, he pleaded no contest to a charge of receiving and concealing stolen property worth less than $100 (a Colt .32-caliber handgun) and was fined $50 plus $100 in court costs. Charges of assault and battery and receiving stolen property worth more than $100 were dropped. A 1987 cocaine arrest landed him in jail for repeated parole violations.\nIn 1985, longtime Temptations fans Hall & Oates teamed up with Ruffin and Kendrick to perform at the re-opening of the Apollo Theater in New York. Their performance was released as a relatively successful live album and single. The four singers also sang a medley of Temptations hits at Live Aid on July 13, 1985. John Oates later wrote a minor hit single for Ruffin and Kendrick, but the two duos fell out, allegedly due to Daryl Hall's objections to Ruffin's heavy drug use. After being inducted into the Rock and Roll Hall of Fame, in 1989, with the other Temptations, Ruffin, Kendrick and Dennis Edwards began touring and recording as \"Ruffin/Kendrick/Edwards: Former Leads of The Temptations\". On August 17, 2013 in Cleveland, Ohio The Official R&B Music Hall of Fame inducted David Ruffin as a solo artist and also a member of The Temptations. His family was on hand for this great honor.\n\nRuffin was married twice. His first marriage was to Sandra Ruffin in 1961 with whom he had three daughters, Cheryl, Nedra and Kimberly. In 1976, Ruffin married Joy Hamilton. He also had one son he named David Ruffin Junior with his former girlfriend Genna Sapia, who--after his death--would add \"Ruffin\" to her last name in tribute to their long-term relationship, as well as to the fact that they had a son together. The two lived as husband and wife, but were never legally married.\nRuffin also had a well publicized relationship with Motown label mate and Marvin Gaye duet partner, singer Tammi Terrell.\n\nAfter a successful month-long tour of England with Kendrick and Edwards, Ruffin died on June 1, 1991, in a Philadelphia, Pennsylvania, hospital of \"an adverse reaction to drugs\" - namely cocaine. Although the cause of death was ruled an accident, Ruffin's family and friends suspected foul play, claiming that a money belt containing the proceeds from the tour ($300,000) was missing from his body. He had just finished recording the single \"Hurt the One You Love\" for Motorcity Records.\nIn The Temptations television miniseries, Ruffin's beaten body is depicted as being thrown from a moving car in front of a hospital, where he dies. Also stated in the mini-series was that his body remained unclaimed in a morgue for a week after his death. As a result, Ruffin's estate filed suit against NBC and other major players involved in the making of the series, claiming defamation. According to the plaintiffs in the case, Ruffin was actually taken to the hospital by a limousine and was escorted to the waiting area by his driver, who informed the attendants of his identity. The Ruffin children further state that his body was claimed by one of them within a few days after his death. (Ruffin's estate lost the lawsuit; the ruling against them was upheld on appeal.)\n\nRuffin had many admirers among his fellow artists, mainly for the emotive power he brought to every song he sang. \"Nobody could sing like David Ruffin,\" said his close friend and colleague Martha Reeves (of Martha and the Vandellas fame). His contemporary, label-mate, and long-time acquaintance Marvin Gaye was particularly impressed with the virility of Ruffin's voice. Gaye said Ruffin's work \"made me remember that when a lot of women listen to music, they want to feel the power of a real man.\"\nDaryl Hall of Hall & Oates, one of Ruffin's biggest fans, said, \"His voice had a certain glorious anguish that spoke to people on many emotional levels\". Ruffin himself said, \"I don't know what kind of voice I have, I really don't\"...it's just about \"the feeling I get for the song.\"\nThe raspy-voiced Rod Stewart fell in love with Ruffin's voice after he heard \"I Wish It Would Rain\". \"It jumped out of the speakers and ravished my soul,\" Stewart exclaimed. Stewart would later become friends with Ruffin. \"His voice was so powerful -- like a foghorn on the Queen Mary,\" Stewart told Rolling Stone magazine.\nFor all of his nearly forty years in the music business, much of it with modest success, Ruffin is remembered almost exclusively for his relatively brief stint in the Temptations. The cover art of his last album Gentleman Ruffin was the inspiration on the art of rapper Wiz Khalifa's mixtape Kush and Orange Juice.\n\nIn 1998, NBC aired The Temptations, a four-hour television miniseries about the group's career. Ruffin was portrayed by Leon Robinson (who uses the professional name \"Leon\"). The actor won high praise for his portrayal of Ruffin, but Ruffin's family was upset by the way the miniseries portrayed Ruffin and filed a lawsuit against the producers of the miniseries and also Otis Williams, whose memoir had been the source material for the miniseries. The case was dismissed in favor of the defendants, with Williams later claiming that he had no real control over the presentation of the material.\nGrand Puba of Brand Nubian referenced the singer on the 1990 single \"All for One\", stating: \"I hit a beat and swing a note as if my name was David Ruffin\".\nRapper Machine Gun Kelly also referenced the singer on his 2013 song \"See My Tears\" stating:\"Fought every temptation shit, I guess I’m David Ruffin huh?\"\nThe first song on Fall Out Boy's 2005 CD From Under the Cork Tree was to have been titled \"My Name is David Ruffin...and These are The Temptations\" but for legal reasons, the name was changed (to \"Our Lawyer Made Us Change the Name of This Song So We Wouldn't Get Sued\").\nHotstylz used Ruffin's song and referred his name on their hip-hop single \"Lookin' Boy\".\nAmerican rap rock group Gym Class Heroes references Ruffin in the 2008 song \"Like Father, Like Son (Papa's Song)\" from their album The Quilt stating: \"I never understood temptation. But I guess we both got a little David Ruffin in us.\"\n <a href=\"https://www.last.fm/music/David+Ruffin\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Davis Eli \"David\" Ruffin (January 18, 1941 – June 1, 1991) was an American soul singer and musician most famous for his work as one of the lead singers of the Temptations from 1964 to 1968 (or the group's \"Classic Five\" period as it was later known). He was the lead voice on such famous songs as \"My Girl\" and \"Ain't Too Proud to Beg.\"\nKnown for his unique raspy and anguished tenor vocals, Ruffin was ranked as one of the 100 Greatest Singers of All Time by Rolling Stone magazine in 2008. <a href=\"https://www.last.fm/music/David+Ruffin\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 201510,
      "mbid": "3d2ac089-fdc8-4381-a4b5-fcdc7fc36590",
      "name": "David Ruffin",
      "playcount": 1113484,
      "similar_artists": [
        {
          "name": "The Temptations",
          "url": "https://www.last.fm/music/The+Temptations"
        },
        {
          "name": "Eddie Kendricks",
          "url": "https://www.last.fm/music/Eddie+Kendricks"
        },
        {
          "name": "The O'Jays",
          "url": "https://www.last.fm/music/The+O%27Jays"
        },
        {
          "name": "Jimmy Ruffin",
          "url": "https://www.last.fm/music/Jimmy+Ruffin"
        },
        {
          "name": "Jr. Walker & The All Stars",
          "url": "https://www.last.fm/music/Jr.+Walker+&+The+All+Stars"
        }
      ],
      "tags": [
        "soul",
        "motown",
        "funk",
        "rhythm and blues",
        "rnb"
      ],
      "url": "https://www.last.fm/music/David+Ruffin"
    },
    "spotify": {
      "followers": 239403,
      "genres": [
        "motown",
        "northern soul",
        "classic soul",
        "soul",
        "philly soul"
      ],
      "id": "3FZn8Z2B7mfaSOU8NE62KR",
      "images": [
        {
          "height": 642,
          "url": "https://i.scdn.co/image/b380a73e72a5f4ced0b236c57b0ef610c6c7f13f",
          "width": 999
        },
        {
          "height": 411,
          "url": "https://i.scdn.co/image/754a82b8b772c43efb08bd6521055d6e64a9d51c",
          "width": 640
        },
        {
          "height": 128,
          "url": "https://i.scdn.co/image/4f5f4e4c4a57e0cb35b7b8c959d7c0939c425d93",
          "width": 199
        },
        {
          "height": 41,
          "url": "https://i.scdn.co/image/7c2783c7e641c527153ae8f748bdfd9a3f1e667b",
          "width": 64
        }
      ],
      "name": "David Ruffin",
      "popularity": 42,
      "url": "https://open.spotify.com/artist/3FZn8Z2B7mfaSOU8NE62KR"
    }
  },
  "spotify_id": "3FZn8Z2B7mfaSOU8NE62KR",
  "spotify_url": "https://open.spotify.com/artist/3FZn8Z2B7mfaSOU8NE62KR",
  "updated_at": "2025-07-08T09:57:35.311586",
  "wikipedia_url": null
}