{
  "apple_music_id": "463277",
  "apple_music_url": "https://music.apple.com/gb/artist/ben-folds/463277",
  "biography": "Benjamin Scott \"Ben\" Folds (born September 12, 1966) is an American singer-songwriter and record producer. From 1995 to 2000, Folds was the frontman and pianist of the alternative rock band Ben Folds Five. After the group temporarily disbanded, Folds performed as a solo artist and has toured all over the world. The group reunited in 2011. He has also collaborated with musicians such as William Shatner, Regina Spektor and \"Weird Al\" Yankovic and undertaken experimental songwriting projects with authors such as Nick Hornby and Neil Gaiman. In addition to contributing music to the soundtracks of the animated films Over the Hedge, and Hoodwinked!, Folds produced Amanda Palmer's first solo album and has been a judge on the NBC a cappella singing contest The Sing-Off since 2009.",
  "country": null,
  "created_at": "2025-07-12T10:44:04.961381",
  "discogs_id": "264737",
  "discogs_url": "https://www.discogs.com/artist/264737",
  "followers": 321538,
  "formed_date": null,
  "genres": [
    "Rock",
    "Alternative Rock",
    "Rock/Pop"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/2f/17/9d/2f179d99-eb76-8229-927a-c209691ed907/ami-identity-0900fd34574b568f21243aec333f84bf-2025-01-15T21-06-37.630Z_cropped.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5ebd1224064f3e5ecf9533ebfbe",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174d1224064f3e5ecf9533ebfbe",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178d1224064f3e5ecf9533ebfbe",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/folds-ben-50612805f2de2.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e395aa3b1d5d.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e3963c7ce1df.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e3963c7ce1df.jpg",
      "width": 1920
    },
    {
      "height": 185,
      "type": "banner",
      "url": "https://www.theaudiodb.com/images/media/artist/banner/folds-ben-5517335cc06b8.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/folds-ben-519dbae7c78cc.png",
      "width": 400
    }
  ],
  "lastfm_mbid": "51b7f46f-6c0f-46f2-9496-08c9ec2624d4",
  "lastfm_url": "https://www.last.fm/music/Ben+Folds",
  "local_images": {
    "hi-res": "../public/artist/ben-folds/ben-folds-hi-res.jpg",
    "medium": "../public/artist/ben-folds/ben-folds-medium.jpg",
    "small": "../public/artist/ben-folds/ben-folds-small.jpg"
  },
  "name": "Ben Folds",
  "popularity": 52,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='463277', url='https://music.apple.com/gb/artist/ben-folds/463277', name='Ben Folds', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/2f/17/9d/2f179d99-eb76-8229-927a-c209691ed907/ami-identity-0900fd34574b568f21243aec333f84bf-2025-01-15T21-06-37.630Z_cropped.png/2000x2000bb.jpg', genres=['Rock'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '463277', 'type': 'artists', 'href': '/v1/catalog/gb/artists/463277', 'attributes': {'name': 'Ben Folds', 'genreNames': ['Rock'], 'artwork': {'width': 4070, 'height': 4070, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/2f/17/9d/2f179d99-eb76-8229-927a-c209691ed907/ami-identity-0900fd34574b568f21243aec333f84bf-2025-01-15T21-06-37.630Z_cropped.png/{w}x{h}bb.jpg', 'bgColor': 'e5d5c8', 'textColor1': '09090d', 'textColor2': '151012', 'textColor3': '353132', 'textColor4': '3f3736'}, 'url': 'https://music.apple.com/gb/artist/ben-folds/463277'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/463277/albums', 'next': '/v1/catalog/gb/artists/463277/albums?offset=25', 'data': [{'id': '1668213049', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1668213049'}, {'id': '190084442', 'type': 'albums', 'href': '/v1/catalog/gb/albums/190084442'}, {'id': '1024117649', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1024117649'}, {'id': '1436820405', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1436820405'}, {'id': '287484864', 'type': 'albums', 'href': '/v1/catalog/gb/albums/287484864'}, {'id': '271422114', 'type': 'albums', 'href': '/v1/catalog/gb/albums/271422114'}, {'id': '201685638', 'type': 'albums', 'href': '/v1/catalog/gb/albums/201685638'}, {'id': '1821880625', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1821880625'}, {'id': '462925530', 'type': 'albums', 'href': '/v1/catalog/gb/albums/462925530'}, {'id': '287594049', 'type': 'albums', 'href': '/v1/catalog/gb/albums/287594049'}, {'id': '1435829802', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1435829802'}, {'id': '1519946891', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1519946891'}, {'id': '1766317522', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1766317522'}, {'id': '466586012', 'type': 'albums', 'href': '/v1/catalog/gb/albums/466586012'}, {'id': '506300892', 'type': 'albums', 'href': '/v1/catalog/gb/albums/506300892'}, {'id': '1436935441', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1436935441'}, {'id': '387461887', 'type': 'albums', 'href': '/v1/catalog/gb/albums/387461887'}, {'id': '1617375219', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1617375219'}, {'id': '322986920', 'type': 'albums', 'href': '/v1/catalog/gb/albums/322986920'}, {'id': '387461770', 'type': 'albums', 'href': '/v1/catalog/gb/albums/387461770'}, {'id': '1436938879', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1436938879'}, {'id': '462869670', 'type': 'albums', 'href': '/v1/catalog/gb/albums/462869670'}, {'id': '1245317047', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1245317047'}, {'id': '312959543', 'type': 'albums', 'href': '/v1/catalog/gb/albums/312959543'}, {'id': '1437017174', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1437017174'}]}}})",
    "discogs": {
      "cover_image": "",
      "id": "264737",
      "images": [],
      "members": [],
      "name": "Ben Folds",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "264737",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/264737"
      },
      "resource_url": "https://api.discogs.com/artists/264737",
      "thumb": "",
      "url": "https://www.discogs.com/artist/264737",
      "urls": []
    },
    "lastfm": "ArtistLastFmData(name='Ben Folds', url='https://www.last.fm/music/Ben+Folds', mbid='51b7f46f-6c0f-46f2-9496-08c9ec2624d4', listeners=1086040, playcount=29595523, bio_summary='Benjamin Scott Folds (born September 12, 1966, in Winston-Salem, North Carolina) is an American singer-songwriter. He is widely known for his prowess as a pianist. Ben Folds\\' musical career started to get off the ground in the late \\'80s, as bassist for band Majosha, after playing bass and piano at Pinehurst, in a group known as the \"Caroliners\" with cohort Millard Powers in 1985-1987; he also played drums as a session musician in Nashville. As well as appearing in Pots & Pans - now known as the Snuzz demo <a href=\"https://www.last.fm/music/Ben+Folds\">Read more on Last.fm</a>', bio_content='Benjamin Scott Folds (born September 12, 1966, in Winston-Salem, North Carolina) is an American singer-songwriter. He is widely known for his prowess as a pianist. Ben Folds\\' musical career started to get off the ground in the late \\'80s, as bassist for band Majosha, after playing bass and piano at Pinehurst, in a group known as the \"Caroliners\" with cohort Millard Powers in 1985-1987; he also played drums as a session musician in Nashville. As well as appearing in Pots & Pans - now known as the Snuzz demo, as a pianist in Britt Harper Uzzell\\'s (aka Snuzz) band.  Folds is well known for his later work as the frontman and pianist of Ben Folds Five and as a solo artist. Folds\\'s compositional and playing technique remain wholly unique, combining elements of the typical \\'singer/songwriter\\' genre, jazz, and power rock. Indeed, his music is evocative of artists such as Joe Jackson, Todd Rundgren, and Sir Elton John, with an added edge and bold infusion of energy and wit. Although his music has no distinctive genre with which it is associated, the terms piano rock and indie are often used to describe his unique style. It is worth noting that popular, piano-centric artists such as trio-based Keane and solo artist Matt Hales, a.k.a. Aqualung, began their rise to popularity after Ben Folds\\' three-member band, Ben Folds Five, broke up in 2000. The other two members of Ben Folds Five were Robert Sledge (bass) and Darren Jessee (drums).\\n\\nAs of fall 2006, Ben Folds has released five solo LPs. His first album, Fear of Pop: Volume 1, an album of spoken word and instrumental compositions, was recorded and released while Ben Folds Five was still together. Since it was an uncharacteristic release, and officially released under the moniker of \\'Fear of Pop\\', it is widely considered that his first \"proper\" solo album was Rockin\\' the Suburbs (2001), on which he played all the instruments by himself. A year later, in 2002, he released Ben Folds Live, a collection of live solo recordings. In late 2003, two solo EPs, Speed Graphic and Sunny 16, were released, with a third entitled Super D released in mid-2004. In 2005, Folds released a second studio album called Songs for Silverman. Most recently Folds has released the album \"Supersunnyspeedgraphic, the lp\" a compliation of his EPs, a The Bens track called \"Bruised,\" \"Still\" from the motion picture of 2006 \"Over the Hedge\" for which Folds wrote all the songs, his cover of the Dr. Dre song \"Bitches Ain\\'t Shit\", and, with the kind permission of his good friend Neil Hannon, a cover of The Divine Comedy song \"Songs of Love\".  \"Supersunnyspeedgraphic, the lp\" otherwise includes remastered takes from the three internet EPs from 2002-2004. Ben claims that he wanted to have the CD in hard format so he could \"put it past him.\"\\n\\nBen resides in Nashville.  He often tours the United States, the United Kingdom, other countries in Europe, Japan, and Australia.\\n\\nFolds\\' tours are famous for his solo act as \"Ben Folds and a piano\", often having the audience become involved by \"playing\" the accompanying instruments (such as the trumpet and saxophone harmonies in \"Army\") and singing choir-like backing vocals on \"Not the Same\". His concerts are charismatic, yet calm - an enjoyable experience for most. And although Folds is constantly putting out new songs, his concerts rarely omit classic fan favorites such as \"Philosophy,\" \"One Angry Dwarf and 200 Solemn Faces,\" and \"Army.\" Also, a seemingly fan favorite that started in Chicago, IL was \"Rock this Bitch,\" a song where Folds has to come up an impromptu new tune with the words \"Rock this Bitch\" in it; though the song seems to be phasing out, it still makes appearances on tours, such as the November 2006 tour and the Spring US College tour of 2007 and 2008.\\n\\nFolds also produced and arranged the William Shatner album, Has Been (2004); he previously worked with Shatner on the songs \"In Love\" and \"Still in Love\" for Fear of Pop.\\n\\nFolds described his former band, Ben Folds Five, as \"punk rock for sissies,\" and his oddball lyrics often contain nuances of depression, melancholy and self-conflict. Folds also provided a number of songs for film soundtracks. Some of these include \"Lonely Christmas Eve\" for the Jim Carrey film How the Grinch Stole Christmas! (2000), and a rendition of the Beatles\\' \"Golden Slumbers\" for the film I Am Sam (2001). He (as The Bens) has also done charity compilations, from singing \"Wicked Little Town\" (from film and stage show Hedwig and the Angry Inch) on the benefit album \"Wig in a Box\" (2003) to appearing on No Boundaries, a benefit album for Kosovo refugees, with the song \"Leather Jacket.\" (written by Darren Jessee)\\n\\nOn a planned tour of Australia, Folds teamed up with solo artists Ben Kweller and Ben Lee to travel the country together as The Bens, at the suggestion of a fan on Ben Kweller\\'s official website. The trio also went on to record a four-track EP together, entitled The Bens.\\n\\nIn summer of 2004, Folds co-headlined an American tour with fellow rockers Rufus Wainwright and Guster. His second solo studio album, entitled Songs for Silverman, was released in the U.S. on April 26, 2005, featuring Jared Reynolds on bass, and Lindsay Jamieson on the drums, thus returning to the trio format, which had been so successful earlier, in earnest. This album includes the track \"Late,\" a tribute to the late singer-songwriter Elliott Smith, and also features backing vocals from \"Weird Al\" Yankovic on \"Time.\" (Folds had played piano for Yankovic\\'s song \"Why Does This Always Happen to Me?\" and \"Weird Al\" directed Folds\\' music video for Rockin\\' the Suburbs). In January of 2007 Lindsay Jamieson left the band and was replaced by Sam Smith, of The Comfies on drums.\\n\\nFolds performed with Rufus Wainwright and Ben Lee in the summer of 2005 as part of the \"Odd Men Out\" tour. In addition, Folds has performed with many other famous musical names, including Weezer. Folds has also shown the complexity behind his authentic sound by performing with the West Australian Symphony Orchestra, in March 2005, and the Baltimore Symphony Orchestra, in November 2005. A DVD recording of Folds playing with the West Australian Symphony Orchestra was released in December, 2005.\\n\\nFolds was the first artist to do a \"Live at Myspace\" concert, held on October 24, 2006 in his recording studio in Nashville, the show was an hour long and had requests from the internet submitted via Myspace\\'s Messenger. It also entailed several stunts, including a suicide attempt, and a falling audience member during \"Jesusland\". The DVD of the broadcast (almost whole) was released in February of 2007. \\n\\n\\nFolds supports the independent music scene, creating his own record label (Attacked By Plastic) and doing promotional work for independent record stores across the country.\\n\\nIn 2008, September 16 marked the release of Amanda Palmer\\'s solo album which was produced by Folds. Two days following that release, Ben Folds Five had a one-time reunion concert held in Chapel Hill, North Carolina, the same place the band was formed. Weeks later, he released his third solo album entitled Way To Normal, released on September 30. Folds also recorded a fake album that was leaked intentionally during the summer to please fans and in an attempt to stop the real album from leaking. The fake tracks were recorded and mixed over a period of only several days. The leak contained 6 fake songs with names similar to the real songs or the album, and three songs from the actual release (except the song Cologne, which was an orchestral version of a song by the same name on the final album).\\n\\nSince December 2008, Folds has been collaborating with English novelist Nick Hornby, writing the music while Hornby writes the lyrics. This album was originally planned to be recorded over a course of 3 days, the same amount of time in which the fake album was recorded, but Folds has since been recording the album in a more standard format, albeit attempting to retain the live recording format. He has also played several songs from the upcoming album at live shows since mid-2009, and the album is slated to be released on September 27th of 2010.\\n\\nFrom December 14 through 21, 2009, Folds was featured as a judge on NBC\\'s a cappella competition The Sing Off alongside Nicole Scherzinger and Shawn Stockman and offered insightful, constructive comments and criticisms to the contestants. On the final show, in a departure from his a cappella purism, showcased his talents and played the roaring, riffing piano background on \"Why Can\\'t We Be Friends?\" sung by the two finalist groups, Tufts Beelzebubs from Tufts University near Boston and Nota, from San Juan, Puerto Rico. He again returned for the show\\'s second season, and has been confirmed to return for the third season in September 2011 alongside Stockman and new judge Sara Bareilles.\\n\\nRecently Ben Folds was assumed to be the anonymous pianist playing songs to random ChatRoulette users, named \"Merton.\" Although Ben Folds has admitted to NOT being Merton, he paid tribute to the YouTube star at a concert in Charlotte in \"Ode To Merton.\"\\n\\nBen Folds recently released his first album since So There, What Matters Most in June of 2023 after a 12 year hiatus. <a href=\"https://www.last.fm/music/Ben+Folds\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['singer-songwriter', 'seen live', 'indie', 'piano rock', 'alternative'], similar_artists=[{'name': 'Ben Folds Five', 'url': 'https://www.last.fm/music/Ben+Folds+Five'}, {'name': 'Guster', 'url': 'https://www.last.fm/music/Guster'}, {'name': 'Ben Lee', 'url': 'https://www.last.fm/music/Ben+Lee'}, {'name': 'Ben Kweller', 'url': 'https://www.last.fm/music/Ben+Kweller'}, {'name': 'Fountains of Wayne', 'url': 'https://www.last.fm/music/Fountains+of+Wayne'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Ben Folds', 'mbid': '51b7f46f-6c0f-46f2-9496-08c9ec2624d4', 'url': 'https://www.last.fm/music/Ben+Folds', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '1', 'stats': {'listeners': '1086040', 'playcount': '29595523'}, 'similar': {'artist': [{'name': 'Ben Folds Five', 'url': 'https://www.last.fm/music/Ben+Folds+Five', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Guster', 'url': 'https://www.last.fm/music/Guster', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Ben Lee', 'url': 'https://www.last.fm/music/Ben+Lee', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Ben Kweller', 'url': 'https://www.last.fm/music/Ben+Kweller', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Fountains of Wayne', 'url': 'https://www.last.fm/music/Fountains+of+Wayne', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'singer-songwriter', 'url': 'https://www.last.fm/tag/singer-songwriter'}, {'name': 'seen live', 'url': 'https://www.last.fm/tag/seen+live'}, {'name': 'indie', 'url': 'https://www.last.fm/tag/indie'}, {'name': 'piano rock', 'url': 'https://www.last.fm/tag/piano+rock'}, {'name': 'alternative', 'url': 'https://www.last.fm/tag/alternative'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Ben+Folds/+wiki'}}, 'published': '10 Feb 2006, 14:43', 'summary': 'Benjamin Scott Folds (born September 12, 1966, in Winston-Salem, North Carolina) is an American singer-songwriter. He is widely known for his prowess as a pianist. Ben Folds\\' musical career started to get off the ground in the late \\'80s, as bassist for band Majosha, after playing bass and piano at Pinehurst, in a group known as the \"Caroliners\" with cohort Millard Powers in 1985-1987; he also played drums as a session musician in Nashville. As well as appearing in Pots & Pans - now known as the Snuzz demo <a href=\"https://www.last.fm/music/Ben+Folds\">Read more on Last.fm</a>', 'content': 'Benjamin Scott Folds (born September 12, 1966, in Winston-Salem, North Carolina) is an American singer-songwriter. He is widely known for his prowess as a pianist. Ben Folds\\' musical career started to get off the ground in the late \\'80s, as bassist for band Majosha, after playing bass and piano at Pinehurst, in a group known as the \"Caroliners\" with cohort Millard Powers in 1985-1987; he also played drums as a session musician in Nashville. As well as appearing in Pots & Pans - now known as the Snuzz demo, as a pianist in Britt Harper Uzzell\\'s (aka Snuzz) band.  Folds is well known for his later work as the frontman and pianist of Ben Folds Five and as a solo artist. Folds\\'s compositional and playing technique remain wholly unique, combining elements of the typical \\'singer/songwriter\\' genre, jazz, and power rock. Indeed, his music is evocative of artists such as Joe Jackson, Todd Rundgren, and Sir Elton John, with an added edge and bold infusion of energy and wit. Although his music has no distinctive genre with which it is associated, the terms piano rock and indie are often used to describe his unique style. It is worth noting that popular, piano-centric artists such as trio-based Keane and solo artist Matt Hales, a.k.a. Aqualung, began their rise to popularity after Ben Folds\\' three-member band, Ben Folds Five, broke up in 2000. The other two members of Ben Folds Five were Robert Sledge (bass) and Darren Jessee (drums).\\n\\nAs of fall 2006, Ben Folds has released five solo LPs. His first album, Fear of Pop: Volume 1, an album of spoken word and instrumental compositions, was recorded and released while Ben Folds Five was still together. Since it was an uncharacteristic release, and officially released under the moniker of \\'Fear of Pop\\', it is widely considered that his first \"proper\" solo album was Rockin\\' the Suburbs (2001), on which he played all the instruments by himself. A year later, in 2002, he released Ben Folds Live, a collection of live solo recordings. In late 2003, two solo EPs, Speed Graphic and Sunny 16, were released, with a third entitled Super D released in mid-2004. In 2005, Folds released a second studio album called Songs for Silverman. Most recently Folds has released the album \"Supersunnyspeedgraphic, the lp\" a compliation of his EPs, a The Bens track called \"Bruised,\" \"Still\" from the motion picture of 2006 \"Over the Hedge\" for which Folds wrote all the songs, his cover of the Dr. Dre song \"Bitches Ain\\'t Shit\", and, with the kind permission of his good friend Neil Hannon, a cover of The Divine Comedy song \"Songs of Love\".  \"Supersunnyspeedgraphic, the lp\" otherwise includes remastered takes from the three internet EPs from 2002-2004. Ben claims that he wanted to have the CD in hard format so he could \"put it past him.\"\\n\\nBen resides in Nashville.  He often tours the United States, the United Kingdom, other countries in Europe, Japan, and Australia.\\n\\nFolds\\' tours are famous for his solo act as \"Ben Folds and a piano\", often having the audience become involved by \"playing\" the accompanying instruments (such as the trumpet and saxophone harmonies in \"Army\") and singing choir-like backing vocals on \"Not the Same\". His concerts are charismatic, yet calm - an enjoyable experience for most. And although Folds is constantly putting out new songs, his concerts rarely omit classic fan favorites such as \"Philosophy,\" \"One Angry Dwarf and 200 Solemn Faces,\" and \"Army.\" Also, a seemingly fan favorite that started in Chicago, IL was \"Rock this Bitch,\" a song where Folds has to come up an impromptu new tune with the words \"Rock this Bitch\" in it; though the song seems to be phasing out, it still makes appearances on tours, such as the November 2006 tour and the Spring US College tour of 2007 and 2008.\\n\\nFolds also produced and arranged the William Shatner album, Has Been (2004); he previously worked with Shatner on the songs \"In Love\" and \"Still in Love\" for Fear of Pop.\\n\\nFolds described his former band, Ben Folds Five, as \"punk rock for sissies,\" and his oddball lyrics often contain nuances of depression, melancholy and self-conflict. Folds also provided a number of songs for film soundtracks. Some of these include \"Lonely Christmas Eve\" for the Jim Carrey film How the Grinch Stole Christmas! (2000), and a rendition of the Beatles\\' \"Golden Slumbers\" for the film I Am Sam (2001). He (as The Bens) has also done charity compilations, from singing \"Wicked Little Town\" (from film and stage show Hedwig and the Angry Inch) on the benefit album \"Wig in a Box\" (2003) to appearing on No Boundaries, a benefit album for Kosovo refugees, with the song \"Leather Jacket.\" (written by Darren Jessee)\\n\\nOn a planned tour of Australia, Folds teamed up with solo artists Ben Kweller and Ben Lee to travel the country together as The Bens, at the suggestion of a fan on Ben Kweller\\'s official website. The trio also went on to record a four-track EP together, entitled The Bens.\\n\\nIn summer of 2004, Folds co-headlined an American tour with fellow rockers Rufus Wainwright and Guster. His second solo studio album, entitled Songs for Silverman, was released in the U.S. on April 26, 2005, featuring Jared Reynolds on bass, and Lindsay Jamieson on the drums, thus returning to the trio format, which had been so successful earlier, in earnest. This album includes the track \"Late,\" a tribute to the late singer-songwriter Elliott Smith, and also features backing vocals from \"Weird Al\" Yankovic on \"Time.\" (Folds had played piano for Yankovic\\'s song \"Why Does This Always Happen to Me?\" and \"Weird Al\" directed Folds\\' music video for Rockin\\' the Suburbs). In January of 2007 Lindsay Jamieson left the band and was replaced by Sam Smith, of The Comfies on drums.\\n\\nFolds performed with Rufus Wainwright and Ben Lee in the summer of 2005 as part of the \"Odd Men Out\" tour. In addition, Folds has performed with many other famous musical names, including Weezer. Folds has also shown the complexity behind his authentic sound by performing with the West Australian Symphony Orchestra, in March 2005, and the Baltimore Symphony Orchestra, in November 2005. A DVD recording of Folds playing with the West Australian Symphony Orchestra was released in December, 2005.\\n\\nFolds was the first artist to do a \"Live at Myspace\" concert, held on October 24, 2006 in his recording studio in Nashville, the show was an hour long and had requests from the internet submitted via Myspace\\'s Messenger. It also entailed several stunts, including a suicide attempt, and a falling audience member during \"Jesusland\". The DVD of the broadcast (almost whole) was released in February of 2007. \\n\\n\\nFolds supports the independent music scene, creating his own record label (Attacked By Plastic) and doing promotional work for independent record stores across the country.\\n\\nIn 2008, September 16 marked the release of Amanda Palmer\\'s solo album which was produced by Folds. Two days following that release, Ben Folds Five had a one-time reunion concert held in Chapel Hill, North Carolina, the same place the band was formed. Weeks later, he released his third solo album entitled Way To Normal, released on September 30. Folds also recorded a fake album that was leaked intentionally during the summer to please fans and in an attempt to stop the real album from leaking. The fake tracks were recorded and mixed over a period of only several days. The leak contained 6 fake songs with names similar to the real songs or the album, and three songs from the actual release (except the song Cologne, which was an orchestral version of a song by the same name on the final album).\\n\\nSince December 2008, Folds has been collaborating with English novelist Nick Hornby, writing the music while Hornby writes the lyrics. This album was originally planned to be recorded over a course of 3 days, the same amount of time in which the fake album was recorded, but Folds has since been recording the album in a more standard format, albeit attempting to retain the live recording format. He has also played several songs from the upcoming album at live shows since mid-2009, and the album is slated to be released on September 27th of 2010.\\n\\nFrom December 14 through 21, 2009, Folds was featured as a judge on NBC\\'s a cappella competition The Sing Off alongside Nicole Scherzinger and Shawn Stockman and offered insightful, constructive comments and criticisms to the contestants. On the final show, in a departure from his a cappella purism, showcased his talents and played the roaring, riffing piano background on \"Why Can\\'t We Be Friends?\" sung by the two finalist groups, Tufts Beelzebubs from Tufts University near Boston and Nota, from San Juan, Puerto Rico. He again returned for the show\\'s second season, and has been confirmed to return for the third season in September 2011 alongside Stockman and new judge Sara Bareilles.\\n\\nRecently Ben Folds was assumed to be the anonymous pianist playing songs to random ChatRoulette users, named \"Merton.\" Although Ben Folds has admitted to NOT being Merton, he paid tribute to the YouTube star at a concert in Charlotte in \"Ode To Merton.\"\\n\\nBen Folds recently released his first album since So There, What Matters Most in June of 2023 after a 12 year hiatus. <a href=\"https://www.last.fm/music/Ben+Folds\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='55tif8708yyDQlSjh3Trdu', url='https://open.spotify.com/artist/55tif8708yyDQlSjh3Trdu', name='Ben Folds', popularity=52, followers=321538, genres=[], images=[{'url': 'https://i.scdn.co/image/ab6761610000e5ebd1224064f3e5ecf9533ebfbe', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174d1224064f3e5ecf9533ebfbe', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178d1224064f3e5ecf9533ebfbe', 'height': 160, 'width': 160}], external_urls={'spotify': 'https://open.spotify.com/artist/55tif8708yyDQlSjh3Trdu'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/55tif8708yyDQlSjh3Trdu'}, 'followers': {'href': None, 'total': 321538}, 'genres': [], 'href': 'https://api.spotify.com/v1/artists/55tif8708yyDQlSjh3Trdu', 'id': '55tif8708yyDQlSjh3Trdu', 'images': [{'url': 'https://i.scdn.co/image/ab6761610000e5ebd1224064f3e5ecf9533ebfbe', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174d1224064f3e5ecf9533ebfbe', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178d1224064f3e5ecf9533ebfbe', 'height': 160, 'width': 160}], 'name': 'Ben Folds', 'popularity': 52, 'type': 'artist', 'uri': 'spotify:artist:55tif8708yyDQlSjh3Trdu'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Benjamin Scott \"Ben\" Folds (born September 12, 1966) is an American singer-songwriter and record producer. From 1995 to 2000, Folds was the frontman and pianist of the alternative rock band Ben Folds Five. After the group temporarily disbanded, Folds performed as a solo artist and has toured all over the world. The group reunited in 2011. He has also collaborated with musicians such as William Shatner, Regina Spektor and \"Weird Al\" Yankovic and undertaken experimental songwriting projects with authors such as Nick Hornby and Neil Gaiman. In addition to contributing music to the soundtracks of the animated films Over the Hedge, and Hoodwinked!, Folds produced Amanda Palmer's first solo album and has been a judge on the NBC a cappella singing contest The Sing-Off since 2009.",
      "biography_es": null,
      "biography_fr": "Benjamin Scott Folds est un chanteur américain, né le 12 septembre 1966 à Winston-Salem en Caroline du Nord (États-Unis). Il est notamment connu pour avoir fait partie du groupe Ben Folds Five et est une figure emblématique du piano rock.\n\nEssentiellement connu pour ses prouesses au piano, il est également un adepte de la guitare, de la basse, et de la batterie. Il est originairement devenu célèbre en tant que membre du groupe de rock Ben Folds Five. Ben a publié 4 albums solo: Fear of Pop: Volume 1, Rockin' the Suburbs, Ben Folds Live, and Songs for Silverman. Fear of Pop fut publié lorsque Ben Folds Five était encore en activité. Les albums Suburbs, Live, et Songs for Silverman furent eux publiés après.\n\nMais comme Fear of Pop est largement expérimental et Live est une collection d'enregistrements de morceaux en live, originairement enregistrés avec les Ben Folds Five, celui de Rockin' the Suburbs est officiellement le premier propre album solo de Ben sorti, dans lequel il a enregistré la plupart des instruments lui-même. Fin 2003, ce sont deux solos Speed Graphic et Sunny 16 qui sont publiés. Et avec un troisième intitulé Super D à la mi-2004.\n\nSon groupe, Ben Folds Five (1994–2000) était un groupe de trois membres formés à Chapel Hill, en Caroline du Nord. Ils jouèrent ce que l’on pourrait appeler du piano à dominante pop-rock. La plupart de leurs chansons ont été influencées par le jazz, avec des passages improvisés. Ben Folds, le chanteur leader du groupe et pianiste, qui a écrit aussi la plupart des chansons, Robert Sledge, à la basse, Darren Jessee aux percussions, Alex Queen à la guitare, Jane Scorp's au gong. Après la séparation du groupe, Folds a commencé une carrière en solo. Le reste du groupe a continué à jouer de la musique orchestrale à la fanfare de Sanem.\n\nLorsqu’on l’a interrogé à propos du nom de son groupe il répondit à l’interviewer : « vous voulez dire qu’un quintette, espèce d'inculte, ce n’est pas cinq personnes ? »\n\nBen et sa femme Fleur Folds se sont mariés en janvier, 2008 et habitent avec leurs trois enfants à Nashville aux États-Unis.",
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1966",
      "country": "Nashville, USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "www.facebook.com/BenFolds",
      "formed_year": "1995",
      "gender": "Male",
      "genre": "Alternative Rock",
      "id": "114185",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/folds-ben-50612805f2de2.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e395aa3b1d5d.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e3963c7ce1df.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e3963c7ce1df.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/folds-ben-5517335cc06b8.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/folds-ben-519dbae7c78cc.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "Enlightened",
      "music_videos": null,
      "musicbrainz_id": "51b7f46f-6c0f-46f2-9496-08c9ec2624d4",
      "name": "Ben Folds",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": "benfolds.com"
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages221/v4/2f/17/9d/2f179d99-eb76-8229-927a-c209691ed907/ami-identity-0900fd34574b568f21243aec333f84bf-2025-01-15T21-06-37.630Z_cropped.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "463277",
      "name": "Ben Folds",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/ben-folds/463277"
    },
    "discogs": {
      "cover_image": "",
      "id": "264737",
      "images": [],
      "members": [],
      "name": "Ben Folds",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "264737",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/264737"
      },
      "resource_url": "https://api.discogs.com/artists/264737",
      "thumb": "",
      "url": "https://www.discogs.com/artist/264737",
      "urls": []
    },
    "lastfm": {
      "bio_content": "Benjamin Scott Folds (born September 12, 1966, in Winston-Salem, North Carolina) is an American singer-songwriter. He is widely known for his prowess as a pianist. Ben Folds' musical career started to get off the ground in the late '80s, as bassist for band Majosha, after playing bass and piano at Pinehurst, in a group known as the \"Caroliners\" with cohort Millard Powers in 1985-1987; he also played drums as a session musician in Nashville. As well as appearing in Pots & Pans - now known as the Snuzz demo, as a pianist in Britt Harper Uzzell's (aka Snuzz) band.  Folds is well known for his later work as the frontman and pianist of Ben Folds Five and as a solo artist. Folds's compositional and playing technique remain wholly unique, combining elements of the typical 'singer/songwriter' genre, jazz, and power rock. Indeed, his music is evocative of artists such as Joe Jackson, Todd Rundgren, and Sir Elton John, with an added edge and bold infusion of energy and wit. Although his music has no distinctive genre with which it is associated, the terms piano rock and indie are often used to describe his unique style. It is worth noting that popular, piano-centric artists such as trio-based Keane and solo artist Matt Hales, a.k.a. Aqualung, began their rise to popularity after Ben Folds' three-member band, Ben Folds Five, broke up in 2000. The other two members of Ben Folds Five were Robert Sledge (bass) and Darren Jessee (drums).\n\nAs of fall 2006, Ben Folds has released five solo LPs. His first album, Fear of Pop: Volume 1, an album of spoken word and instrumental compositions, was recorded and released while Ben Folds Five was still together. Since it was an uncharacteristic release, and officially released under the moniker of 'Fear of Pop', it is widely considered that his first \"proper\" solo album was Rockin' the Suburbs (2001), on which he played all the instruments by himself. A year later, in 2002, he released Ben Folds Live, a collection of live solo recordings. In late 2003, two solo EPs, Speed Graphic and Sunny 16, were released, with a third entitled Super D released in mid-2004. In 2005, Folds released a second studio album called Songs for Silverman. Most recently Folds has released the album \"Supersunnyspeedgraphic, the lp\" a compliation of his EPs, a The Bens track called \"Bruised,\" \"Still\" from the motion picture of 2006 \"Over the Hedge\" for which Folds wrote all the songs, his cover of the Dr. Dre song \"Bitches Ain't Shit\", and, with the kind permission of his good friend Neil Hannon, a cover of The Divine Comedy song \"Songs of Love\".  \"Supersunnyspeedgraphic, the lp\" otherwise includes remastered takes from the three internet EPs from 2002-2004. Ben claims that he wanted to have the CD in hard format so he could \"put it past him.\"\n\nBen resides in Nashville.  He often tours the United States, the United Kingdom, other countries in Europe, Japan, and Australia.\n\nFolds' tours are famous for his solo act as \"Ben Folds and a piano\", often having the audience become involved by \"playing\" the accompanying instruments (such as the trumpet and saxophone harmonies in \"Army\") and singing choir-like backing vocals on \"Not the Same\". His concerts are charismatic, yet calm - an enjoyable experience for most. And although Folds is constantly putting out new songs, his concerts rarely omit classic fan favorites such as \"Philosophy,\" \"One Angry Dwarf and 200 Solemn Faces,\" and \"Army.\" Also, a seemingly fan favorite that started in Chicago, IL was \"Rock this Bitch,\" a song where Folds has to come up an impromptu new tune with the words \"Rock this Bitch\" in it; though the song seems to be phasing out, it still makes appearances on tours, such as the November 2006 tour and the Spring US College tour of 2007 and 2008.\n\nFolds also produced and arranged the William Shatner album, Has Been (2004); he previously worked with Shatner on the songs \"In Love\" and \"Still in Love\" for Fear of Pop.\n\nFolds described his former band, Ben Folds Five, as \"punk rock for sissies,\" and his oddball lyrics often contain nuances of depression, melancholy and self-conflict. Folds also provided a number of songs for film soundtracks. Some of these include \"Lonely Christmas Eve\" for the Jim Carrey film How the Grinch Stole Christmas! (2000), and a rendition of the Beatles' \"Golden Slumbers\" for the film I Am Sam (2001). He (as The Bens) has also done charity compilations, from singing \"Wicked Little Town\" (from film and stage show Hedwig and the Angry Inch) on the benefit album \"Wig in a Box\" (2003) to appearing on No Boundaries, a benefit album for Kosovo refugees, with the song \"Leather Jacket.\" (written by Darren Jessee)\n\nOn a planned tour of Australia, Folds teamed up with solo artists Ben Kweller and Ben Lee to travel the country together as The Bens, at the suggestion of a fan on Ben Kweller's official website. The trio also went on to record a four-track EP together, entitled The Bens.\n\nIn summer of 2004, Folds co-headlined an American tour with fellow rockers Rufus Wainwright and Guster. His second solo studio album, entitled Songs for Silverman, was released in the U.S. on April 26, 2005, featuring Jared Reynolds on bass, and Lindsay Jamieson on the drums, thus returning to the trio format, which had been so successful earlier, in earnest. This album includes the track \"Late,\" a tribute to the late singer-songwriter Elliott Smith, and also features backing vocals from \"Weird Al\" Yankovic on \"Time.\" (Folds had played piano for Yankovic's song \"Why Does This Always Happen to Me?\" and \"Weird Al\" directed Folds' music video for Rockin' the Suburbs). In January of 2007 Lindsay Jamieson left the band and was replaced by Sam Smith, of The Comfies on drums.\n\nFolds performed with Rufus Wainwright and Ben Lee in the summer of 2005 as part of the \"Odd Men Out\" tour. In addition, Folds has performed with many other famous musical names, including Weezer. Folds has also shown the complexity behind his authentic sound by performing with the West Australian Symphony Orchestra, in March 2005, and the Baltimore Symphony Orchestra, in November 2005. A DVD recording of Folds playing with the West Australian Symphony Orchestra was released in December, 2005.\n\nFolds was the first artist to do a \"Live at Myspace\" concert, held on October 24, 2006 in his recording studio in Nashville, the show was an hour long and had requests from the internet submitted via Myspace's Messenger. It also entailed several stunts, including a suicide attempt, and a falling audience member during \"Jesusland\". The DVD of the broadcast (almost whole) was released in February of 2007. \n\n\nFolds supports the independent music scene, creating his own record label (Attacked By Plastic) and doing promotional work for independent record stores across the country.\n\nIn 2008, September 16 marked the release of Amanda Palmer's solo album which was produced by Folds. Two days following that release, Ben Folds Five had a one-time reunion concert held in Chapel Hill, North Carolina, the same place the band was formed. Weeks later, he released his third solo album entitled Way To Normal, released on September 30. Folds also recorded a fake album that was leaked intentionally during the summer to please fans and in an attempt to stop the real album from leaking. The fake tracks were recorded and mixed over a period of only several days. The leak contained 6 fake songs with names similar to the real songs or the album, and three songs from the actual release (except the song Cologne, which was an orchestral version of a song by the same name on the final album).\n\nSince December 2008, Folds has been collaborating with English novelist Nick Hornby, writing the music while Hornby writes the lyrics. This album was originally planned to be recorded over a course of 3 days, the same amount of time in which the fake album was recorded, but Folds has since been recording the album in a more standard format, albeit attempting to retain the live recording format. He has also played several songs from the upcoming album at live shows since mid-2009, and the album is slated to be released on September 27th of 2010.\n\nFrom December 14 through 21, 2009, Folds was featured as a judge on NBC's a cappella competition The Sing Off alongside Nicole Scherzinger and Shawn Stockman and offered insightful, constructive comments and criticisms to the contestants. On the final show, in a departure from his a cappella purism, showcased his talents and played the roaring, riffing piano background on \"Why Can't We Be Friends?\" sung by the two finalist groups, Tufts Beelzebubs from Tufts University near Boston and Nota, from San Juan, Puerto Rico. He again returned for the show's second season, and has been confirmed to return for the third season in September 2011 alongside Stockman and new judge Sara Bareilles.\n\nRecently Ben Folds was assumed to be the anonymous pianist playing songs to random ChatRoulette users, named \"Merton.\" Although Ben Folds has admitted to NOT being Merton, he paid tribute to the YouTube star at a concert in Charlotte in \"Ode To Merton.\"\n\nBen Folds recently released his first album since So There, What Matters Most in June of 2023 after a 12 year hiatus. <a href=\"https://www.last.fm/music/Ben+Folds\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Benjamin Scott Folds (born September 12, 1966, in Winston-Salem, North Carolina) is an American singer-songwriter. He is widely known for his prowess as a pianist. Ben Folds' musical career started to get off the ground in the late '80s, as bassist for band Majosha, after playing bass and piano at Pinehurst, in a group known as the \"Caroliners\" with cohort Millard Powers in 1985-1987; he also played drums as a session musician in Nashville. As well as appearing in Pots & Pans - now known as the Snuzz demo <a href=\"https://www.last.fm/music/Ben+Folds\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 1086040,
      "mbid": "51b7f46f-6c0f-46f2-9496-08c9ec2624d4",
      "name": "Ben Folds",
      "playcount": 29595523,
      "similar_artists": [
        {
          "name": "Ben Folds Five",
          "url": "https://www.last.fm/music/Ben+Folds+Five"
        },
        {
          "name": "Guster",
          "url": "https://www.last.fm/music/Guster"
        },
        {
          "name": "Ben Lee",
          "url": "https://www.last.fm/music/Ben+Lee"
        },
        {
          "name": "Ben Kweller",
          "url": "https://www.last.fm/music/Ben+Kweller"
        },
        {
          "name": "Fountains of Wayne",
          "url": "https://www.last.fm/music/Fountains+of+Wayne"
        }
      ],
      "tags": [
        "singer-songwriter",
        "seen live",
        "indie",
        "piano rock",
        "alternative"
      ],
      "url": "https://www.last.fm/music/Ben+Folds"
    },
    "spotify": {
      "followers": 321538,
      "genres": [],
      "id": "55tif8708yyDQlSjh3Trdu",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5ebd1224064f3e5ecf9533ebfbe",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174d1224064f3e5ecf9533ebfbe",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178d1224064f3e5ecf9533ebfbe",
          "width": 160
        }
      ],
      "name": "Ben Folds",
      "popularity": 52,
      "url": "https://open.spotify.com/artist/55tif8708yyDQlSjh3Trdu"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Benjamin Scott \"Ben\" Folds (born September 12, 1966) is an American singer-songwriter and record producer. From 1995 to 2000, Folds was the frontman and pianist of the alternative rock band Ben Folds Five. After the group temporarily disbanded, Folds performed as a solo artist and has toured all over the world. The group reunited in 2011. He has also collaborated with musicians such as William Shatner, Regina Spektor and \"Weird Al\" Yankovic and undertaken experimental songwriting projects with authors such as Nick Hornby and Neil Gaiman. In addition to contributing music to the soundtracks of the animated films Over the Hedge, and Hoodwinked!, Folds produced Amanda Palmer's first solo album and has been a judge on the NBC a cappella singing contest The Sing-Off since 2009.",
      "biography_es": null,
      "biography_fr": "Benjamin Scott Folds est un chanteur américain, né le 12 septembre 1966 à Winston-Salem en Caroline du Nord (États-Unis). Il est notamment connu pour avoir fait partie du groupe Ben Folds Five et est une figure emblématique du piano rock.\n\nEssentiellement connu pour ses prouesses au piano, il est également un adepte de la guitare, de la basse, et de la batterie. Il est originairement devenu célèbre en tant que membre du groupe de rock Ben Folds Five. Ben a publié 4 albums solo: Fear of Pop: Volume 1, Rockin' the Suburbs, Ben Folds Live, and Songs for Silverman. Fear of Pop fut publié lorsque Ben Folds Five était encore en activité. Les albums Suburbs, Live, et Songs for Silverman furent eux publiés après.\n\nMais comme Fear of Pop est largement expérimental et Live est une collection d'enregistrements de morceaux en live, originairement enregistrés avec les Ben Folds Five, celui de Rockin' the Suburbs est officiellement le premier propre album solo de Ben sorti, dans lequel il a enregistré la plupart des instruments lui-même. Fin 2003, ce sont deux solos Speed Graphic et Sunny 16 qui sont publiés. Et avec un troisième intitulé Super D à la mi-2004.\n\nSon groupe, Ben Folds Five (1994–2000) était un groupe de trois membres formés à Chapel Hill, en Caroline du Nord. Ils jouèrent ce que l’on pourrait appeler du piano à dominante pop-rock. La plupart de leurs chansons ont été influencées par le jazz, avec des passages improvisés. Ben Folds, le chanteur leader du groupe et pianiste, qui a écrit aussi la plupart des chansons, Robert Sledge, à la basse, Darren Jessee aux percussions, Alex Queen à la guitare, Jane Scorp's au gong. Après la séparation du groupe, Folds a commencé une carrière en solo. Le reste du groupe a continué à jouer de la musique orchestrale à la fanfare de Sanem.\n\nLorsqu’on l’a interrogé à propos du nom de son groupe il répondit à l’interviewer : « vous voulez dire qu’un quintette, espèce d'inculte, ce n’est pas cinq personnes ? »\n\nBen et sa femme Fleur Folds se sont mariés en janvier, 2008 et habitent avec leurs trois enfants à Nashville aux États-Unis.",
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1966",
      "country": "Nashville, USA",
      "country_code": "US",
      "died_year": null,
      "disbanded": false,
      "facebook": "www.facebook.com/BenFolds",
      "formed_year": "1995",
      "gender": "Male",
      "genre": "Alternative Rock",
      "id": "114185",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/folds-ben-50612805f2de2.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e395aa3b1d5d.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e3963c7ce1df.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ben-folds-4e3963c7ce1df.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/folds-ben-5517335cc06b8.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/folds-ben-519dbae7c78cc.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "Enlightened",
      "music_videos": null,
      "musicbrainz_id": "51b7f46f-6c0f-46f2-9496-08c9ec2624d4",
      "name": "Ben Folds",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": "benfolds.com"
    }
  },
  "spotify_id": "55tif8708yyDQlSjh3Trdu",
  "spotify_url": "https://open.spotify.com/artist/55tif8708yyDQlSjh3Trdu",
  "updated_at": "2025-07-12T10:44:11.457744",
  "wikipedia_url": null
}