{
  "apple_music_id": "353061",
  "apple_music_url": "https://music.apple.com/gb/artist/rick-wakeman/353061",
  "biography": "Richard Christopher Wakeman (born 18 May 1949 in Perivale, London) is an English keyboard player best known as the keyboardist for progressive rock group Yes. Originally a classically trained pianist, he was a pioneer in the use of electronic keyboards and in the use of a rock band in combination with orchestra and choir. He purchased his first electronic keyboard, a Minimoog, from the actor Jack Wild. Wakeman was able to buy it for half the regular selling price because Wild thought it did not work as it only played one note at a time. He hosts a regular radio show on Planet Rock.\n\nWakeman attended Drayton Manor Grammar School. He initially studied piano, clarinet, orchestration and modern music at the Royal College of Music, but he left of his own accord after a year and a half in favour of work as a session musician.\n\nIn 1970, Wakeman played with Strawbs and was an active studio musician, playing with such artists as David Bowie, Cat Stevens and Al Stewart, notably playing piano on both Bowie's Life on Mars? and Morning Has Broken by Cat Stevens He joined Yes in 1971, after keyboardist Tony Kaye was asked to leave the band because of his refusal to play anything more than the organ. His first album with the band was Fragile released 1971 in the UK and 1972 in the US, and very nearly his last was Tales from Topographic Oceans, released in 1973. He also played on the studio album Close to the Edge (his favourite Yes album) and his live performances with the group were released as Yessongs. He left the band following the Tales from Topographic Oceans tour.\n\nDuring his time with Yes, he released his first solo album, The Six Wives Of Henry VIII, which showcases his skills with various electronic and acoustic keyboard instruments. Some members of Yes played their respective instruments on certain tracks.\n\nIn 1975, he released the concept album The Myths and Legends of King Arthur and the Knights of the Round Table which was supported by a live show featuring ice skating theatrical performances accompanied by a large number of musicians, an orchestra and choirs. The cost of the show was extravagant and it caused Wakeman to declare bankruptcy.\n\nOf all the members of the band, Wakeman is the only non-vegetarian, a difference which contributed to his first departure from the band. The primary reason for that initial departure, however, was musical differences. Wakeman felt Tales from Topographic Oceans was thin on substance and did not connect with its themes. Further, he did not enjoy the experience of reproducing the entire work on stage each night. He felt the length of the songs prohibited the band from playing many of their more popular songs of the time. Following the tour, as the band began work on what would become Relayer, Wakeman felt further alienated from the group. Disenchanted with the direction in which Yes were going, and already into a successful solo career, Wakeman jumped ship.\n\nHe rejoined Yes for their 1977 album Going for the One. He remained until their next album, Tormato, a year later. He is reputed to have given the album its name by throwing a tomato at a showing of the art used for the album's cover.[citation needed]\n\nIn 1989, he joined with three fellow ex-Yes members to form Anderson Bruford Wakeman Howe (a.k.a. ABWH). After ABWH's first album, some of the completed tracks for a planned second album were merged with tracks from an in-progress Yes album to create the album Union. Wakeman, along with the combined members of both bands then joined to form a Yes supergroup (made up of past and present members of Yes) for the subsequent tour in 1991. When the tour ended a year later, Wakeman left again. He then returned in 1996 for the Keys to Ascension albums but left before the band could tour. In 2002, he rejoined Yes and has been with the group ever since, but also enjoys a successful solo career.\n\nHe has also performed as a guest or session musician for artists as disparate as:\n\n    * John Williams,\n    * Brotherhood of Man,\n    * Elton John,\n    * Lou Reed,\n    * David Bowie (notably mellotron on 'Space Oddity', piano on 'Life On Mars' and 'Changes'),\n    * Cat Stevens (including piano on Stevens' hit cover of the hymn \"Morning Has Broken\"),\n    * T. Rex,\n    * Ozzy Osbourne,\n    * Black Sabbath (playing keyboards on \"Sabbra Cadabra\" and \"Who are You\" on 1973's Sabbath Bloody Sabbath),\n    * Brian May and played piano on \"There's no one quite like Grandma\"[citation needed] by St. Winifred's School Choir.\n\nAlthough Wakeman was a noted player of the Hammond Organ and the Minimoog, he also played a key part in the popularisation of the Mellotron – an electronic musical instrument that used a bank of prerecorded tape strips, activated by each key on its keyboard. It proved too unwieldy and unreliable for regular touring, and Rick eventually doused his in petrol and set fire to it in a field . Undeterred, Rick worked with David Biro to develop the Birotron, which used the then popular 8-track cassette format rather than bare tape strips. Only 35 Birotrons were produced, it was not a commercial or technical success, and Rick eventually threw his across the stage after it broke down mid-concert, an action he now regrets, as there are only 6 known remaining examples.\n\nHe has written the soundtracks for two films by Ken Russell: Lisztomania (1975), which features vocals from Roger Daltrey and which takes as its starting point the music of Liszt and Wagner; and Crimes of Passion (1985), much of which is built around themes taken from Dvorak's New World Symphony.\n\nAs announced on the official Yes website, Rick Wakeman will not be joining Yes on their 40th Anniversary tour, he will instead be replaced by his son Oliver Wakeman. In 2008, Wakeman has been touring with a solo show, \"Rick Wakeman's grumpy old picture show\", an evening of biography, stories and music.\n\nPersonal life\n\nA self-confessed former alcoholic, he had several heart attacks in his twenties. The first of them occurred just after he left Yes in early 1974, during the release of Journey To The Centre Of The Earth. He married former Page Three model Nina Carter, although they have since divorced. He has had a renewal of his Christian faith, which began around the time of their marriage.\n\nChildren include Adam Wakeman, Oliver Wakeman, Oscar Wakeman, Jemma Wakeman, Ben Wakeman, and Manda Wakeman, who have inherited their father's interest in music.\n\nA passionate football fan, Wakeman has supported Brentford F.C. since he was a child, and later on he also became a director of the West London club. After a disagreement with the board, he moved on to Manchester City F.C. but never stopped loving the Bees. He was also involved in the ownership of the American soccer club Philadelphia Fury in the late '70s, along with other rock celebrities such as Peter Frampton and Paul Simon.\n\nHe is a strong supporter of the UK's Conservative Party, and performed a concert in September 2004 for the benefit of the party. The Arthur section of his King Arthur and the Knights of the Round Table suite is used as the theme tune to the BBC's Election Night Coverage since 1979 (with the exception of 2001). Wakeman's album Fields of Green '97 featured the track \"Election '97/Arthur\", which was used by the BBC for their coverage of the 1997 General Election. The music was further revamped for the BBC's 2005 Election Night coverage.\n\nRick can currently be seen as a contributor on BBC Two's series, Grumpy Old Men. He has also appeared in a number of episodes of Countdown; about twenty per year, according to Wakeman. He currently (2008) presents a weekly Saturday morning programme, \"Rick's Place\", on Planet Rock. He has also appeared on the satirical panel show Have I Got News For You as a guest.\n\nRick appeared as himself in \"Journey to the Centre of Rick Wakeman\", the last episode of season two of Mitch Benn's Crimes Against Music, a BBC Radio 4 comedy programme. The episode detailed a fictional war between England and Wales in 2009 which only Rick could stop. The majority of the episode was set inside Rick where Mitch and his team are sent to rouse him from a coma and thus stop the war.\n\nIn December 2006, Rick was the guest host for an episode of The Personality Test, a BBC Radio 4 programme where the panel stay the same and the host changes each week. The questions set in the programme are all about the host. Rick set a challenge for a new concept album idea, and the comedian Will Smith suggested \"Spiders and Other Invertebrates\". Rick said he liked that idea so much, he would include a track of his next album called \"Spiders and Other Invertebrates\", and would include a sleeve credit to Will. Will responded by saying that Rick had \"...just made my life\".\n\nRick has been president of the show business charity The Heritage Foundation (formerly Comic Heritage) for the past two years. The charity erects blue plaques on the homes and/or work-places of late entertainers and sportspeople. He is also Honorary President of the Classic Rock Society, a UK-based organisation helping to promote classic and progressive rock. In October 2007 Rick commenced a new tour 'Rick Wakeman's Grumpy Old Picture Show', where Rick accompanies video performers such as Gordon Giltrap and the English Rock Ensemble.\n\nHe also appeared on Top Gear and got a lap time of 1.55.26.\n\nIn December 2006 and 2007, Rick was the celebrity who turned on the Christmas lights in Diss, Norfolk, a town close to his home.\nOn 25 June 2019, The New York Times Magazine listed Wakeman among hundreds of artists whose material was reportedly destroyed in the 2008 Universal fire. In September and October 2019, Wakeman embarked on his first solo American tour in 13 years, playing piano shows. Wakeman's Christmas-themed piano album, Christmas Portraits, was released in November 2019.\n\nIn January 2020, Wakeman started recording a new progressive rock album which was set for release in March. The album's title was revealed as The Red Planet and, according to Wakeman, harks back to albums such as The Six Wives of Henry VIII and Criminal Record; it was due for release on 3 April 2020 and features the English Rock Ensemble. It was delayed again to be released \"nearer to June realistically\", due to the 2020 COVID-19 pandemic.\n\n <a href=\"https://www.last.fm/music/Rick+Wakeman\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T17:29:13.913445",
  "discogs_id": "149420",
  "discogs_url": "https://www.discogs.com/artist/149420",
  "followers": 209585,
  "formed_date": null,
  "genres": [
    "Rock",
    "progressive rock",
    "art rock",
    "Progressive rock",
    "instrumental",
    "classic rock",
    "rock",
    "Progressive"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/af/3a/02/af3a0260-b41d-876b-50cc-fc75aa9619d1/mzl.zixnvvtn.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 691,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/40aecd496eff1df1d42a25d31859641e824517c0",
      "width": 1000
    },
    {
      "height": 442,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/515eef4ab96bc207f7b203332004fc76f5bd245b",
      "width": 640
    },
    {
      "height": 138,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/d0759c201f0e86481fb85377efda06f9eec20ad9",
      "width": 200
    },
    {
      "height": 44,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/9912b3975198e5fcb00fcf92a2756627a831ecdb",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "2ad06109-0a52-4b7b-8b7a-ca7c10baf597",
  "lastfm_url": "https://www.last.fm/music/Rick+Wakeman",
  "local_images": {
    "hi-res": "public/artist/rick-wakeman/rick-wakeman-hi-res.jpg",
    "medium": "public/artist/rick-wakeman/rick-wakeman-medium.jpg",
    "small": "public/artist/rick-wakeman/rick-wakeman-small.jpg"
  },
  "name": "Rick Wakeman",
  "popularity": 42,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/af/3a/02/af3a0260-b41d-876b-50cc-fc75aa9619d1/mzl.zixnvvtn.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "353061",
      "name": "Rick Wakeman",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/rick-wakeman/353061"
    },
    "discogs": {
      "id": 149420,
      "original_name": "Rick Wakeman",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Richard Christopher Wakeman (born 18 May 1949 in Perivale, London) is an English keyboard player best known as the keyboardist for progressive rock group Yes. Originally a classically trained pianist, he was a pioneer in the use of electronic keyboards and in the use of a rock band in combination with orchestra and choir. He purchased his first electronic keyboard, a Minimoog, from the actor Jack Wild. Wakeman was able to buy it for half the regular selling price because Wild thought it did not work as it only played one note at a time. He hosts a regular radio show on Planet Rock.\n\nWakeman attended Drayton Manor Grammar School. He initially studied piano, clarinet, orchestration and modern music at the Royal College of Music, but he left of his own accord after a year and a half in favour of work as a session musician.\n\nIn 1970, Wakeman played with Strawbs and was an active studio musician, playing with such artists as David Bowie, Cat Stevens and Al Stewart, notably playing piano on both Bowie's Life on Mars? and Morning Has Broken by Cat Stevens He joined Yes in 1971, after keyboardist Tony Kaye was asked to leave the band because of his refusal to play anything more than the organ. His first album with the band was Fragile released 1971 in the UK and 1972 in the US, and very nearly his last was Tales from Topographic Oceans, released in 1973. He also played on the studio album Close to the Edge (his favourite Yes album) and his live performances with the group were released as Yessongs. He left the band following the Tales from Topographic Oceans tour.\n\nDuring his time with Yes, he released his first solo album, The Six Wives Of Henry VIII, which showcases his skills with various electronic and acoustic keyboard instruments. Some members of Yes played their respective instruments on certain tracks.\n\nIn 1975, he released the concept album The Myths and Legends of King Arthur and the Knights of the Round Table which was supported by a live show featuring ice skating theatrical performances accompanied by a large number of musicians, an orchestra and choirs. The cost of the show was extravagant and it caused Wakeman to declare bankruptcy.\n\nOf all the members of the band, Wakeman is the only non-vegetarian, a difference which contributed to his first departure from the band. The primary reason for that initial departure, however, was musical differences. Wakeman felt Tales from Topographic Oceans was thin on substance and did not connect with its themes. Further, he did not enjoy the experience of reproducing the entire work on stage each night. He felt the length of the songs prohibited the band from playing many of their more popular songs of the time. Following the tour, as the band began work on what would become Relayer, Wakeman felt further alienated from the group. Disenchanted with the direction in which Yes were going, and already into a successful solo career, Wakeman jumped ship.\n\nHe rejoined Yes for their 1977 album Going for the One. He remained until their next album, Tormato, a year later. He is reputed to have given the album its name by throwing a tomato at a showing of the art used for the album's cover.[citation needed]\n\nIn 1989, he joined with three fellow ex-Yes members to form Anderson Bruford Wakeman Howe (a.k.a. ABWH). After ABWH's first album, some of the completed tracks for a planned second album were merged with tracks from an in-progress Yes album to create the album Union. Wakeman, along with the combined members of both bands then joined to form a Yes supergroup (made up of past and present members of Yes) for the subsequent tour in 1991. When the tour ended a year later, Wakeman left again. He then returned in 1996 for the Keys to Ascension albums but left before the band could tour. In 2002, he rejoined Yes and has been with the group ever since, but also enjoys a successful solo career.\n\nHe has also performed as a guest or session musician for artists as disparate as:\n\n    * John Williams,\n    * Brotherhood of Man,\n    * Elton John,\n    * Lou Reed,\n    * David Bowie (notably mellotron on 'Space Oddity', piano on 'Life On Mars' and 'Changes'),\n    * Cat Stevens (including piano on Stevens' hit cover of the hymn \"Morning Has Broken\"),\n    * T. Rex,\n    * Ozzy Osbourne,\n    * Black Sabbath (playing keyboards on \"Sabbra Cadabra\" and \"Who are You\" on 1973's Sabbath Bloody Sabbath),\n    * Brian May and played piano on \"There's no one quite like Grandma\"[citation needed] by St. Winifred's School Choir.\n\nAlthough Wakeman was a noted player of the Hammond Organ and the Minimoog, he also played a key part in the popularisation of the Mellotron – an electronic musical instrument that used a bank of prerecorded tape strips, activated by each key on its keyboard. It proved too unwieldy and unreliable for regular touring, and Rick eventually doused his in petrol and set fire to it in a field . Undeterred, Rick worked with David Biro to develop the Birotron, which used the then popular 8-track cassette format rather than bare tape strips. Only 35 Birotrons were produced, it was not a commercial or technical success, and Rick eventually threw his across the stage after it broke down mid-concert, an action he now regrets, as there are only 6 known remaining examples.\n\nHe has written the soundtracks for two films by Ken Russell: Lisztomania (1975), which features vocals from Roger Daltrey and which takes as its starting point the music of Liszt and Wagner; and Crimes of Passion (1985), much of which is built around themes taken from Dvorak's New World Symphony.\n\nAs announced on the official Yes website, Rick Wakeman will not be joining Yes on their 40th Anniversary tour, he will instead be replaced by his son Oliver Wakeman. In 2008, Wakeman has been touring with a solo show, \"Rick Wakeman's grumpy old picture show\", an evening of biography, stories and music.\n\nPersonal life\n\nA self-confessed former alcoholic, he had several heart attacks in his twenties. The first of them occurred just after he left Yes in early 1974, during the release of Journey To The Centre Of The Earth. He married former Page Three model Nina Carter, although they have since divorced. He has had a renewal of his Christian faith, which began around the time of their marriage.\n\nChildren include Adam Wakeman, Oliver Wakeman, Oscar Wakeman, Jemma Wakeman, Ben Wakeman, and Manda Wakeman, who have inherited their father's interest in music.\n\nA passionate football fan, Wakeman has supported Brentford F.C. since he was a child, and later on he also became a director of the West London club. After a disagreement with the board, he moved on to Manchester City F.C. but never stopped loving the Bees. He was also involved in the ownership of the American soccer club Philadelphia Fury in the late '70s, along with other rock celebrities such as Peter Frampton and Paul Simon.\n\nHe is a strong supporter of the UK's Conservative Party, and performed a concert in September 2004 for the benefit of the party. The Arthur section of his King Arthur and the Knights of the Round Table suite is used as the theme tune to the BBC's Election Night Coverage since 1979 (with the exception of 2001). Wakeman's album Fields of Green '97 featured the track \"Election '97/Arthur\", which was used by the BBC for their coverage of the 1997 General Election. The music was further revamped for the BBC's 2005 Election Night coverage.\n\nRick can currently be seen as a contributor on BBC Two's series, Grumpy Old Men. He has also appeared in a number of episodes of Countdown; about twenty per year, according to Wakeman. He currently (2008) presents a weekly Saturday morning programme, \"Rick's Place\", on Planet Rock. He has also appeared on the satirical panel show Have I Got News For You as a guest.\n\nRick appeared as himself in \"Journey to the Centre of Rick Wakeman\", the last episode of season two of Mitch Benn's Crimes Against Music, a BBC Radio 4 comedy programme. The episode detailed a fictional war between England and Wales in 2009 which only Rick could stop. The majority of the episode was set inside Rick where Mitch and his team are sent to rouse him from a coma and thus stop the war.\n\nIn December 2006, Rick was the guest host for an episode of The Personality Test, a BBC Radio 4 programme where the panel stay the same and the host changes each week. The questions set in the programme are all about the host. Rick set a challenge for a new concept album idea, and the comedian Will Smith suggested \"Spiders and Other Invertebrates\". Rick said he liked that idea so much, he would include a track of his next album called \"Spiders and Other Invertebrates\", and would include a sleeve credit to Will. Will responded by saying that Rick had \"...just made my life\".\n\nRick has been president of the show business charity The Heritage Foundation (formerly Comic Heritage) for the past two years. The charity erects blue plaques on the homes and/or work-places of late entertainers and sportspeople. He is also Honorary President of the Classic Rock Society, a UK-based organisation helping to promote classic and progressive rock. In October 2007 Rick commenced a new tour 'Rick Wakeman's Grumpy Old Picture Show', where Rick accompanies video performers such as Gordon Giltrap and the English Rock Ensemble.\n\nHe also appeared on Top Gear and got a lap time of 1.55.26.\n\nIn December 2006 and 2007, Rick was the celebrity who turned on the Christmas lights in Diss, Norfolk, a town close to his home.\nOn 25 June 2019, The New York Times Magazine listed Wakeman among hundreds of artists whose material was reportedly destroyed in the 2008 Universal fire. In September and October 2019, Wakeman embarked on his first solo American tour in 13 years, playing piano shows. Wakeman's Christmas-themed piano album, Christmas Portraits, was released in November 2019.\n\nIn January 2020, Wakeman started recording a new progressive rock album which was set for release in March. The album's title was revealed as The Red Planet and, according to Wakeman, harks back to albums such as The Six Wives of Henry VIII and Criminal Record; it was due for release on 3 April 2020 and features the English Rock Ensemble. It was delayed again to be released \"nearer to June realistically\", due to the 2020 COVID-19 pandemic.\n\n <a href=\"https://www.last.fm/music/Rick+Wakeman\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Richard Christopher Wakeman (born 18 May 1949 in Perivale, London) is an English keyboard player best known as the keyboardist for progressive rock group Yes. Originally a classically trained pianist, he was a pioneer in the use of electronic keyboards and in the use of a rock band in combination with orchestra and choir. He purchased his first electronic keyboard, a Minimoog, from the actor Jack Wild. Wakeman was able to buy it for half the regular selling price because Wild thought it did not work as it only played one note at a time. <a href=\"https://www.last.fm/music/Rick+Wakeman\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 213782,
      "mbid": "2ad06109-0a52-4b7b-8b7a-ca7c10baf597",
      "name": "Rick Wakeman",
      "playcount": 2812194,
      "similar_artists": [
        {
          "name": "Jon Anderson",
          "url": "https://www.last.fm/music/Jon+Anderson"
        },
        {
          "name": "Yes",
          "url": "https://www.last.fm/music/Yes"
        },
        {
          "name": "Anderson Bruford Wakeman Howe",
          "url": "https://www.last.fm/music/Anderson+Bruford+Wakeman+Howe"
        },
        {
          "name": "Steve Hackett",
          "url": "https://www.last.fm/music/Steve+Hackett"
        },
        {
          "name": "Emerson, Lake & Palmer",
          "url": "https://www.last.fm/music/Emerson,+Lake+&+Palmer"
        }
      ],
      "tags": [
        "Progressive rock",
        "instrumental",
        "classic rock",
        "rock",
        "Progressive"
      ],
      "url": "https://www.last.fm/music/Rick+Wakeman"
    },
    "spotify": {
      "followers": 209585,
      "genres": [
        "progressive rock",
        "art rock"
      ],
      "id": "0mkcYaXUbJUs5mJointuzB",
      "images": [
        {
          "height": 691,
          "url": "https://i.scdn.co/image/40aecd496eff1df1d42a25d31859641e824517c0",
          "width": 1000
        },
        {
          "height": 442,
          "url": "https://i.scdn.co/image/515eef4ab96bc207f7b203332004fc76f5bd245b",
          "width": 640
        },
        {
          "height": 138,
          "url": "https://i.scdn.co/image/d0759c201f0e86481fb85377efda06f9eec20ad9",
          "width": 200
        },
        {
          "height": 44,
          "url": "https://i.scdn.co/image/9912b3975198e5fcb00fcf92a2756627a831ecdb",
          "width": 64
        }
      ],
      "name": "Rick Wakeman",
      "popularity": 42,
      "url": "https://open.spotify.com/artist/0mkcYaXUbJUs5mJointuzB"
    }
  },
  "spotify_id": "0mkcYaXUbJUs5mJointuzB",
  "spotify_url": "https://open.spotify.com/artist/0mkcYaXUbJUs5mJointuzB",
  "updated_at": "2025-07-05T17:29:17.478035",
  "wikipedia_url": null
}