{
  "apple_music_id": "2929326",
  "apple_music_url": "https://music.apple.com/gb/artist/joe-strummer/2929326",
  "biography": "John Graham Mellor (21 August 1952 - 22 December 2002), best remembered by his stage name Joe Strummer, was a British musician, singer, actor and songwriter who was the co-founder, lyricist, rhythm guitarist and lead vocalist of the punk rock band The Clash, a band that formed in 1976 as part of the original wave of British punk. Along with punk, their music incorporated elements of reggae, ska, dub, funk, rap, and rockabilly. The Clash were one of the most prominent of the emerging bands in the UK punk rock scene, their second album, Give 'Em Enough Rope (1978) reaching number 2 on the UK charts. Soon after, they began achieving success in the US, starting with London Calling (1979), and peaking with 1982's Combat Rock, reaching number 7 on the US charts and being certified 2x platinum there. The Clash's politicised lyrics, musical experimentation, and rebellious attitude had a far-reaching influence on rock, alternative rock in particular. \nHis musical experience included his membership of The 101ers, Latino Rockabilly War, The Mescaleros and The Pogues, in addition to his own solo music career. Strummer's work as a musician allowed him to explore other interests, which included acting, creating film scores for television and movies, songwriting, radio broadcasting, and a position as a radio host. Strummer is one of the iconic figures of the British punk movement. \nStrummer and The Clash were inducted into the Rock and Roll Hall of Fame in January 2003. In his remembrance, Strummer's friends and family have established the Strummerville Foundation for the promotion of new music, and each year there are many festivals and both organised and spontaneous ceremonies worldwide to celebrate his memory. \n\nBiography and career:\n\nThe early years (1952-1976):\nStrummer was born John Graham Mellor in Ankara, Turkey on 21 August 1952. His mother, Anna Mackenzie, a crofter's daughter born and raised in Bonar Bridge in the Scottish Highlands, was a nurse. His father, Ronald Mellor, was a British foreign service diplomat born in Lucknow, India. Ronald Mellor had an Armenian maternal grandfather and a German Jewish paternal grandmother. The family spent much time moving from place to place, and Strummer spent parts of his early childhood in Cairo, Mexico City, and Bonn. At the age of 9, Strummer and his older brother David, 10, began boarding at the City of London Freemen's School in Surrey. Strummer rarely saw his parents during the next seven years. \n\nAt the age of nine I had to say good-bye to them because they went abroad to Africa or something. I went to boarding school and only saw them once a year after that - the Government paid for me to see my parents once a year. I was left on my own, and went to this school where thick rich people sent their thick rich kids. Another perk of my father's job - it was a job with a lot of perks - all the fees were paid by the Government. \n--Joe Strummer\n\nHe developed a love of rock music listening to records by Little Richard and The Beach Boys as well as American folk-singer Woody Guthrie. (Strummer would even go by the nickname \"Woody\" for a few years). Strummer would later say that \"the reason he played music was the Beach Boys.\" \n\nDavid was a year older than me. Funnily enough, you know, he was a Nazi. He was a member of the National Front. He was into the occult and he used to have these deaths-heads and cross-bones all over everything. He didn't like to talk to anybody, and I think suicide was the only way out for him. What else could he have done? \n\n--Joe Strummer\n\nBy 1970 his brother David had become estranged from his family and had joined the National Front. His suicide in July profoundly affected Strummer, as did having to identify his body after it had lain undiscovered for three days. After finishing his time at City of London Freemen's School, Ashtead Park, Surrey, in 1970, Strummer moved on to the Central School of Art and Design in London, where he briefly flirted with the idea of becoming a professional cartoonist, but ultimately completed a foundations course. During this time, Mellor shared a flat in the north London suburb of Palmers Green with friends Clive Timperley and Tymon Dogg. In 1971 Strummer became a vegetarian and remained one until his death. In April 1972 Strummer attended as a fan the Bickershaw Festival in Lancashire, a three day event which was attended by many London counter culture figures and underground magazines. Strummer said in 1999 that Don Van Vliet's ( Captain Beefheart's) performance at the 1972 Bickershaw Festival was the best concert he had ever attended. \n\nI bought a ukulele. No kidding. I saved some money, £1.99 I think, and bought it down Shaftesbury Avenue. Then the guy I was busking with taught me to play Johnny Be Good. ... I was on my own for the first time with this ukulele and Johnny Be Good. And that's how I started. \n\n--Joe Strummer\n\nIn 1973 Strummer moved to Newport, Wales. He did not study at Newport College of Art but met up with college musicians in the Students' Union in Stow Hill and became vocalist for Flaming Youth, renaming the band The Vultures. The Vultures included three former members of Rip Off Park Rock & Roll Allstars, the original college band co-founded by Terry Earl Taylor. For the next year he was the band's part-time singer and rhythm guitarist. During this time Strummer also worked as a gravedigger in St Woolos Cemetery. In 1974, the band fell apart and he moved back to London where he met up again with Tymon Dogg. He did street performance for a while and then decided to form another band with his West London roommates. The band was called The 101'ers, named after the address of their squat (101 Walterton Road, in Maida Vale). \nThe band played many gigs in London pubs, playing covers of popular American R&B and blues songs. In 1975 he stopped calling himself \"Woody\" Mellor and adopted the stage name of Joe Strummer, and insisted that his friends call him by that name. The name \"Strummer\" apparently referred to his role as rhythm guitarist, in a rather self-deprecating way. Though left-handed, he was taught to play right-handed by his friend Tymon Dogg. Strummer was the lead singer of the 101'ers and began to write original songs for the group. One song he wrote was inspired by his girlfriend at the time, Slits drummer Palmolive. The group liked the song \"Keys to Your Heart\", and picked it as their first single. \n\nThe Clash (1976-1986):\nOn 3 April 1976, a then-unknown Sex Pistols opened for The 101'ers at a venue called The Nashville Rooms in London, and Strummer was impressed by them. Sometime after the show, Strummer was approached by Bernie Rhodes and Mick Jones. Jones was from the band London SS and wanted Strummer to join as lead singer. Strummer agreed to leave the 101'ers and join Jones, bassist Paul Simonon, drummer Terry Chimes and guitarist Keith Levene. The band was named The Clash by Simonon and made their debut on 4 July 1976, opening for the Sex Pistols at The Black Swan (a.k.a. The Mucky Duck, now known as the Boardwalk Sheffield, England). On 25 January 1977, the band signed with CBS Records and was now a three-piece after Levene was fired from the band and Chimes quit. Drummer Topper Headon later became the band's full-time drummer. \nAt the band's induction into the Rock and Roll Hall of Fame, the Clash was said to be \"considered one of the most overtly political, explosive and exciting bands in rock and roll history\". Their songs tackled social decay, unemployment, racism, police brutality, political and social repression, and militarism in detail. Strummer was involved with the Anti-Nazi League and Rock Against Racism campaigns. He later also gave his support to the Rock Against the Rich series of concerts organised by the anarchist organisation Class War. The Clash's London Calling album was voted best album of the 1980s by Rolling Stone magazine (although it was released in late 1979 in the UK; it was released in 1980 in the USA). \nDuring his time with The Clash, Strummer, along with his bandmates, became notorious for getting in trouble with the law. On 10 June 1977, he and Headon were arrested for spray-painting \"The Clash\" on a wall in a hotel. On 20 May 1980, he was arrested for hitting a violent member of the audience with his guitar during a performance in Hamburg, Germany. This incident shocked Strummer, and had a lasting personal impact on him. \n\" \nI nearly murdered somebody, and it made me realise that you can't face violence with violence. It doesn't work. \n\" \n\n--Joe Strummer \n\nBefore the album Combat Rock was released in 1982, Strummer wilfully went into hiding and band management represented that he had \"disappeared\". Bernie Rhodes, the band's manager, pressured Joe to do so because tickets were selling slowly for the Scottish leg of an upcoming tour. It was planned for Strummer to travel to Texas in secret and stay with his friend, musician Joe Ely. However, Strummer, uneasy with his decision, decided to genuinely disappear and \"dicked around\" in France. During this time, Strummer ran the Paris Marathon in April 1982. He claimed his training regime consisted of 10 pints of beer the night before the race. For this period of time, Joe's whereabouts were not only a mystery to the public, but the band's management as well. Joe later said this was a huge mistake and you \"have to have some regrets\". This was in spite of the popular success of the single \"Rock the Casbah\". During this time band members began to argue a lot, and with tensions high, the group began to fall apart. \nIn September 1983, Strummer issued the infamous \"Clash Communique\", and fired Mick Jones. Headon had earlier been kicked out of the band because of his heroin addiction, and replaced with drummer Pete Howard. This left the band with only two of its original members. Rhodes persuaded Strummer to carry on and added new members. \"The Clash Mark Two\" released the album Cut the Crap in 1985. The album was panned by fans and critics alike and Strummer disbanded The Clash. The disintegration of the band and the reasons behind the break-up are the subject matter of Danny Garcia's 2012/3 book and documentary, The Rise and Fall of the Clash. \n\nSolo career and soundtrack work (1986-1999):\n\nA year later, Strummer worked on several songs for the 1986 film Sid and Nancy, including \"Love Kills\" and \"Dum Dum Club\". Strummer also later worked with Mick Jones and his band Big Audio Dynamite, contributing to the band's second studio album by co-writing most of the songs as well as producing the album along with Jones. In 1987, he played a small part in the film Walker, directed by Alex Cox, as a character named \"Faucet\" and wrote and performed on the film's soundtrack. \nHe starred in another Cox film that same year called Straight to Hell, as the character Simms. Straight to Hell also featured London-Irish folk/punk band The Pogues - both as actors and major contributors to the soundtrack. Strummer joined The Pogues for a tour in 1987/88, filling in for ailing guitarist Philip Chevron, who wrote (in May 2008) on the band's online forum: \"When I was sick in late 1987, I taught Joe all the guitar parts in an afternoon and he was on tour in the USA as deputy guitarist the next day. Joe wrote all the tabs in his meticulously neat hand on a long piece of paper which he taped to the top of the guitar so he could glance down occasionally when he was onstage.\" This tour would be the first of several collaborations with the band. \nIn 1989, Strummer played a substantial role in Jim Jarmusch's film Mystery Train, as a drunken, short-tempered drifter named Johnny (whom most characters refer to as Elvis, much to Johnny's dismay). He also made a brief appearance in Aki Kaurismäki's 1990 film I Hired a Contract Killer as a guitarist in a pub, performing two songs (\"Burning Lights\" and \"Afro-Cuban Bebop\"). These were released as a promotional 7-inch single limited to a few hundred copies, credited to \"Joe Strummer & the Astro Physicians\". The \"Astro Physicians\" were in fact The Pogues (\"Afro-Cuban Bebop\" got a re-release on The Pogues' 2008 box set). During this time Strummer continued to act, write and produce soundtracks for various films, most notably the soundtrack for Grosse Pointe Blank (1997). While the group started to formulate its roots in the year 1986, Strummer began actually producing solo records with a band called The Latino Rockabilly War in 1989. The album Earthquake Weather was a critical and commercial flop, and resulted in the loss of his contract with Sony Records. \nHe also did the soundtrack to the movie Permanent Record with this band. Strummer was asked by The Pogues, who were fracturing as a band, to help them produce their next album, released in 1990 as Hell's Ditch. In 1991, he replaced Shane MacGowan as singer of The Pogues for a tour after MacGowan's departure from the band. One night of this tour was professionally recorded, and three tracks (\"I Fought the Law\", \"London Calling\", and \"Turkish Song of the Damned\") have seen release as b-sides and again on The Pogues' 2008 box set. On 16 April 1994, Strummer joined Czech-American band Dirty Pictures on stage in Prague at the Repre Club in Obecni Dum at \"Rock for Refugees\", a benefit concert for people left displaced by the war in Bosnia. Backed up by the Pictures, Strummer played a blistering set of Clash songs that he said he had not played in more than ten years. Although the set appeared impromptu, Strummer and the band had spent the days leading up to the event rehearsing and \"hanging out\" in Prague. The show began with \"London Calling\" and without pause went into \"Brand New Cadillac\". In the middle of the song, the power went out. \nOnce the power was back on, Strummer asked the audience whether or not they would mind if the band started over. They then began again with \"London Calling\" and continued on for another half-hour. After these self-described \"wilderness years\", Strummer began working with other bands; he played piano on the 1995 UK hit of The Levellers, \"Just the One\" and appeared on the Black Grape single \"England's Irie\" in 1996. In 1997, while in New York City, he had worked with noted producer and engineer Lee Perry on a significant amount of remixed Clash and 101'ers reissue dub material. In collaboration with percussionist Pablo Cook, Strummer wrote and performed the soundtrack to Tunnel of Love (Robert Wallace 1997) that was featured in the Cannes Film Festival in the same year. In 1998, he made a guest appearance on the animated television show, South Park and appeared on the album Chef Aid: The South Park Album featuring songs from and inspired by the series. \nAlso during this time, Strummer was in dispute with The Clash's record label, Epic Records. The disagreement lasted nearly eight years and ended with the label agreeing to let him record solo records with another label. If The Clash were to reunite though, they would have to record for Sony. During the nineties, Strummer was a DJ on the BBC World Service with his half-hour programme London Calling. Samples from the series provide the vocals for \"Midnight Jam\" on Joe Strummer and the Mescaleros' final album Streetcore. \n\nThe Mescaleros and other work (1999-2002):\nIn the mid-to-late 1990s, Strummer gathered top-flight musicians into a backing band he called The Mescaleros. Strummer and the band signed with Mercury Records, and released their first album in 1999, which was co-written with Antony Genn, called Rock Art and the X-Ray Style. A tour of England, Europe, and North America soon followed; sets included several Clash fan favourites. \n\" \nThis is my Indian summer...I learnt that fame is an illusion & everything about it is just a joke. I'm far more dangerous now, because I don't care at all. \n\" \n\n--Joe Strummer to Chris Salewicz - 2000 ,  \n\nIn 2001, the band signed with Californian punk label Hellcat Records and released their second studio album, Global a Go-Go. The album was supported with a 21-date tour of North America, Britain, and Ireland. Once again, these concerts featured Clash material (\"London's Burning\", \"Rudie Can't Fail\", \"(White Man) In Hammersmith Palais\"), as well as covers of reggae and ska hits (\"The Harder They Come\", \"A Message to You, Rudy\") and the band regularly closed the show by playing the Ramones' \"Blitzkrieg Bop\". He covered Bob Marley's \"Redemption Song\" with Johnny Cash. In the same year, somewhat out of character, Strummer and the Mescaleros performed the song \"Minstrel Boy\" for the film Black Hawk Down, a haunting and emotive Celtic tune that is played during the evacuation of PFC Todd Blackburn during the Battle of Mogadishu and again over the end credits. \n\nOn 15 November 2002, Strummer and The Mescaleros played a benefit show for striking fire fighters in London, at the Acton Town Hall. Mick Jones was in the audience, and joined the band on stage during the Clash's \"Bankrobber\". An encore followed with Jones playing guitar and singing on \"White Riot\" and \"London's Burning\". This performance marked the first time since 1983 that Strummer and Jones had performed together on stage. Jones later remarked that it was totally unplanned and that he felt compelled to join Strummer on stage. \nStrummer's final regular gig was at Liverpool Academy on 22 November 2002, yet his final performance, just two weeks before his death, was in a small club venue 'The Palace' in Bridgwater, Somerset near to his home. Shortly before his death, Strummer and U2's Bono co-wrote a song, \"46664\", for Nelson Mandela as part of a campaign against AIDS in Africa. Strummer had been scheduled to play at Mandela's SOS fundraising concert in February 2003 on Robben Island. Mick Jones later recorded a version of the song in studio, performing both the vocals and guitar work, that has yet to be formally released. \n\nDeath and legacy (2002-present):\n\nOn-stage Strummer wires himself up into an inhuman dynamo of sweaty, trembling flesh, fearful enough to have one wondering when the ambulance brigade will rush to his rescue with a straight-jacket. While he tilts his bullet head at acute angles, his agonising face screwed into an open wound, he wields his Telecaster like a chain saw. His magnetism is totally original - more like an Olympic strong man imploding all his energy into a final record-breaking lift than anything seen on a rock'n'roll stage before., \nOff-stage, he's the Clash member with the lowest profile. \n\n--Caroline Coon\n\nStrummer died suddenly on 22 December 2002 in his home at Broomfield in Somerset, the victim of an undiagnosed congenital heart defect. His estate was valued at just under £1 million, and he left all the money to his wife Lucinda. Strummer was cremated, and his ashes were given to his family. \nStrummer was instrumental in setting up Future Forests (since rechristened The Carbon Neutral Company), dedicated to planting trees in various parts of the world to combat global warming. Strummer was the first artist to make the recording, pressing and distribution of his records carbon neutral through the planting of trees. In his remembrance, Strummer's friends and family have established the Strummerville Foundation for the promotion of new music. The foundation also holds an annual festival with the same name. \nIn January 2003, The Clash were inducted into the Rock and Roll Hall of Fame. At the Grammy Awards in February 2003, \"London Calling\" was performed by Elvis Costello, Bruce Springsteen, Steven Van Zandt, Dave Grohl, Pete Thomas, and Tony Kanal in tribute to Strummer. Another tribute to Strummer occurred in the same month at the rock club Debaser in Stockholm, when some of Sweden's most famous rock musicians paid their tribute to Strummer by performing songs written by the Clash (the exception was Nicke Borg and Dregen from Backyard Babies, who performed \"I Fought the Law\", which the Clash had covered). At the end of the concert, the legendary Swedish punk band Ebba Grön reunited for the tribute, aided by Mick Jones on guitar. \nAt the time of his death, Strummer was working on another Mescaleros album, which was released posthumously in October 2003 under the title Streetcore. The album features a tribute to American music icon Johnny Cash; \"Long Shadow\", which was written for Cash to sing and recorded in Rick Rubin's garage, as well as a remembrance of the terrorist attacks on 11 September 2001 (\"Ramshackle Day Parade\"), and a cover of Bob Marley's \"Redemption Song\", which Strummer had also recorded as a duet with Cash. The Cash/Strummer duet version appears on the 2003 box set Unearthed. \n\nNovember 2003 saw the release of a video for \"Redemption Song\", directed by Josh Cheuse. The video features the painting of a memorial mural, by graffiti artist REVOLT, on the wall of the Niagara Bar in the East Village of New York City. \nOn 22 December 2003, a year after his death, a tribute show/benefit was held at Irving Plaza in NYC. Bands that played were: Ari Up; Clem Snide; The Detachment Kit; Dirty Mary; Hammel on Trial; Jesse Malin; New Blood Revival; The Realistics; Eugene Hütz; Radio 4; Secret Army; Ted Leo; Vic Thrill + The Saturn Missile. The show was videotaped by punkcast.com but is as yet unreleased. \nA documentary by Dick Rude titled Let's Rock Again! was released in 2004. The film, completed after Strummer's death, chronicles life on tour in the United States with the Mescaleros to support Global a Go-Go. The Belfast punk rock group Stiff Little Fingers also recorded a tribute song \"Strummerville\" on their album, Guitar and Drum. Al Barr, lead singer of the Boston punk band Dropkick Murphys, named his son Strummer in honour of Joe. German band Beatsteaks pay tribute to Strummer on their album Smack Smash with the song \"Hello Joe\". In 2004, German punk band Die Toten Hosen released an EP called \"Friss oder stirb\", which included a tribute song for Strummer called \"Goodbye Garageland\", which is a lyrical co-production with Matt Dangerfield from London's 77 punk band The Boys. Boston Punk Rock Band Street Dogs recorded a tribute song called \"The General's Boombox\" on their latest album State of Grace, and New Jersey's The Gaslight Anthem recorded the song \"I'da Called You Woody, Joe\" on their album Sink or Swim. Attila the Stockbroker's Barnstormer released \"Comandante Joe\" on their album Zero Tolerance. \nOn 12 February 2005, the Class 47 locomotive 47828 was named \"Joe Strummer\". The nameplates were unveiled by his widow Lucinda Tait in a ceremony at Bristol Temple Meads railway station. On 22 July 2005 Tait unveiled a plaque on the house in Pentonville, Newport where Strummer lived from 1973 to 1974 and where his first foray into recorded music, \"Crummy Bum Blues\" was recorded.That Was Clash Radio, a short story by Charles de Lint, was written in response to Strummer's death and features Strummer in a minor role. \nNew Orleans-based rockers Cowboy Mouth released a song called \"Joe Strummer\" on their album Voodoo Shoppe. The song tells the story of a man who had to break up with his girlfriend because \"...she didn't know who/Joe Strummer was.\" The popular track is a tongue-in-cheek salute to Strummer and The Clash that received significant radio play in 2006. In addition, the Joe Pernice-penned \"High As a Kite\", included on The Pernice Brothers 2006 album Live a Little, was, in part a tribute to Joe Strummer. Lyrics included, \"Heavy downbeat of one and the show began/London calling, strike up the contraband\" and the memorable opening to the chorus, \"We wore pictures of Strummer.\" A play by Paul Hodson called Meeting Joe Strummer premiered at the Edinburgh Festival in 2006, and toured the UK the following year. \nJoe Strummer: The Future Is Unwritten, a documentary film directed by Julien Temple about Strummer, premiered on 20 January 2007 at the 2007 Sundance Film Festival. In October 2007, a tribute and benefit concert in honour of Joe Strummer was held in Los Angeles featuring Love & Rockets, Zander Schloss, Hellride and many other artists. The event was filmed and then released in DVD format as Tribute Concert: Cast a Long Shadow by MVD Videos in December 2010. In conjunction with the Strummer estate, Fender released the Joe Strummer Tribute Telecaster, combining elements of Joe's main guitars, namely an attempt at the \"road worn\" finish of his 1966 Telecaster, which he used until his death. The first 1,500 guitars come with a Shepard Fairey designed \"Customization kit\" with stickers and stencils, which resemble some of the designs Strummer used on his guitars. Joe Strummer's impact is referenced by The Hold Steady in the song \"Constructive Summer\", a song featured on their 2008 album Stay Positive. In this song the band sings \"Raise a toast to Saint Joe Strummer. I think he might have been our only decent teacher.\" In November 2009, Tonara, a town in Sardinia, Italy, dedicated a street to Joe Strummer. \nOn 22 December 2010, CJAM 99.1 FM, a radio station in Windsor, Ontario, Canada, declared the eighth anniversary of his death \"Joe Strummer Day to confront poverty in Windsor-Detroit.\" For 24-hours, the station played nothing but Strummer-related music, wrapping the sounds around reports about poverty from North America's hardest hit economic region--Windsor-Detroit. CJAM (which is located near the banks of the Detroit River, a kilometre from downtown Detroit) and its board of directors have since officially decided to make it a yearly event, and is hosting its 5th Annual Joe Strummer Day on Dec. 22, 2014. \nIn January 2011 a motion was started to grant Strummer his own street in the Spanish city of Granada. \nOn 21 August 2012 and what would have been Strummer's 60th birthday, Hellcat Records released an exclusive 57 song digital download album titled Joe Strummer and The Mescaleros, The Hellcat Years. The album features Strummer's three Hellcat albums along with various b-sides and live songs including Strummer's 15 November 2002 concert which featured Mick Jones. Hellcat also announced that on 25 September 2012 they will re-release remastered versions of Strummer's three records he recorded for Hellcat on both CD and vinyl. and Strummer's 15 Nov. 2002 concert, Live at Acton Town Hall was released as well through Hellcat on 23 November 2012 as an exclusive limited to 2200 copies 2 LP vinyl for Record Store Day. In January 2013, Joe Strummer had a plaza named in his honour in the Spanish city of Granada. Placeta Joe Strummer is at N37.16892 W3.58771 (722m) on a junction between three narrow roads the Calle Vistillas de Los Angeles, the Cuesta Escoriaza and the Calle Paseo Palmas. About 650m south of the Alhambra. \nIn an October 2013 interview, Mick Jones confirmed that Strummer indeed had intentions of reforming the Clash and new music was even being written. In the months prior to Strummer's passing, Jones and Strummer got together to write new music. Jones said at the time he assumed the new songs would be used on albums with the Mescaleros. A few months following their work together, Jones ran into Strummer at an event and asked him what he intended to do with those songs. Strummer informed Jones that they were going to be used for the next Clash record. \n\nMarriages and relationships:\nIn 1975, after being offered £120, Strummer married Pamela Moolman, a South African citizen, so she could obtain British citizenship. He bought his signature Fender Telecaster, later painted black, with the money. In 1978, Strummer started a relationship with Gaby Salter shortly after her 17th birthday. The couple remained together for 14 years and had two daughters, Jazz and Lola, but did not marry as Strummer had been unable to locate and divorce Moolman. During his relationship with Salter, he had multiple affairs spanning the 1980s. \nIn 1993, Strummer began an affair with Lucinda Tait, which finally ended his relationship with Gaby Salter. Strummer and Tait married in 1995 and remained so until his death in 2002 from a heart arrhythmia. Strummer is commonly believed to have been Lily Allen's godfather. Although this is not true, Strummer and his family were close friends of the Allens and would regularly attend the Glastonbury Festival together. Lily Allen has recalled how Strummer had a paternal attitude towards her as an adolescent, accompanying her for two days when she went to meet some friends at the festival. \n\nDocumentaries:\nLet's Rock Again! is a one-hour music documentary, directed by Dick Rude, that follows Strummer as he tours in America and Japan with The Mescaleros. It premiered at the Tribeca Film Festival in New York, May 2004. \nRedemption Song: The Ballad of Joe Strummer is a 2006 biography of Strummer by Chris Salewicz. \nJoe Strummer: The Future Is Unwritten is a documentary about Joe Strummer by Julien Temple. It comprises archive footage of him spanning his life, and interviews with friends, family, and other celebrities. It debuted at the 2007 Sundance Film Festival. \nLet Fury Have the Hour is a documentary about Strummer's politics. It was made by Antonino D'Ambrosio based on his book of the same name. Wayne Kramer composed the score. The movie debuted at the 2012 Tribeca Film Festival. \n\nMusical equipment:\n\nStrummer's main guitar throughout his career was a 1966 Fender Telecaster that originally came in a three-colour sunburst with a white pickguard. Strummer acquired the guitar in middle of 1975 while playing with the 101ers. After joining the Clash, the guitar's body and pickguard were refinished in grey auto primer and then painted black. By 1979, the word NOISE was stenciled on the upper part of the body, a rasta flag sticker was placed at the horn of the pickguard, and an \"Ignore Alien Orders\" sticker was placed above the bridge. By the release of Give 'Em Enough Rope, the guitar was fitted with a bridge with individual saddles and the original Kluson tuners were replaced with later model tuners and a large question mark was spraypainted on its back. \nThe guitar would remain in this configuration throughout his career with the addition of stickers on its body. The guitar's black paint became worn down due to Strummer's playing and on many places the original sunburst finish and bare wood shines through, except for the square where Strummer taped his setlists. In 2012 modern artist Karl Haglund paid tribute to this guitar in one of his iconic guitar paintings. The Fender Custom Shop has created a Joe Strummer tribute Telecaster with a reliced flat black finish. \nStrummer was naturally left-handed, but learned to play guitar right-handed, taught by his close friend Tymon Dogg who still has the original guitar (painted blue) that Joe learned on. Strummer had reckoned his left-handedness on a right-hand guitar as a drawback and claimed it caused him to be underdeveloped as a guitarist, although his style of playing was unique. \nHe also used three Fender Esquire models, one from 1952, a white blonde with slab fretboard from the mid-1950s and another from early to mid-1960s with a white pick guard and rosewood fingerboard. The Esquire is a one-pickup version of the Telecaster. Prior to using any Telecaster oriented guitar, before buying his 1966 model, he used as main guitars a Gretsch White Falcon and a Hofner. For amplification Strummer was known to use amplifiers such as a Roland Jazz Chorus, a Selmer Bassman while he was in the 101ers, a Vox AC30 and various Marshall amplifiers, but his main amplifier was a Music Man HD 212,150. Strummer commented on his choice of amplifier with \"I don't have time to search for those old Fender tube amps. The Music Man is the closest thing to that sound I've found\" and that the \"plastic motif on the front is repulsive.\" \n\nMural in New York City:\nIn 2013 the mural of Joe Strummer outside Niagara bar on the East Village of Manhattan, New York City was destroyed due to construction. On 19 September 2013, a new mural was unveiled. The unveiling was accompanied by a large celebration, attended by Mick Jones.",
  "country": null,
  "created_at": "2025-07-05T15:55:17.879644",
  "discogs_id": "56830",
  "discogs_url": "https://www.discogs.com/artist/56830-Joe-Strummer",
  "followers": 106600,
  "formed_date": null,
  "genres": [
    "Rock",
    "punk",
    "rock",
    "alternative",
    "singer-songwriter",
    "punk rock"
  ],
  "id": "joe-strummer-1751727320",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages211/v4/66/a5/f5/66a5f549-c1cf-71a8-e8bc-0450cc8fc72c/36f059b7-25b9-47c9-a3e6-dd28ca84a8c6_ami-identity-94606bec1f6e6c5b24d9ab4e6ba651c2-2024-07-03T04-37-51.123Z_cropped.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5ebb9586ddeb23977ba7d47e037",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174b9586ddeb23977ba7d47e037",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178b9586ddeb23977ba7d47e037",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "http://r2.theaudiodb.com/images/media/artist/thumb/strummer-joe-5cedd7ef80c91.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/8d7yk71667608246.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/6L_QExI9Ap7eZE16wAsZbevJ_HyuzoL_tGDnI48pRPM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "af4ea2a3-c54d-40b4-8120-a1f0b838ad54",
  "lastfm_url": "https://www.last.fm/music/Joe+Strummer",
  "local_images": {
    "hi-res": "../public/artist/joe-strummer/joe-strummer-hi-res.jpg",
    "medium": "../public/artist/joe-strummer/joe-strummer-medium.jpg",
    "small": "../public/artist/joe-strummer/joe-strummer-small.jpg"
  },
  "name": "Joe Strummer",
  "popularity": 45,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='2929326', url='https://music.apple.com/gb/artist/joe-strummer/2929326', name='Joe Strummer', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages211/v4/66/a5/f5/66a5f549-c1cf-71a8-e8bc-0450cc8fc72c/36f059b7-25b9-47c9-a3e6-dd28ca84a8c6_ami-identity-94606bec1f6e6c5b24d9ab4e6ba651c2-2024-07-03T04-37-51.123Z_cropped.png/2000x2000bb.jpg', genres=['Rock'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '2929326', 'type': 'artists', 'href': '/v1/catalog/gb/artists/2929326', 'attributes': {'name': 'Joe Strummer', 'genreNames': ['Rock'], 'artwork': {'width': 898, 'height': 898, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages211/v4/66/a5/f5/66a5f549-c1cf-71a8-e8bc-0450cc8fc72c/36f059b7-25b9-47c9-a3e6-dd28ca84a8c6_ami-identity-94606bec1f6e6c5b24d9ab4e6ba651c2-2024-07-03T04-37-51.123Z_cropped.png/{w}x{h}bb.jpg', 'bgColor': '069c99', 'textColor1': '030304', 'textColor2': '030305', 'textColor3': '042222', 'textColor4': '042222'}, 'url': 'https://music.apple.com/gb/artist/joe-strummer/2929326'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/2929326/albums', 'data': [{'id': '1494012735', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1494012735'}, {'id': '1558886326', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1558886326'}, {'id': '1494055363', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1494055363'}, {'id': '1622867751', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1622867751'}, {'id': '1494060501', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1494060501'}, {'id': '269627860', 'type': 'albums', 'href': '/v1/catalog/gb/albums/269627860'}, {'id': '1350922742', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1350922742'}, {'id': '1652354038', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1652354038'}, {'id': '1639499091', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1639499091'}, {'id': '1711089787', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1711089787'}, {'id': '724949484', 'type': 'albums', 'href': '/v1/catalog/gb/albums/724949484'}, {'id': '254876456', 'type': 'albums', 'href': '/v1/catalog/gb/albums/254876456'}, {'id': '1645411568', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1645411568'}, {'id': '1639307874', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1639307874'}, {'id': '1679862868', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1679862868'}, {'id': '254586400', 'type': 'albums', 'href': '/v1/catalog/gb/albums/254586400'}, {'id': '1679853668', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1679853668'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "56830",
      "images": [
        {
          "height": 623,
          "resource_url": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/6L_QExI9Ap7eZE16wAsZbevJ_HyuzoL_tGDnI48pRPM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 359,
          "resource_url": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/9siMh4Qw4sH0gjXBmKm9mBTgzXmlGuU36FE0gY9nVOs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
          "width": 500
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/7tLZMZwdaVE45CmDF5NNFkncp3dPLll12tr0jPxmGCY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/y5eS6y9JOmtzjAuBcj39TDOh-R3Me-4OWTX6ZRLJpAA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
          "width": 487
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/RlIFNMjR6Wm5pM7rfZGMX5EeCAbFzNuN12AfKNKZYTs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
          "width": 380
        },
        {
          "height": 420,
          "resource_url": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/V8kNIqjXRfZoXpf9qwRxTvFe-6T4ADOGm6SF5pWbhLo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
          "width": 280
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/vZlcfPnHGGUtZB71jCv1NEJOjy7KWiFX7zB-yt3k4Bk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
          "width": 450
        },
        {
          "height": 354,
          "resource_url": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/GglJqE4xxqn1V87mPSlx2JeOO8PmRQgAPjFbhKesWW4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
          "width": 219
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/qLJquCUEZF2JUMDXIfwKah6Ph-fHph6eF9_qPNrDRWQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 402,
          "resource_url": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/QbWfBdUada-FDBBIZ-_gfIwvMKx61XS4bWSIRpWzgqk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 750,
          "resource_url": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/TdAIYNdwEULa28xiEAyN8AA_ofn29OSpn7kNy9pahtI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 750,
          "resource_url": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/NOBXcEvT9LN1e_KfIUnhvDEDaqt-ZTH3_fmozsEjhD4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/hXEZkoC_ugYL19KCzU_22v6dz4DrJaPmZekAAGbithk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/D_x4Fyp-Z0zBcz-nzwkcTBQLnSdnM_dpmgvA0ih3VPQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 414,
          "resource_url": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/4NnALjVu1eADvCS4Ukskw6_gi-As2FXmpTxaBnz8XQ8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 420,
          "resource_url": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/e0LU9nmx6VDsRJ_t3QyId_3g_KZIvHTLI6jgWwcJdmE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "Joe Strummer",
      "namevariations": [
        "J Strummer",
        "J Stummer",
        "J. Strummer",
        "J. Summer",
        "J.Strummer",
        "Joe",
        "Joe-Strummer",
        "Joe. Strummer",
        "Mellor",
        "Strumer",
        "Strummer",
        "Strummer J",
        "Stummer",
        "ジョー・ストラマー"
      ],
      "profile": "Songwriter, vocalist, guitarist and co-founder of [a=The 101'ers]  and [a=The Clash]. He later formed [a=Joe Strummer & The Mescaleros] and [a=Joe Strummer & The Latino Rockabilly War]. Spanish [l84559] label founder with [a519954] in Granada.\r\n\r\nBorn: Ankara, Turkey August 21, 1952. \r\nDied: Broomfield, Somerset, England December 22, 2002 (congenital heart failure).",
      "raw_data": {
        "aliases": [
          {
            "id": 782160,
            "name": "John Mellor",
            "resource_url": "https://api.discogs.com/artists/782160",
            "thumbnail_url": "https://i.discogs.com/hi7G5ko1VgS_2jgowIR0hWTgp5T3SJ_xC8CU8hG1yKI/rs:fit/g:sm/q:40/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTc4MjE2/MC0xMTk2Mzg2ODk2/LmpwZWc.jpeg"
          },
          {
            "id": 796747,
            "name": "Jimmy Jazz (3)",
            "resource_url": "https://api.discogs.com/artists/796747",
            "thumbnail_url": "https://i.discogs.com/dsIYaH3bpwIGoXKlMwGbvTA3Podcjashh2KCyP6hTuo/rs:fit/g:sm/q:40/h:398/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTc5Njc0/Ny0xMTk4Nzg4ODA5/LmpwZWc.jpeg"
          },
          {
            "id": 1672273,
            "name": "Albert Transom",
            "resource_url": "https://api.discogs.com/artists/1672273",
            "thumbnail_url": "https://i.discogs.com/zEsVxznzBeVVd1BB4_M2s9e9y2f8LEcnxf3ttluKAQc/rs:fit/g:sm/q:40/h:599/w:577/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE2NzIy/NzMtMTc0MjI0OTc1/NC00MDIxLmpwZWc.jpeg"
          }
        ],
        "data_quality": "Correct",
        "id": 56830,
        "images": [
          {
            "height": 623,
            "resource_url": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/6L_QExI9Ap7eZE16wAsZbevJ_HyuzoL_tGDnI48pRPM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 359,
            "resource_url": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/9siMh4Qw4sH0gjXBmKm9mBTgzXmlGuU36FE0gY9nVOs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
            "width": 500
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/7tLZMZwdaVE45CmDF5NNFkncp3dPLll12tr0jPxmGCY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/y5eS6y9JOmtzjAuBcj39TDOh-R3Me-4OWTX6ZRLJpAA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
            "width": 487
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/RlIFNMjR6Wm5pM7rfZGMX5EeCAbFzNuN12AfKNKZYTs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
            "width": 380
          },
          {
            "height": 420,
            "resource_url": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/V8kNIqjXRfZoXpf9qwRxTvFe-6T4ADOGm6SF5pWbhLo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
            "width": 280
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/vZlcfPnHGGUtZB71jCv1NEJOjy7KWiFX7zB-yt3k4Bk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
            "width": 450
          },
          {
            "height": 354,
            "resource_url": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/GglJqE4xxqn1V87mPSlx2JeOO8PmRQgAPjFbhKesWW4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
            "width": 219
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/qLJquCUEZF2JUMDXIfwKah6Ph-fHph6eF9_qPNrDRWQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 402,
            "resource_url": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/QbWfBdUada-FDBBIZ-_gfIwvMKx61XS4bWSIRpWzgqk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 750,
            "resource_url": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/TdAIYNdwEULa28xiEAyN8AA_ofn29OSpn7kNy9pahtI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 750,
            "resource_url": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/NOBXcEvT9LN1e_KfIUnhvDEDaqt-ZTH3_fmozsEjhD4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/hXEZkoC_ugYL19KCzU_22v6dz4DrJaPmZekAAGbithk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/D_x4Fyp-Z0zBcz-nzwkcTBQLnSdnM_dpmgvA0ih3VPQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 414,
            "resource_url": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/4NnALjVu1eADvCS4Ukskw6_gi-As2FXmpTxaBnz8XQ8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 420,
            "resource_url": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/e0LU9nmx6VDsRJ_t3QyId_3g_KZIvHTLI6jgWwcJdmE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
            "width": 600
          }
        ],
        "name": "Joe Strummer",
        "namevariations": [
          "J Strummer",
          "J Stummer",
          "J. Strummer",
          "J. Summer",
          "J.Strummer",
          "Joe",
          "Joe-Strummer",
          "Joe. Strummer",
          "Mellor",
          "Strumer",
          "Strummer",
          "Strummer J",
          "Stummer",
          "ジョー・ストラマー"
        ],
        "profile": "Songwriter, vocalist, guitarist and co-founder of [a=The 101'ers]  and [a=The Clash]. He later formed [a=Joe Strummer & The Mescaleros] and [a=Joe Strummer & The Latino Rockabilly War]. Spanish [l84559] label founder with [a519954] in Granada.\r\n\r\nBorn: Ankara, Turkey August 21, 1952. \r\nDied: Broomfield, Somerset, England December 22, 2002 (congenital heart failure).",
        "realname": "John Graham Mellor",
        "releases_url": "https://api.discogs.com/artists/56830/releases",
        "resource_url": "https://api.discogs.com/artists/56830",
        "uri": "https://www.discogs.com/artist/56830-Joe-Strummer",
        "urls": [
          "https://www.joestrummer.com",
          "https://en.wikipedia.org/wiki/Joe_Strummer",
          "https://www.facebook.com/JoeStrummerOfficial",
          "https://www.instagram.com/joestrummerofficial",
          "https://twitter.com/joestrummer",
          "https://www.youtube.com/channel/UCr1-wWOgjfQaFM_zFHkZtJA"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/56830",
      "thumb": "https://i.discogs.com/6L_QExI9Ap7eZE16wAsZbevJ_HyuzoL_tGDnI48pRPM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/56830-Joe-Strummer",
      "urls": [
        "https://www.joestrummer.com",
        "https://en.wikipedia.org/wiki/Joe_Strummer",
        "https://www.facebook.com/JoeStrummerOfficial",
        "https://www.instagram.com/joestrummerofficial",
        "https://twitter.com/joestrummer",
        "https://www.youtube.com/channel/UCr1-wWOgjfQaFM_zFHkZtJA"
      ]
    },
    "lastfm": "ArtistLastFmData(name='Joe Strummer', url='https://www.last.fm/music/Joe+Strummer', mbid='af4ea2a3-c54d-40b4-8120-a1f0b838ad54', listeners=200420, playcount=1927006, bio_summary='John Graham Mellor (21 August 1952 – 22 December 2002), better known by his stage name Joe Strummer, was the co-founder, lyricist, rhythm guitarist and lead singer of the English punk rock band The Clash. He was also a member of the The 101\\'ers and Joe Strummer and The Mescaleros.\\n\\nFollowing the end of the Clash, Joe spent a period moving from project to project. He acted in films like Walker and Straight to Hell, and OF COURSE his most unforgettable role as the awesome Johnny aka Elvis in the Jim Jarmusch masterpiece, \"Mystery Train. <a href=\"https://www.last.fm/music/Joe+Strummer\">Read more on Last.fm</a>', bio_content='John Graham Mellor (21 August 1952 – 22 December 2002), better known by his stage name Joe Strummer, was the co-founder, lyricist, rhythm guitarist and lead singer of the English punk rock band The Clash. He was also a member of the The 101\\'ers and Joe Strummer and The Mescaleros.\\n\\nFollowing the end of the Clash, Joe spent a period moving from project to project. He acted in films like Walker and Straight to Hell, and OF COURSE his most unforgettable role as the awesome Johnny aka Elvis in the Jim Jarmusch masterpiece, \"Mystery Train.\"  He even sang for The Pogues after Shane MacGowan bizarrely quit/was sacked on the Hell\\'s Ditch tour.\\n\\nFinally, in the mid-to-late 1990s, Strummer gathered top-flight musicians into a backing band he called The Mescaleros. Strummer and the band signed with the Californian punk label Hellcat Records, and issued a stunning album in 1999, which was co-written with Anthony Genn, called Rock Art and the X-Ray Style. A tour of England and North America soon followed; sets included several Clash fan favourites. In 2001 the band released their second album, \"Global A Go-Go\". The album was supported with a 21-date tour of North America, Britain, and Ireland. Once again, these concerts featured Clash material (\"London Calling\", \"Rudie Can\\'t Fail,\" \"White Man in Hammersmith Palais\"), as well as classic covers of reggae hits (\"The Harder They Come\", \"A Message To You, Rudie\") and the band regularly closed the show with a nod to the late Joey Ramone by playing The Ramones\\' \"Blitzkrieg Bop\".\\n <a href=\"https://www.last.fm/music/Joe+Strummer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['punk', 'rock', 'alternative', 'singer-songwriter', 'punk rock'], similar_artists=[{'name': 'Joe Strummer and the Mescaleros', 'url': 'https://www.last.fm/music/Joe+Strummer+and+the+Mescaleros'}, {'name': 'The Clash', 'url': 'https://www.last.fm/music/The+Clash'}, {'name': 'Johnny Thunders', 'url': 'https://www.last.fm/music/Johnny+Thunders'}, {'name': 'Patti Smith', 'url': 'https://www.last.fm/music/Patti+Smith'}, {'name': 'The Gaslight Anthem', 'url': 'https://www.last.fm/music/The+Gaslight+Anthem'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Joe Strummer', 'mbid': 'af4ea2a3-c54d-40b4-8120-a1f0b838ad54', 'url': 'https://www.last.fm/music/Joe+Strummer', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '200420', 'playcount': '1927006'}, 'similar': {'artist': [{'name': 'Joe Strummer and the Mescaleros', 'url': 'https://www.last.fm/music/Joe+Strummer+and+the+Mescaleros', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'The Clash', 'url': 'https://www.last.fm/music/The+Clash', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Johnny Thunders', 'url': 'https://www.last.fm/music/Johnny+Thunders', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Patti Smith', 'url': 'https://www.last.fm/music/Patti+Smith', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'The Gaslight Anthem', 'url': 'https://www.last.fm/music/The+Gaslight+Anthem', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'punk', 'url': 'https://www.last.fm/tag/punk'}, {'name': 'rock', 'url': 'https://www.last.fm/tag/rock'}, {'name': 'alternative', 'url': 'https://www.last.fm/tag/alternative'}, {'name': 'singer-songwriter', 'url': 'https://www.last.fm/tag/singer-songwriter'}, {'name': 'punk rock', 'url': 'https://www.last.fm/tag/punk+rock'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Joe+Strummer/+wiki'}}, 'published': '25 Feb 2006, 12:15', 'summary': 'John Graham Mellor (21 August 1952 – 22 December 2002), better known by his stage name Joe Strummer, was the co-founder, lyricist, rhythm guitarist and lead singer of the English punk rock band The Clash. He was also a member of the The 101\\'ers and Joe Strummer and The Mescaleros.\\n\\nFollowing the end of the Clash, Joe spent a period moving from project to project. He acted in films like Walker and Straight to Hell, and OF COURSE his most unforgettable role as the awesome Johnny aka Elvis in the Jim Jarmusch masterpiece, \"Mystery Train. <a href=\"https://www.last.fm/music/Joe+Strummer\">Read more on Last.fm</a>', 'content': 'John Graham Mellor (21 August 1952 – 22 December 2002), better known by his stage name Joe Strummer, was the co-founder, lyricist, rhythm guitarist and lead singer of the English punk rock band The Clash. He was also a member of the The 101\\'ers and Joe Strummer and The Mescaleros.\\n\\nFollowing the end of the Clash, Joe spent a period moving from project to project. He acted in films like Walker and Straight to Hell, and OF COURSE his most unforgettable role as the awesome Johnny aka Elvis in the Jim Jarmusch masterpiece, \"Mystery Train.\"  He even sang for The Pogues after Shane MacGowan bizarrely quit/was sacked on the Hell\\'s Ditch tour.\\n\\nFinally, in the mid-to-late 1990s, Strummer gathered top-flight musicians into a backing band he called The Mescaleros. Strummer and the band signed with the Californian punk label Hellcat Records, and issued a stunning album in 1999, which was co-written with Anthony Genn, called Rock Art and the X-Ray Style. A tour of England and North America soon followed; sets included several Clash fan favourites. In 2001 the band released their second album, \"Global A Go-Go\". The album was supported with a 21-date tour of North America, Britain, and Ireland. Once again, these concerts featured Clash material (\"London Calling\", \"Rudie Can\\'t Fail,\" \"White Man in Hammersmith Palais\"), as well as classic covers of reggae hits (\"The Harder They Come\", \"A Message To You, Rudie\") and the band regularly closed the show with a nod to the late Joey Ramone by playing The Ramones\\' \"Blitzkrieg Bop\".\\n <a href=\"https://www.last.fm/music/Joe+Strummer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='2A09V0kHlETOFfT8Hz8oba', url='https://open.spotify.com/artist/2A09V0kHlETOFfT8Hz8oba', name='Joe Strummer', popularity=45, followers=106600, genres=[], images=[{'url': 'https://i.scdn.co/image/ab6761610000e5ebb9586ddeb23977ba7d47e037', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174b9586ddeb23977ba7d47e037', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178b9586ddeb23977ba7d47e037', 'height': 160, 'width': 160}], external_urls={'spotify': 'https://open.spotify.com/artist/2A09V0kHlETOFfT8Hz8oba'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/2A09V0kHlETOFfT8Hz8oba'}, 'followers': {'href': None, 'total': 106600}, 'genres': [], 'href': 'https://api.spotify.com/v1/artists/2A09V0kHlETOFfT8Hz8oba', 'id': '2A09V0kHlETOFfT8Hz8oba', 'images': [{'url': 'https://i.scdn.co/image/ab6761610000e5ebb9586ddeb23977ba7d47e037', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab67616100005174b9586ddeb23977ba7d47e037', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f178b9586ddeb23977ba7d47e037', 'height': 160, 'width': 160}], 'name': 'Joe Strummer', 'popularity': 45, 'type': 'artist', 'uri': 'spotify:artist:2A09V0kHlETOFfT8Hz8oba'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": null,
      "biography_de": null,
      "biography_en": "John Graham Mellor (21 August 1952 - 22 December 2002), best remembered by his stage name Joe Strummer, was a British musician, singer, actor and songwriter who was the co-founder, lyricist, rhythm guitarist and lead vocalist of the punk rock band The Clash, a band that formed in 1976 as part of the original wave of British punk. Along with punk, their music incorporated elements of reggae, ska, dub, funk, rap, and rockabilly. The Clash were one of the most prominent of the emerging bands in the UK punk rock scene, their second album, Give 'Em Enough Rope (1978) reaching number 2 on the UK charts. Soon after, they began achieving success in the US, starting with London Calling (1979), and peaking with 1982's Combat Rock, reaching number 7 on the US charts and being certified 2x platinum there. The Clash's politicised lyrics, musical experimentation, and rebellious attitude had a far-reaching influence on rock, alternative rock in particular. \nHis musical experience included his membership of The 101ers, Latino Rockabilly War, The Mescaleros and The Pogues, in addition to his own solo music career. Strummer's work as a musician allowed him to explore other interests, which included acting, creating film scores for television and movies, songwriting, radio broadcasting, and a position as a radio host. Strummer is one of the iconic figures of the British punk movement. \nStrummer and The Clash were inducted into the Rock and Roll Hall of Fame in January 2003. In his remembrance, Strummer's friends and family have established the Strummerville Foundation for the promotion of new music, and each year there are many festivals and both organised and spontaneous ceremonies worldwide to celebrate his memory. \n\nBiography and career:\n\nThe early years (1952-1976):\nStrummer was born John Graham Mellor in Ankara, Turkey on 21 August 1952. His mother, Anna Mackenzie, a crofter's daughter born and raised in Bonar Bridge in the Scottish Highlands, was a nurse. His father, Ronald Mellor, was a British foreign service diplomat born in Lucknow, India. Ronald Mellor had an Armenian maternal grandfather and a German Jewish paternal grandmother. The family spent much time moving from place to place, and Strummer spent parts of his early childhood in Cairo, Mexico City, and Bonn. At the age of 9, Strummer and his older brother David, 10, began boarding at the City of London Freemen's School in Surrey. Strummer rarely saw his parents during the next seven years. \n\nAt the age of nine I had to say good-bye to them because they went abroad to Africa or something. I went to boarding school and only saw them once a year after that - the Government paid for me to see my parents once a year. I was left on my own, and went to this school where thick rich people sent their thick rich kids. Another perk of my father's job - it was a job with a lot of perks - all the fees were paid by the Government. \n--Joe Strummer\n\nHe developed a love of rock music listening to records by Little Richard and The Beach Boys as well as American folk-singer Woody Guthrie. (Strummer would even go by the nickname \"Woody\" for a few years). Strummer would later say that \"the reason he played music was the Beach Boys.\" \n\nDavid was a year older than me. Funnily enough, you know, he was a Nazi. He was a member of the National Front. He was into the occult and he used to have these deaths-heads and cross-bones all over everything. He didn't like to talk to anybody, and I think suicide was the only way out for him. What else could he have done? \n\n--Joe Strummer\n\nBy 1970 his brother David had become estranged from his family and had joined the National Front. His suicide in July profoundly affected Strummer, as did having to identify his body after it had lain undiscovered for three days. After finishing his time at City of London Freemen's School, Ashtead Park, Surrey, in 1970, Strummer moved on to the Central School of Art and Design in London, where he briefly flirted with the idea of becoming a professional cartoonist, but ultimately completed a foundations course. During this time, Mellor shared a flat in the north London suburb of Palmers Green with friends Clive Timperley and Tymon Dogg. In 1971 Strummer became a vegetarian and remained one until his death. In April 1972 Strummer attended as a fan the Bickershaw Festival in Lancashire, a three day event which was attended by many London counter culture figures and underground magazines. Strummer said in 1999 that Don Van Vliet's ( Captain Beefheart's) performance at the 1972 Bickershaw Festival was the best concert he had ever attended. \n\nI bought a ukulele. No kidding. I saved some money, £1.99 I think, and bought it down Shaftesbury Avenue. Then the guy I was busking with taught me to play Johnny Be Good. ... I was on my own for the first time with this ukulele and Johnny Be Good. And that's how I started. \n\n--Joe Strummer\n\nIn 1973 Strummer moved to Newport, Wales. He did not study at Newport College of Art but met up with college musicians in the Students' Union in Stow Hill and became vocalist for Flaming Youth, renaming the band The Vultures. The Vultures included three former members of Rip Off Park Rock & Roll Allstars, the original college band co-founded by Terry Earl Taylor. For the next year he was the band's part-time singer and rhythm guitarist. During this time Strummer also worked as a gravedigger in St Woolos Cemetery. In 1974, the band fell apart and he moved back to London where he met up again with Tymon Dogg. He did street performance for a while and then decided to form another band with his West London roommates. The band was called The 101'ers, named after the address of their squat (101 Walterton Road, in Maida Vale). \nThe band played many gigs in London pubs, playing covers of popular American R&B and blues songs. In 1975 he stopped calling himself \"Woody\" Mellor and adopted the stage name of Joe Strummer, and insisted that his friends call him by that name. The name \"Strummer\" apparently referred to his role as rhythm guitarist, in a rather self-deprecating way. Though left-handed, he was taught to play right-handed by his friend Tymon Dogg. Strummer was the lead singer of the 101'ers and began to write original songs for the group. One song he wrote was inspired by his girlfriend at the time, Slits drummer Palmolive. The group liked the song \"Keys to Your Heart\", and picked it as their first single. \n\nThe Clash (1976-1986):\nOn 3 April 1976, a then-unknown Sex Pistols opened for The 101'ers at a venue called The Nashville Rooms in London, and Strummer was impressed by them. Sometime after the show, Strummer was approached by Bernie Rhodes and Mick Jones. Jones was from the band London SS and wanted Strummer to join as lead singer. Strummer agreed to leave the 101'ers and join Jones, bassist Paul Simonon, drummer Terry Chimes and guitarist Keith Levene. The band was named The Clash by Simonon and made their debut on 4 July 1976, opening for the Sex Pistols at The Black Swan (a.k.a. The Mucky Duck, now known as the Boardwalk Sheffield, England). On 25 January 1977, the band signed with CBS Records and was now a three-piece after Levene was fired from the band and Chimes quit. Drummer Topper Headon later became the band's full-time drummer. \nAt the band's induction into the Rock and Roll Hall of Fame, the Clash was said to be \"considered one of the most overtly political, explosive and exciting bands in rock and roll history\". Their songs tackled social decay, unemployment, racism, police brutality, political and social repression, and militarism in detail. Strummer was involved with the Anti-Nazi League and Rock Against Racism campaigns. He later also gave his support to the Rock Against the Rich series of concerts organised by the anarchist organisation Class War. The Clash's London Calling album was voted best album of the 1980s by Rolling Stone magazine (although it was released in late 1979 in the UK; it was released in 1980 in the USA). \nDuring his time with The Clash, Strummer, along with his bandmates, became notorious for getting in trouble with the law. On 10 June 1977, he and Headon were arrested for spray-painting \"The Clash\" on a wall in a hotel. On 20 May 1980, he was arrested for hitting a violent member of the audience with his guitar during a performance in Hamburg, Germany. This incident shocked Strummer, and had a lasting personal impact on him. \n\" \nI nearly murdered somebody, and it made me realise that you can't face violence with violence. It doesn't work. \n\" \n\n--Joe Strummer \n\nBefore the album Combat Rock was released in 1982, Strummer wilfully went into hiding and band management represented that he had \"disappeared\". Bernie Rhodes, the band's manager, pressured Joe to do so because tickets were selling slowly for the Scottish leg of an upcoming tour. It was planned for Strummer to travel to Texas in secret and stay with his friend, musician Joe Ely. However, Strummer, uneasy with his decision, decided to genuinely disappear and \"dicked around\" in France. During this time, Strummer ran the Paris Marathon in April 1982. He claimed his training regime consisted of 10 pints of beer the night before the race. For this period of time, Joe's whereabouts were not only a mystery to the public, but the band's management as well. Joe later said this was a huge mistake and you \"have to have some regrets\". This was in spite of the popular success of the single \"Rock the Casbah\". During this time band members began to argue a lot, and with tensions high, the group began to fall apart. \nIn September 1983, Strummer issued the infamous \"Clash Communique\", and fired Mick Jones. Headon had earlier been kicked out of the band because of his heroin addiction, and replaced with drummer Pete Howard. This left the band with only two of its original members. Rhodes persuaded Strummer to carry on and added new members. \"The Clash Mark Two\" released the album Cut the Crap in 1985. The album was panned by fans and critics alike and Strummer disbanded The Clash. The disintegration of the band and the reasons behind the break-up are the subject matter of Danny Garcia's 2012/3 book and documentary, The Rise and Fall of the Clash. \n\nSolo career and soundtrack work (1986-1999):\n\nA year later, Strummer worked on several songs for the 1986 film Sid and Nancy, including \"Love Kills\" and \"Dum Dum Club\". Strummer also later worked with Mick Jones and his band Big Audio Dynamite, contributing to the band's second studio album by co-writing most of the songs as well as producing the album along with Jones. In 1987, he played a small part in the film Walker, directed by Alex Cox, as a character named \"Faucet\" and wrote and performed on the film's soundtrack. \nHe starred in another Cox film that same year called Straight to Hell, as the character Simms. Straight to Hell also featured London-Irish folk/punk band The Pogues - both as actors and major contributors to the soundtrack. Strummer joined The Pogues for a tour in 1987/88, filling in for ailing guitarist Philip Chevron, who wrote (in May 2008) on the band's online forum: \"When I was sick in late 1987, I taught Joe all the guitar parts in an afternoon and he was on tour in the USA as deputy guitarist the next day. Joe wrote all the tabs in his meticulously neat hand on a long piece of paper which he taped to the top of the guitar so he could glance down occasionally when he was onstage.\" This tour would be the first of several collaborations with the band. \nIn 1989, Strummer played a substantial role in Jim Jarmusch's film Mystery Train, as a drunken, short-tempered drifter named Johnny (whom most characters refer to as Elvis, much to Johnny's dismay). He also made a brief appearance in Aki Kaurismäki's 1990 film I Hired a Contract Killer as a guitarist in a pub, performing two songs (\"Burning Lights\" and \"Afro-Cuban Bebop\"). These were released as a promotional 7-inch single limited to a few hundred copies, credited to \"Joe Strummer & the Astro Physicians\". The \"Astro Physicians\" were in fact The Pogues (\"Afro-Cuban Bebop\" got a re-release on The Pogues' 2008 box set). During this time Strummer continued to act, write and produce soundtracks for various films, most notably the soundtrack for Grosse Pointe Blank (1997). While the group started to formulate its roots in the year 1986, Strummer began actually producing solo records with a band called The Latino Rockabilly War in 1989. The album Earthquake Weather was a critical and commercial flop, and resulted in the loss of his contract with Sony Records. \nHe also did the soundtrack to the movie Permanent Record with this band. Strummer was asked by The Pogues, who were fracturing as a band, to help them produce their next album, released in 1990 as Hell's Ditch. In 1991, he replaced Shane MacGowan as singer of The Pogues for a tour after MacGowan's departure from the band. One night of this tour was professionally recorded, and three tracks (\"I Fought the Law\", \"London Calling\", and \"Turkish Song of the Damned\") have seen release as b-sides and again on The Pogues' 2008 box set. On 16 April 1994, Strummer joined Czech-American band Dirty Pictures on stage in Prague at the Repre Club in Obecni Dum at \"Rock for Refugees\", a benefit concert for people left displaced by the war in Bosnia. Backed up by the Pictures, Strummer played a blistering set of Clash songs that he said he had not played in more than ten years. Although the set appeared impromptu, Strummer and the band had spent the days leading up to the event rehearsing and \"hanging out\" in Prague. The show began with \"London Calling\" and without pause went into \"Brand New Cadillac\". In the middle of the song, the power went out. \nOnce the power was back on, Strummer asked the audience whether or not they would mind if the band started over. They then began again with \"London Calling\" and continued on for another half-hour. After these self-described \"wilderness years\", Strummer began working with other bands; he played piano on the 1995 UK hit of The Levellers, \"Just the One\" and appeared on the Black Grape single \"England's Irie\" in 1996. In 1997, while in New York City, he had worked with noted producer and engineer Lee Perry on a significant amount of remixed Clash and 101'ers reissue dub material. In collaboration with percussionist Pablo Cook, Strummer wrote and performed the soundtrack to Tunnel of Love (Robert Wallace 1997) that was featured in the Cannes Film Festival in the same year. In 1998, he made a guest appearance on the animated television show, South Park and appeared on the album Chef Aid: The South Park Album featuring songs from and inspired by the series. \nAlso during this time, Strummer was in dispute with The Clash's record label, Epic Records. The disagreement lasted nearly eight years and ended with the label agreeing to let him record solo records with another label. If The Clash were to reunite though, they would have to record for Sony. During the nineties, Strummer was a DJ on the BBC World Service with his half-hour programme London Calling. Samples from the series provide the vocals for \"Midnight Jam\" on Joe Strummer and the Mescaleros' final album Streetcore. \n\nThe Mescaleros and other work (1999-2002):\nIn the mid-to-late 1990s, Strummer gathered top-flight musicians into a backing band he called The Mescaleros. Strummer and the band signed with Mercury Records, and released their first album in 1999, which was co-written with Antony Genn, called Rock Art and the X-Ray Style. A tour of England, Europe, and North America soon followed; sets included several Clash fan favourites. \n\" \nThis is my Indian summer...I learnt that fame is an illusion & everything about it is just a joke. I'm far more dangerous now, because I don't care at all. \n\" \n\n--Joe Strummer to Chris Salewicz - 2000 ,  \n\nIn 2001, the band signed with Californian punk label Hellcat Records and released their second studio album, Global a Go-Go. The album was supported with a 21-date tour of North America, Britain, and Ireland. Once again, these concerts featured Clash material (\"London's Burning\", \"Rudie Can't Fail\", \"(White Man) In Hammersmith Palais\"), as well as covers of reggae and ska hits (\"The Harder They Come\", \"A Message to You, Rudy\") and the band regularly closed the show by playing the Ramones' \"Blitzkrieg Bop\". He covered Bob Marley's \"Redemption Song\" with Johnny Cash. In the same year, somewhat out of character, Strummer and the Mescaleros performed the song \"Minstrel Boy\" for the film Black Hawk Down, a haunting and emotive Celtic tune that is played during the evacuation of PFC Todd Blackburn during the Battle of Mogadishu and again over the end credits. \n\nOn 15 November 2002, Strummer and The Mescaleros played a benefit show for striking fire fighters in London, at the Acton Town Hall. Mick Jones was in the audience, and joined the band on stage during the Clash's \"Bankrobber\". An encore followed with Jones playing guitar and singing on \"White Riot\" and \"London's Burning\". This performance marked the first time since 1983 that Strummer and Jones had performed together on stage. Jones later remarked that it was totally unplanned and that he felt compelled to join Strummer on stage. \nStrummer's final regular gig was at Liverpool Academy on 22 November 2002, yet his final performance, just two weeks before his death, was in a small club venue 'The Palace' in Bridgwater, Somerset near to his home. Shortly before his death, Strummer and U2's Bono co-wrote a song, \"46664\", for Nelson Mandela as part of a campaign against AIDS in Africa. Strummer had been scheduled to play at Mandela's SOS fundraising concert in February 2003 on Robben Island. Mick Jones later recorded a version of the song in studio, performing both the vocals and guitar work, that has yet to be formally released. \n\nDeath and legacy (2002-present):\n\nOn-stage Strummer wires himself up into an inhuman dynamo of sweaty, trembling flesh, fearful enough to have one wondering when the ambulance brigade will rush to his rescue with a straight-jacket. While he tilts his bullet head at acute angles, his agonising face screwed into an open wound, he wields his Telecaster like a chain saw. His magnetism is totally original - more like an Olympic strong man imploding all his energy into a final record-breaking lift than anything seen on a rock'n'roll stage before., \nOff-stage, he's the Clash member with the lowest profile. \n\n--Caroline Coon\n\nStrummer died suddenly on 22 December 2002 in his home at Broomfield in Somerset, the victim of an undiagnosed congenital heart defect. His estate was valued at just under £1 million, and he left all the money to his wife Lucinda. Strummer was cremated, and his ashes were given to his family. \nStrummer was instrumental in setting up Future Forests (since rechristened The Carbon Neutral Company), dedicated to planting trees in various parts of the world to combat global warming. Strummer was the first artist to make the recording, pressing and distribution of his records carbon neutral through the planting of trees. In his remembrance, Strummer's friends and family have established the Strummerville Foundation for the promotion of new music. The foundation also holds an annual festival with the same name. \nIn January 2003, The Clash were inducted into the Rock and Roll Hall of Fame. At the Grammy Awards in February 2003, \"London Calling\" was performed by Elvis Costello, Bruce Springsteen, Steven Van Zandt, Dave Grohl, Pete Thomas, and Tony Kanal in tribute to Strummer. Another tribute to Strummer occurred in the same month at the rock club Debaser in Stockholm, when some of Sweden's most famous rock musicians paid their tribute to Strummer by performing songs written by the Clash (the exception was Nicke Borg and Dregen from Backyard Babies, who performed \"I Fought the Law\", which the Clash had covered). At the end of the concert, the legendary Swedish punk band Ebba Grön reunited for the tribute, aided by Mick Jones on guitar. \nAt the time of his death, Strummer was working on another Mescaleros album, which was released posthumously in October 2003 under the title Streetcore. The album features a tribute to American music icon Johnny Cash; \"Long Shadow\", which was written for Cash to sing and recorded in Rick Rubin's garage, as well as a remembrance of the terrorist attacks on 11 September 2001 (\"Ramshackle Day Parade\"), and a cover of Bob Marley's \"Redemption Song\", which Strummer had also recorded as a duet with Cash. The Cash/Strummer duet version appears on the 2003 box set Unearthed. \n\nNovember 2003 saw the release of a video for \"Redemption Song\", directed by Josh Cheuse. The video features the painting of a memorial mural, by graffiti artist REVOLT, on the wall of the Niagara Bar in the East Village of New York City. \nOn 22 December 2003, a year after his death, a tribute show/benefit was held at Irving Plaza in NYC. Bands that played were: Ari Up; Clem Snide; The Detachment Kit; Dirty Mary; Hammel on Trial; Jesse Malin; New Blood Revival; The Realistics; Eugene Hütz; Radio 4; Secret Army; Ted Leo; Vic Thrill + The Saturn Missile. The show was videotaped by punkcast.com but is as yet unreleased. \nA documentary by Dick Rude titled Let's Rock Again! was released in 2004. The film, completed after Strummer's death, chronicles life on tour in the United States with the Mescaleros to support Global a Go-Go. The Belfast punk rock group Stiff Little Fingers also recorded a tribute song \"Strummerville\" on their album, Guitar and Drum. Al Barr, lead singer of the Boston punk band Dropkick Murphys, named his son Strummer in honour of Joe. German band Beatsteaks pay tribute to Strummer on their album Smack Smash with the song \"Hello Joe\". In 2004, German punk band Die Toten Hosen released an EP called \"Friss oder stirb\", which included a tribute song for Strummer called \"Goodbye Garageland\", which is a lyrical co-production with Matt Dangerfield from London's 77 punk band The Boys. Boston Punk Rock Band Street Dogs recorded a tribute song called \"The General's Boombox\" on their latest album State of Grace, and New Jersey's The Gaslight Anthem recorded the song \"I'da Called You Woody, Joe\" on their album Sink or Swim. Attila the Stockbroker's Barnstormer released \"Comandante Joe\" on their album Zero Tolerance. \nOn 12 February 2005, the Class 47 locomotive 47828 was named \"Joe Strummer\". The nameplates were unveiled by his widow Lucinda Tait in a ceremony at Bristol Temple Meads railway station. On 22 July 2005 Tait unveiled a plaque on the house in Pentonville, Newport where Strummer lived from 1973 to 1974 and where his first foray into recorded music, \"Crummy Bum Blues\" was recorded.That Was Clash Radio, a short story by Charles de Lint, was written in response to Strummer's death and features Strummer in a minor role. \nNew Orleans-based rockers Cowboy Mouth released a song called \"Joe Strummer\" on their album Voodoo Shoppe. The song tells the story of a man who had to break up with his girlfriend because \"...she didn't know who/Joe Strummer was.\" The popular track is a tongue-in-cheek salute to Strummer and The Clash that received significant radio play in 2006. In addition, the Joe Pernice-penned \"High As a Kite\", included on The Pernice Brothers 2006 album Live a Little, was, in part a tribute to Joe Strummer. Lyrics included, \"Heavy downbeat of one and the show began/London calling, strike up the contraband\" and the memorable opening to the chorus, \"We wore pictures of Strummer.\" A play by Paul Hodson called Meeting Joe Strummer premiered at the Edinburgh Festival in 2006, and toured the UK the following year. \nJoe Strummer: The Future Is Unwritten, a documentary film directed by Julien Temple about Strummer, premiered on 20 January 2007 at the 2007 Sundance Film Festival. In October 2007, a tribute and benefit concert in honour of Joe Strummer was held in Los Angeles featuring Love & Rockets, Zander Schloss, Hellride and many other artists. The event was filmed and then released in DVD format as Tribute Concert: Cast a Long Shadow by MVD Videos in December 2010. In conjunction with the Strummer estate, Fender released the Joe Strummer Tribute Telecaster, combining elements of Joe's main guitars, namely an attempt at the \"road worn\" finish of his 1966 Telecaster, which he used until his death. The first 1,500 guitars come with a Shepard Fairey designed \"Customization kit\" with stickers and stencils, which resemble some of the designs Strummer used on his guitars. Joe Strummer's impact is referenced by The Hold Steady in the song \"Constructive Summer\", a song featured on their 2008 album Stay Positive. In this song the band sings \"Raise a toast to Saint Joe Strummer. I think he might have been our only decent teacher.\" In November 2009, Tonara, a town in Sardinia, Italy, dedicated a street to Joe Strummer. \nOn 22 December 2010, CJAM 99.1 FM, a radio station in Windsor, Ontario, Canada, declared the eighth anniversary of his death \"Joe Strummer Day to confront poverty in Windsor-Detroit.\" For 24-hours, the station played nothing but Strummer-related music, wrapping the sounds around reports about poverty from North America's hardest hit economic region--Windsor-Detroit. CJAM (which is located near the banks of the Detroit River, a kilometre from downtown Detroit) and its board of directors have since officially decided to make it a yearly event, and is hosting its 5th Annual Joe Strummer Day on Dec. 22, 2014. \nIn January 2011 a motion was started to grant Strummer his own street in the Spanish city of Granada. \nOn 21 August 2012 and what would have been Strummer's 60th birthday, Hellcat Records released an exclusive 57 song digital download album titled Joe Strummer and The Mescaleros, The Hellcat Years. The album features Strummer's three Hellcat albums along with various b-sides and live songs including Strummer's 15 November 2002 concert which featured Mick Jones. Hellcat also announced that on 25 September 2012 they will re-release remastered versions of Strummer's three records he recorded for Hellcat on both CD and vinyl. and Strummer's 15 Nov. 2002 concert, Live at Acton Town Hall was released as well through Hellcat on 23 November 2012 as an exclusive limited to 2200 copies 2 LP vinyl for Record Store Day. In January 2013, Joe Strummer had a plaza named in his honour in the Spanish city of Granada. Placeta Joe Strummer is at N37.16892 W3.58771 (722m) on a junction between three narrow roads the Calle Vistillas de Los Angeles, the Cuesta Escoriaza and the Calle Paseo Palmas. About 650m south of the Alhambra. \nIn an October 2013 interview, Mick Jones confirmed that Strummer indeed had intentions of reforming the Clash and new music was even being written. In the months prior to Strummer's passing, Jones and Strummer got together to write new music. Jones said at the time he assumed the new songs would be used on albums with the Mescaleros. A few months following their work together, Jones ran into Strummer at an event and asked him what he intended to do with those songs. Strummer informed Jones that they were going to be used for the next Clash record. \n\nMarriages and relationships:\nIn 1975, after being offered £120, Strummer married Pamela Moolman, a South African citizen, so she could obtain British citizenship. He bought his signature Fender Telecaster, later painted black, with the money. In 1978, Strummer started a relationship with Gaby Salter shortly after her 17th birthday. The couple remained together for 14 years and had two daughters, Jazz and Lola, but did not marry as Strummer had been unable to locate and divorce Moolman. During his relationship with Salter, he had multiple affairs spanning the 1980s. \nIn 1993, Strummer began an affair with Lucinda Tait, which finally ended his relationship with Gaby Salter. Strummer and Tait married in 1995 and remained so until his death in 2002 from a heart arrhythmia. Strummer is commonly believed to have been Lily Allen's godfather. Although this is not true, Strummer and his family were close friends of the Allens and would regularly attend the Glastonbury Festival together. Lily Allen has recalled how Strummer had a paternal attitude towards her as an adolescent, accompanying her for two days when she went to meet some friends at the festival. \n\nDocumentaries:\nLet's Rock Again! is a one-hour music documentary, directed by Dick Rude, that follows Strummer as he tours in America and Japan with The Mescaleros. It premiered at the Tribeca Film Festival in New York, May 2004. \nRedemption Song: The Ballad of Joe Strummer is a 2006 biography of Strummer by Chris Salewicz. \nJoe Strummer: The Future Is Unwritten is a documentary about Joe Strummer by Julien Temple. It comprises archive footage of him spanning his life, and interviews with friends, family, and other celebrities. It debuted at the 2007 Sundance Film Festival. \nLet Fury Have the Hour is a documentary about Strummer's politics. It was made by Antonino D'Ambrosio based on his book of the same name. Wayne Kramer composed the score. The movie debuted at the 2012 Tribeca Film Festival. \n\nMusical equipment:\n\nStrummer's main guitar throughout his career was a 1966 Fender Telecaster that originally came in a three-colour sunburst with a white pickguard. Strummer acquired the guitar in middle of 1975 while playing with the 101ers. After joining the Clash, the guitar's body and pickguard were refinished in grey auto primer and then painted black. By 1979, the word NOISE was stenciled on the upper part of the body, a rasta flag sticker was placed at the horn of the pickguard, and an \"Ignore Alien Orders\" sticker was placed above the bridge. By the release of Give 'Em Enough Rope, the guitar was fitted with a bridge with individual saddles and the original Kluson tuners were replaced with later model tuners and a large question mark was spraypainted on its back. \nThe guitar would remain in this configuration throughout his career with the addition of stickers on its body. The guitar's black paint became worn down due to Strummer's playing and on many places the original sunburst finish and bare wood shines through, except for the square where Strummer taped his setlists. In 2012 modern artist Karl Haglund paid tribute to this guitar in one of his iconic guitar paintings. The Fender Custom Shop has created a Joe Strummer tribute Telecaster with a reliced flat black finish. \nStrummer was naturally left-handed, but learned to play guitar right-handed, taught by his close friend Tymon Dogg who still has the original guitar (painted blue) that Joe learned on. Strummer had reckoned his left-handedness on a right-hand guitar as a drawback and claimed it caused him to be underdeveloped as a guitarist, although his style of playing was unique. \nHe also used three Fender Esquire models, one from 1952, a white blonde with slab fretboard from the mid-1950s and another from early to mid-1960s with a white pick guard and rosewood fingerboard. The Esquire is a one-pickup version of the Telecaster. Prior to using any Telecaster oriented guitar, before buying his 1966 model, he used as main guitars a Gretsch White Falcon and a Hofner. For amplification Strummer was known to use amplifiers such as a Roland Jazz Chorus, a Selmer Bassman while he was in the 101ers, a Vox AC30 and various Marshall amplifiers, but his main amplifier was a Music Man HD 212,150. Strummer commented on his choice of amplifier with \"I don't have time to search for those old Fender tube amps. The Music Man is the closest thing to that sound I've found\" and that the \"plastic motif on the front is repulsive.\" \n\nMural in New York City:\nIn 2013 the mural of Joe Strummer outside Niagara bar on the East Village of Manhattan, New York City was destroyed due to construction. On 19 September 2013, a new mural was unveiled. The unveiling was accompanied by a large celebration, attended by Mick Jones.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1952",
      "country": null,
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": null,
      "formed_year": "1952",
      "gender": null,
      "genre": null,
      "id": "119065",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "http://r2.theaudiodb.com/images/media/artist/thumb/strummer-joe-5cedd7ef80c91.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/8d7yk71667608246.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": null,
      "mood": null,
      "music_videos": null,
      "musicbrainz_id": "af4ea2a3-c54d-40b4-8120-a1f0b838ad54",
      "name": "Joe Strummer",
      "raw_data": {},
      "style": null,
      "twitter": null,
      "website": null
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages211/v4/66/a5/f5/66a5f549-c1cf-71a8-e8bc-0450cc8fc72c/36f059b7-25b9-47c9-a3e6-dd28ca84a8c6_ami-identity-94606bec1f6e6c5b24d9ab4e6ba651c2-2024-07-03T04-37-51.123Z_cropped.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "2929326",
      "name": "Joe Strummer",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/joe-strummer/2929326"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "56830",
      "images": [
        {
          "height": 623,
          "resource_url": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/6L_QExI9Ap7eZE16wAsZbevJ_HyuzoL_tGDnI48pRPM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 359,
          "resource_url": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/9siMh4Qw4sH0gjXBmKm9mBTgzXmlGuU36FE0gY9nVOs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
          "width": 500
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/7tLZMZwdaVE45CmDF5NNFkncp3dPLll12tr0jPxmGCY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/y5eS6y9JOmtzjAuBcj39TDOh-R3Me-4OWTX6ZRLJpAA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
          "width": 487
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/RlIFNMjR6Wm5pM7rfZGMX5EeCAbFzNuN12AfKNKZYTs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
          "width": 380
        },
        {
          "height": 420,
          "resource_url": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/V8kNIqjXRfZoXpf9qwRxTvFe-6T4ADOGm6SF5pWbhLo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
          "width": 280
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/vZlcfPnHGGUtZB71jCv1NEJOjy7KWiFX7zB-yt3k4Bk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
          "width": 450
        },
        {
          "height": 354,
          "resource_url": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/GglJqE4xxqn1V87mPSlx2JeOO8PmRQgAPjFbhKesWW4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
          "width": 219
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/qLJquCUEZF2JUMDXIfwKah6Ph-fHph6eF9_qPNrDRWQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 402,
          "resource_url": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/QbWfBdUada-FDBBIZ-_gfIwvMKx61XS4bWSIRpWzgqk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 750,
          "resource_url": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/TdAIYNdwEULa28xiEAyN8AA_ofn29OSpn7kNy9pahtI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 750,
          "resource_url": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/NOBXcEvT9LN1e_KfIUnhvDEDaqt-ZTH3_fmozsEjhD4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/hXEZkoC_ugYL19KCzU_22v6dz4DrJaPmZekAAGbithk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/D_x4Fyp-Z0zBcz-nzwkcTBQLnSdnM_dpmgvA0ih3VPQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 414,
          "resource_url": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/4NnALjVu1eADvCS4Ukskw6_gi-As2FXmpTxaBnz8XQ8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 420,
          "resource_url": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/e0LU9nmx6VDsRJ_t3QyId_3g_KZIvHTLI6jgWwcJdmE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "Joe Strummer",
      "namevariations": [
        "J Strummer",
        "J Stummer",
        "J. Strummer",
        "J. Summer",
        "J.Strummer",
        "Joe",
        "Joe-Strummer",
        "Joe. Strummer",
        "Mellor",
        "Strumer",
        "Strummer",
        "Strummer J",
        "Stummer",
        "ジョー・ストラマー"
      ],
      "profile": "Songwriter, vocalist, guitarist and co-founder of [a=The 101'ers]  and [a=The Clash]. He later formed [a=Joe Strummer & The Mescaleros] and [a=Joe Strummer & The Latino Rockabilly War]. Spanish [l84559] label founder with [a519954] in Granada.\r\n\r\nBorn: Ankara, Turkey August 21, 1952. \r\nDied: Broomfield, Somerset, England December 22, 2002 (congenital heart failure).",
      "raw_data": {
        "aliases": [
          {
            "id": 782160,
            "name": "John Mellor",
            "resource_url": "https://api.discogs.com/artists/782160",
            "thumbnail_url": "https://i.discogs.com/hi7G5ko1VgS_2jgowIR0hWTgp5T3SJ_xC8CU8hG1yKI/rs:fit/g:sm/q:40/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTc4MjE2/MC0xMTk2Mzg2ODk2/LmpwZWc.jpeg"
          },
          {
            "id": 796747,
            "name": "Jimmy Jazz (3)",
            "resource_url": "https://api.discogs.com/artists/796747",
            "thumbnail_url": "https://i.discogs.com/dsIYaH3bpwIGoXKlMwGbvTA3Podcjashh2KCyP6hTuo/rs:fit/g:sm/q:40/h:398/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTc5Njc0/Ny0xMTk4Nzg4ODA5/LmpwZWc.jpeg"
          },
          {
            "id": 1672273,
            "name": "Albert Transom",
            "resource_url": "https://api.discogs.com/artists/1672273",
            "thumbnail_url": "https://i.discogs.com/zEsVxznzBeVVd1BB4_M2s9e9y2f8LEcnxf3ttluKAQc/rs:fit/g:sm/q:40/h:599/w:577/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE2NzIy/NzMtMTc0MjI0OTc1/NC00MDIxLmpwZWc.jpeg"
          }
        ],
        "data_quality": "Correct",
        "id": 56830,
        "images": [
          {
            "height": 623,
            "resource_url": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/pgODBsq6ojm_UJojMzctW3daG4VcRsFUxMxz2MBiGWg/rs:fit/g:sm/q:90/h:623/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/6L_QExI9Ap7eZE16wAsZbevJ_HyuzoL_tGDnI48pRPM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 359,
            "resource_url": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/s-us221WOWz84GWr0pPNt4lVIhIi8Ngk8aJ1-lVau7o/rs:fit/g:sm/q:90/h:359/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/9siMh4Qw4sH0gjXBmKm9mBTgzXmlGuU36FE0gY9nVOs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE2NjI2MTE5MzIt/NTU3OS5qcGVn.jpeg",
            "width": 500
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/hZ92TaBPM25sLSnx1brlEV8-ZYFXYrBjv_3D2yKajHY/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/7tLZMZwdaVE45CmDF5NNFkncp3dPLll12tr0jPxmGCY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE1NDk4MzIyMTEt/Nzc4My5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/5EZNanN4XbC9_znzoyNK9JcG_KumnMsAwvqY0RF-weU/rs:fit/g:sm/q:90/h:600/w:487/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/y5eS6y9JOmtzjAuBcj39TDOh-R3Me-4OWTX6ZRLJpAA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEyNjc4MzI1NTUu/anBlZw.jpeg",
            "width": 487
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/2RBToMHvQOw8uGAwa9T5cVueXCGtz2UR234mHgtFpB0/rs:fit/g:sm/q:90/h:300/w:380/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/RlIFNMjR6Wm5pM7rfZGMX5EeCAbFzNuN12AfKNKZYTs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5Mzk5NzUu/anBlZw.jpeg",
            "width": 380
          },
          {
            "height": 420,
            "resource_url": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/_R87jaYDD3l_6km9yFLrZ6HRgTbhMlI9sCuypZFx7h4/rs:fit/g:sm/q:90/h:420/w:280/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/V8kNIqjXRfZoXpf9qwRxTvFe-6T4ADOGm6SF5pWbhLo/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDAyNjcu/anBlZw.jpeg",
            "width": 280
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/M0djy1gCKiLsHepgX2hH7q_OvyZ947zHGtLjVbQIacc/rs:fit/g:sm/q:90/h:300/w:450/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/vZlcfPnHGGUtZB71jCv1NEJOjy7KWiFX7zB-yt3k4Bk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMjk5NDA0MDcu/anBlZw.jpeg",
            "width": 450
          },
          {
            "height": 354,
            "resource_url": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/KGMhmdXvJeGR-AUO04nYfzKLW6qUi9gOSouxRwLzZ3I/rs:fit/g:sm/q:90/h:354/w:219/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/GglJqE4xxqn1V87mPSlx2JeOO8PmRQgAPjFbhKesWW4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTExMzI2MTcwNDgu/anBlZw.jpeg",
            "width": 219
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/faEW4U7szVDojPqNpCTuHvF3WLF7glsKW2guBQOMo0s/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/qLJquCUEZF2JUMDXIfwKah6Ph-fHph6eF9_qPNrDRWQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyMjMt/Njg1My5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 402,
            "resource_url": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/PL4OcqMXDouMoKEszIE9tnP-jbr-3ld1oWxTkrzrF5M/rs:fit/g:sm/q:90/h:402/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/QbWfBdUada-FDBBIZ-_gfIwvMKx61XS4bWSIRpWzgqk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYyNzIt/MzQ0NS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 750,
            "resource_url": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/i3VV7PglsscXSI45t7hoC__gf4-AsgR3EAf96D_lTuE/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/TdAIYNdwEULa28xiEAyN8AA_ofn29OSpn7kNy9pahtI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzMTQt/NDkyMi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 750,
            "resource_url": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/ns9MC5-LUU-h6Pn6zRL5kZ2pddbnMhl-caUYslFvmNc/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/NOBXcEvT9LN1e_KfIUnhvDEDaqt-ZTH3_fmozsEjhD4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzYzODUt/MzQ1OC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/TwL6fLPHkv_aPWkEPEg69fvY06pX7x0fuTzXOA7WB0E/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/hXEZkoC_ugYL19KCzU_22v6dz4DrJaPmZekAAGbithk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0MTct/MTg2NC5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/vJXERvFV3eESfMQXUOGhov0xalBMJNQeF2fS0_PObkQ/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/D_x4Fyp-Z0zBcz-nzwkcTBQLnSdnM_dpmgvA0ih3VPQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0NTQt/NTAyNy5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 414,
            "resource_url": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/pfcqxfaSN68GqDQM9mU-SMiucXMLhgW4aCdm61qTENg/rs:fit/g:sm/q:90/h:414/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/4NnALjVu1eADvCS4Ukskw6_gi-As2FXmpTxaBnz8XQ8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY0OTkt/NjQyMi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 420,
            "resource_url": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/ca2n_jhLNDEKp2Lz4gt6xfmpIzvKi-Of56Gh3WuiUs4/rs:fit/g:sm/q:90/h:420/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/e0LU9nmx6VDsRJ_t3QyId_3g_KZIvHTLI6jgWwcJdmE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTE0ODkwMzY1MzEt/NjQ4OS5qcGVn.jpeg",
            "width": 600
          }
        ],
        "name": "Joe Strummer",
        "namevariations": [
          "J Strummer",
          "J Stummer",
          "J. Strummer",
          "J. Summer",
          "J.Strummer",
          "Joe",
          "Joe-Strummer",
          "Joe. Strummer",
          "Mellor",
          "Strumer",
          "Strummer",
          "Strummer J",
          "Stummer",
          "ジョー・ストラマー"
        ],
        "profile": "Songwriter, vocalist, guitarist and co-founder of [a=The 101'ers]  and [a=The Clash]. He later formed [a=Joe Strummer & The Mescaleros] and [a=Joe Strummer & The Latino Rockabilly War]. Spanish [l84559] label founder with [a519954] in Granada.\r\n\r\nBorn: Ankara, Turkey August 21, 1952. \r\nDied: Broomfield, Somerset, England December 22, 2002 (congenital heart failure).",
        "realname": "John Graham Mellor",
        "releases_url": "https://api.discogs.com/artists/56830/releases",
        "resource_url": "https://api.discogs.com/artists/56830",
        "uri": "https://www.discogs.com/artist/56830-Joe-Strummer",
        "urls": [
          "https://www.joestrummer.com",
          "https://en.wikipedia.org/wiki/Joe_Strummer",
          "https://www.facebook.com/JoeStrummerOfficial",
          "https://www.instagram.com/joestrummerofficial",
          "https://twitter.com/joestrummer",
          "https://www.youtube.com/channel/UCr1-wWOgjfQaFM_zFHkZtJA"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/56830",
      "thumb": "https://i.discogs.com/6L_QExI9Ap7eZE16wAsZbevJ_HyuzoL_tGDnI48pRPM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU2ODMw/LTEzOTU2NTIzMzYt/ODI0Ni5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/56830-Joe-Strummer",
      "urls": [
        "https://www.joestrummer.com",
        "https://en.wikipedia.org/wiki/Joe_Strummer",
        "https://www.facebook.com/JoeStrummerOfficial",
        "https://www.instagram.com/joestrummerofficial",
        "https://twitter.com/joestrummer",
        "https://www.youtube.com/channel/UCr1-wWOgjfQaFM_zFHkZtJA"
      ]
    },
    "lastfm": {
      "bio_content": "John Graham Mellor (21 August 1952 – 22 December 2002), better known by his stage name Joe Strummer, was the co-founder, lyricist, rhythm guitarist and lead singer of the English punk rock band The Clash. He was also a member of the The 101'ers and Joe Strummer and The Mescaleros.\n\nFollowing the end of the Clash, Joe spent a period moving from project to project. He acted in films like Walker and Straight to Hell, and OF COURSE his most unforgettable role as the awesome Johnny aka Elvis in the Jim Jarmusch masterpiece, \"Mystery Train.\"  He even sang for The Pogues after Shane MacGowan bizarrely quit/was sacked on the Hell's Ditch tour.\n\nFinally, in the mid-to-late 1990s, Strummer gathered top-flight musicians into a backing band he called The Mescaleros. Strummer and the band signed with the Californian punk label Hellcat Records, and issued a stunning album in 1999, which was co-written with Anthony Genn, called Rock Art and the X-Ray Style. A tour of England and North America soon followed; sets included several Clash fan favourites. In 2001 the band released their second album, \"Global A Go-Go\". The album was supported with a 21-date tour of North America, Britain, and Ireland. Once again, these concerts featured Clash material (\"London Calling\", \"Rudie Can't Fail,\" \"White Man in Hammersmith Palais\"), as well as classic covers of reggae hits (\"The Harder They Come\", \"A Message To You, Rudie\") and the band regularly closed the show with a nod to the late Joey Ramone by playing The Ramones' \"Blitzkrieg Bop\".\n <a href=\"https://www.last.fm/music/Joe+Strummer\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "John Graham Mellor (21 August 1952 – 22 December 2002), better known by his stage name Joe Strummer, was the co-founder, lyricist, rhythm guitarist and lead singer of the English punk rock band The Clash. He was also a member of the The 101'ers and Joe Strummer and The Mescaleros.\n\nFollowing the end of the Clash, Joe spent a period moving from project to project. He acted in films like Walker and Straight to Hell, and OF COURSE his most unforgettable role as the awesome Johnny aka Elvis in the Jim Jarmusch masterpiece, \"Mystery Train. <a href=\"https://www.last.fm/music/Joe+Strummer\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 200420,
      "mbid": "af4ea2a3-c54d-40b4-8120-a1f0b838ad54",
      "name": "Joe Strummer",
      "playcount": 1927006,
      "similar_artists": [
        {
          "name": "Joe Strummer and the Mescaleros",
          "url": "https://www.last.fm/music/Joe+Strummer+and+the+Mescaleros"
        },
        {
          "name": "The Clash",
          "url": "https://www.last.fm/music/The+Clash"
        },
        {
          "name": "Johnny Thunders",
          "url": "https://www.last.fm/music/Johnny+Thunders"
        },
        {
          "name": "Patti Smith",
          "url": "https://www.last.fm/music/Patti+Smith"
        },
        {
          "name": "The Gaslight Anthem",
          "url": "https://www.last.fm/music/The+Gaslight+Anthem"
        }
      ],
      "tags": [
        "punk",
        "rock",
        "alternative",
        "singer-songwriter",
        "punk rock"
      ],
      "url": "https://www.last.fm/music/Joe+Strummer"
    },
    "spotify": {
      "followers": 106600,
      "genres": [],
      "id": "2A09V0kHlETOFfT8Hz8oba",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5ebb9586ddeb23977ba7d47e037",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174b9586ddeb23977ba7d47e037",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178b9586ddeb23977ba7d47e037",
          "width": 160
        }
      ],
      "name": "Joe Strummer",
      "popularity": 45,
      "url": "https://open.spotify.com/artist/2A09V0kHlETOFfT8Hz8oba"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": null,
      "biography_de": null,
      "biography_en": "John Graham Mellor (21 August 1952 - 22 December 2002), best remembered by his stage name Joe Strummer, was a British musician, singer, actor and songwriter who was the co-founder, lyricist, rhythm guitarist and lead vocalist of the punk rock band The Clash, a band that formed in 1976 as part of the original wave of British punk. Along with punk, their music incorporated elements of reggae, ska, dub, funk, rap, and rockabilly. The Clash were one of the most prominent of the emerging bands in the UK punk rock scene, their second album, Give 'Em Enough Rope (1978) reaching number 2 on the UK charts. Soon after, they began achieving success in the US, starting with London Calling (1979), and peaking with 1982's Combat Rock, reaching number 7 on the US charts and being certified 2x platinum there. The Clash's politicised lyrics, musical experimentation, and rebellious attitude had a far-reaching influence on rock, alternative rock in particular. \nHis musical experience included his membership of The 101ers, Latino Rockabilly War, The Mescaleros and The Pogues, in addition to his own solo music career. Strummer's work as a musician allowed him to explore other interests, which included acting, creating film scores for television and movies, songwriting, radio broadcasting, and a position as a radio host. Strummer is one of the iconic figures of the British punk movement. \nStrummer and The Clash were inducted into the Rock and Roll Hall of Fame in January 2003. In his remembrance, Strummer's friends and family have established the Strummerville Foundation for the promotion of new music, and each year there are many festivals and both organised and spontaneous ceremonies worldwide to celebrate his memory. \n\nBiography and career:\n\nThe early years (1952-1976):\nStrummer was born John Graham Mellor in Ankara, Turkey on 21 August 1952. His mother, Anna Mackenzie, a crofter's daughter born and raised in Bonar Bridge in the Scottish Highlands, was a nurse. His father, Ronald Mellor, was a British foreign service diplomat born in Lucknow, India. Ronald Mellor had an Armenian maternal grandfather and a German Jewish paternal grandmother. The family spent much time moving from place to place, and Strummer spent parts of his early childhood in Cairo, Mexico City, and Bonn. At the age of 9, Strummer and his older brother David, 10, began boarding at the City of London Freemen's School in Surrey. Strummer rarely saw his parents during the next seven years. \n\nAt the age of nine I had to say good-bye to them because they went abroad to Africa or something. I went to boarding school and only saw them once a year after that - the Government paid for me to see my parents once a year. I was left on my own, and went to this school where thick rich people sent their thick rich kids. Another perk of my father's job - it was a job with a lot of perks - all the fees were paid by the Government. \n--Joe Strummer\n\nHe developed a love of rock music listening to records by Little Richard and The Beach Boys as well as American folk-singer Woody Guthrie. (Strummer would even go by the nickname \"Woody\" for a few years). Strummer would later say that \"the reason he played music was the Beach Boys.\" \n\nDavid was a year older than me. Funnily enough, you know, he was a Nazi. He was a member of the National Front. He was into the occult and he used to have these deaths-heads and cross-bones all over everything. He didn't like to talk to anybody, and I think suicide was the only way out for him. What else could he have done? \n\n--Joe Strummer\n\nBy 1970 his brother David had become estranged from his family and had joined the National Front. His suicide in July profoundly affected Strummer, as did having to identify his body after it had lain undiscovered for three days. After finishing his time at City of London Freemen's School, Ashtead Park, Surrey, in 1970, Strummer moved on to the Central School of Art and Design in London, where he briefly flirted with the idea of becoming a professional cartoonist, but ultimately completed a foundations course. During this time, Mellor shared a flat in the north London suburb of Palmers Green with friends Clive Timperley and Tymon Dogg. In 1971 Strummer became a vegetarian and remained one until his death. In April 1972 Strummer attended as a fan the Bickershaw Festival in Lancashire, a three day event which was attended by many London counter culture figures and underground magazines. Strummer said in 1999 that Don Van Vliet's ( Captain Beefheart's) performance at the 1972 Bickershaw Festival was the best concert he had ever attended. \n\nI bought a ukulele. No kidding. I saved some money, £1.99 I think, and bought it down Shaftesbury Avenue. Then the guy I was busking with taught me to play Johnny Be Good. ... I was on my own for the first time with this ukulele and Johnny Be Good. And that's how I started. \n\n--Joe Strummer\n\nIn 1973 Strummer moved to Newport, Wales. He did not study at Newport College of Art but met up with college musicians in the Students' Union in Stow Hill and became vocalist for Flaming Youth, renaming the band The Vultures. The Vultures included three former members of Rip Off Park Rock & Roll Allstars, the original college band co-founded by Terry Earl Taylor. For the next year he was the band's part-time singer and rhythm guitarist. During this time Strummer also worked as a gravedigger in St Woolos Cemetery. In 1974, the band fell apart and he moved back to London where he met up again with Tymon Dogg. He did street performance for a while and then decided to form another band with his West London roommates. The band was called The 101'ers, named after the address of their squat (101 Walterton Road, in Maida Vale). \nThe band played many gigs in London pubs, playing covers of popular American R&B and blues songs. In 1975 he stopped calling himself \"Woody\" Mellor and adopted the stage name of Joe Strummer, and insisted that his friends call him by that name. The name \"Strummer\" apparently referred to his role as rhythm guitarist, in a rather self-deprecating way. Though left-handed, he was taught to play right-handed by his friend Tymon Dogg. Strummer was the lead singer of the 101'ers and began to write original songs for the group. One song he wrote was inspired by his girlfriend at the time, Slits drummer Palmolive. The group liked the song \"Keys to Your Heart\", and picked it as their first single. \n\nThe Clash (1976-1986):\nOn 3 April 1976, a then-unknown Sex Pistols opened for The 101'ers at a venue called The Nashville Rooms in London, and Strummer was impressed by them. Sometime after the show, Strummer was approached by Bernie Rhodes and Mick Jones. Jones was from the band London SS and wanted Strummer to join as lead singer. Strummer agreed to leave the 101'ers and join Jones, bassist Paul Simonon, drummer Terry Chimes and guitarist Keith Levene. The band was named The Clash by Simonon and made their debut on 4 July 1976, opening for the Sex Pistols at The Black Swan (a.k.a. The Mucky Duck, now known as the Boardwalk Sheffield, England). On 25 January 1977, the band signed with CBS Records and was now a three-piece after Levene was fired from the band and Chimes quit. Drummer Topper Headon later became the band's full-time drummer. \nAt the band's induction into the Rock and Roll Hall of Fame, the Clash was said to be \"considered one of the most overtly political, explosive and exciting bands in rock and roll history\". Their songs tackled social decay, unemployment, racism, police brutality, political and social repression, and militarism in detail. Strummer was involved with the Anti-Nazi League and Rock Against Racism campaigns. He later also gave his support to the Rock Against the Rich series of concerts organised by the anarchist organisation Class War. The Clash's London Calling album was voted best album of the 1980s by Rolling Stone magazine (although it was released in late 1979 in the UK; it was released in 1980 in the USA). \nDuring his time with The Clash, Strummer, along with his bandmates, became notorious for getting in trouble with the law. On 10 June 1977, he and Headon were arrested for spray-painting \"The Clash\" on a wall in a hotel. On 20 May 1980, he was arrested for hitting a violent member of the audience with his guitar during a performance in Hamburg, Germany. This incident shocked Strummer, and had a lasting personal impact on him. \n\" \nI nearly murdered somebody, and it made me realise that you can't face violence with violence. It doesn't work. \n\" \n\n--Joe Strummer \n\nBefore the album Combat Rock was released in 1982, Strummer wilfully went into hiding and band management represented that he had \"disappeared\". Bernie Rhodes, the band's manager, pressured Joe to do so because tickets were selling slowly for the Scottish leg of an upcoming tour. It was planned for Strummer to travel to Texas in secret and stay with his friend, musician Joe Ely. However, Strummer, uneasy with his decision, decided to genuinely disappear and \"dicked around\" in France. During this time, Strummer ran the Paris Marathon in April 1982. He claimed his training regime consisted of 10 pints of beer the night before the race. For this period of time, Joe's whereabouts were not only a mystery to the public, but the band's management as well. Joe later said this was a huge mistake and you \"have to have some regrets\". This was in spite of the popular success of the single \"Rock the Casbah\". During this time band members began to argue a lot, and with tensions high, the group began to fall apart. \nIn September 1983, Strummer issued the infamous \"Clash Communique\", and fired Mick Jones. Headon had earlier been kicked out of the band because of his heroin addiction, and replaced with drummer Pete Howard. This left the band with only two of its original members. Rhodes persuaded Strummer to carry on and added new members. \"The Clash Mark Two\" released the album Cut the Crap in 1985. The album was panned by fans and critics alike and Strummer disbanded The Clash. The disintegration of the band and the reasons behind the break-up are the subject matter of Danny Garcia's 2012/3 book and documentary, The Rise and Fall of the Clash. \n\nSolo career and soundtrack work (1986-1999):\n\nA year later, Strummer worked on several songs for the 1986 film Sid and Nancy, including \"Love Kills\" and \"Dum Dum Club\". Strummer also later worked with Mick Jones and his band Big Audio Dynamite, contributing to the band's second studio album by co-writing most of the songs as well as producing the album along with Jones. In 1987, he played a small part in the film Walker, directed by Alex Cox, as a character named \"Faucet\" and wrote and performed on the film's soundtrack. \nHe starred in another Cox film that same year called Straight to Hell, as the character Simms. Straight to Hell also featured London-Irish folk/punk band The Pogues - both as actors and major contributors to the soundtrack. Strummer joined The Pogues for a tour in 1987/88, filling in for ailing guitarist Philip Chevron, who wrote (in May 2008) on the band's online forum: \"When I was sick in late 1987, I taught Joe all the guitar parts in an afternoon and he was on tour in the USA as deputy guitarist the next day. Joe wrote all the tabs in his meticulously neat hand on a long piece of paper which he taped to the top of the guitar so he could glance down occasionally when he was onstage.\" This tour would be the first of several collaborations with the band. \nIn 1989, Strummer played a substantial role in Jim Jarmusch's film Mystery Train, as a drunken, short-tempered drifter named Johnny (whom most characters refer to as Elvis, much to Johnny's dismay). He also made a brief appearance in Aki Kaurismäki's 1990 film I Hired a Contract Killer as a guitarist in a pub, performing two songs (\"Burning Lights\" and \"Afro-Cuban Bebop\"). These were released as a promotional 7-inch single limited to a few hundred copies, credited to \"Joe Strummer & the Astro Physicians\". The \"Astro Physicians\" were in fact The Pogues (\"Afro-Cuban Bebop\" got a re-release on The Pogues' 2008 box set). During this time Strummer continued to act, write and produce soundtracks for various films, most notably the soundtrack for Grosse Pointe Blank (1997). While the group started to formulate its roots in the year 1986, Strummer began actually producing solo records with a band called The Latino Rockabilly War in 1989. The album Earthquake Weather was a critical and commercial flop, and resulted in the loss of his contract with Sony Records. \nHe also did the soundtrack to the movie Permanent Record with this band. Strummer was asked by The Pogues, who were fracturing as a band, to help them produce their next album, released in 1990 as Hell's Ditch. In 1991, he replaced Shane MacGowan as singer of The Pogues for a tour after MacGowan's departure from the band. One night of this tour was professionally recorded, and three tracks (\"I Fought the Law\", \"London Calling\", and \"Turkish Song of the Damned\") have seen release as b-sides and again on The Pogues' 2008 box set. On 16 April 1994, Strummer joined Czech-American band Dirty Pictures on stage in Prague at the Repre Club in Obecni Dum at \"Rock for Refugees\", a benefit concert for people left displaced by the war in Bosnia. Backed up by the Pictures, Strummer played a blistering set of Clash songs that he said he had not played in more than ten years. Although the set appeared impromptu, Strummer and the band had spent the days leading up to the event rehearsing and \"hanging out\" in Prague. The show began with \"London Calling\" and without pause went into \"Brand New Cadillac\". In the middle of the song, the power went out. \nOnce the power was back on, Strummer asked the audience whether or not they would mind if the band started over. They then began again with \"London Calling\" and continued on for another half-hour. After these self-described \"wilderness years\", Strummer began working with other bands; he played piano on the 1995 UK hit of The Levellers, \"Just the One\" and appeared on the Black Grape single \"England's Irie\" in 1996. In 1997, while in New York City, he had worked with noted producer and engineer Lee Perry on a significant amount of remixed Clash and 101'ers reissue dub material. In collaboration with percussionist Pablo Cook, Strummer wrote and performed the soundtrack to Tunnel of Love (Robert Wallace 1997) that was featured in the Cannes Film Festival in the same year. In 1998, he made a guest appearance on the animated television show, South Park and appeared on the album Chef Aid: The South Park Album featuring songs from and inspired by the series. \nAlso during this time, Strummer was in dispute with The Clash's record label, Epic Records. The disagreement lasted nearly eight years and ended with the label agreeing to let him record solo records with another label. If The Clash were to reunite though, they would have to record for Sony. During the nineties, Strummer was a DJ on the BBC World Service with his half-hour programme London Calling. Samples from the series provide the vocals for \"Midnight Jam\" on Joe Strummer and the Mescaleros' final album Streetcore. \n\nThe Mescaleros and other work (1999-2002):\nIn the mid-to-late 1990s, Strummer gathered top-flight musicians into a backing band he called The Mescaleros. Strummer and the band signed with Mercury Records, and released their first album in 1999, which was co-written with Antony Genn, called Rock Art and the X-Ray Style. A tour of England, Europe, and North America soon followed; sets included several Clash fan favourites. \n\" \nThis is my Indian summer...I learnt that fame is an illusion & everything about it is just a joke. I'm far more dangerous now, because I don't care at all. \n\" \n\n--Joe Strummer to Chris Salewicz - 2000 ,  \n\nIn 2001, the band signed with Californian punk label Hellcat Records and released their second studio album, Global a Go-Go. The album was supported with a 21-date tour of North America, Britain, and Ireland. Once again, these concerts featured Clash material (\"London's Burning\", \"Rudie Can't Fail\", \"(White Man) In Hammersmith Palais\"), as well as covers of reggae and ska hits (\"The Harder They Come\", \"A Message to You, Rudy\") and the band regularly closed the show by playing the Ramones' \"Blitzkrieg Bop\". He covered Bob Marley's \"Redemption Song\" with Johnny Cash. In the same year, somewhat out of character, Strummer and the Mescaleros performed the song \"Minstrel Boy\" for the film Black Hawk Down, a haunting and emotive Celtic tune that is played during the evacuation of PFC Todd Blackburn during the Battle of Mogadishu and again over the end credits. \n\nOn 15 November 2002, Strummer and The Mescaleros played a benefit show for striking fire fighters in London, at the Acton Town Hall. Mick Jones was in the audience, and joined the band on stage during the Clash's \"Bankrobber\". An encore followed with Jones playing guitar and singing on \"White Riot\" and \"London's Burning\". This performance marked the first time since 1983 that Strummer and Jones had performed together on stage. Jones later remarked that it was totally unplanned and that he felt compelled to join Strummer on stage. \nStrummer's final regular gig was at Liverpool Academy on 22 November 2002, yet his final performance, just two weeks before his death, was in a small club venue 'The Palace' in Bridgwater, Somerset near to his home. Shortly before his death, Strummer and U2's Bono co-wrote a song, \"46664\", for Nelson Mandela as part of a campaign against AIDS in Africa. Strummer had been scheduled to play at Mandela's SOS fundraising concert in February 2003 on Robben Island. Mick Jones later recorded a version of the song in studio, performing both the vocals and guitar work, that has yet to be formally released. \n\nDeath and legacy (2002-present):\n\nOn-stage Strummer wires himself up into an inhuman dynamo of sweaty, trembling flesh, fearful enough to have one wondering when the ambulance brigade will rush to his rescue with a straight-jacket. While he tilts his bullet head at acute angles, his agonising face screwed into an open wound, he wields his Telecaster like a chain saw. His magnetism is totally original - more like an Olympic strong man imploding all his energy into a final record-breaking lift than anything seen on a rock'n'roll stage before., \nOff-stage, he's the Clash member with the lowest profile. \n\n--Caroline Coon\n\nStrummer died suddenly on 22 December 2002 in his home at Broomfield in Somerset, the victim of an undiagnosed congenital heart defect. His estate was valued at just under £1 million, and he left all the money to his wife Lucinda. Strummer was cremated, and his ashes were given to his family. \nStrummer was instrumental in setting up Future Forests (since rechristened The Carbon Neutral Company), dedicated to planting trees in various parts of the world to combat global warming. Strummer was the first artist to make the recording, pressing and distribution of his records carbon neutral through the planting of trees. In his remembrance, Strummer's friends and family have established the Strummerville Foundation for the promotion of new music. The foundation also holds an annual festival with the same name. \nIn January 2003, The Clash were inducted into the Rock and Roll Hall of Fame. At the Grammy Awards in February 2003, \"London Calling\" was performed by Elvis Costello, Bruce Springsteen, Steven Van Zandt, Dave Grohl, Pete Thomas, and Tony Kanal in tribute to Strummer. Another tribute to Strummer occurred in the same month at the rock club Debaser in Stockholm, when some of Sweden's most famous rock musicians paid their tribute to Strummer by performing songs written by the Clash (the exception was Nicke Borg and Dregen from Backyard Babies, who performed \"I Fought the Law\", which the Clash had covered). At the end of the concert, the legendary Swedish punk band Ebba Grön reunited for the tribute, aided by Mick Jones on guitar. \nAt the time of his death, Strummer was working on another Mescaleros album, which was released posthumously in October 2003 under the title Streetcore. The album features a tribute to American music icon Johnny Cash; \"Long Shadow\", which was written for Cash to sing and recorded in Rick Rubin's garage, as well as a remembrance of the terrorist attacks on 11 September 2001 (\"Ramshackle Day Parade\"), and a cover of Bob Marley's \"Redemption Song\", which Strummer had also recorded as a duet with Cash. The Cash/Strummer duet version appears on the 2003 box set Unearthed. \n\nNovember 2003 saw the release of a video for \"Redemption Song\", directed by Josh Cheuse. The video features the painting of a memorial mural, by graffiti artist REVOLT, on the wall of the Niagara Bar in the East Village of New York City. \nOn 22 December 2003, a year after his death, a tribute show/benefit was held at Irving Plaza in NYC. Bands that played were: Ari Up; Clem Snide; The Detachment Kit; Dirty Mary; Hammel on Trial; Jesse Malin; New Blood Revival; The Realistics; Eugene Hütz; Radio 4; Secret Army; Ted Leo; Vic Thrill + The Saturn Missile. The show was videotaped by punkcast.com but is as yet unreleased. \nA documentary by Dick Rude titled Let's Rock Again! was released in 2004. The film, completed after Strummer's death, chronicles life on tour in the United States with the Mescaleros to support Global a Go-Go. The Belfast punk rock group Stiff Little Fingers also recorded a tribute song \"Strummerville\" on their album, Guitar and Drum. Al Barr, lead singer of the Boston punk band Dropkick Murphys, named his son Strummer in honour of Joe. German band Beatsteaks pay tribute to Strummer on their album Smack Smash with the song \"Hello Joe\". In 2004, German punk band Die Toten Hosen released an EP called \"Friss oder stirb\", which included a tribute song for Strummer called \"Goodbye Garageland\", which is a lyrical co-production with Matt Dangerfield from London's 77 punk band The Boys. Boston Punk Rock Band Street Dogs recorded a tribute song called \"The General's Boombox\" on their latest album State of Grace, and New Jersey's The Gaslight Anthem recorded the song \"I'da Called You Woody, Joe\" on their album Sink or Swim. Attila the Stockbroker's Barnstormer released \"Comandante Joe\" on their album Zero Tolerance. \nOn 12 February 2005, the Class 47 locomotive 47828 was named \"Joe Strummer\". The nameplates were unveiled by his widow Lucinda Tait in a ceremony at Bristol Temple Meads railway station. On 22 July 2005 Tait unveiled a plaque on the house in Pentonville, Newport where Strummer lived from 1973 to 1974 and where his first foray into recorded music, \"Crummy Bum Blues\" was recorded.That Was Clash Radio, a short story by Charles de Lint, was written in response to Strummer's death and features Strummer in a minor role. \nNew Orleans-based rockers Cowboy Mouth released a song called \"Joe Strummer\" on their album Voodoo Shoppe. The song tells the story of a man who had to break up with his girlfriend because \"...she didn't know who/Joe Strummer was.\" The popular track is a tongue-in-cheek salute to Strummer and The Clash that received significant radio play in 2006. In addition, the Joe Pernice-penned \"High As a Kite\", included on The Pernice Brothers 2006 album Live a Little, was, in part a tribute to Joe Strummer. Lyrics included, \"Heavy downbeat of one and the show began/London calling, strike up the contraband\" and the memorable opening to the chorus, \"We wore pictures of Strummer.\" A play by Paul Hodson called Meeting Joe Strummer premiered at the Edinburgh Festival in 2006, and toured the UK the following year. \nJoe Strummer: The Future Is Unwritten, a documentary film directed by Julien Temple about Strummer, premiered on 20 January 2007 at the 2007 Sundance Film Festival. In October 2007, a tribute and benefit concert in honour of Joe Strummer was held in Los Angeles featuring Love & Rockets, Zander Schloss, Hellride and many other artists. The event was filmed and then released in DVD format as Tribute Concert: Cast a Long Shadow by MVD Videos in December 2010. In conjunction with the Strummer estate, Fender released the Joe Strummer Tribute Telecaster, combining elements of Joe's main guitars, namely an attempt at the \"road worn\" finish of his 1966 Telecaster, which he used until his death. The first 1,500 guitars come with a Shepard Fairey designed \"Customization kit\" with stickers and stencils, which resemble some of the designs Strummer used on his guitars. Joe Strummer's impact is referenced by The Hold Steady in the song \"Constructive Summer\", a song featured on their 2008 album Stay Positive. In this song the band sings \"Raise a toast to Saint Joe Strummer. I think he might have been our only decent teacher.\" In November 2009, Tonara, a town in Sardinia, Italy, dedicated a street to Joe Strummer. \nOn 22 December 2010, CJAM 99.1 FM, a radio station in Windsor, Ontario, Canada, declared the eighth anniversary of his death \"Joe Strummer Day to confront poverty in Windsor-Detroit.\" For 24-hours, the station played nothing but Strummer-related music, wrapping the sounds around reports about poverty from North America's hardest hit economic region--Windsor-Detroit. CJAM (which is located near the banks of the Detroit River, a kilometre from downtown Detroit) and its board of directors have since officially decided to make it a yearly event, and is hosting its 5th Annual Joe Strummer Day on Dec. 22, 2014. \nIn January 2011 a motion was started to grant Strummer his own street in the Spanish city of Granada. \nOn 21 August 2012 and what would have been Strummer's 60th birthday, Hellcat Records released an exclusive 57 song digital download album titled Joe Strummer and The Mescaleros, The Hellcat Years. The album features Strummer's three Hellcat albums along with various b-sides and live songs including Strummer's 15 November 2002 concert which featured Mick Jones. Hellcat also announced that on 25 September 2012 they will re-release remastered versions of Strummer's three records he recorded for Hellcat on both CD and vinyl. and Strummer's 15 Nov. 2002 concert, Live at Acton Town Hall was released as well through Hellcat on 23 November 2012 as an exclusive limited to 2200 copies 2 LP vinyl for Record Store Day. In January 2013, Joe Strummer had a plaza named in his honour in the Spanish city of Granada. Placeta Joe Strummer is at N37.16892 W3.58771 (722m) on a junction between three narrow roads the Calle Vistillas de Los Angeles, the Cuesta Escoriaza and the Calle Paseo Palmas. About 650m south of the Alhambra. \nIn an October 2013 interview, Mick Jones confirmed that Strummer indeed had intentions of reforming the Clash and new music was even being written. In the months prior to Strummer's passing, Jones and Strummer got together to write new music. Jones said at the time he assumed the new songs would be used on albums with the Mescaleros. A few months following their work together, Jones ran into Strummer at an event and asked him what he intended to do with those songs. Strummer informed Jones that they were going to be used for the next Clash record. \n\nMarriages and relationships:\nIn 1975, after being offered £120, Strummer married Pamela Moolman, a South African citizen, so she could obtain British citizenship. He bought his signature Fender Telecaster, later painted black, with the money. In 1978, Strummer started a relationship with Gaby Salter shortly after her 17th birthday. The couple remained together for 14 years and had two daughters, Jazz and Lola, but did not marry as Strummer had been unable to locate and divorce Moolman. During his relationship with Salter, he had multiple affairs spanning the 1980s. \nIn 1993, Strummer began an affair with Lucinda Tait, which finally ended his relationship with Gaby Salter. Strummer and Tait married in 1995 and remained so until his death in 2002 from a heart arrhythmia. Strummer is commonly believed to have been Lily Allen's godfather. Although this is not true, Strummer and his family were close friends of the Allens and would regularly attend the Glastonbury Festival together. Lily Allen has recalled how Strummer had a paternal attitude towards her as an adolescent, accompanying her for two days when she went to meet some friends at the festival. \n\nDocumentaries:\nLet's Rock Again! is a one-hour music documentary, directed by Dick Rude, that follows Strummer as he tours in America and Japan with The Mescaleros. It premiered at the Tribeca Film Festival in New York, May 2004. \nRedemption Song: The Ballad of Joe Strummer is a 2006 biography of Strummer by Chris Salewicz. \nJoe Strummer: The Future Is Unwritten is a documentary about Joe Strummer by Julien Temple. It comprises archive footage of him spanning his life, and interviews with friends, family, and other celebrities. It debuted at the 2007 Sundance Film Festival. \nLet Fury Have the Hour is a documentary about Strummer's politics. It was made by Antonino D'Ambrosio based on his book of the same name. Wayne Kramer composed the score. The movie debuted at the 2012 Tribeca Film Festival. \n\nMusical equipment:\n\nStrummer's main guitar throughout his career was a 1966 Fender Telecaster that originally came in a three-colour sunburst with a white pickguard. Strummer acquired the guitar in middle of 1975 while playing with the 101ers. After joining the Clash, the guitar's body and pickguard were refinished in grey auto primer and then painted black. By 1979, the word NOISE was stenciled on the upper part of the body, a rasta flag sticker was placed at the horn of the pickguard, and an \"Ignore Alien Orders\" sticker was placed above the bridge. By the release of Give 'Em Enough Rope, the guitar was fitted with a bridge with individual saddles and the original Kluson tuners were replaced with later model tuners and a large question mark was spraypainted on its back. \nThe guitar would remain in this configuration throughout his career with the addition of stickers on its body. The guitar's black paint became worn down due to Strummer's playing and on many places the original sunburst finish and bare wood shines through, except for the square where Strummer taped his setlists. In 2012 modern artist Karl Haglund paid tribute to this guitar in one of his iconic guitar paintings. The Fender Custom Shop has created a Joe Strummer tribute Telecaster with a reliced flat black finish. \nStrummer was naturally left-handed, but learned to play guitar right-handed, taught by his close friend Tymon Dogg who still has the original guitar (painted blue) that Joe learned on. Strummer had reckoned his left-handedness on a right-hand guitar as a drawback and claimed it caused him to be underdeveloped as a guitarist, although his style of playing was unique. \nHe also used three Fender Esquire models, one from 1952, a white blonde with slab fretboard from the mid-1950s and another from early to mid-1960s with a white pick guard and rosewood fingerboard. The Esquire is a one-pickup version of the Telecaster. Prior to using any Telecaster oriented guitar, before buying his 1966 model, he used as main guitars a Gretsch White Falcon and a Hofner. For amplification Strummer was known to use amplifiers such as a Roland Jazz Chorus, a Selmer Bassman while he was in the 101ers, a Vox AC30 and various Marshall amplifiers, but his main amplifier was a Music Man HD 212,150. Strummer commented on his choice of amplifier with \"I don't have time to search for those old Fender tube amps. The Music Man is the closest thing to that sound I've found\" and that the \"plastic motif on the front is repulsive.\" \n\nMural in New York City:\nIn 2013 the mural of Joe Strummer outside Niagara bar on the East Village of Manhattan, New York City was destroyed due to construction. On 19 September 2013, a new mural was unveiled. The unveiling was accompanied by a large celebration, attended by Mick Jones.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1952",
      "country": null,
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": null,
      "formed_year": "1952",
      "gender": null,
      "genre": null,
      "id": "119065",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "http://r2.theaudiodb.com/images/media/artist/thumb/strummer-joe-5cedd7ef80c91.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/8d7yk71667608246.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": null,
      "mood": null,
      "music_videos": null,
      "musicbrainz_id": "af4ea2a3-c54d-40b4-8120-a1f0b838ad54",
      "name": "Joe Strummer",
      "raw_data": {},
      "style": null,
      "twitter": null,
      "website": null
    }
  },
  "spotify_id": "2A09V0kHlETOFfT8Hz8oba",
  "spotify_url": "https://open.spotify.com/artist/2A09V0kHlETOFfT8Hz8oba",
  "updated_at": "2025-07-08T20:50:07.501324",
  "wikipedia_url": null
}