{
  "apple_music_id": "1440852773",
  "apple_music_url": "https://music.apple.com/gb/album/tubular-bells/1440852773",
  "artists": [
    {
      "apple_music_id": "259271",
      "biography": "Mike Oldfield (born Michael Gordon Oldfield, 15 May 1953, Reading, Berkshire, England) is largely known for Tubular Bells, his groundbreaking album from 1973, the success of which also bankrolled Sir Richard Branson's Virgin Records, for which Tubular Bells was the inaugural release. However, his musical career has spread over more than 40 years encompassing a range of styles, with varying amounts of success. According to the Gibraltar Encyclopedia of Progressive Rock, his style is labeled as Oldfield Progressive.\n\nBefore Oldfield started his solo career, he formed a band with his sister Sally Oldfield in 1967 called The Sallyangie and at the start of the 70s played bass and guitar with Kevin Ayers and the Whole World, alongside Ayers, David Bedford and saxophonist Lol Coxhill. At this time Kevin Ayers lent Oldfield a multitrack tape recorder, and it was on this that Oldfield began to put together what would become Tubular Bells, although Branson at one point suggested \"Breakfast In Bed\" as a title.\n\nTubular Bells is considered to be the first rock album to incorporate elements of classical composition, particularly the use of repetition with subtle variations in the minimalist style as pioneered by composers such as Philip Glass, Steve Reich and LaMonte Young, although these influences were filtered through rock sensibilities. Oldfield also claimed to have been inspired by Kevin Ayers' observation that \"there was nothing wrong with repetition so long as it was something worth repeating\".\n\nEarly on in his search for a label, Oldfield encountered Branson who was in the early stages of setting up Virgin Records on top of his existing chain of record shops, but after many rejections over the following year, Oldfield returned to Branson, who agreed to release it as Virgin's inaugural release and allowed Oldfield to finish the album at his Manor recording studio. Oldfield was signed to a ten album contract that would have repercussions on his later career. The album's success took hold when John Peel played the entirety on his radio program on BBC radio, and an excerpt was licensed for use on the film The Exorcist, giving it some exposure in the US market.\n\nMike Oldfield's next few albums continued in the vein of Tubular Bells. Hergest Ridge was a more textured, pastoral work, though still with contrasting sections. It actually hit No 1 in the UK album charts in 1974 before its predecessor, which took over the slot, however in the long run it wasn't received nearly as well as Tubular Bells. An orchestral version of Tubular Bells was orchestrated by David Bedford and released. \n\nOmmadawn was released in 1975, and is considered by many of his fans to be Oldfield's best album. It took on Celtic and African music influences, ably assisted by The Chieftains' Paddy Moloney and the exiled South African drumming ensemble Jabula. \n\nAfter releasing this album, Oldfield had all three studio albums remixed for quadraphonic, with Hergest Ridge in particular being significantly altered to sound less \"cluttered\" this mix ended up as the default CD release on Oldfield's imprimatur. These mixes were released as Boxed, along with another LP entitled Collaborations which contained songs and compositions that Oldfield had recorded with David Bedford, Leslie Penning on recorder, and Chris Cutler on percussion. The selections included Portsmouth and In Dulci Jubilo.\n\nAfter \"Ommadawn\", Mike Oldfield took a break from recording and underwent Exegesis therapy sessions. Prior to this stage Oldfield had been quite reclusive (to the exasperation of his record company), having only performed Tubular Bells before a live audience once, though he also performed the first half for television on the BBC's \"Second House\" program. After the controversial therapy, his personality seemed to have dramatically changed and he was more confident, almost to the point of arrogance.\n\nIn 1978, he recorded his most ambitious album to that point, Incantations, which bears strong minimalist influences, and featured Maddy Prior from Steeleye Span on vocals, as well as the return of the Jabula drummers and a full string section. He followed this up with his first live tour of Europe, complete with a 50 piece band. The tour itself lost money, however the album documenting the tour, Exposed, was successful enough to recoup those losses.  \n\nBy this point his particular \"style\" was increasingly at odds with the fashions of the day, indeed he bristled at the idea of Branson signing The Sex Pistols to the label. Nevertheless, he changed his approach to begin to write more pop songs to placate Virgin's marketing department, as well as writing material that was more suitable for a \"small\" band. After the \"Exposed\" tour he continued to tour extensively, refining his act and pared his band back to a six-piece by the time of the QE2 tour. Around this time he also renegotiated his contract to obtain a better royalty rate, however it also extended his obligation from ten to thirteen albums.\n\n1979 saw the release of Platinum (repackaged with a different tracklisting as Airborne in some markets), the first album he'd recorded in the US, and contained arrangements of Philip Glass's North Star, amongst his usual side-length instrumental, and George Gershwin's I Got Rhythm, sung by Wendy Roberts. Early pressings of the album contained a song called Sally which was removed at the request of Richard Branson on later editions and replaced with Into Wonderland sung by Wendy Roberts. On many editions of the album on CD the song is still marked as \"Sally\".\n\nQE2, named after the ship rather than the Queen, was released in 1980 and featured contributions on drums from Phil Collins, and also the first appearance of Maggie Reilly on his albums. It was also the first album where there were no side-length instrumentals, the longest being Taurus I which was ten minutes long. Included amongst the nine tracks were covers of ABBA's Arrival and The Shadows' Wonderful Land.\n\n1982's Five Miles Out again featured a side-length instrumental in \"Taurus II\", and also two compositions with his touring band, Family Man which was sung by Maggie Reilly and later covered by Hall & Oates, and the thirteen minute Orabidoo. Carl Palmer performed drums on Mount Teidi. Both Reilly and Oldfield sung on the title track, whose the subject matter was inspired by Oldfield's interest in flying, as he'd become a qualified pilot by this point. \n\nLike many other musicians of the time, Oldfield was also making increasing use of the Fairlight CMI synthesiser, which had extensive sequencing and sampling capabilities for the time, and it would feature extensively on his next few albums. Crises featured vocals from Yes's Jon Anderson, Roger Chapman and, once again, Maggie Reilly on Moonlight Shadow, which became Mike Oldfield's most successful single, peaking at #4 on the UK chart. The titular side-length instrumental incorporated the opening theme of Tubular Bells to mark the tenth anniversary of Oldfield's debut. The same year, Oldfield also released Crime Of Passion as a standalone single with Barry Palmer on vocals.\n\nDiscovery was largely a \"pop\" album, released in 1984, featuring Maggie Reilly and Barry Palmer as the main vocalists, with Oldfield sharing the production role with the drummer Simon Phillips. Notable tracks included To France and Tricks Of The Light. There was also a 13-minute instrumental called The Lake.\n\nAlso in 1984, Roland Joffé commissioned Mike Oldfield to compose the soundtrack The Killing Fields soundtrack. Oldfield employed a combination of classical orchestration, (arranged by David Bedford) including the Vienna Boys Choir, plus other sections incorporating East Asian instrumentation, Fairlight and guitar. The result was considered to be quite fitting for the mood of the film based around Pol Pot's Cambodian revolution, however this was the only soundtrack that Oldfield would compose. (The portion of Tubular Bells used for The Exorcist was licensed without his knowledge.)\n\nAfter this point, Mike Oldfield increasingly concentrated on computer video production, though he released the music videos for \"Pictures In The Dark\", featuring himself, partner Anita Hegerland and then-boy soprano Aled Jones, and \"Shine\" featuring Jon Anderson. In 1987 He released the The Wind Chimes video album, also released in album form as Islands. The entirely of The Wind Chimes was later re-released on the Elements DVD in 2004. (The video for \"Magic Touch\" was co-produced by Alex Proyas, who produced many music videos before moving into feature-length films.)\n\nAside from experimenting with computer graphics, Oldfield was also engaged in a campaign for \"real\" music. After having claimed that computers were ruining music, he wrote the bulk of Earthmoving on computer, with the song \"Innocent\" reportedly being written in a couple of hours one afternoon. The album consisted of ten songs, and was then seen as the nadir of his career, although highlights included Maggie Reilly's re-appearance on \"Blue Night\" and the coda to \"Far Country\", which saw Mike Oldfield trade guitar solos with Adrian Belew (of King Crimson fame), who also contributed vocals to \"Holy\".\n\nAmarok was released in 1990, and is regarded by many fans as being amongst his best work, though it had little commercial success due to Virgin virtually not bothering to market it all, leaving Oldfield himself to do so. The album was conceived as a sequel to Ommadawn and as a kind of rehearsal for his planned Tubular Bells II. It was fully instrumental, using much of the same personnel as Ommadawn including Paddy Moloney and Julian Bahula, leader of the Jabula drum ensemble. The album displayed formidable musicianship, whimsical humour, and contrary anti-commercialism in equal parts. The latter manifested itself in the decision to present it as one hour-long track on CD, but comprised of musical segments that lasted two or three minutes at most before the motif give way to something else completely only to return with a vengeance later. In spite of the jump-cut nature of the album, it remained idiosyncratically Oldfield.\n\nHeaven's Open saw out Mike Oldfield's contractual obligation to Virgin in 1991, and he chose to credit it to \"Michael Oldfield\", and do the lead vocals himself. Although somewhat lacklustre, it still represented a step up from Earthmoving. \"Make Make\" represented a thinly-veiled bitter farewell to the record company, and \"Music From The Balcony\", the side-long instrumental, exhibited some more of the contrariness of Amarok. The last sound on the album, barely audible, was of Oldfield yelling \"fuck off!\".\n\nBy this point Mike Oldfield signed a new contract with Warner Music, and his first release for them was the much anticipated Tubular Bells II, produced by Trevor Horn. The album generally followed the structure of the original, though the tunes were what could be described as \"anagrams\" of the corresponding themes from the original. It sounded a lot clearer than the original, and the second half seemed to have been fleshed out more, but some fans felt that Horn had \"sanitised\" the sound too much. The Orb were also commissioned to remix \"Sentinel\", the lead single, and brought an ambient dub style to bear - if anything, it was more \"minimalist\" than the original - in a manner that perplexed some fans but delighted others.\n\nOldfield followed this up in 1994 with Songs of Distant Earth, a concept album based on Arthur C Clarke's novel of the same name, with the plot being about the Magellan, an interstellar colony ship that had fled Earth as the sun went nova. The Magellan made a stopover on Thalassa, a planet colonised on a previous diaspora, and amongst other things, a romance develops between one of the Magellan's passengers and a Thalassan. Songs of Distant Earth was also one of the first CDs to incorporate a enhanced multimedia component, though this was only compatible with Macintosh computers.\n\n1996's Voyager saw Oldfield revisit his mother's Irish roots, partly bidden by Warner to cash in on the Riverdance and Braveheart phenomena, with performances of various Celtic standards such as \"Women Of Ireland\" and \"She Moves Through The Fair\" as well as a number of originals. It was dismissed by some Celtic music aficionados as being overproduced, wishy-washy and unauthentic, it is stylistically consistent with Oldfield's later work and contains the epic instrumental Mont St Michel, orchestrated by Robin Smith who was his musical director for his '90s live tours.\n\n1998 saw another iteration of the Tubular Bells franchise, this time inspired by Mike Oldfield's move to Ibiza to a house that he'd designed himself. Unlike II, Tubular Bells III didn't strictly follow the structure of the original, though again themes from it were given a twist. The most radical of these departures was a re-imagining of the ubiquitous piano motif along the lines of the dance music prevalent in the nightclubs of Ibiza, but he also included sections inspired by flamenco and ambient. \"Man In The Rain\", virtually a rewrite of \"Moonlight Shadow\", served as an interlude for the two instrumental halves of the album, and the conclusion was strongly reminiscent of part one of Ommadawn, sampling the African drums from that album, and of course finishing with the inevitable bells. After the release of the album he sold his house to Noel Gallagher and left the island, disillusioned.\n\n1999 saw the release of two albums, Guitars, which was made up completely of sounds made by guitars, and The Millennium Bell, written in part for Mike Oldfield's performance at Berlin's millennium celebrations. The latter album was conceived as a musical journey through the history of the world over the previous thousand years. Tres Lunas was released in 2002 almost as an afterthought, with his creative energies largely concentrated on creating a virtual reality game. \"Sirius\" and the title track are notable tracks. \"Thou Art In Heaven\", originally composed for the Berlin event, was also re-arranged and included in this album.\n\nTubular Bells 2003 was, this time, a re-recording of the original, with the arrangements largely kept intact except to correct what Oldfield perceived to be imperfections with the original, as well as to add string arrangements in places that the original recording circumstances prevented. Oldfield drew criticism for his insistence that the recording be copy-protected, a stance which may or may not have affected sales - in either case it was the least successful of his Tubular Bells albums.\n\nOldfield moved to a new record company for him, Universal Music Group, and \nLight And Shade was released in 2005 through its Mercury label, and contained two discs, representing light and shade. Criticism was somewhat mixed, comparing it with Tres Lunas in quality, and indeed recycles motifs from that album in parts. The general style continues the dance-beat chilled feeling started in TB3, though his distinctive guitar stylings are quite prominent on certain tracks. A key element on this album is the use of \"Vocaloid\" software, replacing and adding to human voices, harking back to his use of the Vocoder in the early 1980s. Yet another first was the inclusion of \"U-Mix\", a program which allows some manipulation of 4 tracks. The UK release features two extra tracks, \"Près de Toi\" (on Light) and \"Lakme (Fruity Loops)\" (on Shade).\n\nIn late 2006 Oldfield returned to live performance after an 7 year absence to headline Nokia Night of the Proms in Germany. 3 tracks from his performance on the event can be heard on the Night of the Proms Vol 13 CD (Germany): Tubular Bells, Ommadawn and Shadow on the Wall (feat John Miles on vocals). In 2007 he played on the Spanish version of Night of the Proms in Valencia and Madrid, playing the very same tunes from the Nokia Night of the Proms and featured Rosa Cedrón (formely of Luar na Lubre) as the female voice for Moonlight Shadow and To France (in Germany, Miriam Stockley did the job).\n\nHis autobiography, Changeling: The Autobiography of Mike Oldfield, was published on 10 May 2007 on Virgin Books. The first two years of royalties were donated to the mental health charity SANE.\n\nHis latest album, Music of the Spheres, was released in April 2008. It was his first work written for a classical orchestra, and he was assisted with the orchestration by Karl Jenkins, best known for his Adiemus albums. Lang Lang played piano and Hayley Westenra sang on \"On My Heart\". Many of the themes were reminiscent of both his own previous work, particularly Tubular Bells and Incantations, as well as composers such as Glass, Sibelius and Satie. The album was well received, reaching #9 in the UK Albums charts, making it well his first album to reach the Top 10 since Tubular Bells III.\n\nAfter the rights to his Virgin recordings reverted to him in 2008, Oldfield then licensed them on to Universal Music, who have announced that they will be re-releasing his back catalogue under the Mercury imprint, starting with Tubular Bells in June 2009, which has been remixed by Oldfield for this release. \n\nThis will be available in a number of different configurations such as a mass-market 2CD set with the second featuring yet another compilation of his work up to the Crises album, and a limited edition deluxe version which will be personally signed and includes 3 CDs of the 2009 and original mixes plus demos, a DVD including 5.1 surround mixes plus the Second House TV performance, a vinyl LP of the original mix, plus collectible memorabilia. Rumours that a small piece of the original bells would be included in each of these box sets were unfounded.\n\nReissues of subsequent albums are also forthcoming, with reports saying the first wave will cover the first decade of his solo career.\n\nA number of compilations have been released through the years:\n- The Complete Mike Oldfield 1985, 2 discs. Completists may find it worthwhile for the live section, which contains good renditions of \"Sheba\", \"Mirage\", \"Platinum\" and \"Mount Teidi\".\n- Elements, 1992, a single disc compilation by Virgin released after the success of Tubular Bells II by Warner. Elements 1973-1991, a four disc box set, was also released at the same time.\n- XXV 1997, a single disc compilation by Warner, licensing tracks over his whole period of work but concentrating on his Warner years. Includes an early mix of \"Secrets\" from Tubular Bells III, released the following year.\n- The Best of Tubular Bells, 2001, a single disc compilation by Virgin sequencing selections from all five \"Bell\" releases - Tubular Bells 1-3, The Orchestral Tubular Bells, and The Millenium Bell.\n- Platinum Collection, 2006, a 3 disc compilation from Virgin/EMI.  A good primer on the breadth and depth of Oldfield's work over three decades, it is notable in that it includes some tracks such as \"Don Alfonso\" and \"Pictures in the Dark\" previously unavailable on CD, as well as 12\" mixes and extended versions of other tracks such as \"Moonlight Shadow\" that were previously hard to find.\n\nThere are also a number of DVDs available.\n- Tubular Bells II/III, performed live at their respective launches in 1992 and 1998.\n- The Millennium Concert from Berlin 1999/2000. Much of The Millenium Bell is performed, as is about the first 7-8 minutes of Tubular Bells, \"Moonlight Shadow\", \"Portsmouth\" and a couple of other songs.\n- Elements; Includes a performance of the first half of Tubular Bells, performed by Mike Oldfield, Fred Frith, Mick Taylor and others, from 1975 from the BBC's Second House program, as well as all of his Virgin-era music videos plus Space Movie and the The Wind Chimes video album.\n- Exposed - released in late 2005, presumably covers one of his concerts from his 1979 tour.\n- Live At Montreux 1981 - released in 2006, filmed at the Montreux Festival during the QE2 tour, with a 6-piece band including Maggie Reilly.\n\nArtists that Mike Oldfield has arguably had an influence on include The Orb, Orbital, Sigur Ros, Enigma and Deep Forest. <a href=\"https://www.last.fm/music/Mike+Oldfield\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "18666",
      "discogs_original_name": "Mike Oldfield",
      "id": null,
      "lastfm_mbid": "a1684a49-feaa-4150-b758-d9412fc59f12",
      "name": "Mike Oldfield",
      "role": "",
      "spotify_id": "562Od3CffWedyz2BbeYWVn",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Mike Oldfield": {
      "biography": "Mike Oldfield (born Michael Gordon Oldfield, 15 May 1953, Reading, Berkshire, England) is largely known for Tubular Bells, his groundbreaking album from 1973, the success of which also bankrolled Sir Richard Branson's Virgin Records, for which Tubular Bells was the inaugural release. However, his musical career has spread over more than 40 years encompassing a range of styles, with varying amounts of success. According to the Gibraltar Encyclopedia of Progressive Rock, his style is labeled as Oldfield Progressive.\n\nBefore Oldfield started his solo career, he formed a band with his sister Sally Oldfield in 1967 called The Sallyangie and at the start of the 70s played bass and guitar with Kevin Ayers and the Whole World, alongside Ayers, David Bedford and saxophonist Lol Coxhill. At this time Kevin Ayers lent Oldfield a multitrack tape recorder, and it was on this that Oldfield began to put together what would become Tubular Bells, although Branson at one point suggested \"Breakfast In Bed\" as a title.\n\nTubular Bells is considered to be the first rock album to incorporate elements of classical composition, particularly the use of repetition with subtle variations in the minimalist style as pioneered by composers such as Philip Glass, Steve Reich and LaMonte Young, although these influences were filtered through rock sensibilities. Oldfield also claimed to have been inspired by Kevin Ayers' observation that \"there was nothing wrong with repetition so long as it was something worth repeating\".\n\nEarly on in his search for a label, Oldfield encountered Branson who was in the early stages of setting up Virgin Records on top of his existing chain of record shops, but after many rejections over the following year, Oldfield returned to Branson, who agreed to release it as Virgin's inaugural release and allowed Oldfield to finish the album at his Manor recording studio. Oldfield was signed to a ten album contract that would have repercussions on his later career. The album's success took hold when John Peel played the entirety on his radio program on BBC radio, and an excerpt was licensed for use on the film The Exorcist, giving it some exposure in the US market.\n\nMike Oldfield's next few albums continued in the vein of Tubular Bells. Hergest Ridge was a more textured, pastoral work, though still with contrasting sections. It actually hit No 1 in the UK album charts in 1974 before its predecessor, which took over the slot, however in the long run it wasn't received nearly as well as Tubular Bells. An orchestral version of Tubular Bells was orchestrated by David Bedford and released. \n\nOmmadawn was released in 1975, and is considered by many of his fans to be Oldfield's best album. It took on Celtic and African music influences, ably assisted by The Chieftains' Paddy Moloney and the exiled South African drumming ensemble Jabula. \n\nAfter releasing this album, Oldfield had all three studio albums remixed for quadraphonic, with Hergest Ridge in particular being significantly altered to sound less \"cluttered\" this mix ended up as the default CD release on Oldfield's imprimatur. These mixes were released as Boxed, along with another LP entitled Collaborations which contained songs and compositions that Oldfield had recorded with David Bedford, Leslie Penning on recorder, and Chris Cutler on percussion. The selections included Portsmouth and In Dulci Jubilo.\n\nAfter \"Ommadawn\", Mike Oldfield took a break from recording and underwent Exegesis therapy sessions. Prior to this stage Oldfield had been quite reclusive (to the exasperation of his record company), having only performed Tubular Bells before a live audience once, though he also performed the first half for television on the BBC's \"Second House\" program. After the controversial therapy, his personality seemed to have dramatically changed and he was more confident, almost to the point of arrogance.\n\nIn 1978, he recorded his most ambitious album to that point, Incantations, which bears strong minimalist influences, and featured Maddy Prior from Steeleye Span on vocals, as well as the return of the Jabula drummers and a full string section. He followed this up with his first live tour of Europe, complete with a 50 piece band. The tour itself lost money, however the album documenting the tour, Exposed, was successful enough to recoup those losses.  \n\nBy this point his particular \"style\" was increasingly at odds with the fashions of the day, indeed he bristled at the idea of Branson signing The Sex Pistols to the label. Nevertheless, he changed his approach to begin to write more pop songs to placate Virgin's marketing department, as well as writing material that was more suitable for a \"small\" band. After the \"Exposed\" tour he continued to tour extensively, refining his act and pared his band back to a six-piece by the time of the QE2 tour. Around this time he also renegotiated his contract to obtain a better royalty rate, however it also extended his obligation from ten to thirteen albums.\n\n1979 saw the release of Platinum (repackaged with a different tracklisting as Airborne in some markets), the first album he'd recorded in the US, and contained arrangements of Philip Glass's North Star, amongst his usual side-length instrumental, and George Gershwin's I Got Rhythm, sung by Wendy Roberts. Early pressings of the album contained a song called Sally which was removed at the request of Richard Branson on later editions and replaced with Into Wonderland sung by Wendy Roberts. On many editions of the album on CD the song is still marked as \"Sally\".\n\nQE2, named after the ship rather than the Queen, was released in 1980 and featured contributions on drums from Phil Collins, and also the first appearance of Maggie Reilly on his albums. It was also the first album where there were no side-length instrumentals, the longest being Taurus I which was ten minutes long. Included amongst the nine tracks were covers of ABBA's Arrival and The Shadows' Wonderful Land.\n\n1982's Five Miles Out again featured a side-length instrumental in \"Taurus II\", and also two compositions with his touring band, Family Man which was sung by Maggie Reilly and later covered by Hall & Oates, and the thirteen minute Orabidoo. Carl Palmer performed drums on Mount Teidi. Both Reilly and Oldfield sung on the title track, whose the subject matter was inspired by Oldfield's interest in flying, as he'd become a qualified pilot by this point. \n\nLike many other musicians of the time, Oldfield was also making increasing use of the Fairlight CMI synthesiser, which had extensive sequencing and sampling capabilities for the time, and it would feature extensively on his next few albums. Crises featured vocals from Yes's Jon Anderson, Roger Chapman and, once again, Maggie Reilly on Moonlight Shadow, which became Mike Oldfield's most successful single, peaking at #4 on the UK chart. The titular side-length instrumental incorporated the opening theme of Tubular Bells to mark the tenth anniversary of Oldfield's debut. The same year, Oldfield also released Crime Of Passion as a standalone single with Barry Palmer on vocals.\n\nDiscovery was largely a \"pop\" album, released in 1984, featuring Maggie Reilly and Barry Palmer as the main vocalists, with Oldfield sharing the production role with the drummer Simon Phillips. Notable tracks included To France and Tricks Of The Light. There was also a 13-minute instrumental called The Lake.\n\nAlso in 1984, Roland Joffé commissioned Mike Oldfield to compose the soundtrack The Killing Fields soundtrack. Oldfield employed a combination of classical orchestration, (arranged by David Bedford) including the Vienna Boys Choir, plus other sections incorporating East Asian instrumentation, Fairlight and guitar. The result was considered to be quite fitting for the mood of the film based around Pol Pot's Cambodian revolution, however this was the only soundtrack that Oldfield would compose. (The portion of Tubular Bells used for The Exorcist was licensed without his knowledge.)\n\nAfter this point, Mike Oldfield increasingly concentrated on computer video production, though he released the music videos for \"Pictures In The Dark\", featuring himself, partner Anita Hegerland and then-boy soprano Aled Jones, and \"Shine\" featuring Jon Anderson. In 1987 He released the The Wind Chimes video album, also released in album form as Islands. The entirely of The Wind Chimes was later re-released on the Elements DVD in 2004. (The video for \"Magic Touch\" was co-produced by Alex Proyas, who produced many music videos before moving into feature-length films.)\n\nAside from experimenting with computer graphics, Oldfield was also engaged in a campaign for \"real\" music. After having claimed that computers were ruining music, he wrote the bulk of Earthmoving on computer, with the song \"Innocent\" reportedly being written in a couple of hours one afternoon. The album consisted of ten songs, and was then seen as the nadir of his career, although highlights included Maggie Reilly's re-appearance on \"Blue Night\" and the coda to \"Far Country\", which saw Mike Oldfield trade guitar solos with Adrian Belew (of King Crimson fame), who also contributed vocals to \"Holy\".\n\nAmarok was released in 1990, and is regarded by many fans as being amongst his best work, though it had little commercial success due to Virgin virtually not bothering to market it all, leaving Oldfield himself to do so. The album was conceived as a sequel to Ommadawn and as a kind of rehearsal for his planned Tubular Bells II. It was fully instrumental, using much of the same personnel as Ommadawn including Paddy Moloney and Julian Bahula, leader of the Jabula drum ensemble. The album displayed formidable musicianship, whimsical humour, and contrary anti-commercialism in equal parts. The latter manifested itself in the decision to present it as one hour-long track on CD, but comprised of musical segments that lasted two or three minutes at most before the motif give way to something else completely only to return with a vengeance later. In spite of the jump-cut nature of the album, it remained idiosyncratically Oldfield.\n\nHeaven's Open saw out Mike Oldfield's contractual obligation to Virgin in 1991, and he chose to credit it to \"Michael Oldfield\", and do the lead vocals himself. Although somewhat lacklustre, it still represented a step up from Earthmoving. \"Make Make\" represented a thinly-veiled bitter farewell to the record company, and \"Music From The Balcony\", the side-long instrumental, exhibited some more of the contrariness of Amarok. The last sound on the album, barely audible, was of Oldfield yelling \"fuck off!\".\n\nBy this point Mike Oldfield signed a new contract with Warner Music, and his first release for them was the much anticipated Tubular Bells II, produced by Trevor Horn. The album generally followed the structure of the original, though the tunes were what could be described as \"anagrams\" of the corresponding themes from the original. It sounded a lot clearer than the original, and the second half seemed to have been fleshed out more, but some fans felt that Horn had \"sanitised\" the sound too much. The Orb were also commissioned to remix \"Sentinel\", the lead single, and brought an ambient dub style to bear - if anything, it was more \"minimalist\" than the original - in a manner that perplexed some fans but delighted others.\n\nOldfield followed this up in 1994 with Songs of Distant Earth, a concept album based on Arthur C Clarke's novel of the same name, with the plot being about the Magellan, an interstellar colony ship that had fled Earth as the sun went nova. The Magellan made a stopover on Thalassa, a planet colonised on a previous diaspora, and amongst other things, a romance develops between one of the Magellan's passengers and a Thalassan. Songs of Distant Earth was also one of the first CDs to incorporate a enhanced multimedia component, though this was only compatible with Macintosh computers.\n\n1996's Voyager saw Oldfield revisit his mother's Irish roots, partly bidden by Warner to cash in on the Riverdance and Braveheart phenomena, with performances of various Celtic standards such as \"Women Of Ireland\" and \"She Moves Through The Fair\" as well as a number of originals. It was dismissed by some Celtic music aficionados as being overproduced, wishy-washy and unauthentic, it is stylistically consistent with Oldfield's later work and contains the epic instrumental Mont St Michel, orchestrated by Robin Smith who was his musical director for his '90s live tours.\n\n1998 saw another iteration of the Tubular Bells franchise, this time inspired by Mike Oldfield's move to Ibiza to a house that he'd designed himself. Unlike II, Tubular Bells III didn't strictly follow the structure of the original, though again themes from it were given a twist. The most radical of these departures was a re-imagining of the ubiquitous piano motif along the lines of the dance music prevalent in the nightclubs of Ibiza, but he also included sections inspired by flamenco and ambient. \"Man In The Rain\", virtually a rewrite of \"Moonlight Shadow\", served as an interlude for the two instrumental halves of the album, and the conclusion was strongly reminiscent of part one of Ommadawn, sampling the African drums from that album, and of course finishing with the inevitable bells. After the release of the album he sold his house to Noel Gallagher and left the island, disillusioned.\n\n1999 saw the release of two albums, Guitars, which was made up completely of sounds made by guitars, and The Millennium Bell, written in part for Mike Oldfield's performance at Berlin's millennium celebrations. The latter album was conceived as a musical journey through the history of the world over the previous thousand years. Tres Lunas was released in 2002 almost as an afterthought, with his creative energies largely concentrated on creating a virtual reality game. \"Sirius\" and the title track are notable tracks. \"Thou Art In Heaven\", originally composed for the Berlin event, was also re-arranged and included in this album.\n\nTubular Bells 2003 was, this time, a re-recording of the original, with the arrangements largely kept intact except to correct what Oldfield perceived to be imperfections with the original, as well as to add string arrangements in places that the original recording circumstances prevented. Oldfield drew criticism for his insistence that the recording be copy-protected, a stance which may or may not have affected sales - in either case it was the least successful of his Tubular Bells albums.\n\nOldfield moved to a new record company for him, Universal Music Group, and \nLight And Shade was released in 2005 through its Mercury label, and contained two discs, representing light and shade. Criticism was somewhat mixed, comparing it with Tres Lunas in quality, and indeed recycles motifs from that album in parts. The general style continues the dance-beat chilled feeling started in TB3, though his distinctive guitar stylings are quite prominent on certain tracks. A key element on this album is the use of \"Vocaloid\" software, replacing and adding to human voices, harking back to his use of the Vocoder in the early 1980s. Yet another first was the inclusion of \"U-Mix\", a program which allows some manipulation of 4 tracks. The UK release features two extra tracks, \"Près de Toi\" (on Light) and \"Lakme (Fruity Loops)\" (on Shade).\n\nIn late 2006 Oldfield returned to live performance after an 7 year absence to headline Nokia Night of the Proms in Germany. 3 tracks from his performance on the event can be heard on the Night of the Proms Vol 13 CD (Germany): Tubular Bells, Ommadawn and Shadow on the Wall (feat John Miles on vocals). In 2007 he played on the Spanish version of Night of the Proms in Valencia and Madrid, playing the very same tunes from the Nokia Night of the Proms and featured Rosa Cedrón (formely of Luar na Lubre) as the female voice for Moonlight Shadow and To France (in Germany, Miriam Stockley did the job).\n\nHis autobiography, Changeling: The Autobiography of Mike Oldfield, was published on 10 May 2007 on Virgin Books. The first two years of royalties were donated to the mental health charity SANE.\n\nHis latest album, Music of the Spheres, was released in April 2008. It was his first work written for a classical orchestra, and he was assisted with the orchestration by Karl Jenkins, best known for his Adiemus albums. Lang Lang played piano and Hayley Westenra sang on \"On My Heart\". Many of the themes were reminiscent of both his own previous work, particularly Tubular Bells and Incantations, as well as composers such as Glass, Sibelius and Satie. The album was well received, reaching #9 in the UK Albums charts, making it well his first album to reach the Top 10 since Tubular Bells III.\n\nAfter the rights to his Virgin recordings reverted to him in 2008, Oldfield then licensed them on to Universal Music, who have announced that they will be re-releasing his back catalogue under the Mercury imprint, starting with Tubular Bells in June 2009, which has been remixed by Oldfield for this release. \n\nThis will be available in a number of different configurations such as a mass-market 2CD set with the second featuring yet another compilation of his work up to the Crises album, and a limited edition deluxe version which will be personally signed and includes 3 CDs of the 2009 and original mixes plus demos, a DVD including 5.1 surround mixes plus the Second House TV performance, a vinyl LP of the original mix, plus collectible memorabilia. Rumours that a small piece of the original bells would be included in each of these box sets were unfounded.\n\nReissues of subsequent albums are also forthcoming, with reports saying the first wave will cover the first decade of his solo career.\n\nA number of compilations have been released through the years:\n- The Complete Mike Oldfield 1985, 2 discs. Completists may find it worthwhile for the live section, which contains good renditions of \"Sheba\", \"Mirage\", \"Platinum\" and \"Mount Teidi\".\n- Elements, 1992, a single disc compilation by Virgin released after the success of Tubular Bells II by Warner. Elements 1973-1991, a four disc box set, was also released at the same time.\n- XXV 1997, a single disc compilation by Warner, licensing tracks over his whole period of work but concentrating on his Warner years. Includes an early mix of \"Secrets\" from Tubular Bells III, released the following year.\n- The Best of Tubular Bells, 2001, a single disc compilation by Virgin sequencing selections from all five \"Bell\" releases - Tubular Bells 1-3, The Orchestral Tubular Bells, and The Millenium Bell.\n- Platinum Collection, 2006, a 3 disc compilation from Virgin/EMI.  A good primer on the breadth and depth of Oldfield's work over three decades, it is notable in that it includes some tracks such as \"Don Alfonso\" and \"Pictures in the Dark\" previously unavailable on CD, as well as 12\" mixes and extended versions of other tracks such as \"Moonlight Shadow\" that were previously hard to find.\n\nThere are also a number of DVDs available.\n- Tubular Bells II/III, performed live at their respective launches in 1992 and 1998.\n- The Millennium Concert from Berlin 1999/2000. Much of The Millenium Bell is performed, as is about the first 7-8 minutes of Tubular Bells, \"Moonlight Shadow\", \"Portsmouth\" and a couple of other songs.\n- Elements; Includes a performance of the first half of Tubular Bells, performed by Mike Oldfield, Fred Frith, Mick Taylor and others, from 1975 from the BBC's Second House program, as well as all of his Virgin-era music videos plus Space Movie and the The Wind Chimes video album.\n- Exposed - released in late 2005, presumably covers one of his concerts from his 1979 tour.\n- Live At Montreux 1981 - released in 2006, filmed at the Montreux Festival during the QE2 tour, with a 6-piece band including Maggie Reilly.\n\nArtists that Mike Oldfield has arguably had an influence on include The Orb, Orbital, Sigur Ros, Enigma and Deep Forest. <a href=\"https://www.last.fm/music/Mike+Oldfield\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "Europe",
  "created_at": "2025-07-05T17:33:39.500506",
  "date_added": "2016-12-01T06:53:11-08:00",
  "discogs_id": "9412569",
  "discogs_url": "https://www.discogs.com/release/9412569-Mike-Oldfield-Tubular-Bells",
  "formats": [
    "Vinyl",
    "Vinyl",
    "All Media"
  ],
  "genres": [
    "Rock",
    "progressive rock",
    "1973",
    "instrumental",
    "70s",
    "new age"
  ],
  "id": "9412569",
  "images": [
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/E3xqgV0uM6XIPmWtq7iq5XNV6_v6UcVWFTjj_nFD0-k/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/Mi0xOTQ2LmpwZWc.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/E3xqgV0uM6XIPmWtq7iq5XNV6_v6UcVWFTjj_nFD0-k/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/Mi0xOTQ2LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 488,
      "resource_url": "https://i.discogs.com/-14FShD2Ajuu4yO-wkw6mBxSxSzgLkHA3kAHM1R8OZ0/rs:fit/g:sm/q:90/h:488/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTQ5MTU5MTg5/OC04MTg4LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/-14FShD2Ajuu4yO-wkw6mBxSxSzgLkHA3kAHM1R8OZ0/rs:fit/g:sm/q:90/h:488/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTQ5MTU5MTg5/OC04MTg4LmpwZWc.jpeg",
      "width": 500
    },
    {
      "height": 291,
      "resource_url": "https://i.discogs.com/Jj6SCm3H0PQLRvmy9lcR348mnZn2nZLskbuqKy49D_4/rs:fit/g:sm/q:90/h:291/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OS0xNTA0LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/Jj6SCm3H0PQLRvmy9lcR348mnZn2nZLskbuqKy49D_4/rs:fit/g:sm/q:90/h:291/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OS0xNTA0LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/5VplaTjC701Y7aV_JB53vY-mzraM5bKDDEAlRNsdcMU/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OS0yMjY3LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/5VplaTjC701Y7aV_JB53vY-mzraM5bKDDEAlRNsdcMU/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OS0yMjY3LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/Dm0iIyH0YaY8-9RzXfbiPBGmKEzKP0hO04JyfyzkK3w/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OC0zNzczLmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/Dm0iIyH0YaY8-9RzXfbiPBGmKEzKP0hO04JyfyzkK3w/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OC0zNzczLmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/riNIZgq94PBI2Cy13HcOb5TiVUcDpfj9QGz8WoQlauY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/My05ODU0LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/riNIZgq94PBI2Cy13HcOb5TiVUcDpfj9QGz8WoQlauY/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/My05ODU0LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/XSyLEhzEeC96z9c6cYL7vF6F_HWj5dJi8r1fvmVQONs/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/MS04MTQ5LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/XSyLEhzEeC96z9c6cYL7vF6F_HWj5dJi8r1fvmVQONs/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/MS04MTQ5LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/mkw1oyK_EWD6rDfO-Cu3kzuCGEiO-QyzIdqr-9dOBog/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/My0xMjQyLmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/mkw1oyK_EWD6rDfO-Cu3kzuCGEiO-QyzIdqr-9dOBog/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/My0xMjQyLmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/P18B_dqpGDr-8FrltS-LbcdJGu4M1_ySK0Fm5UcvVf4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/NC05ODg5LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/P18B_dqpGDr-8FrltS-LbcdJGu4M1_ySK0Fm5UcvVf4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/NC05ODg5LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/pdhzHJBjT2mfeb1iHAjrBtBLaLwo7vGNIRHcAvlUdmE/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OC05Mjk2LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/pdhzHJBjT2mfeb1iHAjrBtBLaLwo7vGNIRHcAvlUdmE/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY4/OC05Mjk2LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/t5YrftZ5VJXKHBRP2QCKGmHcydecRKdSNTyc7-YWP6o/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/OS01ODE4LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/t5YrftZ5VJXKHBRP2QCKGmHcydecRKdSNTyc7-YWP6o/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/OS01ODE4LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/PA99RL33ozPaTcozaN_k5b9SkpSPNA2dH2YATDCiGzw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/MS01MDg2LmpwZWc.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/PA99RL33ozPaTcozaN_k5b9SkpSPNA2dH2YATDCiGzw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTk0MTI1/NjktMTUyMzA5MjY5/MS01MDg2LmpwZWc.jpeg",
      "width": 600
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/36/51/2c/36512c3e-b23c-eed6-2179-731768d05107/00602547380067.rgb.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "Virgin",
    "Universal Music Group International"
  ],
  "lastfm_mbid": null,
  "lastfm_url": "https://www.last.fm/music/Mike+Oldfield/Tubular+Bells",
  "local_images": {
    "hi-res": "public/album/tubular-bells-9412569/tubular-bells-9412569-hi-res.jpg",
    "medium": "public/album/tubular-bells-9412569/tubular-bells-9412569-medium.jpg",
    "small": "public/album/tubular-bells-9412569/tubular-bells-9412569-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T17:33:41.700941",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "Tubular Bells",
  "release_name_discogs": "Tubular Bells",
  "release_name_spotify": "Tubular Bells",
  "released": "2016-11-25",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/36/51/2c/36512c3e-b23c-eed6-2179-731768d05107/00602547380067.rgb.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 2015 Oldfield Music Limited, under exclusive licence to Mercury Records Limited",
      "editorial_notes": "A shifting labyrinth of complex orchestral pop beckons you on a two-part 1973 suite of mostly instrumental music that goes well beyond the familiar tinkling melody of its opening section. Oldfield—a prodigious talent who wrote his first songs at the age of nine—plays 20 instruments throughout, including the titular bells, and the scope is staggering. Spanish guitar flickers, ambient moments materialise and it all builds to a finger-plucked, deliciously proggy finale.",
      "id": "1440852773",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Mike Oldfield",
        "artwork": {
          "bgColor": "86a0af",
          "height": 1500,
          "textColor1": "0b0d0d",
          "textColor2": "151313",
          "textColor3": "242a2d",
          "textColor4": "2b2f32",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music128/v4/36/51/2c/36512c3e-b23c-eed6-2179-731768d05107/00602547380067.rgb.jpg/{w}x{h}bb.jpg",
          "width": 1500
        },
        "copyright": "℗ 2015 Oldfield Music Limited, under exclusive licence to Mercury Records Limited",
        "editorialNotes": {
          "short": "A shifting labyrinth of complex orchestral pop.",
          "standard": "A shifting labyrinth of complex orchestral pop beckons you on a two-part 1973 suite of mostly instrumental music that goes well beyond the familiar tinkling melody of its opening section. Oldfield—a prodigious talent who wrote his first songs at the age of nine—plays 20 instruments throughout, including the titular bells, and the scope is staggering. Spanish guitar flickers, ambient moments materialise and it all builds to a finger-plucked, deliciously proggy finale."
        },
        "genreNames": [
          "Rock",
          "Music",
          "Electronic",
          "Prog-Rock/Art Rock",
          "New Age",
          "Classical",
          "Classical Crossover"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "Tubular Bells",
        "playParams": {
          "id": "1440852773",
          "kind": "album"
        },
        "recordLabel": "UMC (Universal Music Catalogue)",
        "releaseDate": "1973-02-01",
        "trackCount": 4,
        "upc": "00602547380067",
        "url": "https://music.apple.com/gb/album/tubular-bells/1440852773"
      },
      "url": "https://music.apple.com/gb/album/tubular-bells/1440852773"
    },
    "lastfm": {
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/015c5fef4db24c4b8545aa3c2ef231d9.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/015c5fef4db24c4b8545aa3c2ef231d9.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/015c5fef4db24c4b8545aa3c2ef231d9.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/015c5fef4db24c4b8545aa3c2ef231d9.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/015c5fef4db24c4b8545aa3c2ef231d9.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/015c5fef4db24c4b8545aa3c2ef231d9.png"
        }
      ],
      "listeners": 132691,
      "mbid": "088434f5-17fb-4dda-a592-945e025ec9a5",
      "playcount": 839416,
      "raw_data": {
        "album": {
          "artist": "Mike Oldfield",
          "image": [
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/34s/015c5fef4db24c4b8545aa3c2ef231d9.png",
              "size": "small"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/64s/015c5fef4db24c4b8545aa3c2ef231d9.png",
              "size": "medium"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/174s/015c5fef4db24c4b8545aa3c2ef231d9.png",
              "size": "large"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/015c5fef4db24c4b8545aa3c2ef231d9.png",
              "size": "extralarge"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/015c5fef4db24c4b8545aa3c2ef231d9.png",
              "size": "mega"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/015c5fef4db24c4b8545aa3c2ef231d9.png",
              "size": ""
            }
          ],
          "listeners": "132691",
          "mbid": "088434f5-17fb-4dda-a592-945e025ec9a5",
          "name": "Tubular Bells",
          "playcount": "839416",
          "tags": {
            "tag": [
              {
                "name": "progressive rock",
                "url": "https://www.last.fm/tag/progressive+rock"
              },
              {
                "name": "1973",
                "url": "https://www.last.fm/tag/1973"
              },
              {
                "name": "instrumental",
                "url": "https://www.last.fm/tag/instrumental"
              },
              {
                "name": "70s",
                "url": "https://www.last.fm/tag/70s"
              },
              {
                "name": "new age",
                "url": "https://www.last.fm/tag/new+age"
              }
            ]
          },
          "tracks": {
            "track": [
              {
                "@attr": {
                  "rank": 1
                },
                "artist": {
                  "mbid": "a1684a49-feaa-4150-b758-d9412fc59f12",
                  "name": "Mike Oldfield",
                  "url": "https://www.last.fm/music/Mike+Oldfield"
                },
                "duration": 1562,
                "name": "Tubular Bells (Part One)",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Mike+Oldfield/Tubular+Bells/Tubular+Bells+(Part+One)"
              },
              {
                "@attr": {
                  "rank": 2
                },
                "artist": {
                  "mbid": "a1684a49-feaa-4150-b758-d9412fc59f12",
                  "name": "Mike Oldfield",
                  "url": "https://www.last.fm/music/Mike+Oldfield"
                },
                "duration": 1397,
                "name": "Tubular Bells (Part Two)",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Mike+Oldfield/Tubular+Bells/Tubular+Bells+(Part+Two)"
              }
            ]
          },
          "url": "https://www.last.fm/music/Mike+Oldfield/Tubular+Bells",
          "wiki": {
            "content": "Tubular Bells is a record album, written and mostly performed by Mike Oldfield, released in 1973. The late Vivian Stanshall provided the voice of the \"Master of Ceremonies\" who reads off the list of instruments at the end of the first movement. The piece was later orchestrated by David Bedford for The Orchestral Tubular Bells version and it had two sequels in the 1990s, Tubular Bells II and Tubular Bells III.\n\n\nSignificance\n\nOldfield approached (and was rejected by) many other established record labels. Some of the rejections were because they believed the piece to be unmarketable. Oldfield then played his demos to some of the Engineers at The Manor; they along with their boss, Richard Branson decided to give Oldfield a chance. Virgin Records released Oldfield's debut album Tubular Bells as its first album; hence the catalogue number V2001 (although V2002 and V2003 were released on the same date).\n\nMike Oldfield played most of the instruments on the album (see below), recording them one at a time and layering the recordings to create the finished work. Many of his subsequent albums feature this technique. Though fairly common in the music industry now, at the time of the production of Tubular Bells not many musicians made use of it, preferring multi-musician \"session\" recordings.\n\nTubular Bells is the album most identified with Oldfield and the reverse may be true as well as he has frequently returned to it in later works. The opening passage of the title track on the album Crises and the piece Harbinger on the album Music of the Spheres are clearly derived from the opening of Tubular Bells. The opening is also quoted directly in the song Five Miles Out from the album of the same name and the song also features his \"trademark\" instrument, \"Piltdown Man\" (referring to his singing like a caveman, first heard on Tubular Bells).\n\nTubular Bells stayed in the British charts for over five years, reaching the number 1 spot after more than a year and taking there for one week the place of his second album, Hergest Ridge, thereby becoming one of only three artists in the UK to knock himself off the first spot. It sold more than two million copies in the UK alone and according to some reports 15 to 17 million copies worldwide. The album went gold in the USA and Mike Oldfield received a Grammy Award for the best Instrumental Composition in 1975.\n\nThe coda at the end of Part Two, the Sailor's Hornpipe, was originally created as a much longer production, with Vivian Stanshall providing comic narration as an obviously-inebriated tour guide showing the listener around the Manor House where the album was recorded. It was cut from the final version for being too strange to be put on an unknown artist's first album, though it can be heard \"in all its magnificent foolishness\" (from the liner notes) on the Boxed set, which features completely remixed versions of Tubular Bells, Hergest Ridge, Ommadawn and several shorter tracks. It can also be heard on the SACD (multi-channel track only).\n\nIn 2008 when Oldfield's original 35 year deal with Virgin Records ended, the rights to the piece were returned to him, and will be transferred to Mercury Records; according to a report in the Music Week magazine in 2005.\n\n\nIn popular culture\n\nThe opening theme, which was eventually chosen for the 1973 film The Exorcist, gained the record considerable publicity and is how many people have probably first heard the work. Along with a number of other Oldfield pieces it was used in the 1979 NASA movie, The Space Movie. The opening theme has been sampled by many other artists such as Janet Jackson on her song The Velvet Rope. The opening theme has also gained cultural significance as a 'haunting theme'; partly due to the association with The Exorcist.\n\nIn television it was also used in the in several episodes of the Dutch children's series Bassie en Adriaan, an episode (\"Ghosts\") of the BBC series My Family and an episode (Poltergeist III - Dipesto Nothing) of Moonlighting. It was also used in a television advertisement for Volkswagen in 2003. It has also been used in other films such as 1974's Black Christmas, 1985's Weird Science, 2001's Scary Movie 2, 2002's The Master of Disguise and 2004's Saved!.\n\n\nTubular Bells series\n\nTubular Bells can be seen as the first of a \"series\" of albums continuing with Tubular Bells II (1992), Tubular Bells III (1998) and The Millennium Bell (1999). Finally in 2003 Oldfield released Tubular Bells 2003, a re-recording of the original Tubular Bells with updated digital technology and several \"corrections\" to what he saw as flaws in the first album's production. This version is notable for replacing the late Vivian Stanshall's narration with a newly recorded narration by John Cleese.\n\nOther versions include a quadrophonic version in 1975 (\"For people with four ears\", as the sleeve said; the quad mix was later used for the multi-channel part of the SACD release), an orchestral version in the same year (the Orchestral Tubular Bells with David Bedford), and different live recordings; a complete one can be found on the double live album Exposed from 1979.\n\n\nAlbum art\n\nThe cover design was by Trevor Key, who would go on to create the covers of many Oldfield albums, and was inspired by Magritte's \"Castle in the Pyrenees\".\n\nThe concept for the triangular bell on the album cover art originally came from the idea of a bell which had been destroyed. Oldfield had come up with this when he had dented the set of Tubular bells used to record the album when playing them.\n\nThe \"bent bell\" image on the cover is also associated with Oldfield, even being used for the logo of his personal music company, Oldfield Music, Ltd. The image was also the main focus for the cover art of the successive Tubular Bells albums.\n\n\nAlbum progression\n\nPart one opens with a soft minor key piano line in 15/8 eventually played verbatim by organ and glockenspiel. This riff is made up of two bars; the first bar is in 7/8, the second bar is in 8/8. These are later joined by a different line in bass guitar. An occasional punchy organ chord, first heard at about 1:02 in, accents this piece, harmonised by variations of the anchor line and a later incorporated 3/4 chord sequence, both in piano. At around 3:38, a gentle flute line appears, which segues into a section of 4/4-7/8-7/8-4/4, and at 3:40 an electric guitar line, the latter entirely in 4/4.\n\nAfter the electric guitar line ends, a softer, fast guitar line (\"speed guitar,\" as listed in the liner notes) takes over, only to be interrupted by an acoustic guitar line overlaying the original piano phrase in major key. A gentle glockenspiel/piano piece takes over, but is later replaced with a fast piano section, occasionally accented with organ chords.\n\nThe mood of the first 6 minutes is soon replaced by edgy electric guitar and, afterward, a sinister organ chord, with various changes in pitch and duration. But, once again, a more refined, carefree section ensues, dominated by acoustic guitar and piano, eventually returning to the soft riff first heard just past four minutes into the piece.\n\nA 3/4 variation of the original theme comes next, followed by eerie bass and organ playing, segueing into a bluesy shuffle on electric guitar. Once again, when it looks like the piece will be serene (when the nasal choir intervenes), another edgy guitar line ensues, with Oldfield incorporating both 4/4 and 7/8.\n\nAfter that, a more folky acoustic line plays (with background tambourine), but is suddenly cut off by the tolling of bells. A weary acoustic guitar line follows, breaking into the eight-and-a-half minute \"Finale\" section, commencing with a double bass line in 5/4, polyrhythmically played with a 4/4 acoustic line. After the bass and guitar unite into the 4/4 line, the acoustic guitar tacets and is eventually replaced by soft pipe organ notes (usually lasting four or eight full beats) while the bass line plays.\n\nAfter the 10-bar bass phrase is repeated several times, Stanshall introduces many of the instruments appearing in part one up to then, beginning with the keyboards, followed by glockenspiel and all guitars before the tubular bells are announced, the ensemble becoming more dynamic and full as more instruments are said. Finally, after the tubular bells enter, a wordless feminine chorus starts to sing. Farther down, the Finale ensemble fades out to an acoustic guitar solo, which takes up the remainder of part one.\n\nPart two begins where part one left off; a soft, simple piece, this time, beginning with bass guitar and working up with other guitars and keyboards. The opening time signature is 6/8, but a later line plays a similar melody in 3/4 on various instruments, beginning with guitar. The opening section builds for five minutes before the second section starts, another 3/4 section at half tempo on acoustic guitar, with accompaniment on organ, mandolin and female chorus.\n\nAt around 8:48, the piece becomes edgy and surreal again, as the \"bagpipe guitars\" enter the piece (electric guitars with added effects to give it the bagpipe-esque sound), playing a 12/8 piece of sorts. About 11 minutes in, the intensity of the section builds as the guitar pitches increase and a heavy piano \"roll\" plays, climaxed by a sudden ascending glissando on the piano.\n\nWhat comes next is one of the more unusual parts of the entire album. Tympani rolls and drum kit commence this part, highlighted by unintelligible \"lyrical\" screams by Oldfield (who, according to rumours, was then intoxicated), in rebellion to how Richard Branson wanted him to include at least one part with lyrics to release as a single (at the time, Oldfield was not interested in adding lyrics to his music). This is listed in the liner notes as the \"Piltdown Man\". Oldfield's yelling is countered by various phrases on piano, guitars, and the \"Moribund chorus,\" with this piece abruptly ending on one loud shout exactly 16:29 in.\n\nAs expected, another quiet section ensues, a 12/8 piece mostly dominated by guitars and organ. This section gives an excellent insight into the psychedelic, spacey side of Oldfield (a similar sound to that of Pink Floyd's David Gilmour), which would also be present in his third album, Ommadawn. After about five minutes, an optimistic organ line plays, segueing into a climactic arrangement of \"Sailor's Hornpipe\".\n\n\"Sailor's Hornpipe\" begins with just one guitar playing at a moderately slow tempo, but quickly mutates into a gradually accented piece with multiple instruments (including an unlisted violin), ending with two loud, accented notes. In live performances, Oldfield would reach incredible tempos and \"Sailor's Hornpipe\" alone became a staple of his concerts.\n\n\nSound mixes\n\nThere are three known variations of the vinyl edition of Tubular Bells.\nThe standard stereo black vinyl version catalogue number V2001 (white label with twins image)\nA quadrophonic version, black vinyl catalogue number QV2001. The first 40,000 copies of this are not true quadrophonic but doctored versions of the stereo issue, thereafter the subsequent copies are true quadrophonic. Unfortunately there is no indication on the record label that this substitution was made.\nThe Picture Disc, catalogue number VP2001. This is a stereo remix of the quadrophonic version. The only difference being in the sound of the \"Reed and Pipe Organ\" during the ceremony of instruments. This version appears in the Boxed compilation.\n\n\nStereo record joke\n\nNormally, records have a small statement printed along the bottom to the effect that it is in stereo but may be played on mono record players (a holdover from the days before stereo). It normally reads:\nThis stereo record can be played on mono reproducers provided either a compatible or stereo cartridge wired for mono is fitted. Recent equipment may already be fitted with a suitable cartridge. If in doubt consult your dealer.\n\nHowever, Tubular Bells pokes fun at this by having the following text printed on the bottom of the reverse of the LP.\nThis stereo record cannot be played on old tin boxes no matter what they are fitted with. If you are in possession of such equipment please hand it into the nearest police station.\n\n\nThe recording sessions\n\nPart one was recorded in just one single week at the studio owned by the founder of Virgin Records Richard Branson, The Manor Studio. Oldfield used the studio immediately after John Cale's sessions and just before the Bonzo Dog Doo-Dah Band began recording.\nOldfield's working title for Tubular Bells was Opus One and Richard Branson thought to call it Breakfast in Bed. One of the possible album covers for Breakfast in Bed included a boiled egg with blood pouring out of it. This cover was edited and used as the artwork for Oldfield's final album with Virgin, Heaven's Open.\nMike Oldfield had been performing \"The Sailor's Hornpipe\" for years before including it on Tubular Bells, when he was the bass player with Kevin Ayers and The Whole World.\nThe only electric guitar to be used on the album was a 1966 blonde Fender Telecaster (serial no. 180728) which used to belong to Marc Bolan. Oldfield had added an extra Bill Lawrence pickup and has since sold the guitar and donated the money to the SANE charity.\nAccording to Oldfield the \"Piltdown Man\" shouting sequence came about when he had practically finished recording the instruments for the section, but felt that it needed something else. The whisky fuelled idea to create the \"Piltdown Man\" effect was to shout and scream into a microphone while running the tape at a lower speed.\nThe album was recorded on an Ampex 2\" 16 track tape recorder, which was The Manor's main recording equipment at the time.\nTo create the double speed guitar, the tape was simply run at half speed during recording. Oldfield also used a custom effects unit, named the Glorfindel box, to create the 'fuzz' or 'bagpipe' distortion on some guitar pieces on the album. The Glorfindel box was given to David Bedford at a party, who then subsequently gave it to Oldfield. Tom Newman criticised the wooden cased unit in a 2001 interview with Q magazine noting that it rarely gave the same result twice.\nThe set of tubular bells that were used on the album had been left by an instrument hire company after John Cale's sessions at the Manor, at the request of Oldfield.\nAccording to Phil Newell the Bass guitar used on the album was one of his Fender Telecaster Basses.\nVivian Stanshall, who was staying at the Manor at the time, was asked to introduce the instruments for the finale of part one. It was the way in which Stanshall had said plus... tubular bells which gave Oldfield the idea to call the album Tubular Bells.\nThe \"lyrics\" announcing the instruments are: \"Grand piano; reed and pipe organ; glockenspiel; bass guitar; double speed guitar; two slightly distorted guitars; mandolin! Spanish guitar, and introducing acoustic guitar, plus... tubular bells\".\n\n\nOriginal ending\n\nWhen recorded in 1973, the ending rendition of \"Sailor's Hornpipe\" was originally preceded by a slightly bizarre rendition of the piece. Loud marching footsteps trot around the sound channels as the \"Sailor's Hornpipe\" is played on acoustic instruments, whilst announcer Vivian Stanshall gives a drunken, improvised tour of the Manor. According to the liner notes for the Boxed vinyl set, this session occurred at four in the morning after Oldfield, engineer Tom Newman and Stanshall had been drinking heavily. They placed microphones in the rooms of the Manor, hit record and set off on an unplanned tour of the house.\n\nThe section was deemed \"too bizarre\" to include on the initial release of Tubular Bells, and was left off. The Boxed set reinstates the section at the end of side two of Tubular Bells.\n\nThe \"lyrics\" to Stanshall's improvised tour of the Manor follows:\n\n\"The hallway.\n\nFrom outside, an ordinary house. A great house, true - four hundred and eighty three rooms, each one with its own marble wash basin and douche, bidet as it may. But inside, and the positions are reversed. A human failing, some say a disease, but a disease that Sir Francis Dashwood knew, and knew it well.\n\nUpstairs, inside and a revelation. It's a discotheque. No, no, uh.. there are paintings, real, and look here - a rare seventeenth century masterpiece, and if I can scrape a little of it off, beneath I can find hidden a fourteenth century underpiece.\n\nMade entirely of tiny pieces of eggshells, this lurid work has caused controversy in the world of embroidery and anthropologicky. No, I'll say it again, anthropolology. Umm.. no quite possibly make an anthropol, no, uh, I mean an apolog..ph.. It has enthralled distinguished professors, and in layman's language is \"blinking well baffling\".\n\nBut to be more obtusely, \"buggered if I know.\" Yes, \"buggered if I know.\" And that's all we've gleaned so far from experts in fourteenth century painting, renaissance, greengrocers, and recently revived members of the public. Buggered if I know.\n\nVivian Stanshall, about three o'clock in the morning, Oxfordshire, 1973, Goodnight\"\n\nIn addition, a version of Tubular Bells was originally released on the Spanish Boxed compilation such that Part Two ended with the \"Ambient Guitars\" movement without the Sailor's Hornpipe finale.\n\n\nSingle\n\nMike Oldfield's Single was the first 7-inch single released by Mike Oldfield, in June 1974. In the UK it featured a re-recorded extract from part two of Tubular Bells as the A-side, while Froggy Went A-Courting was the B-side. The single was produced in response to an American single containing an excerpt from Tubular Bells which Oldfield did not authorise.\n\n\nDemo version\n\nOldfield recorded the demo pieces of Tubular Bells in his flat in Tottenham, London in 1971. Oldfield recorded the demos on a Bang & Olufsen Beocord 1/4\" tape machine which he had borrowed from Kevin Ayers. Oldfield was able to overdub his playing by blocking off the erase head of the tape machine. The demos titled, \"Tubular Bells Long\", \"Caveman Lead-In\", \"Caveman\", \"Peace Demo A\" and \"Peace Demo B\" appeared on the DVD-Audio version of the rerecording of Tubular Bells, Tubular Bells 2003.\n\n\nCommodore 64\n\nWith the aid of the software house CRL and distributor Nu Wave, Mike Oldfield released an interactive Commodore 64 version of the album in 1986, which utilised the computer's SID sound chip to play back a simplified re-arrangement of the album, accompanied by some simple 2D visual effects.\n\nThe \"interactivity\" offered by the album/program was limited to controlling the speed and quantity of the visual effects, tuning the sound's volume and filtering, and skipping to any part of the album.\n\nThe software was not very successful, partly due to its unusual nature. It can be considered the first, if not only, example of commercial, albeit relatively simple, interactive computer demo or \"musicdisk\", while other sources consider it a \"union between music and videogames\".\n\nThis, combined with the low quality of the final sound output compared to the original album, despite the C64 arguably having one of the best sound chips of its era, decreed the attempt's failure. It's also one of the earliest attempts by part of a musician to release an interactive/multimedia software based on his works, before the CD-ROM era and before the first videogames and multimedia discs licensed by a music artist appeared.\n\n\nMaestro\n\nIn 2004 Oldfield launched a virtual reality project called Maestro which contains music from the re-recorded Tubular Bells album (Tubular Bells 2003). The original title of the game was The Tube World. This was the second game which was released under the MusicVR banner, the first being Tres Lunas.\n\n\nCover versions\n\nEd Starink made an abridged cover for an album Synthesizer Greatest (the first album in a multi-volume series) that was released in 1989. Tubular Bells appears only on the CD-version as a \"bonus track\". Other tracks on the album are cover versions of famous synthesizer songs but the original Tubular Bells features no synthesizer\nFinnish one-man a cappella rock band Paska recorded an abridged cover version for his 2005 album Women Are From Venus, Men From Anus. Paska has also performed the song at his live performances. This number can be considered both a parody of the original work and mockery of progressive rock and new age music in general. In a concert held on the 1st October 2007 in club Tavastia in Helsinki), before performing his version of the song, Ari Peltonen gave a speech about his hatred towards the song and progressive rock in general.\nBook of Love opened their 1988 album Lullaby with a cover version, stretched to 4/4 time by adding stretching a note to make it danceable.\nTherapy? jokingly covered the opening theme live in 1998 as part of a medley, which opened with \"Tubular Bells\", segued into Judas Priest's Breaking the Law, and ended with their own Nowhere.\nDuo Sonare, a German classical guitar duo, has made a complete rerecording of Tubular Bells for two guitars.\nThrash metal band Possessed played the intro in the first song of the record Seven Churches (in 1985), which is titled The Exorcist.\nAnother thrash metal band called Death Angel played the main theme in the title track of the album the Ultra-Violence in 1987.\nLol Coxhill and Steven Miller parodied Tubular Bells in Tubercular Balls on the album The Story So Far...Oh Really!.\nPaul Hardcastle based his single 19 around the piano theme of Tubular Bells.\nForma Tadre use the intro guitars from the second part of Tubular bells in their song Automate on the album of the same name. Their version is done with synth and only repeats the first two bars.\nRapper Tech N9ne also used a similar version of the intro in the song Be Warned, only he moved it to 4/4 time, rather than the 7/8 to 8/8 signatures. The piano intro is a slight modification of the original. Also, the bassline, although quite different-sounding itself, is a slight copy of the original bassline, only with a few notes added.\nAmerican artist Tori Amos has frequently been using the opening Tubular Bells theme in her live shows. It began during the 1996 Dew Drop Inn Tour where she would let Father Lucifer segue into Tubular Bells on the piano while singing words from Bronski Beat's Smalltown Boy as well as playing it on the harpsichord during songs Love Song (a Cure cover) and Bells for Her (from Under the Pink), usually while mixing in lyrics from a third song such as Björk's Hyperballad or Blue Skies. It appeared again in 2005 as part of Yes, Anastasia and on the current 2007 tour promoting her album American Doll Posse it is being performed with full band as an intro to Devils and Gods.\nCalifornia Guitar Trio covers most of the first side of the original album on their album Echoes released in late March 2008.\n\n\nFurthermore, many dance acts and other artists have used the intro to Tubular Bells as the basis for their songs. A long list can be found at Rainer Muenz' discography. <a href=\"https://www.last.fm/music/Mike+Oldfield/Tubular+Bells\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
            "published": "07 Jul 2008, 15:25",
            "summary": "Tubular Bells is a record album, written and mostly performed by Mike Oldfield, released in 1973. The late Vivian Stanshall provided the voice of the \"Master of Ceremonies\" who reads off the list of instruments at the end of the first movement. The piece was later orchestrated by David Bedford for The Orchestral Tubular Bells version and it had two sequels in the 1990s, Tubular Bells II and Tubular Bells III. Significance Oldfield approached (and was rejected by) many other established record labels. Some of the rejections were because they believed the piece to be unmarketable. Oldfield then played his <a href=\"https://www.last.fm/music/Mike+Oldfield/Tubular+Bells\">Read more on Last.fm</a>."
          }
        }
      },
      "similar_artists": [],
      "tags": [
        "progressive rock",
        "1973",
        "instrumental",
        "70s",
        "new age"
      ],
      "top_albums": [],
      "top_tracks": [],
      "url": "https://www.last.fm/music/Mike+Oldfield/Tubular+Bells",
      "wiki_content": "Tubular Bells is a record album, written and mostly performed by Mike Oldfield, released in 1973. The late Vivian Stanshall provided the voice of the \"Master of Ceremonies\" who reads off the list of instruments at the end of the first movement. The piece was later orchestrated by David Bedford for The Orchestral Tubular Bells version and it had two sequels in the 1990s, Tubular Bells II and Tubular Bells III.\n\n\nSignificance\n\nOldfield approached (and was rejected by) many other established record labels. Some of the rejections were because they believed the piece to be unmarketable. Oldfield then played his demos to some of the Engineers at The Manor; they along with their boss, Richard Branson decided to give Oldfield a chance. Virgin Records released Oldfield's debut album Tubular Bells as its first album; hence the catalogue number V2001 (although V2002 and V2003 were released on the same date).\n\nMike Oldfield played most of the instruments on the album (see below), recording them one at a time and layering the recordings to create the finished work. Many of his subsequent albums feature this technique. Though fairly common in the music industry now, at the time of the production of Tubular Bells not many musicians made use of it, preferring multi-musician \"session\" recordings.\n\nTubular Bells is the album most identified with Oldfield and the reverse may be true as well as he has frequently returned to it in later works. The opening passage of the title track on the album Crises and the piece Harbinger on the album Music of the Spheres are clearly derived from the opening of Tubular Bells. The opening is also quoted directly in the song Five Miles Out from the album of the same name and the song also features his \"trademark\" instrument, \"Piltdown Man\" (referring to his singing like a caveman, first heard on Tubular Bells).\n\nTubular Bells stayed in the British charts for over five years, reaching the number 1 spot after more than a year and taking there for one week the place of his second album, Hergest Ridge, thereby becoming one of only three artists in the UK to knock himself off the first spot. It sold more than two million copies in the UK alone and according to some reports 15 to 17 million copies worldwide. The album went gold in the USA and Mike Oldfield received a Grammy Award for the best Instrumental Composition in 1975.\n\nThe coda at the end of Part Two, the Sailor's Hornpipe, was originally created as a much longer production, with Vivian Stanshall providing comic narration as an obviously-inebriated tour guide showing the listener around the Manor House where the album was recorded. It was cut from the final version for being too strange to be put on an unknown artist's first album, though it can be heard \"in all its magnificent foolishness\" (from the liner notes) on the Boxed set, which features completely remixed versions of Tubular Bells, Hergest Ridge, Ommadawn and several shorter tracks. It can also be heard on the SACD (multi-channel track only).\n\nIn 2008 when Oldfield's original 35 year deal with Virgin Records ended, the rights to the piece were returned to him, and will be transferred to Mercury Records; according to a report in the Music Week magazine in 2005.\n\n\nIn popular culture\n\nThe opening theme, which was eventually chosen for the 1973 film The Exorcist, gained the record considerable publicity and is how many people have probably first heard the work. Along with a number of other Oldfield pieces it was used in the 1979 NASA movie, The Space Movie. The opening theme has been sampled by many other artists such as Janet Jackson on her song The Velvet Rope. The opening theme has also gained cultural significance as a 'haunting theme'; partly due to the association with The Exorcist.\n\nIn television it was also used in the in several episodes of the Dutch children's series Bassie en Adriaan, an episode (\"Ghosts\") of the BBC series My Family and an episode (Poltergeist III - Dipesto Nothing) of Moonlighting. It was also used in a television advertisement for Volkswagen in 2003. It has also been used in other films such as 1974's Black Christmas, 1985's Weird Science, 2001's Scary Movie 2, 2002's The Master of Disguise and 2004's Saved!.\n\n\nTubular Bells series\n\nTubular Bells can be seen as the first of a \"series\" of albums continuing with Tubular Bells II (1992), Tubular Bells III (1998) and The Millennium Bell (1999). Finally in 2003 Oldfield released Tubular Bells 2003, a re-recording of the original Tubular Bells with updated digital technology and several \"corrections\" to what he saw as flaws in the first album's production. This version is notable for replacing the late Vivian Stanshall's narration with a newly recorded narration by John Cleese.\n\nOther versions include a quadrophonic version in 1975 (\"For people with four ears\", as the sleeve said; the quad mix was later used for the multi-channel part of the SACD release), an orchestral version in the same year (the Orchestral Tubular Bells with David Bedford), and different live recordings; a complete one can be found on the double live album Exposed from 1979.\n\n\nAlbum art\n\nThe cover design was by Trevor Key, who would go on to create the covers of many Oldfield albums, and was inspired by Magritte's \"Castle in the Pyrenees\".\n\nThe concept for the triangular bell on the album cover art originally came from the idea of a bell which had been destroyed. Oldfield had come up with this when he had dented the set of Tubular bells used to record the album when playing them.\n\nThe \"bent bell\" image on the cover is also associated with Oldfield, even being used for the logo of his personal music company, Oldfield Music, Ltd. The image was also the main focus for the cover art of the successive Tubular Bells albums.\n\n\nAlbum progression\n\nPart one opens with a soft minor key piano line in 15/8 eventually played verbatim by organ and glockenspiel. This riff is made up of two bars; the first bar is in 7/8, the second bar is in 8/8. These are later joined by a different line in bass guitar. An occasional punchy organ chord, first heard at about 1:02 in, accents this piece, harmonised by variations of the anchor line and a later incorporated 3/4 chord sequence, both in piano. At around 3:38, a gentle flute line appears, which segues into a section of 4/4-7/8-7/8-4/4, and at 3:40 an electric guitar line, the latter entirely in 4/4.\n\nAfter the electric guitar line ends, a softer, fast guitar line (\"speed guitar,\" as listed in the liner notes) takes over, only to be interrupted by an acoustic guitar line overlaying the original piano phrase in major key. A gentle glockenspiel/piano piece takes over, but is later replaced with a fast piano section, occasionally accented with organ chords.\n\nThe mood of the first 6 minutes is soon replaced by edgy electric guitar and, afterward, a sinister organ chord, with various changes in pitch and duration. But, once again, a more refined, carefree section ensues, dominated by acoustic guitar and piano, eventually returning to the soft riff first heard just past four minutes into the piece.\n\nA 3/4 variation of the original theme comes next, followed by eerie bass and organ playing, segueing into a bluesy shuffle on electric guitar. Once again, when it looks like the piece will be serene (when the nasal choir intervenes), another edgy guitar line ensues, with Oldfield incorporating both 4/4 and 7/8.\n\nAfter that, a more folky acoustic line plays (with background tambourine), but is suddenly cut off by the tolling of bells. A weary acoustic guitar line follows, breaking into the eight-and-a-half minute \"Finale\" section, commencing with a double bass line in 5/4, polyrhythmically played with a 4/4 acoustic line. After the bass and guitar unite into the 4/4 line, the acoustic guitar tacets and is eventually replaced by soft pipe organ notes (usually lasting four or eight full beats) while the bass line plays.\n\nAfter the 10-bar bass phrase is repeated several times, Stanshall introduces many of the instruments appearing in part one up to then, beginning with the keyboards, followed by glockenspiel and all guitars before the tubular bells are announced, the ensemble becoming more dynamic and full as more instruments are said. Finally, after the tubular bells enter, a wordless feminine chorus starts to sing. Farther down, the Finale ensemble fades out to an acoustic guitar solo, which takes up the remainder of part one.\n\nPart two begins where part one left off; a soft, simple piece, this time, beginning with bass guitar and working up with other guitars and keyboards. The opening time signature is 6/8, but a later line plays a similar melody in 3/4 on various instruments, beginning with guitar. The opening section builds for five minutes before the second section starts, another 3/4 section at half tempo on acoustic guitar, with accompaniment on organ, mandolin and female chorus.\n\nAt around 8:48, the piece becomes edgy and surreal again, as the \"bagpipe guitars\" enter the piece (electric guitars with added effects to give it the bagpipe-esque sound), playing a 12/8 piece of sorts. About 11 minutes in, the intensity of the section builds as the guitar pitches increase and a heavy piano \"roll\" plays, climaxed by a sudden ascending glissando on the piano.\n\nWhat comes next is one of the more unusual parts of the entire album. Tympani rolls and drum kit commence this part, highlighted by unintelligible \"lyrical\" screams by Oldfield (who, according to rumours, was then intoxicated), in rebellion to how Richard Branson wanted him to include at least one part with lyrics to release as a single (at the time, Oldfield was not interested in adding lyrics to his music). This is listed in the liner notes as the \"Piltdown Man\". Oldfield's yelling is countered by various phrases on piano, guitars, and the \"Moribund chorus,\" with this piece abruptly ending on one loud shout exactly 16:29 in.\n\nAs expected, another quiet section ensues, a 12/8 piece mostly dominated by guitars and organ. This section gives an excellent insight into the psychedelic, spacey side of Oldfield (a similar sound to that of Pink Floyd's David Gilmour), which would also be present in his third album, Ommadawn. After about five minutes, an optimistic organ line plays, segueing into a climactic arrangement of \"Sailor's Hornpipe\".\n\n\"Sailor's Hornpipe\" begins with just one guitar playing at a moderately slow tempo, but quickly mutates into a gradually accented piece with multiple instruments (including an unlisted violin), ending with two loud, accented notes. In live performances, Oldfield would reach incredible tempos and \"Sailor's Hornpipe\" alone became a staple of his concerts.\n\n\nSound mixes\n\nThere are three known variations of the vinyl edition of Tubular Bells.\nThe standard stereo black vinyl version catalogue number V2001 (white label with twins image)\nA quadrophonic version, black vinyl catalogue number QV2001. The first 40,000 copies of this are not true quadrophonic but doctored versions of the stereo issue, thereafter the subsequent copies are true quadrophonic. Unfortunately there is no indication on the record label that this substitution was made.\nThe Picture Disc, catalogue number VP2001. This is a stereo remix of the quadrophonic version. The only difference being in the sound of the \"Reed and Pipe Organ\" during the ceremony of instruments. This version appears in the Boxed compilation.\n\n\nStereo record joke\n\nNormally, records have a small statement printed along the bottom to the effect that it is in stereo but may be played on mono record players (a holdover from the days before stereo). It normally reads:\nThis stereo record can be played on mono reproducers provided either a compatible or stereo cartridge wired for mono is fitted. Recent equipment may already be fitted with a suitable cartridge. If in doubt consult your dealer.\n\nHowever, Tubular Bells pokes fun at this by having the following text printed on the bottom of the reverse of the LP.\nThis stereo record cannot be played on old tin boxes no matter what they are fitted with. If you are in possession of such equipment please hand it into the nearest police station.\n\n\nThe recording sessions\n\nPart one was recorded in just one single week at the studio owned by the founder of Virgin Records Richard Branson, The Manor Studio. Oldfield used the studio immediately after John Cale's sessions and just before the Bonzo Dog Doo-Dah Band began recording.\nOldfield's working title for Tubular Bells was Opus One and Richard Branson thought to call it Breakfast in Bed. One of the possible album covers for Breakfast in Bed included a boiled egg with blood pouring out of it. This cover was edited and used as the artwork for Oldfield's final album with Virgin, Heaven's Open.\nMike Oldfield had been performing \"The Sailor's Hornpipe\" for years before including it on Tubular Bells, when he was the bass player with Kevin Ayers and The Whole World.\nThe only electric guitar to be used on the album was a 1966 blonde Fender Telecaster (serial no. 180728) which used to belong to Marc Bolan. Oldfield had added an extra Bill Lawrence pickup and has since sold the guitar and donated the money to the SANE charity.\nAccording to Oldfield the \"Piltdown Man\" shouting sequence came about when he had practically finished recording the instruments for the section, but felt that it needed something else. The whisky fuelled idea to create the \"Piltdown Man\" effect was to shout and scream into a microphone while running the tape at a lower speed.\nThe album was recorded on an Ampex 2\" 16 track tape recorder, which was The Manor's main recording equipment at the time.\nTo create the double speed guitar, the tape was simply run at half speed during recording. Oldfield also used a custom effects unit, named the Glorfindel box, to create the 'fuzz' or 'bagpipe' distortion on some guitar pieces on the album. The Glorfindel box was given to David Bedford at a party, who then subsequently gave it to Oldfield. Tom Newman criticised the wooden cased unit in a 2001 interview with Q magazine noting that it rarely gave the same result twice.\nThe set of tubular bells that were used on the album had been left by an instrument hire company after John Cale's sessions at the Manor, at the request of Oldfield.\nAccording to Phil Newell the Bass guitar used on the album was one of his Fender Telecaster Basses.\nVivian Stanshall, who was staying at the Manor at the time, was asked to introduce the instruments for the finale of part one. It was the way in which Stanshall had said plus... tubular bells which gave Oldfield the idea to call the album Tubular Bells.\nThe \"lyrics\" announcing the instruments are: \"Grand piano; reed and pipe organ; glockenspiel; bass guitar; double speed guitar; two slightly distorted guitars; mandolin! Spanish guitar, and introducing acoustic guitar, plus... tubular bells\".\n\n\nOriginal ending\n\nWhen recorded in 1973, the ending rendition of \"Sailor's Hornpipe\" was originally preceded by a slightly bizarre rendition of the piece. Loud marching footsteps trot around the sound channels as the \"Sailor's Hornpipe\" is played on acoustic instruments, whilst announcer Vivian Stanshall gives a drunken, improvised tour of the Manor. According to the liner notes for the Boxed vinyl set, this session occurred at four in the morning after Oldfield, engineer Tom Newman and Stanshall had been drinking heavily. They placed microphones in the rooms of the Manor, hit record and set off on an unplanned tour of the house.\n\nThe section was deemed \"too bizarre\" to include on the initial release of Tubular Bells, and was left off. The Boxed set reinstates the section at the end of side two of Tubular Bells.\n\nThe \"lyrics\" to Stanshall's improvised tour of the Manor follows:\n\n\"The hallway.\n\nFrom outside, an ordinary house. A great house, true - four hundred and eighty three rooms, each one with its own marble wash basin and douche, bidet as it may. But inside, and the positions are reversed. A human failing, some say a disease, but a disease that Sir Francis Dashwood knew, and knew it well.\n\nUpstairs, inside and a revelation. It's a discotheque. No, no, uh.. there are paintings, real, and look here - a rare seventeenth century masterpiece, and if I can scrape a little of it off, beneath I can find hidden a fourteenth century underpiece.\n\nMade entirely of tiny pieces of eggshells, this lurid work has caused controversy in the world of embroidery and anthropologicky. No, I'll say it again, anthropolology. Umm.. no quite possibly make an anthropol, no, uh, I mean an apolog..ph.. It has enthralled distinguished professors, and in layman's language is \"blinking well baffling\".\n\nBut to be more obtusely, \"buggered if I know.\" Yes, \"buggered if I know.\" And that's all we've gleaned so far from experts in fourteenth century painting, renaissance, greengrocers, and recently revived members of the public. Buggered if I know.\n\nVivian Stanshall, about three o'clock in the morning, Oxfordshire, 1973, Goodnight\"\n\nIn addition, a version of Tubular Bells was originally released on the Spanish Boxed compilation such that Part Two ended with the \"Ambient Guitars\" movement without the Sailor's Hornpipe finale.\n\n\nSingle\n\nMike Oldfield's Single was the first 7-inch single released by Mike Oldfield, in June 1974. In the UK it featured a re-recorded extract from part two of Tubular Bells as the A-side, while Froggy Went A-Courting was the B-side. The single was produced in response to an American single containing an excerpt from Tubular Bells which Oldfield did not authorise.\n\n\nDemo version\n\nOldfield recorded the demo pieces of Tubular Bells in his flat in Tottenham, London in 1971. Oldfield recorded the demos on a Bang & Olufsen Beocord 1/4\" tape machine which he had borrowed from Kevin Ayers. Oldfield was able to overdub his playing by blocking off the erase head of the tape machine. The demos titled, \"Tubular Bells Long\", \"Caveman Lead-In\", \"Caveman\", \"Peace Demo A\" and \"Peace Demo B\" appeared on the DVD-Audio version of the rerecording of Tubular Bells, Tubular Bells 2003.\n\n\nCommodore 64\n\nWith the aid of the software house CRL and distributor Nu Wave, Mike Oldfield released an interactive Commodore 64 version of the album in 1986, which utilised the computer's SID sound chip to play back a simplified re-arrangement of the album, accompanied by some simple 2D visual effects.\n\nThe \"interactivity\" offered by the album/program was limited to controlling the speed and quantity of the visual effects, tuning the sound's volume and filtering, and skipping to any part of the album.\n\nThe software was not very successful, partly due to its unusual nature. It can be considered the first, if not only, example of commercial, albeit relatively simple, interactive computer demo or \"musicdisk\", while other sources consider it a \"union between music and videogames\".\n\nThis, combined with the low quality of the final sound output compared to the original album, despite the C64 arguably having one of the best sound chips of its era, decreed the attempt's failure. It's also one of the earliest attempts by part of a musician to release an interactive/multimedia software based on his works, before the CD-ROM era and before the first videogames and multimedia discs licensed by a music artist appeared.\n\n\nMaestro\n\nIn 2004 Oldfield launched a virtual reality project called Maestro which contains music from the re-recorded Tubular Bells album (Tubular Bells 2003). The original title of the game was The Tube World. This was the second game which was released under the MusicVR banner, the first being Tres Lunas.\n\n\nCover versions\n\nEd Starink made an abridged cover for an album Synthesizer Greatest (the first album in a multi-volume series) that was released in 1989. Tubular Bells appears only on the CD-version as a \"bonus track\". Other tracks on the album are cover versions of famous synthesizer songs but the original Tubular Bells features no synthesizer\nFinnish one-man a cappella rock band Paska recorded an abridged cover version for his 2005 album Women Are From Venus, Men From Anus. Paska has also performed the song at his live performances. This number can be considered both a parody of the original work and mockery of progressive rock and new age music in general. In a concert held on the 1st October 2007 in club Tavastia in Helsinki), before performing his version of the song, Ari Peltonen gave a speech about his hatred towards the song and progressive rock in general.\nBook of Love opened their 1988 album Lullaby with a cover version, stretched to 4/4 time by adding stretching a note to make it danceable.\nTherapy? jokingly covered the opening theme live in 1998 as part of a medley, which opened with \"Tubular Bells\", segued into Judas Priest's Breaking the Law, and ended with their own Nowhere.\nDuo Sonare, a German classical guitar duo, has made a complete rerecording of Tubular Bells for two guitars.\nThrash metal band Possessed played the intro in the first song of the record Seven Churches (in 1985), which is titled The Exorcist.\nAnother thrash metal band called Death Angel played the main theme in the title track of the album the Ultra-Violence in 1987.\nLol Coxhill and Steven Miller parodied Tubular Bells in Tubercular Balls on the album The Story So Far...Oh Really!.\nPaul Hardcastle based his single 19 around the piano theme of Tubular Bells.\nForma Tadre use the intro guitars from the second part of Tubular bells in their song Automate on the album of the same name. Their version is done with synth and only repeats the first two bars.\nRapper Tech N9ne also used a similar version of the intro in the song Be Warned, only he moved it to 4/4 time, rather than the 7/8 to 8/8 signatures. The piano intro is a slight modification of the original. Also, the bassline, although quite different-sounding itself, is a slight copy of the original bassline, only with a few notes added.\nAmerican artist Tori Amos has frequently been using the opening Tubular Bells theme in her live shows. It began during the 1996 Dew Drop Inn Tour where she would let Father Lucifer segue into Tubular Bells on the piano while singing words from Bronski Beat's Smalltown Boy as well as playing it on the harpsichord during songs Love Song (a Cure cover) and Bells for Her (from Under the Pink), usually while mixing in lyrics from a third song such as Björk's Hyperballad or Blue Skies. It appeared again in 2005 as part of Yes, Anastasia and on the current 2007 tour promoting her album American Doll Posse it is being performed with full band as an intro to Devils and Gods.\nCalifornia Guitar Trio covers most of the first side of the original album on their album Echoes released in late March 2008.\n\n\nFurthermore, many dance acts and other artists have used the intro to Tubular Bells as the basis for their songs. A long list can be found at Rainer Muenz' discography. <a href=\"https://www.last.fm/music/Mike+Oldfield/Tubular+Bells\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wiki_summary": "Tubular Bells is a record album, written and mostly performed by Mike Oldfield, released in 1973. The late Vivian Stanshall provided the voice of the \"Master of Ceremonies\" who reads off the list of instruments at the end of the first movement. The piece was later orchestrated by David Bedford for The Orchestral Tubular Bells version and it had two sequels in the 1990s, Tubular Bells II and Tubular Bells III. Significance Oldfield approached (and was rejected by) many other established record labels. Some of the rejections were because they believed the piece to be unmarketable. Oldfield then played his <a href=\"https://www.last.fm/music/Mike+Oldfield/Tubular+Bells\">Read more on Last.fm</a>."
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "© 2009 Oldfield Music Limited, under exclusive licence to Mercury Records Limited",
          "type": "C"
        },
        {
          "text": "This Compilation ℗ 2009 Oldfield Music Limited, under exclusive licence to Mercury Records Limited",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "00602527077079"
      },
      "id": "2Pweuxcp4YkONGzMXfcWVI",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b273711c26dfd475beeb57b200eb",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e02711c26dfd475beeb57b200eb",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d00004851711c26dfd475beeb57b200eb",
          "width": 64
        }
      ],
      "label": "UMC (Universal Music Catalogue)",
      "popularity": 18,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
            },
            "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
            "id": "562Od3CffWedyz2BbeYWVn",
            "name": "Mike Oldfield",
            "type": "artist",
            "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
          }
        ],
        "copyrights": [
          {
            "text": "© 2009 Oldfield Music Limited, under exclusive licence to Mercury Records Limited",
            "type": "C"
          },
          {
            "text": "This Compilation ℗ 2009 Oldfield Music Limited, under exclusive licence to Mercury Records Limited",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "00602527077079"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/2Pweuxcp4YkONGzMXfcWVI"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/2Pweuxcp4YkONGzMXfcWVI?market=US",
        "id": "2Pweuxcp4YkONGzMXfcWVI",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b273711c26dfd475beeb57b200eb",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e02711c26dfd475beeb57b200eb",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d00004851711c26dfd475beeb57b200eb",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "UMC (Universal Music Catalogue)",
        "name": "Tubular Bells",
        "popularity": 18,
        "release_date": "2009-01-01",
        "release_date_precision": "day",
        "total_tracks": 15,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/2Pweuxcp4YkONGzMXfcWVI/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 1,
              "duration_ms": 1372320,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/256FCaNGgOFuvD4UGrAYcX"
              },
              "href": "https://api.spotify.com/v1/tracks/256FCaNGgOFuvD4UGrAYcX",
              "id": "256FCaNGgOFuvD4UGrAYcX",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Long / 1971 Demo",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:256FCaNGgOFuvD4UGrAYcX"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 1,
              "duration_ms": 160613,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/4Kx0EZrSd0o66vworbBckT"
              },
              "href": "https://api.spotify.com/v1/tracks/4Kx0EZrSd0o66vworbBckT",
              "id": "4Kx0EZrSd0o66vworbBckT",
              "is_local": false,
              "is_playable": true,
              "name": "Caveman - Lead-In / 1971 Demo",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:4Kx0EZrSd0o66vworbBckT"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 1,
              "duration_ms": 302880,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2QpCOTqx23tkEkVjdpTaq4"
              },
              "href": "https://api.spotify.com/v1/tracks/2QpCOTqx23tkEkVjdpTaq4",
              "id": "2QpCOTqx23tkEkVjdpTaq4",
              "is_local": false,
              "is_playable": true,
              "name": "Caveman - 1971 Demo",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:2QpCOTqx23tkEkVjdpTaq4"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 1,
              "duration_ms": 417906,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3oRiJ7vaDwWRWovkMFpqWS"
              },
              "href": "https://api.spotify.com/v1/tracks/3oRiJ7vaDwWRWovkMFpqWS",
              "id": "3oRiJ7vaDwWRWovkMFpqWS",
              "is_local": false,
              "is_playable": true,
              "name": "Peace - Demo A / 1971 Demo",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:3oRiJ7vaDwWRWovkMFpqWS"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 1,
              "duration_ms": 256653,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6wMjBMkh7zxnyY25eAD72Q"
              },
              "href": "https://api.spotify.com/v1/tracks/6wMjBMkh7zxnyY25eAD72Q",
              "id": "6wMjBMkh7zxnyY25eAD72Q",
              "is_local": false,
              "is_playable": true,
              "name": "Peace - Demo B / 1971 Demo",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:6wMjBMkh7zxnyY25eAD72Q"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 1,
              "duration_ms": 1512706,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/656yu50PA3AWsBbEVj2gVk"
              },
              "href": "https://api.spotify.com/v1/tracks/656yu50PA3AWsBbEVj2gVk",
              "id": "656yu50PA3AWsBbEVj2gVk",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Part One / Rough Mix / November 1972",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:656yu50PA3AWsBbEVj2gVk"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 2,
              "duration_ms": 1528973,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/143GD7mMPzIZH6JBECTo1k"
              },
              "href": "https://api.spotify.com/v1/tracks/143GD7mMPzIZH6JBECTo1k",
              "id": "143GD7mMPzIZH6JBECTo1k",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Pt. I",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:143GD7mMPzIZH6JBECTo1k"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 2,
              "duration_ms": 1397866,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5L8fUYfU6EY1LPSxoekYu8"
              },
              "href": "https://api.spotify.com/v1/tracks/5L8fUYfU6EY1LPSxoekYu8",
              "id": "5L8fUYfU6EY1LPSxoekYu8",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Pt. II",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:5L8fUYfU6EY1LPSxoekYu8"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 3,
              "duration_ms": 1561133,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5bZK8SanfPxvZlINxgEMRw"
              },
              "href": "https://api.spotify.com/v1/tracks/5bZK8SanfPxvZlINxgEMRw",
              "id": "5bZK8SanfPxvZlINxgEMRw",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Pt. I",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:5bZK8SanfPxvZlINxgEMRw"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 3,
              "duration_ms": 1397160,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3bhQcD1ipNLGLdA0r177t1"
              },
              "href": "https://api.spotify.com/v1/tracks/3bhQcD1ipNLGLdA0r177t1",
              "id": "3bhQcD1ipNLGLdA0r177t1",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Pt. II",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:3bhQcD1ipNLGLdA0r177t1"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 3,
              "duration_ms": 236373,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/13WCvw18BAMdwFrZsBBRDN"
              },
              "href": "https://api.spotify.com/v1/tracks/13WCvw18BAMdwFrZsBBRDN",
              "id": "13WCvw18BAMdwFrZsBBRDN",
              "is_local": false,
              "is_playable": true,
              "name": "Mike Oldfield's Single - Theme From Tubular Bells",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:13WCvw18BAMdwFrZsBBRDN"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 3,
              "duration_ms": 172680,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3Z1OXLIxByGXoOtahv31tm"
              },
              "href": "https://api.spotify.com/v1/tracks/3Z1OXLIxByGXoOtahv31tm",
              "id": "3Z1OXLIxByGXoOtahv31tm",
              "is_local": false,
              "is_playable": true,
              "name": "Sailor's Hornpipe - Viv Stanshall Version",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:3Z1OXLIxByGXoOtahv31tm"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 4,
              "duration_ms": 1549320,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1ET3KAo2wORsHfkYLH2Mo7"
              },
              "href": "https://api.spotify.com/v1/tracks/1ET3KAo2wORsHfkYLH2Mo7",
              "id": "1ET3KAo2wORsHfkYLH2Mo7",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Part One / Boxed Mix",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:1ET3KAo2wORsHfkYLH2Mo7"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 4,
              "duration_ms": 1301813,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3yb1hbP8fcXsfI0AK7NPur"
              },
              "href": "https://api.spotify.com/v1/tracks/3yb1hbP8fcXsfI0AK7NPur",
              "id": "3yb1hbP8fcXsfI0AK7NPur",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Part Two / Boxed Mix",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:3yb1hbP8fcXsfI0AK7NPur"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/562Od3CffWedyz2BbeYWVn"
                  },
                  "href": "https://api.spotify.com/v1/artists/562Od3CffWedyz2BbeYWVn",
                  "id": "562Od3CffWedyz2BbeYWVn",
                  "name": "Mike Oldfield",
                  "type": "artist",
                  "uri": "spotify:artist:562Od3CffWedyz2BbeYWVn"
                }
              ],
              "disc_number": 4,
              "duration_ms": 196680,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2p6cXkUjKUJDHAEgUd9ebz"
              },
              "href": "https://api.spotify.com/v1/tracks/2p6cXkUjKUJDHAEgUd9ebz",
              "id": "2p6cXkUjKUJDHAEgUd9ebz",
              "is_local": false,
              "is_playable": true,
              "name": "Tubular Bells - Opening Theme / From \"The Exorcist\"",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:2p6cXkUjKUJDHAEgUd9ebz"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 15
        },
        "type": "album",
        "uri": "spotify:album:2Pweuxcp4YkONGzMXfcWVI"
      },
      "release_date": "2009-01-01",
      "release_date_precision": "day",
      "total_tracks": 15,
      "tracks": [
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1372320,
          "explicit": false,
          "id": "256FCaNGgOFuvD4UGrAYcX",
          "name": "Tubular Bells - Long / 1971 Demo",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 160613,
          "explicit": false,
          "id": "4Kx0EZrSd0o66vworbBckT",
          "name": "Caveman - Lead-In / 1971 Demo",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 302880,
          "explicit": false,
          "id": "2QpCOTqx23tkEkVjdpTaq4",
          "name": "Caveman - 1971 Demo",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 417906,
          "explicit": false,
          "id": "3oRiJ7vaDwWRWovkMFpqWS",
          "name": "Peace - Demo A / 1971 Demo",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 256653,
          "explicit": false,
          "id": "6wMjBMkh7zxnyY25eAD72Q",
          "name": "Peace - Demo B / 1971 Demo",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1512706,
          "explicit": false,
          "id": "656yu50PA3AWsBbEVj2gVk",
          "name": "Tubular Bells - Part One / Rough Mix / November 1972",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1528973,
          "explicit": false,
          "id": "143GD7mMPzIZH6JBECTo1k",
          "name": "Tubular Bells - Pt. I",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1397866,
          "explicit": false,
          "id": "5L8fUYfU6EY1LPSxoekYu8",
          "name": "Tubular Bells - Pt. II",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1561133,
          "explicit": false,
          "id": "5bZK8SanfPxvZlINxgEMRw",
          "name": "Tubular Bells - Pt. I",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1397160,
          "explicit": false,
          "id": "3bhQcD1ipNLGLdA0r177t1",
          "name": "Tubular Bells - Pt. II",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 236373,
          "explicit": false,
          "id": "13WCvw18BAMdwFrZsBBRDN",
          "name": "Mike Oldfield's Single - Theme From Tubular Bells",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 172680,
          "explicit": false,
          "id": "3Z1OXLIxByGXoOtahv31tm",
          "name": "Sailor's Hornpipe - Viv Stanshall Version",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1549320,
          "explicit": false,
          "id": "1ET3KAo2wORsHfkYLH2Mo7",
          "name": "Tubular Bells - Part One / Boxed Mix",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 1301813,
          "explicit": false,
          "id": "3yb1hbP8fcXsfI0AK7NPur",
          "name": "Tubular Bells - Part Two / Boxed Mix",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "562Od3CffWedyz2BbeYWVn",
              "name": "Mike Oldfield"
            }
          ],
          "duration_ms": 196680,
          "explicit": false,
          "id": "2p6cXkUjKUJDHAEgUd9ebz",
          "name": "Tubular Bells - Opening Theme / From \"The Exorcist\"",
          "preview_url": null,
          "track_number": 3
        }
      ],
      "url": "https://open.spotify.com/album/2Pweuxcp4YkONGzMXfcWVI"
    }
  },
  "spotify_id": "2Pweuxcp4YkONGzMXfcWVI",
  "spotify_url": "https://open.spotify.com/album/2Pweuxcp4YkONGzMXfcWVI",
  "styles": [
    "Prog Rock"
  ],
  "title": "Tubular Bells",
  "tracklist": [
    {
      "artists": [],
      "duration": "",
      "position": "",
      "title": "The 2009 Stereo Mixes By Mike Oldfield"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A",
      "title": "Tubular Bells (Part One)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B",
      "title": "Tubular Bells (Part Two)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "",
      "title": "The Original 1973 Stereo Album Mix"
    },
    {
      "artists": [],
      "duration": "",
      "position": "C",
      "title": "Tubular Bells (Part One)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D",
      "title": "Tubular Bells (Part Two)"
    }
  ],
  "updated_at": "2025-07-05T17:33:40.646293",
  "year": 2016
}