{
  "apple_music_id": "160926",
  "apple_music_url": "https://music.apple.com/gb/artist/ray-charles/160926",
  "biography": "Ray Charles (Ray Charles Robinson,  Albany, Georgia, September 23, 1930 - Beverly Hills, California, June 10, 2004), was an American singer-songwriter, musician, arranger, and band leader. \n\nAs a rock and roll, rhythm & blues, soul, blues, jazz, country and pop musician he helped to shape the sound of rhythm & blues.\n\nHe brought a soulful sound to everything from country music (\"I Can't Stop Loving You\") to rock and roll (\"Mess Around\"), to pop standards to a now-iconic rendition of \"America the Beautiful.\" Frank Sinatra called him \"the only genius in the business.\"\n\nRay Charles was born in Albany, Georgia on September 23, 1930. He was the son of Aretha Williams, a share cropper, and Bailey Robinson, a railroad repair man, mechanic and handyman. The two were never married. The family moved to Greenville, Florida, when Ray was an infant. Bailey had three more families, leaving Aretha to raise the family on her own.\n\nRay Charles was not born blind. He started to lose his sight somewhere at the age of five. He was rendered totally blind by the age of seven. Charles never knew exactly why he lost his sight, though there are sources that suggest his blindness was due to glaucoma, and some other sources suggest that Ray began to lose his sight from an infection caused by soapy water to his eyes which was left untreated. He attended school at the Florida School for the Deaf and the Blind in St. Augustine, Florida from 1937-1945 where he developed his musical gift that he is known and remembered for today. His father died when he was ten, followed by his mother five years later.\n\nIn school, he was taught only classical music, but he wanted to play what he heard on the radio, jazz and blues. After his mother died, Charles did not return to school. He lived in Jacksonville with a couple who were friends of his mother. For over a year, he played the piano for bands at the Ritz Theatre in LaVilla, earning $4 a night. Charles moved to Orlando, then Tampa, where he played \"with a hillbilly band called The Florida Playboys.\" This is where Charles began his reputation of always wearing sunglasses that were made by designer Billy Stickles.\n\nCharles had always played for other people, but he wanted a band that was his own. He decided to leave Florida for a large city, but Chicago and New York City were too big. He moved to Seattle in 1947 and soon started recording, first for the label Swing Time Records, achieving his first hit with the 1949 \"Confession Blues\". The song soared to #2 on the R&B charts. He followed his first recording with his only other hit with Swingtime, \"Baby, Let Me Hold Your Hand\" in 1951. It hit #5 on the R&B charts. He then signed with Ahmet Ertegün at Atlantic Records a year later. When he entered show business, his name was shortened to Ray Charles to avoid confusion with boxer Sugar Ray Robinson.\n\nBreakthrough period with Atlantic Records\nAlmost immediately after signing with Atlantic, Charles scored his first hit singles with the label with \"It Should Have Been Me\" and the Ertegün-composed \"Mess Around\", both making the charts in 1953. But it was Charles' \"I Got A Woman\" (composed with band mate Renald Richard) that brought the musician to national prominence.\n\nThe song reached the top of Billboard's R&B singles chart in 1955 and from there until 1959, Charles would have a series of R&B chart-toppers including \"This Little Girl of Mine\", \"Lonely Avenue\", \"Mary Ann\", \"Drown in My Own Tears\" and \"The Night Time (Is the Right Time)\", which were compiled on his Atlantic releases Hallelujah, I Love Her So, Yes Indeed!, and The Genius Sings the Blues. Charles was often cited for using his voice like a saxophone, most notably by the prominent critic Victor Bollo. During this time of transition, he recruited a young girl group from Philadelphia named The Cookies as his background singing group, recording with them in New York and changing their name to the Raelettes in the process.\n\nCrossover success\nIn 1959, Charles crossed over to top 40 radio with the release of his impromptu blues number, \"What'd I Say\", which was initially conceived while Charles was in concert. The song would reach number 1 on the R&B list and would become Charles' first top ten single on the pop charts, peaking at number 6. Charles would also record The Genius of Ray Charles, before leaving Atlantic for a more lucrative deal with ABC Records in 1959.\n\nHit songs such as \"Georgia On My Mind\" (US #1), \"Hit the Road Jack\" (US #1) and \"Unchain My Heart\" (US #9) helped him transition to pop success and his landmark 1962 album, Modern Sounds in Country and Western Music and its sequel Modern Sounds in Country and Western Music, Vol. 2, helped to bring country into the mainstream of music. He also had major pop hits in 1963 with \"Busted\" (US #4) and \"Take These Chains From My Heart\" (US #8), and also scoring a Top 20 hit four years later, in 1967, with \"Here We Go Again\" (US #15) (which would later be duetted with Norah Jones in 2004).\n\nLater years\nIn 1965, Charles was arrested for possession of heroin, a drug to which he had been addicted for nearly 20 years. It was his third arrest for the offence, but he avoided jail time after kicking the habit in a clinic in Los Angeles. He spent a year on parole in 1966, when his single \"Crying Time\" reached #6 on the charts.\n\nDuring the late 1960s and into the 1970s, Charles' releases were hit-or-miss, with some big hits and critically acclaimed work. His version of \"Georgia On My Mind\" was proclaimed the state song of Georgia on April 24, 1979, with Charles performing it on the floor of the state legislature. He also had success with his unique version of \"America the Beautiful.\"\n\nIn November 1977 Charles appeared as the host of NBC's Saturday Night Live. In the 1980s a number of other events increased Charles' recognition among young audiences. He made a cameo appearance in the popular 1980 film The Blues Brothers. In 1985, \"The Right Time\" was featured in the episode \"Happy Anniversary\" of The Cosby Show on NBC. The next year in 1986, he sang America The Beautiful at Wrestlemania 2. In a Pepsi Cola commercial of the early 1990s, Charles popularized the catchphrase \"You Got the Right One, Baby!\" plus he helped in the song \"We Are the World\" a touching song for USA for Africa.\n\nDespite his support of Martin Luther King, Jr. in the 1960s and his support for the American Civil Rights Movement, Charles courted controversy when he toured South Africa in 1981, during an international boycott of the country because of its apartheid policy.\n\nCharles recorded a cover version of the Japanese band Southern All Stars' song \"Itoshi no Ellie\" as \"Ellie My Love\" for a Suntory TV advertisement, reaching #3 on Japan's Oricon chart. Eventually, it sold more than 400,000 copies, and became that year's best-selling single performed by a Western artist for the Japanese music market.\n\nBesides winning 17 Grammy Awards in his career (include five posthumous ones), Charles was also honored in many other ways. In 1979, he was one of the first honorees of the Georgia State Music Hall of Fame being recognized for being a musician born in the state. Ray's version of \"Georgia On My Mind\" was made into the official state song for Georgia. In 1981, he was given a star on the Hollywood Walk of Fame and was one of the first inductees to the Rock & Roll Hall of Fame at its inaugural ceremony in 1986. He received the Kennedy Center Honors in 1986. In 1987, he was awarded the Grammy Lifetime Achievement Award. In 1991, he was inducted to the Rhythm & Blues Foundation. In 1998 he was awarded the Polar Music Prize together with Ravi Shankar in Stockholm, Sweden. In 2004 he was inducted to the Jazz Hall of Fame, and inducted to the National Black Sports & Entertainment Hall of Fame. Also in 2004, Rolling Stone Magazine ranked him #10 on their list of the 100 Greatest Artists of All Time.\n\nThe Grammy Awards of 2005 were dedicated to Charles.\n\nOn December 7, 2007, Ray Charles Plaza was opened in Albany, Georgia, with a revolving, lighted bronze sculpture of Charles seated at a piano.\n\nOn December 26, 2007, Ray Charles was inducted into the Hit Parade Hall of Fame.\n\nRay Charles Post Office Building\nIn 2005, the U.S. postal facility located at 4960 W. Washington Blvd., in Los Angeles, California, was designated  the Ray Charles Post Office Building. \nOn August 24, 2005, the United States Congress honored Charles by dedicating and renaming the former West Adams Station post office in Los Angeles the \"Ray Charles Station\".\n\nCharles has also appeared at two Presidential inaugurations in his lifetime. In 1985, he performed for Ronald Reagan's second inauguration, and in 1993 performed for Bill Clinton's first inauguration.\n\nIn the late '80s and early '90s, Charles made appearances on The Super Dave Osbourne Show, where he performed and appeared in a few vignettes where he was somehow driving a car, often as Super Dave's chauffeur. At the height of his newfound fame in the early nineties, Charles did guest vocals for quite a few projects. He also appeared (with Chaka Khan) on long time friend Quincy Jones' hit \"I'll Be Good to You\" in 1990, from Jones' album Back on the Block.\n\nFollowing Jim Henson's death in 1990, Ray Charles appeared in the one-hour CBS tribute, The Muppets Celebrate Jim Henson. He gave a short speech about the deceased, stating that Henson \"took a simple song and a piece of felt and turned it into a moment of great power\". Charles was referring to the song \"It's Not Easy Being Green\", which Charles later performed with the rest of the Muppet cast in a tribute to Henson's legacy.\n\nDuring the sixth season of Designing Women, Ray Charles vocally performed \"Georgia On My Mind\", rather than the song being rendered by other musicians without lyrics as in the previous five seasons\n\nDuring his life he received eight honorary doctorates, the last from Dillard University in New Orleans in 2003. Later that same year, he performed his 10,000th career concert at the Greek Theater in Los Angeles.\n\nCharles finalized \"Genius Loves Company\" a duets album in 2004, which posthumously became the best selling album of his career. Norah Jones, B.B. King, Willie Nelson, Michael McDonald, Bonnie Raitt, Gladys Knight, Johnny Mathis and James Taylor are just a few of the notable artists involved with the project.\n\nCharles was awarded the prestigious \"President's Merit Award\" from the Grammy(r) organization and was named a City of Los Angeles \"Cultural Treasure\" by LA Mayor James Hahn during \"African American Heritage Month\" in a ceremony that he attended. He also received the NAACP Image Awards' \"Hall of Fame Award.\"\n\nCharles died in July 2004 in California. Three months later, his biopic \"Ray\" opened in theaters. The performance of Jamie Foxx as Ray gave him an Oscar for best lead performance in a feature film.\n\nRecently, a series of slot machines were designed in Charles' name for the visually handicapped and the legendary performer was also named a \"living legend\" by the Library of Congress.\n\nCharles once told an interviewer from USA Today, \"Music to me is just like breathing. I have to have it. It's part of me.\" <a href=\"https://www.last.fm/music/Ray+Charles\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T17:40:35.014234",
  "discogs_id": "30552",
  "discogs_url": "https://www.discogs.com/artist/30552-Ray-Charles",
  "followers": 2550057,
  "formed_date": null,
  "genres": [
    "R&B/Soul",
    "jazz blues",
    "soul",
    "soul blues",
    "blues",
    "classic soul",
    "vocal jazz",
    "jazz",
    "rhythm and blues",
    "piano"
  ],
  "id": "ray-charles-1751733639",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/e9/5f/b3/e95fb3e9-6253-732a-7578-a72207d6b0ef/mzl.nrobskfq.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb6fc460f10177fa38af69b8bf",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab676161000051746fc460f10177fa38af69b8bf",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f1786fc460f10177fa38af69b8bf",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/gP9GFFdjHjgVLI5fTltYRWgffl_lF7eA3Fp4-TwhFe4/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/rk7xW-VN-pNL-nnKKjn5Sdx7_6kIq0RMDbs20Ou67-4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "2ce02909-598b-44ef-a456-151ba0a3bd70",
  "lastfm_url": "https://www.last.fm/music/Ray+Charles",
  "local_images": {
    "hi-res": "../public/artist/ray-charles/ray-charles-hi-res.jpg",
    "medium": "../public/artist/ray-charles/ray-charles-medium.jpg",
    "small": "../public/artist/ray-charles/ray-charles-small.jpg"
  },
  "name": "Ray Charles",
  "popularity": 71,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/e9/5f/b3/e95fb3e9-6253-732a-7578-a72207d6b0ef/mzl.nrobskfq.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "R&B/Soul"
      ],
      "id": "160926",
      "name": "Ray Charles",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/ray-charles/160926"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/gP9GFFdjHjgVLI5fTltYRWgffl_lF7eA3Fp4-TwhFe4/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "30552",
      "images": [
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/gP9GFFdjHjgVLI5fTltYRWgffl_lF7eA3Fp4-TwhFe4/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/gP9GFFdjHjgVLI5fTltYRWgffl_lF7eA3Fp4-TwhFe4/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/rk7xW-VN-pNL-nnKKjn5Sdx7_6kIq0RMDbs20Ou67-4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/K3oSpivolmLCjr_Tx5KycmlSFNwD9gBlfzByo6hZ5M8/rs:fit/g:sm/q:90/h:300/w:440/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MDcu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/K3oSpivolmLCjr_Tx5KycmlSFNwD9gBlfzByo6hZ5M8/rs:fit/g:sm/q:90/h:300/w:440/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MDcu/anBn.jpeg",
          "uri150": "https://i.discogs.com/Z6FhHEVPYB3_mtKkIKzSwysQ2AWiqN_TIJkSPysVaSU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MDcu/anBn.jpeg",
          "width": 440
        },
        {
          "height": 120,
          "resource_url": "https://i.discogs.com/Lx4OWTBeb0YHItESB2FiYTYnb4Fp-qEC5byjxI0YgJw/rs:fit/g:sm/q:90/h:120/w:120/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTAwMS5naWY.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Lx4OWTBeb0YHItESB2FiYTYnb4Fp-qEC5byjxI0YgJw/rs:fit/g:sm/q:90/h:120/w:120/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTAwMS5naWY.jpeg",
          "uri150": "https://i.discogs.com/83FEkBf2ndez3HKLnbN1DtuBDgsb4u9FtUrN4v4-cCQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTAwMS5naWY.jpeg",
          "width": 120
        },
        {
          "height": 323,
          "resource_url": "https://i.discogs.com/O9WvQ_es_lr-J_-r1IImPCej3zQWG1f8zsFdjR7GMGs/rs:fit/g:sm/q:90/h:323/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MTQu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/O9WvQ_es_lr-J_-r1IImPCej3zQWG1f8zsFdjR7GMGs/rs:fit/g:sm/q:90/h:323/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MTQu/anBn.jpeg",
          "uri150": "https://i.discogs.com/em333gIMuaXxGI1-eO-c2NZr4ocI5v3iWBuuEjR9jEw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MTQu/anBn.jpeg",
          "width": 500
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/OJQtOGDHc8UXl_9Dz56BAisclqNgApOVe7DQbCdDJoQ/rs:fit/g:sm/q:90/h:300/w:235/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5Mjgu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/OJQtOGDHc8UXl_9Dz56BAisclqNgApOVe7DQbCdDJoQ/rs:fit/g:sm/q:90/h:300/w:235/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5Mjgu/anBn.jpeg",
          "uri150": "https://i.discogs.com/S0uR9HmPC5UioDxw_gKCmz9owd2Gc9xr01rL5q3wHFQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5Mjgu/anBn.jpeg",
          "width": 235
        },
        {
          "height": 450,
          "resource_url": "https://i.discogs.com/DGhXWYZIb33gd7-PXx1CtbFXmQdIIuXfF2qQk2DSThA/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExODI2Mzk1NzQu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/DGhXWYZIb33gd7-PXx1CtbFXmQdIIuXfF2qQk2DSThA/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExODI2Mzk1NzQu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/GswUHgHyN9w9KfXmUeVf8dBuKZ6wY3IwoT0uz4CVlMs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExODI2Mzk1NzQu/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 333,
          "resource_url": "https://i.discogs.com/kLQPsDnOgDUOmuReA_oz8uFWVKY-PxwXqm5Ln0OJAFU/rs:fit/g:sm/q:90/h:333/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMDkt/MTk1NS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/kLQPsDnOgDUOmuReA_oz8uFWVKY-PxwXqm5Ln0OJAFU/rs:fit/g:sm/q:90/h:333/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMDkt/MTk1NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/2510fXUxFAgcJfb12VWwSbK-WZDX2I6G-xZNNkcRdeQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMDkt/MTk1NS5qcGVn.jpeg",
          "width": 250
        },
        {
          "height": 259,
          "resource_url": "https://i.discogs.com/am4Mqf8H41iTlYdVjjKr2AQ48ShPT-VEtJD3WMTfXEQ/rs:fit/g:sm/q:90/h:259/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMTQt/OTc1OC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/am4Mqf8H41iTlYdVjjKr2AQ48ShPT-VEtJD3WMTfXEQ/rs:fit/g:sm/q:90/h:259/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMTQt/OTc1OC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/s6i-7Dyiabj1LYZu6qBMw6v_djS7TSCH8YWzGbKpF6E/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMTQt/OTc1OC5qcGVn.jpeg",
          "width": 220
        },
        {
          "height": 332,
          "resource_url": "https://i.discogs.com/axR_-DQ-sAG5RzQfh_MBYngZJDyMd40Vv3A3FZz29n8/rs:fit/g:sm/q:90/h:332/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/NjczMC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/axR_-DQ-sAG5RzQfh_MBYngZJDyMd40Vv3A3FZz29n8/rs:fit/g:sm/q:90/h:332/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/NjczMC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/wKOZx6C5Ri4O7wzVqyNdKNJZt0NKc2ccIFzFzj3MNfw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/NjczMC5qcGVn.jpeg",
          "width": 220
        },
        {
          "height": 165,
          "resource_url": "https://i.discogs.com/xfb7TWOSDEDh4X9lQg2odcYnn22gPgF_9pL7DHhwad0/rs:fit/g:sm/q:90/h:165/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/Njc3NS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/xfb7TWOSDEDh4X9lQg2odcYnn22gPgF_9pL7DHhwad0/rs:fit/g:sm/q:90/h:165/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/Njc3NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/janLNfg-pSR0tsfM46d1gO_IUmxqr8fQOYLoxsmDVEI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/Njc3NS5qcGVn.jpeg",
          "width": 220
        },
        {
          "height": 848,
          "resource_url": "https://i.discogs.com/bBHfNlNEFTZXdFyXLke6NGqGiVoqPG22kZRr8BeebtY/rs:fit/g:sm/q:90/h:848/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE3MTQ2NDU5ODMt/NTgyNi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/bBHfNlNEFTZXdFyXLke6NGqGiVoqPG22kZRr8BeebtY/rs:fit/g:sm/q:90/h:848/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE3MTQ2NDU5ODMt/NTgyNi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/HiC1ggScfkjuZpBi1K6avWZMvotb0kxMPD6tUqA5ViE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE3MTQ2NDU5ODMt/NTgyNi5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "Ray Charles",
      "namevariations": [
        "Chadles",
        "Charles",
        "Charles R",
        "Charles Ray",
        "Charles Ray Robinson",
        "Charles, R.",
        "Charles, Ray",
        "Charles,R",
        "Charless",
        "Charlos",
        "Lay Charles",
        "M. Charles",
        "Mr Charles",
        "Mr. Charles",
        "R Ch",
        "R Charles",
        "R, Charles",
        "R. CHarles",
        "R. Charles",
        "R. Charls",
        "R.Charles",
        "Ray",
        "Ray 'The Genious' Charles",
        "Ray Charles And The Raelettes",
        "Ray Charles Robinson",
        "Ray Charlet",
        "Ray Charlles",
        "Ray Charlrs",
        "Ray Charls",
        "Ray Sings",
        "Ray!",
        "Rey Charles",
        "The Piano Of Ray Charles",
        "W Charles",
        "W. Charles",
        "Р. Чарльз",
        "Рей Чарлз",
        "Рей Чарльз",
        "Рэй Чарлз",
        "Рэй Чарльз",
        "Чарльз",
        "ריי צ'ארלס",
        "レイ・チャールス",
        "レイ・チャールズ",
        "レイ・・チャールズ",
        "雷查尔斯"
      ],
      "profile": "American singer, songwriter, musician, and composer, born September 23, 1930, Albany, Georgia, USA – died June 10, 2004, Beverly Hills, California, USA.\r\nHe was inducted into Rock And Roll Hall of Fame in 1986 (Performer). \r\n[b]For the leader of the Ray Charles Singers, see [a=Ray Charles (2)].[/b]\r\n[b]For the co-writer of the songs \"Frenesi\" and \"South\", see [a4184422][/b]\r\nIn 1962, he founded [l=Tangerine Records]. After Charles left [l=ABC Records] in 1973, he closed Tangerine and started [l=Crossover Records (3)]. The Tangerine catalog is owned by [l=Ray Charles Enterprises, Inc.]\r\n\r\n",
      "raw_data": {
        "aliases": [
          {
            "id": 7927347,
            "name": "Ray Charles Robinson",
            "resource_url": "https://api.discogs.com/artists/7927347",
            "thumbnail_url": "https://i.discogs.com/6L-8SbDUHL5uEbZgFnrOZDQHVU6QJffyaiJBYrI3kg8/rs:fit/g:sm/q:40/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTc5Mjcz/NDctMTU5MTE5Nzc1/MS03MTA5LmpwZWc.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 30552,
        "images": [
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/gP9GFFdjHjgVLI5fTltYRWgffl_lF7eA3Fp4-TwhFe4/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/gP9GFFdjHjgVLI5fTltYRWgffl_lF7eA3Fp4-TwhFe4/rs:fit/g:sm/q:90/h:400/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/rk7xW-VN-pNL-nnKKjn5Sdx7_6kIq0RMDbs20Ou67-4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/K3oSpivolmLCjr_Tx5KycmlSFNwD9gBlfzByo6hZ5M8/rs:fit/g:sm/q:90/h:300/w:440/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MDcu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/K3oSpivolmLCjr_Tx5KycmlSFNwD9gBlfzByo6hZ5M8/rs:fit/g:sm/q:90/h:300/w:440/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MDcu/anBn.jpeg",
            "uri150": "https://i.discogs.com/Z6FhHEVPYB3_mtKkIKzSwysQ2AWiqN_TIJkSPysVaSU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MDcu/anBn.jpeg",
            "width": 440
          },
          {
            "height": 120,
            "resource_url": "https://i.discogs.com/Lx4OWTBeb0YHItESB2FiYTYnb4Fp-qEC5byjxI0YgJw/rs:fit/g:sm/q:90/h:120/w:120/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTAwMS5naWY.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Lx4OWTBeb0YHItESB2FiYTYnb4Fp-qEC5byjxI0YgJw/rs:fit/g:sm/q:90/h:120/w:120/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTAwMS5naWY.jpeg",
            "uri150": "https://i.discogs.com/83FEkBf2ndez3HKLnbN1DtuBDgsb4u9FtUrN4v4-cCQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTAwMS5naWY.jpeg",
            "width": 120
          },
          {
            "height": 323,
            "resource_url": "https://i.discogs.com/O9WvQ_es_lr-J_-r1IImPCej3zQWG1f8zsFdjR7GMGs/rs:fit/g:sm/q:90/h:323/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MTQu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/O9WvQ_es_lr-J_-r1IImPCej3zQWG1f8zsFdjR7GMGs/rs:fit/g:sm/q:90/h:323/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MTQu/anBn.jpeg",
            "uri150": "https://i.discogs.com/em333gIMuaXxGI1-eO-c2NZr4ocI5v3iWBuuEjR9jEw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5MTQu/anBn.jpeg",
            "width": 500
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/OJQtOGDHc8UXl_9Dz56BAisclqNgApOVe7DQbCdDJoQ/rs:fit/g:sm/q:90/h:300/w:235/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5Mjgu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/OJQtOGDHc8UXl_9Dz56BAisclqNgApOVe7DQbCdDJoQ/rs:fit/g:sm/q:90/h:300/w:235/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5Mjgu/anBn.jpeg",
            "uri150": "https://i.discogs.com/S0uR9HmPC5UioDxw_gKCmz9owd2Gc9xr01rL5q3wHFQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExMDYwNjA5Mjgu/anBn.jpeg",
            "width": 235
          },
          {
            "height": 450,
            "resource_url": "https://i.discogs.com/DGhXWYZIb33gd7-PXx1CtbFXmQdIIuXfF2qQk2DSThA/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExODI2Mzk1NzQu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/DGhXWYZIb33gd7-PXx1CtbFXmQdIIuXfF2qQk2DSThA/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExODI2Mzk1NzQu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/GswUHgHyN9w9KfXmUeVf8dBuKZ6wY3IwoT0uz4CVlMs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTExODI2Mzk1NzQu/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 333,
            "resource_url": "https://i.discogs.com/kLQPsDnOgDUOmuReA_oz8uFWVKY-PxwXqm5Ln0OJAFU/rs:fit/g:sm/q:90/h:333/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMDkt/MTk1NS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/kLQPsDnOgDUOmuReA_oz8uFWVKY-PxwXqm5Ln0OJAFU/rs:fit/g:sm/q:90/h:333/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMDkt/MTk1NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/2510fXUxFAgcJfb12VWwSbK-WZDX2I6G-xZNNkcRdeQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMDkt/MTk1NS5qcGVn.jpeg",
            "width": 250
          },
          {
            "height": 259,
            "resource_url": "https://i.discogs.com/am4Mqf8H41iTlYdVjjKr2AQ48ShPT-VEtJD3WMTfXEQ/rs:fit/g:sm/q:90/h:259/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMTQt/OTc1OC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/am4Mqf8H41iTlYdVjjKr2AQ48ShPT-VEtJD3WMTfXEQ/rs:fit/g:sm/q:90/h:259/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMTQt/OTc1OC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/s6i-7Dyiabj1LYZu6qBMw6v_djS7TSCH8YWzGbKpF6E/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzMTQt/OTc1OC5qcGVn.jpeg",
            "width": 220
          },
          {
            "height": 332,
            "resource_url": "https://i.discogs.com/axR_-DQ-sAG5RzQfh_MBYngZJDyMd40Vv3A3FZz29n8/rs:fit/g:sm/q:90/h:332/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/NjczMC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/axR_-DQ-sAG5RzQfh_MBYngZJDyMd40Vv3A3FZz29n8/rs:fit/g:sm/q:90/h:332/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/NjczMC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/wKOZx6C5Ri4O7wzVqyNdKNJZt0NKc2ccIFzFzj3MNfw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/NjczMC5qcGVn.jpeg",
            "width": 220
          },
          {
            "height": 165,
            "resource_url": "https://i.discogs.com/xfb7TWOSDEDh4X9lQg2odcYnn22gPgF_9pL7DHhwad0/rs:fit/g:sm/q:90/h:165/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/Njc3NS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/xfb7TWOSDEDh4X9lQg2odcYnn22gPgF_9pL7DHhwad0/rs:fit/g:sm/q:90/h:165/w:220/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/Njc3NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/janLNfg-pSR0tsfM46d1gO_IUmxqr8fQOYLoxsmDVEI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE2MDA4NDYzOTEt/Njc3NS5qcGVn.jpeg",
            "width": 220
          },
          {
            "height": 848,
            "resource_url": "https://i.discogs.com/bBHfNlNEFTZXdFyXLke6NGqGiVoqPG22kZRr8BeebtY/rs:fit/g:sm/q:90/h:848/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE3MTQ2NDU5ODMt/NTgyNi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/bBHfNlNEFTZXdFyXLke6NGqGiVoqPG22kZRr8BeebtY/rs:fit/g:sm/q:90/h:848/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE3MTQ2NDU5ODMt/NTgyNi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/HiC1ggScfkjuZpBi1K6avWZMvotb0kxMPD6tUqA5ViE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE3MTQ2NDU5ODMt/NTgyNi5qcGVn.jpeg",
            "width": 600
          }
        ],
        "name": "Ray Charles",
        "namevariations": [
          "Chadles",
          "Charles",
          "Charles R",
          "Charles Ray",
          "Charles Ray Robinson",
          "Charles, R.",
          "Charles, Ray",
          "Charles,R",
          "Charless",
          "Charlos",
          "Lay Charles",
          "M. Charles",
          "Mr Charles",
          "Mr. Charles",
          "R Ch",
          "R Charles",
          "R, Charles",
          "R. CHarles",
          "R. Charles",
          "R. Charls",
          "R.Charles",
          "Ray",
          "Ray 'The Genious' Charles",
          "Ray Charles And The Raelettes",
          "Ray Charles Robinson",
          "Ray Charlet",
          "Ray Charlles",
          "Ray Charlrs",
          "Ray Charls",
          "Ray Sings",
          "Ray!",
          "Rey Charles",
          "The Piano Of Ray Charles",
          "W Charles",
          "W. Charles",
          "Р. Чарльз",
          "Рей Чарлз",
          "Рей Чарльз",
          "Рэй Чарлз",
          "Рэй Чарльз",
          "Чарльз",
          "ריי צ'ארלס",
          "レイ・チャールス",
          "レイ・チャールズ",
          "レイ・・チャールズ",
          "雷查尔斯"
        ],
        "profile": "American singer, songwriter, musician, and composer, born September 23, 1930, Albany, Georgia, USA – died June 10, 2004, Beverly Hills, California, USA.\r\nHe was inducted into Rock And Roll Hall of Fame in 1986 (Performer). \r\n[b]For the leader of the Ray Charles Singers, see [a=Ray Charles (2)].[/b]\r\n[b]For the co-writer of the songs \"Frenesi\" and \"South\", see [a4184422][/b]\r\nIn 1962, he founded [l=Tangerine Records]. After Charles left [l=ABC Records] in 1973, he closed Tangerine and started [l=Crossover Records (3)]. The Tangerine catalog is owned by [l=Ray Charles Enterprises, Inc.]\r\n\r\n",
        "realname": "Ray Charles Robinson",
        "releases_url": "https://api.discogs.com/artists/30552/releases",
        "resource_url": "https://api.discogs.com/artists/30552",
        "uri": "https://www.discogs.com/artist/30552-Ray-Charles",
        "urls": [
          "https://raycharles.com/",
          "https://theraycharlesfoundation.org/",
          "https://en.wikipedia.org/wiki/Ray_Charles",
          "https://www.britannica.com/biography/Ray-Charles",
          "https://www.imdb.com/name/nm0153124/",
          "https://www.historylink.org/File/5707"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/30552",
      "thumb": "https://i.discogs.com/rk7xW-VN-pNL-nnKKjn5Sdx7_6kIq0RMDbs20Ou67-4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTMwNTUy/LTE0NTE1NTk0NjMt/NjQ5Ny5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/30552-Ray-Charles",
      "urls": [
        "https://raycharles.com/",
        "https://theraycharlesfoundation.org/",
        "https://en.wikipedia.org/wiki/Ray_Charles",
        "https://www.britannica.com/biography/Ray-Charles",
        "https://www.imdb.com/name/nm0153124/",
        "https://www.historylink.org/File/5707"
      ]
    },
    "lastfm": {
      "bio_content": "Ray Charles (Ray Charles Robinson,  Albany, Georgia, September 23, 1930 - Beverly Hills, California, June 10, 2004), was an American singer-songwriter, musician, arranger, and band leader. \n\nAs a rock and roll, rhythm & blues, soul, blues, jazz, country and pop musician he helped to shape the sound of rhythm & blues.\n\nHe brought a soulful sound to everything from country music (\"I Can't Stop Loving You\") to rock and roll (\"Mess Around\"), to pop standards to a now-iconic rendition of \"America the Beautiful.\" Frank Sinatra called him \"the only genius in the business.\"\n\nRay Charles was born in Albany, Georgia on September 23, 1930. He was the son of Aretha Williams, a share cropper, and Bailey Robinson, a railroad repair man, mechanic and handyman. The two were never married. The family moved to Greenville, Florida, when Ray was an infant. Bailey had three more families, leaving Aretha to raise the family on her own.\n\nRay Charles was not born blind. He started to lose his sight somewhere at the age of five. He was rendered totally blind by the age of seven. Charles never knew exactly why he lost his sight, though there are sources that suggest his blindness was due to glaucoma, and some other sources suggest that Ray began to lose his sight from an infection caused by soapy water to his eyes which was left untreated. He attended school at the Florida School for the Deaf and the Blind in St. Augustine, Florida from 1937-1945 where he developed his musical gift that he is known and remembered for today. His father died when he was ten, followed by his mother five years later.\n\nIn school, he was taught only classical music, but he wanted to play what he heard on the radio, jazz and blues. After his mother died, Charles did not return to school. He lived in Jacksonville with a couple who were friends of his mother. For over a year, he played the piano for bands at the Ritz Theatre in LaVilla, earning $4 a night. Charles moved to Orlando, then Tampa, where he played \"with a hillbilly band called The Florida Playboys.\" This is where Charles began his reputation of always wearing sunglasses that were made by designer Billy Stickles.\n\nCharles had always played for other people, but he wanted a band that was his own. He decided to leave Florida for a large city, but Chicago and New York City were too big. He moved to Seattle in 1947 and soon started recording, first for the label Swing Time Records, achieving his first hit with the 1949 \"Confession Blues\". The song soared to #2 on the R&B charts. He followed his first recording with his only other hit with Swingtime, \"Baby, Let Me Hold Your Hand\" in 1951. It hit #5 on the R&B charts. He then signed with Ahmet Ertegün at Atlantic Records a year later. When he entered show business, his name was shortened to Ray Charles to avoid confusion with boxer Sugar Ray Robinson.\n\nBreakthrough period with Atlantic Records\nAlmost immediately after signing with Atlantic, Charles scored his first hit singles with the label with \"It Should Have Been Me\" and the Ertegün-composed \"Mess Around\", both making the charts in 1953. But it was Charles' \"I Got A Woman\" (composed with band mate Renald Richard) that brought the musician to national prominence.\n\nThe song reached the top of Billboard's R&B singles chart in 1955 and from there until 1959, Charles would have a series of R&B chart-toppers including \"This Little Girl of Mine\", \"Lonely Avenue\", \"Mary Ann\", \"Drown in My Own Tears\" and \"The Night Time (Is the Right Time)\", which were compiled on his Atlantic releases Hallelujah, I Love Her So, Yes Indeed!, and The Genius Sings the Blues. Charles was often cited for using his voice like a saxophone, most notably by the prominent critic Victor Bollo. During this time of transition, he recruited a young girl group from Philadelphia named The Cookies as his background singing group, recording with them in New York and changing their name to the Raelettes in the process.\n\nCrossover success\nIn 1959, Charles crossed over to top 40 radio with the release of his impromptu blues number, \"What'd I Say\", which was initially conceived while Charles was in concert. The song would reach number 1 on the R&B list and would become Charles' first top ten single on the pop charts, peaking at number 6. Charles would also record The Genius of Ray Charles, before leaving Atlantic for a more lucrative deal with ABC Records in 1959.\n\nHit songs such as \"Georgia On My Mind\" (US #1), \"Hit the Road Jack\" (US #1) and \"Unchain My Heart\" (US #9) helped him transition to pop success and his landmark 1962 album, Modern Sounds in Country and Western Music and its sequel Modern Sounds in Country and Western Music, Vol. 2, helped to bring country into the mainstream of music. He also had major pop hits in 1963 with \"Busted\" (US #4) and \"Take These Chains From My Heart\" (US #8), and also scoring a Top 20 hit four years later, in 1967, with \"Here We Go Again\" (US #15) (which would later be duetted with Norah Jones in 2004).\n\nLater years\nIn 1965, Charles was arrested for possession of heroin, a drug to which he had been addicted for nearly 20 years. It was his third arrest for the offence, but he avoided jail time after kicking the habit in a clinic in Los Angeles. He spent a year on parole in 1966, when his single \"Crying Time\" reached #6 on the charts.\n\nDuring the late 1960s and into the 1970s, Charles' releases were hit-or-miss, with some big hits and critically acclaimed work. His version of \"Georgia On My Mind\" was proclaimed the state song of Georgia on April 24, 1979, with Charles performing it on the floor of the state legislature. He also had success with his unique version of \"America the Beautiful.\"\n\nIn November 1977 Charles appeared as the host of NBC's Saturday Night Live. In the 1980s a number of other events increased Charles' recognition among young audiences. He made a cameo appearance in the popular 1980 film The Blues Brothers. In 1985, \"The Right Time\" was featured in the episode \"Happy Anniversary\" of The Cosby Show on NBC. The next year in 1986, he sang America The Beautiful at Wrestlemania 2. In a Pepsi Cola commercial of the early 1990s, Charles popularized the catchphrase \"You Got the Right One, Baby!\" plus he helped in the song \"We Are the World\" a touching song for USA for Africa.\n\nDespite his support of Martin Luther King, Jr. in the 1960s and his support for the American Civil Rights Movement, Charles courted controversy when he toured South Africa in 1981, during an international boycott of the country because of its apartheid policy.\n\nCharles recorded a cover version of the Japanese band Southern All Stars' song \"Itoshi no Ellie\" as \"Ellie My Love\" for a Suntory TV advertisement, reaching #3 on Japan's Oricon chart. Eventually, it sold more than 400,000 copies, and became that year's best-selling single performed by a Western artist for the Japanese music market.\n\nBesides winning 17 Grammy Awards in his career (include five posthumous ones), Charles was also honored in many other ways. In 1979, he was one of the first honorees of the Georgia State Music Hall of Fame being recognized for being a musician born in the state. Ray's version of \"Georgia On My Mind\" was made into the official state song for Georgia. In 1981, he was given a star on the Hollywood Walk of Fame and was one of the first inductees to the Rock & Roll Hall of Fame at its inaugural ceremony in 1986. He received the Kennedy Center Honors in 1986. In 1987, he was awarded the Grammy Lifetime Achievement Award. In 1991, he was inducted to the Rhythm & Blues Foundation. In 1998 he was awarded the Polar Music Prize together with Ravi Shankar in Stockholm, Sweden. In 2004 he was inducted to the Jazz Hall of Fame, and inducted to the National Black Sports & Entertainment Hall of Fame. Also in 2004, Rolling Stone Magazine ranked him #10 on their list of the 100 Greatest Artists of All Time.\n\nThe Grammy Awards of 2005 were dedicated to Charles.\n\nOn December 7, 2007, Ray Charles Plaza was opened in Albany, Georgia, with a revolving, lighted bronze sculpture of Charles seated at a piano.\n\nOn December 26, 2007, Ray Charles was inducted into the Hit Parade Hall of Fame.\n\nRay Charles Post Office Building\nIn 2005, the U.S. postal facility located at 4960 W. Washington Blvd., in Los Angeles, California, was designated  the Ray Charles Post Office Building. \nOn August 24, 2005, the United States Congress honored Charles by dedicating and renaming the former West Adams Station post office in Los Angeles the \"Ray Charles Station\".\n\nCharles has also appeared at two Presidential inaugurations in his lifetime. In 1985, he performed for Ronald Reagan's second inauguration, and in 1993 performed for Bill Clinton's first inauguration.\n\nIn the late '80s and early '90s, Charles made appearances on The Super Dave Osbourne Show, where he performed and appeared in a few vignettes where he was somehow driving a car, often as Super Dave's chauffeur. At the height of his newfound fame in the early nineties, Charles did guest vocals for quite a few projects. He also appeared (with Chaka Khan) on long time friend Quincy Jones' hit \"I'll Be Good to You\" in 1990, from Jones' album Back on the Block.\n\nFollowing Jim Henson's death in 1990, Ray Charles appeared in the one-hour CBS tribute, The Muppets Celebrate Jim Henson. He gave a short speech about the deceased, stating that Henson \"took a simple song and a piece of felt and turned it into a moment of great power\". Charles was referring to the song \"It's Not Easy Being Green\", which Charles later performed with the rest of the Muppet cast in a tribute to Henson's legacy.\n\nDuring the sixth season of Designing Women, Ray Charles vocally performed \"Georgia On My Mind\", rather than the song being rendered by other musicians without lyrics as in the previous five seasons\n\nDuring his life he received eight honorary doctorates, the last from Dillard University in New Orleans in 2003. Later that same year, he performed his 10,000th career concert at the Greek Theater in Los Angeles.\n\nCharles finalized \"Genius Loves Company\" a duets album in 2004, which posthumously became the best selling album of his career. Norah Jones, B.B. King, Willie Nelson, Michael McDonald, Bonnie Raitt, Gladys Knight, Johnny Mathis and James Taylor are just a few of the notable artists involved with the project.\n\nCharles was awarded the prestigious \"President's Merit Award\" from the Grammy(r) organization and was named a City of Los Angeles \"Cultural Treasure\" by LA Mayor James Hahn during \"African American Heritage Month\" in a ceremony that he attended. He also received the NAACP Image Awards' \"Hall of Fame Award.\"\n\nCharles died in July 2004 in California. Three months later, his biopic \"Ray\" opened in theaters. The performance of Jamie Foxx as Ray gave him an Oscar for best lead performance in a feature film.\n\nRecently, a series of slot machines were designed in Charles' name for the visually handicapped and the legendary performer was also named a \"living legend\" by the Library of Congress.\n\nCharles once told an interviewer from USA Today, \"Music to me is just like breathing. I have to have it. It's part of me.\" <a href=\"https://www.last.fm/music/Ray+Charles\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Ray Charles (Ray Charles Robinson,  Albany, Georgia, September 23, 1930 - Beverly Hills, California, June 10, 2004), was an American singer-songwriter, musician, arranger, and band leader. \n\nAs a rock and roll, rhythm & blues, soul, blues, jazz, country and pop musician he helped to shape the sound of rhythm & blues.\n\nHe brought a soulful sound to everything from country music (\"I Can't Stop Loving You\") to rock and roll (\"Mess Around\"), to pop standards to a now-iconic rendition of \"America the Beautiful. <a href=\"https://www.last.fm/music/Ray+Charles\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 2497878,
      "mbid": "2ce02909-598b-44ef-a456-151ba0a3bd70",
      "name": "Ray Charles",
      "playcount": 37350205,
      "similar_artists": [
        {
          "name": "Otis Redding",
          "url": "https://www.last.fm/music/Otis+Redding"
        },
        {
          "name": "Etta James",
          "url": "https://www.last.fm/music/Etta+James"
        },
        {
          "name": "Sam Cooke",
          "url": "https://www.last.fm/music/Sam+Cooke"
        },
        {
          "name": "Aretha Franklin",
          "url": "https://www.last.fm/music/Aretha+Franklin"
        },
        {
          "name": "Nina Simone",
          "url": "https://www.last.fm/music/Nina+Simone"
        }
      ],
      "tags": [
        "jazz",
        "soul",
        "blues",
        "rhythm and blues",
        "piano"
      ],
      "url": "https://www.last.fm/music/Ray+Charles"
    },
    "spotify": {
      "followers": 2550057,
      "genres": [
        "jazz blues",
        "soul",
        "soul blues",
        "blues",
        "classic soul",
        "vocal jazz"
      ],
      "id": "1eYhYunlNJlDoQhtYBvPsi",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb6fc460f10177fa38af69b8bf",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab676161000051746fc460f10177fa38af69b8bf",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f1786fc460f10177fa38af69b8bf",
          "width": 160
        }
      ],
      "name": "Ray Charles",
      "popularity": 71,
      "url": "https://open.spotify.com/artist/1eYhYunlNJlDoQhtYBvPsi"
    }
  },
  "spotify_id": "1eYhYunlNJlDoQhtYBvPsi",
  "spotify_url": "https://open.spotify.com/artist/1eYhYunlNJlDoQhtYBvPsi",
  "updated_at": "2025-07-08T10:09:56.775574",
  "wikipedia_url": null
}