{
  "apple_music_id": "270340388",
  "apple_music_url": "https://music.apple.com/gb/album/whispering-jack/270340388",
  "artists": [
    {
      "apple_music_id": "16144416",
      "biography": "John Peter Farnham (born July 1, 1949) is an English-born Australian pop singer. Domestically he has remained one of Australia's best-known performers over a career spanning more than 30 years. He is the only Australian artist to have a number one record in five consecutive decades (echoing Sir Cliff Richard in the United Kingdom). Between 1982 and 1986 he fronted Little River Band.\n\nBorn in Dagenham, East London, United Kingdom, Farnham spent the first years of his life in England before migrating to Australia in 1959. As an undistinguished student, he began a plumbing apprenticeship before taking leave from that to pursue music.\n\nThe Little River Band era\n\nFrom 1981 until 1984, he fronted Little River Band after singer Glenn Shorrock departed. This was a move away from cabaret and into rock music. As Little River Band was a successful band prior to Farnham joining the group, it was a surprise that with Farnham the band found little success initially. Due to the previous success by Little River Band and Farnham's own early career, Capitol Records continued to fund the band for albums and tours, but still to no avail. In their desperation to bring a return from the cost of the band, Capitol Records brought out a \"Greatest Hits\" album, however that caused even more financial problems for the band.\n\nDuring this time, Farnham did vocal tracks for movies just to earn some extra money including for the movies \"Fletch,\" \"The Slugger's Wife,\" \"Savage Streets,\" \"Voyage of the Rock Aliens\" and \"Rad\".\n\nWith Farnham, Little River Band recorded three albums, which had some modest success, though not enough to pay back the advances the record company had given the band. The first album, The Net, was already written and Farnham had no say in the songs, he just had to record his lead vocals.\n\nThey recorded a concert in Melbourne that aired in the United States on HBO. The concert video was only one hour long, and it highlighted some of the songs from The Net as well as reworked versions of Little River Band classics such as \"Cool Change\" and \"Reminiscing\". \"Please Don't Ask Me\", a song written by Graeham Goble, and a hit for Farnham almost three years previously, was played during the Australian opening of the show. Despite positive Australian and US reviews and responses, this performance has not yet been released on VHS or DVD (nor is there any plan announced to).\n\nIn 1986, after releasing the third Little River Band studio album, No Reins, Farnham left the band. In an interview with Channel Seven, he stated, \"I'll be better off leaving, rather than putting myself under pressure that I've created.\" Through this matter, it became apparent to the band that Farnham was intending on leaving and No Reins' lead single \"Playing to Win,\" a song believed by all to be the band's return to success, then started having authorship disputes. As a result, Farnham's relationship with the band was further sullied. To date, the roylaties for the song are meticulously divided with different shares to each of the song's contributors.\n\nWhispering Jack and the return to solo\n\nFarnham's first solo experience since 1980, was doing some live shows with a band consisting of Brett Garsed, Sam See and Derrick Pellicci. Only two weeks' worth of bookings were made but the reaction was so good that they extended it for another week. Because of this success, record producer, Ross Fraser suggested to manager, Glenn Wheatley that it might be time to start working on a solo album.\n\nIn 1986, with the aid of Wheatley, and under considerable financial pressure that forced Wheatley to use his house as collateral to fund the album, Farnham began work on Whispering Jack, searching for songs with Fraser. \"A Touch Of Paradise\" was one that came in, written by Mondo Rock's Ross Wilson. The album was almost ready to be recorded when a tape arrived from London with similar material as \"Pressure Down\". Fraser listened to the song \"You're The Voice\" and knew they had found a once in a lifetime song.\n\nWhispering Jack took a year to plan, 6 weeks in a garage, 1 week putting it all onto a tape in the studio, another week of keyboard adjustments, and a further week adding guitar, bagpipes, and saxophones, before laying down the vocals in 3 weeks.\n\nInitially, public interest in the rebranded former teen-idol was difficult to cultivate, and radio stations refused to play the album. Things however started to change when Sydney radio station 2Day FM started to play the first single from the album, \"You're the Voice\". Henceforth, radio stations began receiving requests for the song.\n\nWhispering Jack would go on to become the highest-selling album in Australia at the time, selling over one million copies and remaining the number one album on the Australian ARIA Charts for 27 weeks. \"You're the Voice,\" was also a number one hit in several European countries, as well as in Australia. It was written by Chris Thompson, formerly of Manfred Mann's Earth Band. With the varied selection of songs used as well as meticulously singing his part, Farnham's pop-rock release was a highly successful breakthrough after a difficult time in his career in the events leading up to and the time with the Little River Band.\n\nAfter the success of the album, the next step was a tour. The \"Jack's Back Tour\", originally had four performances in Melbourne, two in Sydney, two in Perth and two in Brisbane. Although at the time they thought this would have been enough considering they were up against such people as Michael Jackson and Billy Joel, the ticket sales suggested extending the tour. As a result, five more shows were added in Melbourne, three more in Sydney, and Brisbane's concert was moved to a larger venue. At that time the \"Jack's Back Tour\" was the highest grossing tour by Farnham to be surpassed fifteen years later with \"The Last Time Tour\".\n\nIn concert with Olivia Newton-John and Anthony Warlow\n\nJohn Farnham toured with Olivia Newton-John and Anthony Warlow in \"The Main Event\". The concerts included comic musical \"rivalry\" between John Farnham and Anthony Warlow. The album from \"The Main Event\" tour with Olivia Newton-John and Anthony Warlow, was multi-platinum.\n\nThe next year, he took his birthday party on the road with the \"I Can't Believe He's 50 Tour\", teaming up with Kate Ceberano, Ross Wilson, James Reyne, Merril Bainbridge, Human Nature, and his son's band, Nana-Zhami. The first half of the show is a tribute to Farnham. Each guest sang two songs, one of their own and the other was their interpretation of a Farnham song. Some great home movies with some never before seen shots of John played in the background and each of the guests pay tribute to John in their own words, via a pre-recorded tape. The show opened with a huge blast of heavy metal from Nana-Zhami. They sang their own song, 'The Program' followed by their interpretation of John's 'Infatuation', from 'Uncovered'.\n\nA major event of 1999 was the \"Tour Of Duty\" concert in Dili for the Australian troops, which featured Kylie Minogue, Doc Neeson, Gina Jeffreys, James Blundell, The Living End, Dili Allstars and the RMC Band. \"Tour Of Duty\" was the first concert of John Farnham's to be webcast[citation needed]. Held at Dili Stadium in front of 4000 troops, it was a special Christmas present to show appreciation and support for the troops stationed in East Timor, away from their families for Christmas. It was also a special treat for the thousands of East Timorese who danced and sang from every vantage point they could find[citation needed].\n\nMillions around the world watched[citation needed] as Farnham sang \"Dare To Dream\" with Olivia Newton-John at the Sydney 2000 Olympic Games.\n[edit]The Last Tour - The Last Time\n\nIn 2002, Farnham released a new album, The Last Time, and held a countrywide concert tour, taking a circus-style tent to smaller towns. As the title suggested, this was to be Farnham's last major tour, but the singer, from the start, insisted that he was going to work live and hit the road for short periods of time again. He broke Australian touring records, performing with his 10-piece band from November to June 2003, becoming the seventh most profitable touring act in the world[citation needed].\n\n\"I'm not retiring, I'm just never going to undergo a major tour ever again,\" Farnham told a press conference promoting the album and the tour.\nThe album was launched in St. Kilda, at the famous Esplanade Hotel. Farnham had mentioned at a media conference that he would like to play someday at the Espy[citation needed]. A notice was put in a street magazine challenging John to do just that[citation needed]. Devotees of the singer gathered in the front bar of St Kilda grunge icon for an invitation-only gig.\n\nFarnham returned to Cohuna where he had been \"discovered\" by Darryl Sambell in 1967. Following the announcement of regional dates, Farnham and the band performed a free concert. There were signs, yellow balloons, streamers and his music playing from speakers. The all day event was capped off with a huge party featuring the music of Farnham's former band, Strings Unlimited and fireworks.\n\nThe Last Time Tour included 6 states, 7 capital cities and 28 regional centres beginning with the preview show in Melbourne on November 6, 2002. \n\nThe Last Time Tour capital city concerts were held in large entertainment centres, whereas the regional concerts were performed in a 4000 seat air-conditioned tent. Two tents leapfrogged the country to enable the shows to set up on time. The site took 100 workers 1 1/2 days to set up but only 6 hours to pull down and the equipment was carried by a fleet of 6 semi-trailers, 13 trucks, 4 four-wheel drives and 2 cars.\n\nAfter 89 shows and more than 210 days on the road, the Last Time Tour returned to Melbourne for the home town finale fans were hoping for[citation needed]. The final concert on June 15 2003 at Rod Laver Arena was telecast on Channel 7 enabling millions of people to witness Farnham's final \"last time\" concert. When Farnham left the stage, the crowd gave him a standing ovation that lasted more than 10 minutes. The night brought a close to the most extensive tour Australia has ever seen.[citation needed]\n\nThere is only \"One Voice\"\n\nLater in 2003, Farnham worked with Queen to produce a new version of the worldwide favourite \"We Will Rock You\", released on his greatest hits album, \"One Voice\". Farnham was inducted into the ARIA Hall Of Fame before a roof-raising performance of \"You're The Voice\". Media reports of Queen asking Farnham to join the band were subsequently denied by both Brian May and John.\nIn Concert With Tom Jones\n\nAgain feeling success in 2005, Farnham did ten concerts in Perth, Sydney, Brisbane, and Melbourne with Welsh music veteran, Tom Jones. Two musical heavyweights walked out from the sides to perform \"That Driving Beat\" and \"Mama Told Me Not To Come\" together. Farnham then left the stage to let Tom perform a few solos before returning with 1972's \"One\" and raging through hits like \"Pressure Down\", \"That's Freedom\", \"Heart's On Fire\", \"Playing To Win\", \"Man Of The Hour\", \"Help\" and \"Burn For You\". The pair did five duets to close the show - Sam and Dave's \"Hold On I'm Coming\", Otis Redding's \"Try A Little Tenderness\", Ray Charles' \"What'd I Say\", Stevie Wonder's \"Sweet Soul Music\" and AC/DC's anthem, \"Long Way To The Top\". The DVD released debuted at No 1. He also made an appearance at the Melbourne Music Festival, raising much needed funds for rebuilding after the 2004 Asian Tsunami.\n\nTowards the end of 2005, Farnham pinned his colours firmly to the mast with a new studio album, I Remember When I Was Young: Songs From The Great Australian Songbook - covers of classics, written and performed by Australian artists over the last forty years. Farnham listened to over 150 Australian songs and chose just 13 tracks for the album, which was recorded with a quartet of double bass, Steinway piano, drums & guitar and augmented by the Sydney International String Section and a six piece brass selection.\n\nThe first single off the album was \"Downhearted\", a song the Australian Crawl famed on, but the title track was Matt Taylor and Chain's \"I Remember When I Was Young\". This was Farnham's first jazz album after thirty-eight years in the business.\n\nPromoting the album on Channel Seven's \"Dancing With The Stars\", he explained his desire to make the album, \"I left my heart back in the Orient, down on Bali Bay. It's not the way that I should feel, but it's the way I'm going to stay.\"\n\nIn February 2006, for four shows at the Sydney Opera House, he performed with the Sydney Symphony. He furthered this with shows at Hamer Hall, Melbourne. These shows were sponsored by Dairy Farmers and a percentage of revenue received from the 'I Remember When I was Young' concerts went to the Dairy Farmers 'Creating Greener Pastures' program to help farmers and their communities.\n\n\"For a singer, to be able to perform with a full symphony orchestra is as big as it can get. It is a rare opportunity that does not come often, and in February, I get the chance to do this in both Melbourne and Sydney,\" Farnham told journalist, Jim Mitchell.\n\nOn February 10, the morning before his third show with the Sydney Symphony Orchestra, he was interviewed by Channel Nine's entertainment reporter, Richard Wilkins where he said, \"It's great to be on stage with some of this country's greatest musicians. Tonight though is not just about the music. It's about something very close to my heart, Australia. I've seen first hand the sorts of challenges that Australian farmers face so through these concerts we're able to make a direct contribution into the Dairy Farmers 'Creating Greener Pastures'program to lend some added support to the rural community. It is a great cause. I hope you enjoy the show.\"\n\nSydney Opera House - Venue of 2006 Sydney Concert Series\nTouring with Stevie Nicks\n\nIn early 2006 John embarked on a small Australian tour with Fleetwood Mac singer Stevie Nicks for a series of live shows. Both artists had equal billing but unlike the Tom Jones shows, they did not sing together, but rather individually. The same backup singers from the tour, however, were used by Fleetwood Mac and John.\n\nThe current members of the John Farnham Band (as of 2006) are Lindsay Field, Lisa Edwards, Dannielle Gaha, Angus \"The Mongrel\" Burchall, Stuart Fraser, Craig Newman, Steve Williams, Chong Lim, Lachlan Davidson, Jordan Murray, Brett Garsed and Bob Coassin. \n\n2006 Commonwealth Games, Melbourne, Australia\n\nFarnham sang at the closing of the 2006 Commonwealth Games Closing Ceremony, opening with his hit \"Age Of Reason,\" followed by \"I Remember When I Was Young\" from his latest album release, \"Playing to Win\" from his Little River Band days, and finished with his anthem song, \"You're the Voice.\" The athletes danced and partied around the centre stage, many of them taking advantage of the informal procedings to take pictures, and enjoy the festivities.\n\nNew DVD release\n\nA DVD has recently been released of John at the Sydney Opera House, entitled John Farnham with the Sydney Symphony Orchestra. The DVD debuted at number 2 on the ARIA DVD charts, however has achieved number one position.\n\nTwentieth Anniversary of Whispering Jack.\n\nAs the twentieth anniversary of Whispering Jack approaches, a special re-release of the CD and DVD of the tour that accompanied the album is planned to be released. The album, which remains the highest selling album in Australia, was released in 1986, and has outsold albums from artists such as Kylie Minogue is due to be released in November, with the current scheduled release date being November 6, 2006. Also, the 1986 release of Whispering Jack marks the 20th anniversary of the first, Australian-made CD. There have been no formal announcements for any tours related to commemorating the release or event.\n\nhttp://www.johnfarnham.com.au <a href=\"https://www.last.fm/music/John+Farnham\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "131485",
      "discogs_original_name": "John Farnham",
      "id": null,
      "lastfm_mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
      "name": "John Farnham",
      "role": "",
      "spotify_id": "1QxaPWG1POM8Ul6WwsHq4y",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "John Farnham": {
      "biography": "John Peter Farnham (born July 1, 1949) is an English-born Australian pop singer. Domestically he has remained one of Australia's best-known performers over a career spanning more than 30 years. He is the only Australian artist to have a number one record in five consecutive decades (echoing Sir Cliff Richard in the United Kingdom). Between 1982 and 1986 he fronted Little River Band.\n\nBorn in Dagenham, East London, United Kingdom, Farnham spent the first years of his life in England before migrating to Australia in 1959. As an undistinguished student, he began a plumbing apprenticeship before taking leave from that to pursue music.\n\nThe Little River Band era\n\nFrom 1981 until 1984, he fronted Little River Band after singer Glenn Shorrock departed. This was a move away from cabaret and into rock music. As Little River Band was a successful band prior to Farnham joining the group, it was a surprise that with Farnham the band found little success initially. Due to the previous success by Little River Band and Farnham's own early career, Capitol Records continued to fund the band for albums and tours, but still to no avail. In their desperation to bring a return from the cost of the band, Capitol Records brought out a \"Greatest Hits\" album, however that caused even more financial problems for the band.\n\nDuring this time, Farnham did vocal tracks for movies just to earn some extra money including for the movies \"Fletch,\" \"The Slugger's Wife,\" \"Savage Streets,\" \"Voyage of the Rock Aliens\" and \"Rad\".\n\nWith Farnham, Little River Band recorded three albums, which had some modest success, though not enough to pay back the advances the record company had given the band. The first album, The Net, was already written and Farnham had no say in the songs, he just had to record his lead vocals.\n\nThey recorded a concert in Melbourne that aired in the United States on HBO. The concert video was only one hour long, and it highlighted some of the songs from The Net as well as reworked versions of Little River Band classics such as \"Cool Change\" and \"Reminiscing\". \"Please Don't Ask Me\", a song written by Graeham Goble, and a hit for Farnham almost three years previously, was played during the Australian opening of the show. Despite positive Australian and US reviews and responses, this performance has not yet been released on VHS or DVD (nor is there any plan announced to).\n\nIn 1986, after releasing the third Little River Band studio album, No Reins, Farnham left the band. In an interview with Channel Seven, he stated, \"I'll be better off leaving, rather than putting myself under pressure that I've created.\" Through this matter, it became apparent to the band that Farnham was intending on leaving and No Reins' lead single \"Playing to Win,\" a song believed by all to be the band's return to success, then started having authorship disputes. As a result, Farnham's relationship with the band was further sullied. To date, the roylaties for the song are meticulously divided with different shares to each of the song's contributors.\n\nWhispering Jack and the return to solo\n\nFarnham's first solo experience since 1980, was doing some live shows with a band consisting of Brett Garsed, Sam See and Derrick Pellicci. Only two weeks' worth of bookings were made but the reaction was so good that they extended it for another week. Because of this success, record producer, Ross Fraser suggested to manager, Glenn Wheatley that it might be time to start working on a solo album.\n\nIn 1986, with the aid of Wheatley, and under considerable financial pressure that forced Wheatley to use his house as collateral to fund the album, Farnham began work on Whispering Jack, searching for songs with Fraser. \"A Touch Of Paradise\" was one that came in, written by Mondo Rock's Ross Wilson. The album was almost ready to be recorded when a tape arrived from London with similar material as \"Pressure Down\". Fraser listened to the song \"You're The Voice\" and knew they had found a once in a lifetime song.\n\nWhispering Jack took a year to plan, 6 weeks in a garage, 1 week putting it all onto a tape in the studio, another week of keyboard adjustments, and a further week adding guitar, bagpipes, and saxophones, before laying down the vocals in 3 weeks.\n\nInitially, public interest in the rebranded former teen-idol was difficult to cultivate, and radio stations refused to play the album. Things however started to change when Sydney radio station 2Day FM started to play the first single from the album, \"You're the Voice\". Henceforth, radio stations began receiving requests for the song.\n\nWhispering Jack would go on to become the highest-selling album in Australia at the time, selling over one million copies and remaining the number one album on the Australian ARIA Charts for 27 weeks. \"You're the Voice,\" was also a number one hit in several European countries, as well as in Australia. It was written by Chris Thompson, formerly of Manfred Mann's Earth Band. With the varied selection of songs used as well as meticulously singing his part, Farnham's pop-rock release was a highly successful breakthrough after a difficult time in his career in the events leading up to and the time with the Little River Band.\n\nAfter the success of the album, the next step was a tour. The \"Jack's Back Tour\", originally had four performances in Melbourne, two in Sydney, two in Perth and two in Brisbane. Although at the time they thought this would have been enough considering they were up against such people as Michael Jackson and Billy Joel, the ticket sales suggested extending the tour. As a result, five more shows were added in Melbourne, three more in Sydney, and Brisbane's concert was moved to a larger venue. At that time the \"Jack's Back Tour\" was the highest grossing tour by Farnham to be surpassed fifteen years later with \"The Last Time Tour\".\n\nIn concert with Olivia Newton-John and Anthony Warlow\n\nJohn Farnham toured with Olivia Newton-John and Anthony Warlow in \"The Main Event\". The concerts included comic musical \"rivalry\" between John Farnham and Anthony Warlow. The album from \"The Main Event\" tour with Olivia Newton-John and Anthony Warlow, was multi-platinum.\n\nThe next year, he took his birthday party on the road with the \"I Can't Believe He's 50 Tour\", teaming up with Kate Ceberano, Ross Wilson, James Reyne, Merril Bainbridge, Human Nature, and his son's band, Nana-Zhami. The first half of the show is a tribute to Farnham. Each guest sang two songs, one of their own and the other was their interpretation of a Farnham song. Some great home movies with some never before seen shots of John played in the background and each of the guests pay tribute to John in their own words, via a pre-recorded tape. The show opened with a huge blast of heavy metal from Nana-Zhami. They sang their own song, 'The Program' followed by their interpretation of John's 'Infatuation', from 'Uncovered'.\n\nA major event of 1999 was the \"Tour Of Duty\" concert in Dili for the Australian troops, which featured Kylie Minogue, Doc Neeson, Gina Jeffreys, James Blundell, The Living End, Dili Allstars and the RMC Band. \"Tour Of Duty\" was the first concert of John Farnham's to be webcast[citation needed]. Held at Dili Stadium in front of 4000 troops, it was a special Christmas present to show appreciation and support for the troops stationed in East Timor, away from their families for Christmas. It was also a special treat for the thousands of East Timorese who danced and sang from every vantage point they could find[citation needed].\n\nMillions around the world watched[citation needed] as Farnham sang \"Dare To Dream\" with Olivia Newton-John at the Sydney 2000 Olympic Games.\n[edit]The Last Tour - The Last Time\n\nIn 2002, Farnham released a new album, The Last Time, and held a countrywide concert tour, taking a circus-style tent to smaller towns. As the title suggested, this was to be Farnham's last major tour, but the singer, from the start, insisted that he was going to work live and hit the road for short periods of time again. He broke Australian touring records, performing with his 10-piece band from November to June 2003, becoming the seventh most profitable touring act in the world[citation needed].\n\n\"I'm not retiring, I'm just never going to undergo a major tour ever again,\" Farnham told a press conference promoting the album and the tour.\nThe album was launched in St. Kilda, at the famous Esplanade Hotel. Farnham had mentioned at a media conference that he would like to play someday at the Espy[citation needed]. A notice was put in a street magazine challenging John to do just that[citation needed]. Devotees of the singer gathered in the front bar of St Kilda grunge icon for an invitation-only gig.\n\nFarnham returned to Cohuna where he had been \"discovered\" by Darryl Sambell in 1967. Following the announcement of regional dates, Farnham and the band performed a free concert. There were signs, yellow balloons, streamers and his music playing from speakers. The all day event was capped off with a huge party featuring the music of Farnham's former band, Strings Unlimited and fireworks.\n\nThe Last Time Tour included 6 states, 7 capital cities and 28 regional centres beginning with the preview show in Melbourne on November 6, 2002. \n\nThe Last Time Tour capital city concerts were held in large entertainment centres, whereas the regional concerts were performed in a 4000 seat air-conditioned tent. Two tents leapfrogged the country to enable the shows to set up on time. The site took 100 workers 1 1/2 days to set up but only 6 hours to pull down and the equipment was carried by a fleet of 6 semi-trailers, 13 trucks, 4 four-wheel drives and 2 cars.\n\nAfter 89 shows and more than 210 days on the road, the Last Time Tour returned to Melbourne for the home town finale fans were hoping for[citation needed]. The final concert on June 15 2003 at Rod Laver Arena was telecast on Channel 7 enabling millions of people to witness Farnham's final \"last time\" concert. When Farnham left the stage, the crowd gave him a standing ovation that lasted more than 10 minutes. The night brought a close to the most extensive tour Australia has ever seen.[citation needed]\n\nThere is only \"One Voice\"\n\nLater in 2003, Farnham worked with Queen to produce a new version of the worldwide favourite \"We Will Rock You\", released on his greatest hits album, \"One Voice\". Farnham was inducted into the ARIA Hall Of Fame before a roof-raising performance of \"You're The Voice\". Media reports of Queen asking Farnham to join the band were subsequently denied by both Brian May and John.\nIn Concert With Tom Jones\n\nAgain feeling success in 2005, Farnham did ten concerts in Perth, Sydney, Brisbane, and Melbourne with Welsh music veteran, Tom Jones. Two musical heavyweights walked out from the sides to perform \"That Driving Beat\" and \"Mama Told Me Not To Come\" together. Farnham then left the stage to let Tom perform a few solos before returning with 1972's \"One\" and raging through hits like \"Pressure Down\", \"That's Freedom\", \"Heart's On Fire\", \"Playing To Win\", \"Man Of The Hour\", \"Help\" and \"Burn For You\". The pair did five duets to close the show - Sam and Dave's \"Hold On I'm Coming\", Otis Redding's \"Try A Little Tenderness\", Ray Charles' \"What'd I Say\", Stevie Wonder's \"Sweet Soul Music\" and AC/DC's anthem, \"Long Way To The Top\". The DVD released debuted at No 1. He also made an appearance at the Melbourne Music Festival, raising much needed funds for rebuilding after the 2004 Asian Tsunami.\n\nTowards the end of 2005, Farnham pinned his colours firmly to the mast with a new studio album, I Remember When I Was Young: Songs From The Great Australian Songbook - covers of classics, written and performed by Australian artists over the last forty years. Farnham listened to over 150 Australian songs and chose just 13 tracks for the album, which was recorded with a quartet of double bass, Steinway piano, drums & guitar and augmented by the Sydney International String Section and a six piece brass selection.\n\nThe first single off the album was \"Downhearted\", a song the Australian Crawl famed on, but the title track was Matt Taylor and Chain's \"I Remember When I Was Young\". This was Farnham's first jazz album after thirty-eight years in the business.\n\nPromoting the album on Channel Seven's \"Dancing With The Stars\", he explained his desire to make the album, \"I left my heart back in the Orient, down on Bali Bay. It's not the way that I should feel, but it's the way I'm going to stay.\"\n\nIn February 2006, for four shows at the Sydney Opera House, he performed with the Sydney Symphony. He furthered this with shows at Hamer Hall, Melbourne. These shows were sponsored by Dairy Farmers and a percentage of revenue received from the 'I Remember When I was Young' concerts went to the Dairy Farmers 'Creating Greener Pastures' program to help farmers and their communities.\n\n\"For a singer, to be able to perform with a full symphony orchestra is as big as it can get. It is a rare opportunity that does not come often, and in February, I get the chance to do this in both Melbourne and Sydney,\" Farnham told journalist, Jim Mitchell.\n\nOn February 10, the morning before his third show with the Sydney Symphony Orchestra, he was interviewed by Channel Nine's entertainment reporter, Richard Wilkins where he said, \"It's great to be on stage with some of this country's greatest musicians. Tonight though is not just about the music. It's about something very close to my heart, Australia. I've seen first hand the sorts of challenges that Australian farmers face so through these concerts we're able to make a direct contribution into the Dairy Farmers 'Creating Greener Pastures'program to lend some added support to the rural community. It is a great cause. I hope you enjoy the show.\"\n\nSydney Opera House - Venue of 2006 Sydney Concert Series\nTouring with Stevie Nicks\n\nIn early 2006 John embarked on a small Australian tour with Fleetwood Mac singer Stevie Nicks for a series of live shows. Both artists had equal billing but unlike the Tom Jones shows, they did not sing together, but rather individually. The same backup singers from the tour, however, were used by Fleetwood Mac and John.\n\nThe current members of the John Farnham Band (as of 2006) are Lindsay Field, Lisa Edwards, Dannielle Gaha, Angus \"The Mongrel\" Burchall, Stuart Fraser, Craig Newman, Steve Williams, Chong Lim, Lachlan Davidson, Jordan Murray, Brett Garsed and Bob Coassin. \n\n2006 Commonwealth Games, Melbourne, Australia\n\nFarnham sang at the closing of the 2006 Commonwealth Games Closing Ceremony, opening with his hit \"Age Of Reason,\" followed by \"I Remember When I Was Young\" from his latest album release, \"Playing to Win\" from his Little River Band days, and finished with his anthem song, \"You're the Voice.\" The athletes danced and partied around the centre stage, many of them taking advantage of the informal procedings to take pictures, and enjoy the festivities.\n\nNew DVD release\n\nA DVD has recently been released of John at the Sydney Opera House, entitled John Farnham with the Sydney Symphony Orchestra. The DVD debuted at number 2 on the ARIA DVD charts, however has achieved number one position.\n\nTwentieth Anniversary of Whispering Jack.\n\nAs the twentieth anniversary of Whispering Jack approaches, a special re-release of the CD and DVD of the tour that accompanied the album is planned to be released. The album, which remains the highest selling album in Australia, was released in 1986, and has outsold albums from artists such as Kylie Minogue is due to be released in November, with the current scheduled release date being November 6, 2006. Also, the 1986 release of Whispering Jack marks the 20th anniversary of the first, Australian-made CD. There have been no formal announcements for any tours related to commemorating the release or event.\n\nhttp://www.johnfarnham.com.au <a href=\"https://www.last.fm/music/John+Farnham\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "Europe",
  "created_at": "2025-07-05T18:04:17.592267",
  "date_added": "2015-09-11T18:02:25-07:00",
  "discogs_id": "1161865",
  "discogs_url": "https://www.discogs.com/release/1161865-John-Farnham-Whispering-Jack",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock",
    "80s",
    "rock",
    "pop",
    "australian",
    "aussie classic"
  ],
  "id": "1161865",
  "images": [
    {
      "height": 500,
      "resource_url": "https://i.discogs.com/7qpzjZJ6kTF3mL9Jbh0fxf2jgyxeeq53IPKLUmMeESc/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDYw/Ny5qcGVn.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/7qpzjZJ6kTF3mL9Jbh0fxf2jgyxeeq53IPKLUmMeESc/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDYw/Ny5qcGVn.jpeg",
      "width": 500
    },
    {
      "height": 500,
      "resource_url": "https://i.discogs.com/CywwR8vOoeCFB87xaiXrsoOz100mZKBUsVzSfgjSoaw/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDY2/OC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/CywwR8vOoeCFB87xaiXrsoOz100mZKBUsVzSfgjSoaw/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDY2/OC5qcGVn.jpeg",
      "width": 500
    },
    {
      "height": 500,
      "resource_url": "https://i.discogs.com/Plyi_I8qhTiaKIRB5w6zPIAHKCsoeMSpUA5tSIe5Pn4/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDYy/Ny5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/Plyi_I8qhTiaKIRB5w6zPIAHKCsoeMSpUA5tSIe5Pn4/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDYy/Ny5qcGVn.jpeg",
      "width": 500
    },
    {
      "height": 500,
      "resource_url": "https://i.discogs.com/ARkoPVj47Cnngk7Ci3wib7QqfX47NPkdQPPmjAoHEUM/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDY0/MC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/ARkoPVj47Cnngk7Ci3wib7QqfX47NPkdQPPmjAoHEUM/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDY0/MC5qcGVn.jpeg",
      "width": 500
    },
    {
      "height": 500,
      "resource_url": "https://i.discogs.com/VbtOT1kvWR_faR9-u4aa_C6h8GQ7-8TvY9VyBUku280/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDY1/NC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/VbtOT1kvWR_faR9-u4aa_C6h8GQ7-8TvY9VyBUku280/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExNjE4/NjUtMTIwNjA5MDY1/NC5qcGVn.jpeg",
      "width": 500
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/fa/68/b6/fa68b689-8f05-ddf5-c789-f9727344e20c/9399421014927.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "RCA",
    "Wheatley Records"
  ],
  "lastfm_mbid": null,
  "lastfm_url": "https://www.last.fm/music/John+Farnham/Whispering+Jack",
  "local_images": {
    "hi-res": "public/album/whispering-jack-1161865/whispering-jack-1161865-hi-res.jpg",
    "medium": "public/album/whispering-jack-1161865/whispering-jack-1161865-medium.jpg",
    "small": "public/album/whispering-jack-1161865/whispering-jack-1161865-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T18:04:18.776985",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "Whispering Jack",
  "release_name_discogs": "Whispering Jack",
  "release_name_spotify": "Whispering Jack",
  "released": "1986",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/fa/68/b6/fa68b689-8f05-ddf5-c789-f9727344e20c/9399421014927.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 1986 Wheatley Records, Pty. Ltd.",
      "editorial_notes": "The keys to this album are John Farnham’s years of experience as both a solo singer and with Little River Band and David Hirschfelder’s rich keyboard textures. The combination still sounds fresh decades later, with Farnham’s voice showcasing incredible range, power and versatility. His vocals are warm and intense (“Pressure Down”) as well as tender (“A Touch of Paradise”). On standout track “You’re the Voice”, he pulls off a performance that bleeds honesty over soaring synths and bagpipes.",
      "id": "270340388",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "John Farnham",
        "artwork": {
          "bgColor": "ffffff",
          "height": 4000,
          "textColor1": "060606",
          "textColor2": "191919",
          "textColor3": "383838",
          "textColor4": "474747",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/fa/68/b6/fa68b689-8f05-ddf5-c789-f9727344e20c/9399421014927.jpg/{w}x{h}bb.jpg",
          "width": 4000
        },
        "copyright": "℗ 1986 Wheatley Records, Pty. Ltd.",
        "editorialNotes": {
          "short": "Impassioned and adult-friendly pop-rock with a twist.",
          "standard": "The keys to this album are John Farnham’s years of experience as both a solo singer and with Little River Band and David Hirschfelder’s rich keyboard textures. The combination still sounds fresh decades later, with Farnham’s voice showcasing incredible range, power and versatility. His vocals are warm and intense (“Pressure Down”) as well as tender (“A Touch of Paradise”). On standout track “You’re the Voice”, he pulls off a performance that bleeds honesty over soaring synths and bagpipes."
        },
        "genreNames": [
          "Pop",
          "Music",
          "Vocal",
          "Pop/Rock",
          "Vocal Pop"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "Whispering Jack",
        "playParams": {
          "id": "270340388",
          "kind": "album"
        },
        "recordLabel": "RCA Victor",
        "releaseDate": "1986-10-20",
        "trackCount": 10,
        "upc": "9399421014927",
        "url": "https://music.apple.com/gb/album/whispering-jack/270340388"
      },
      "url": "https://music.apple.com/gb/album/whispering-jack/270340388"
    },
    "lastfm": {
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/f3221d9612c7c0956068076b13246c11.jpg"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/f3221d9612c7c0956068076b13246c11.jpg"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/f3221d9612c7c0956068076b13246c11.jpg"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/f3221d9612c7c0956068076b13246c11.jpg"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/f3221d9612c7c0956068076b13246c11.jpg"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/f3221d9612c7c0956068076b13246c11.jpg"
        }
      ],
      "listeners": 94739,
      "mbid": "3c718dbe-4740-442c-8b40-f54443cec1ea",
      "playcount": 528197,
      "raw_data": {
        "album": {
          "artist": "John Farnham",
          "image": [
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/34s/f3221d9612c7c0956068076b13246c11.jpg",
              "size": "small"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/64s/f3221d9612c7c0956068076b13246c11.jpg",
              "size": "medium"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/174s/f3221d9612c7c0956068076b13246c11.jpg",
              "size": "large"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/f3221d9612c7c0956068076b13246c11.jpg",
              "size": "extralarge"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/f3221d9612c7c0956068076b13246c11.jpg",
              "size": "mega"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/f3221d9612c7c0956068076b13246c11.jpg",
              "size": ""
            }
          ],
          "listeners": "94739",
          "mbid": "3c718dbe-4740-442c-8b40-f54443cec1ea",
          "name": "Whispering Jack",
          "playcount": "528197",
          "tags": {
            "tag": [
              {
                "name": "80s",
                "url": "https://www.last.fm/tag/80s"
              },
              {
                "name": "rock",
                "url": "https://www.last.fm/tag/rock"
              },
              {
                "name": "pop",
                "url": "https://www.last.fm/tag/pop"
              },
              {
                "name": "australian",
                "url": "https://www.last.fm/tag/australian"
              },
              {
                "name": "aussie classic",
                "url": "https://www.last.fm/tag/aussie+classic"
              }
            ]
          },
          "tracks": {
            "track": [
              {
                "@attr": {
                  "rank": 1
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 230,
                "name": "Pressure Down",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/Pressure+Down"
              },
              {
                "@attr": {
                  "rank": 2
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 297,
                "name": "You're the Voice",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/You%27re+the+Voice"
              },
              {
                "@attr": {
                  "rank": 3
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 286,
                "name": "A Touch of Paradise",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/A+Touch+of+Paradise"
              },
              {
                "@attr": {
                  "rank": 4
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 215,
                "name": "One Step Away",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/One+Step+Away"
              },
              {
                "@attr": {
                  "rank": 5
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 266,
                "name": "Reasons",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/Reasons"
              },
              {
                "@attr": {
                  "rank": 6
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 248,
                "name": "No One Comes Close",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/No+One+Comes+Close"
              },
              {
                "@attr": {
                  "rank": 7
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 241,
                "name": "Love to Shine",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/Love+to+Shine"
              },
              {
                "@attr": {
                  "rank": 8
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 205,
                "name": "Trouble",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/Trouble"
              },
              {
                "@attr": {
                  "rank": 9
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 262,
                "name": "Let Me Out",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/Let+Me+Out"
              },
              {
                "@attr": {
                  "rank": 10
                },
                "artist": {
                  "mbid": "3b81f816-bdcb-42d0-a0dd-1aa4fc4e19ec",
                  "name": "John Farnham",
                  "url": "https://www.last.fm/music/John+Farnham"
                },
                "duration": 213,
                "name": "Going, Going, Gone",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack/Going,+Going,+Gone"
              }
            ]
          },
          "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack",
          "wiki": {
            "content": "Whispering Jack is the twelfth studio album by Australian adult contemporary pop singer John Farnham. It was produced by Ross Fraser, and released on 20 October 1986, which peaked at #1 on the Australian Kent Music Report Album Charts. Whispering Jack has become the highest selling album in Australia by an Australian artist: as of 2006, it was 24x platinum indicating sales of over 1.68 million copies sold. It spent 25 weeks at the No. 1 spot on the Album Charts during 1986–1987, it was awarded the 1987 ARIA Award for \"Album of the Year\", and was the best charting album in Australia for the decade of the 1980's in Australia. It was the first Australian-made album to be released on Compact Disc within Australia. One of Farnham's biggest hits, \"You're the Voice\" was issued as the lead single from this album and peaked at No. 1 on the Kent Music Report Singles Charts.\n\nPrior to this album, Farnham's career had stalled after being recruited and then leaving as lead singer of Australia's Little River Band. Farnham's manager, Glenn Wheatley, mortgaged his home to raise funds for the recording of this album. After initial reluctance by major Australian radio stations to play the lead single, \"You're the Voice\", public demand became overwhelming and they relented. The song became one of the standout Number One songs on the Australian Charts of the 1980s and still remains a staple of Australian Radio. Whispering Jack re-started Farnham's career and kept it rolling across two more decades. On 21 November 2006, Whispering Jack was re-released to celebrate its 20th Anniversary, which came with a bonus track, an extended studio version of \"Pressure Down\" and with a DVD of the edited 1987 Whispering Jack Live in Concert televised performance.\n\nJohn Farnham had been a teen pop idol during the 1960s and 1970s, he met Glenn Wheatley, who was bass guitarist of rock group The Masters Apprentices, when both acts were managed by Darryl Sambell.  From the mid-1970s, Farnham had moved into television, stage and cabaret entertainment.  Wheatley, who was already managing Little River Band (LRB), signed Farnham to his company in 1980. They decided Farnham's comeback single would be a reworking of The Beatles' \"Help!\", which was produced by LRB's Graeham Goble, it peaked at No. 8 on the Australian Kent Music Report Singles Chart. Farnham was utilising a more adult contemporary pop style and the associated album, Uncovered, was also produced by Goble, which peaked at No. 20 on the Kent Music Report Album Charts. The B-side of \"Help\" was Farnham's song writing effort, \"Jillie's Song\", co-written with Goble. In recording the album, Farnham's studio band included guitarist Tommy Emmanuel (ex-Southern Star Band), keyboardist Mal Logan (ex-Renée Geyer Band, LRB), drummer Derek Pellicci (LRB) and bass guitarist Barry Sullivan (ex-Chain). They became his tour band until Logan and Pellicci returned to their LRB commitments and were replaced by Sam McNally and David Jones respectively. Three other solo singles followed in 1981 but none charted into the Top 50. In February 1982, after Glenn Shorrock had departed Little River Band, Farnham became their lead vocalist with recommendations by Goble and Wheatley.\n\nIn 1985, Farnham had started collecting a songlist for a future solo album while still in Little River Band, he finished his vocals for their album, No Reins, and left the band late that year. Farnham's first solo performances since 1981 were live shows with the John Farnham Band consisting of Brett Garsed on lead guitar, Sam See on guitar and Derek Pellicci, formerly of Little River Band, on drums. In early 1986, sound engineer Ross Fraser suggested to Wheatley that it was time to start working on the solo album. Wheatley searched vainly for a producer and record label willing to work with Farnham, Fraser took on the producer role and Wheatley provided financial support after mortgaging his house.\n\nWhilst visiting a jazz club in the US, Farnham was mistakenly introduced as Jack Phantom, and when he subsequently provided a running commentary for a local pool game he named himself Whispering Jack Phantom after the Pot Black commentator 'Whispering' Ted Lowe. Farnham's work for the album, Whispering Jack, included expanding his song list with Fraser's advice. \"A Touch of Paradise\" was written by Gulliver Smith and Mondo Rock's Ross Wilson, while \"Pressure Down\" was provided by Harry Bogdanovs. Two weeks before the album was due to be recorded a demo tape arrived from London with similar material to \"Pressure Down\", Farnham and Fraser listened to the demo of \"You're the Voice\" and knew they had found a once-in-a-lifetime song. Another song on offer was \"We Built This City\" but Farnham knocked it back, it was later recorded by US band Starship.\n\nInitially, public interest in the re-branded former teen-idol was difficult to cultivate, and radio stations refused to play Farnham's album. Things however started to change after Sydney radio station 2Day FM played its first single, \"You're the Voice\", which was released in September 1986. Henceforth, radio stations began receiving requests for the song. Its television debut was on Hey Hey Its Saturday with Skyhook's Greg Macainsh providing bass guitar. \"You're the Voice,\" peaked at No. 1 in Sweden and Australia, as well as being a Top Ten hit in some European countries: No. 3 in Switzerland, No. 6 in the UK, and No. 6 in Austria.The song was written by Andy Qunta (ex-Icehouse), Keith Reid (Procol Harum), Maggie Ryder and Chris Thompson (ex-Manfred Mann's Earth Band).\n\nWhispering Jack, released in October, became the highest-selling album by an Australian act in Australia, and peaked at No. 1 on the Australian Kent Music Report Album Charts for a total of 25 weeks. As of 2006, it was 24x platinum indicating sales of over 1.68 million units in Australia alone. The album was released internationally on RCA/BMG and peaked at No. 1 in Sweden, No. 3 in Austria, and Top 20 in Norway. In August 1988 it returned to the Australian Top Ten. Other Australian singles were December's \"Pressure Down\", which peaked at No. 4, March 1987's \"Touch of Paradise\" and October's \"Reasons\".\n\nFarnham followed with Jack's Back Tour, an initial itinerary of eleven performances was thought to be enough considering they were up against tours by Michael Jackson and Billy Joel, but after high ticket sales, it was extended by eight more shows and use of larger venues. At that time, Jack's Back Tour was the highest grossing tour by an Australian act. John Farnham Band now consisted of Garsed on lead guitar, David Hirschfelder on keyboards (ex-Little River Band), Macainsh on bass and Angus Burchill on drums. Farnham won six of the inaugural 1987 Australian Record Industry Association (ARIA) Awards for 'Album of the Year', 'Single of the Year', 'Highest Selling Album', 'Highest Selling Single', 'Best Male Artist' and 'Best Adult Contemporary Album'. On 19 July 1987, TV series Countdown broadcast its last show, the 1986 Countdown Music and Video Awards with Farnham winning the 'Best Album Award' for Whispering Jack. <a href=\"https://www.last.fm/music/John+Farnham/Whispering+Jack\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
            "published": "05 May 2010, 20:39",
            "summary": "Whispering Jack is the twelfth studio album by Australian adult contemporary pop singer John Farnham. It was produced by Ross Fraser, and released on 20 October 1986, which peaked at #1 on the Australian Kent Music Report Album Charts. Whispering Jack has become the highest selling album in Australia by an Australian artist: as of 2006, it was 24x platinum indicating sales of over 1.68 million copies sold. It spent 25 weeks at the No. 1 spot on the Album Charts during 1986–1987, it was awarded the 1987 ARIA Award for \"Album of the Year\", and was the best charting <a href=\"https://www.last.fm/music/John+Farnham/Whispering+Jack\">Read more on Last.fm</a>."
          }
        }
      },
      "similar_artists": [],
      "tags": [
        "80s",
        "rock",
        "pop",
        "australian",
        "aussie classic"
      ],
      "top_albums": [],
      "top_tracks": [],
      "url": "https://www.last.fm/music/John+Farnham/Whispering+Jack",
      "wiki_content": "Whispering Jack is the twelfth studio album by Australian adult contemporary pop singer John Farnham. It was produced by Ross Fraser, and released on 20 October 1986, which peaked at #1 on the Australian Kent Music Report Album Charts. Whispering Jack has become the highest selling album in Australia by an Australian artist: as of 2006, it was 24x platinum indicating sales of over 1.68 million copies sold. It spent 25 weeks at the No. 1 spot on the Album Charts during 1986–1987, it was awarded the 1987 ARIA Award for \"Album of the Year\", and was the best charting album in Australia for the decade of the 1980's in Australia. It was the first Australian-made album to be released on Compact Disc within Australia. One of Farnham's biggest hits, \"You're the Voice\" was issued as the lead single from this album and peaked at No. 1 on the Kent Music Report Singles Charts.\n\nPrior to this album, Farnham's career had stalled after being recruited and then leaving as lead singer of Australia's Little River Band. Farnham's manager, Glenn Wheatley, mortgaged his home to raise funds for the recording of this album. After initial reluctance by major Australian radio stations to play the lead single, \"You're the Voice\", public demand became overwhelming and they relented. The song became one of the standout Number One songs on the Australian Charts of the 1980s and still remains a staple of Australian Radio. Whispering Jack re-started Farnham's career and kept it rolling across two more decades. On 21 November 2006, Whispering Jack was re-released to celebrate its 20th Anniversary, which came with a bonus track, an extended studio version of \"Pressure Down\" and with a DVD of the edited 1987 Whispering Jack Live in Concert televised performance.\n\nJohn Farnham had been a teen pop idol during the 1960s and 1970s, he met Glenn Wheatley, who was bass guitarist of rock group The Masters Apprentices, when both acts were managed by Darryl Sambell.  From the mid-1970s, Farnham had moved into television, stage and cabaret entertainment.  Wheatley, who was already managing Little River Band (LRB), signed Farnham to his company in 1980. They decided Farnham's comeback single would be a reworking of The Beatles' \"Help!\", which was produced by LRB's Graeham Goble, it peaked at No. 8 on the Australian Kent Music Report Singles Chart. Farnham was utilising a more adult contemporary pop style and the associated album, Uncovered, was also produced by Goble, which peaked at No. 20 on the Kent Music Report Album Charts. The B-side of \"Help\" was Farnham's song writing effort, \"Jillie's Song\", co-written with Goble. In recording the album, Farnham's studio band included guitarist Tommy Emmanuel (ex-Southern Star Band), keyboardist Mal Logan (ex-Renée Geyer Band, LRB), drummer Derek Pellicci (LRB) and bass guitarist Barry Sullivan (ex-Chain). They became his tour band until Logan and Pellicci returned to their LRB commitments and were replaced by Sam McNally and David Jones respectively. Three other solo singles followed in 1981 but none charted into the Top 50. In February 1982, after Glenn Shorrock had departed Little River Band, Farnham became their lead vocalist with recommendations by Goble and Wheatley.\n\nIn 1985, Farnham had started collecting a songlist for a future solo album while still in Little River Band, he finished his vocals for their album, No Reins, and left the band late that year. Farnham's first solo performances since 1981 were live shows with the John Farnham Band consisting of Brett Garsed on lead guitar, Sam See on guitar and Derek Pellicci, formerly of Little River Band, on drums. In early 1986, sound engineer Ross Fraser suggested to Wheatley that it was time to start working on the solo album. Wheatley searched vainly for a producer and record label willing to work with Farnham, Fraser took on the producer role and Wheatley provided financial support after mortgaging his house.\n\nWhilst visiting a jazz club in the US, Farnham was mistakenly introduced as Jack Phantom, and when he subsequently provided a running commentary for a local pool game he named himself Whispering Jack Phantom after the Pot Black commentator 'Whispering' Ted Lowe. Farnham's work for the album, Whispering Jack, included expanding his song list with Fraser's advice. \"A Touch of Paradise\" was written by Gulliver Smith and Mondo Rock's Ross Wilson, while \"Pressure Down\" was provided by Harry Bogdanovs. Two weeks before the album was due to be recorded a demo tape arrived from London with similar material to \"Pressure Down\", Farnham and Fraser listened to the demo of \"You're the Voice\" and knew they had found a once-in-a-lifetime song. Another song on offer was \"We Built This City\" but Farnham knocked it back, it was later recorded by US band Starship.\n\nInitially, public interest in the re-branded former teen-idol was difficult to cultivate, and radio stations refused to play Farnham's album. Things however started to change after Sydney radio station 2Day FM played its first single, \"You're the Voice\", which was released in September 1986. Henceforth, radio stations began receiving requests for the song. Its television debut was on Hey Hey Its Saturday with Skyhook's Greg Macainsh providing bass guitar. \"You're the Voice,\" peaked at No. 1 in Sweden and Australia, as well as being a Top Ten hit in some European countries: No. 3 in Switzerland, No. 6 in the UK, and No. 6 in Austria.The song was written by Andy Qunta (ex-Icehouse), Keith Reid (Procol Harum), Maggie Ryder and Chris Thompson (ex-Manfred Mann's Earth Band).\n\nWhispering Jack, released in October, became the highest-selling album by an Australian act in Australia, and peaked at No. 1 on the Australian Kent Music Report Album Charts for a total of 25 weeks. As of 2006, it was 24x platinum indicating sales of over 1.68 million units in Australia alone. The album was released internationally on RCA/BMG and peaked at No. 1 in Sweden, No. 3 in Austria, and Top 20 in Norway. In August 1988 it returned to the Australian Top Ten. Other Australian singles were December's \"Pressure Down\", which peaked at No. 4, March 1987's \"Touch of Paradise\" and October's \"Reasons\".\n\nFarnham followed with Jack's Back Tour, an initial itinerary of eleven performances was thought to be enough considering they were up against tours by Michael Jackson and Billy Joel, but after high ticket sales, it was extended by eight more shows and use of larger venues. At that time, Jack's Back Tour was the highest grossing tour by an Australian act. John Farnham Band now consisted of Garsed on lead guitar, David Hirschfelder on keyboards (ex-Little River Band), Macainsh on bass and Angus Burchill on drums. Farnham won six of the inaugural 1987 Australian Record Industry Association (ARIA) Awards for 'Album of the Year', 'Single of the Year', 'Highest Selling Album', 'Highest Selling Single', 'Best Male Artist' and 'Best Adult Contemporary Album'. On 19 July 1987, TV series Countdown broadcast its last show, the 1986 Countdown Music and Video Awards with Farnham winning the 'Best Album Award' for Whispering Jack. <a href=\"https://www.last.fm/music/John+Farnham/Whispering+Jack\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wiki_summary": "Whispering Jack is the twelfth studio album by Australian adult contemporary pop singer John Farnham. It was produced by Ross Fraser, and released on 20 October 1986, which peaked at #1 on the Australian Kent Music Report Album Charts. Whispering Jack has become the highest selling album in Australia by an Australian artist: as of 2006, it was 24x platinum indicating sales of over 1.68 million copies sold. It spent 25 weeks at the No. 1 spot on the Album Charts during 1986–1987, it was awarded the 1987 ARIA Award for \"Album of the Year\", and was the best charting <a href=\"https://www.last.fm/music/John+Farnham/Whispering+Jack\">Read more on Last.fm</a>."
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "(P) 1986 Wheatley Records, Pty. Ltd.",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "884977448726"
      },
      "id": "4cBfyeNYbJAmOq0sl3Hijd",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b273710d3231cb732a6a7ff91a4e",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e02710d3231cb732a6a7ff91a4e",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d00004851710d3231cb732a6a7ff91a4e",
          "width": 64
        }
      ],
      "label": "RCA Victor",
      "popularity": 58,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
            },
            "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
            "id": "1QxaPWG1POM8Ul6WwsHq4y",
            "name": "John Farnham",
            "type": "artist",
            "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
          }
        ],
        "copyrights": [
          {
            "text": "(P) 1986 Wheatley Records, Pty. Ltd.",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "884977448726"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/4cBfyeNYbJAmOq0sl3Hijd"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/4cBfyeNYbJAmOq0sl3Hijd?market=US",
        "id": "4cBfyeNYbJAmOq0sl3Hijd",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b273710d3231cb732a6a7ff91a4e",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e02710d3231cb732a6a7ff91a4e",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d00004851710d3231cb732a6a7ff91a4e",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "RCA Victor",
        "name": "Whispering Jack",
        "popularity": 58,
        "release_date": "1986",
        "release_date_precision": "year",
        "total_tracks": 10,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/4cBfyeNYbJAmOq0sl3Hijd/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 227360,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6OKxpfca25E4UC23VR7E73"
              },
              "href": "https://api.spotify.com/v1/tracks/6OKxpfca25E4UC23VR7E73",
              "id": "6OKxpfca25E4UC23VR7E73",
              "is_local": false,
              "is_playable": true,
              "name": "Pressure Down",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:6OKxpfca25E4UC23VR7E73"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 300733,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/721DwsHOeKf7zHRABCR2rh"
              },
              "href": "https://api.spotify.com/v1/tracks/721DwsHOeKf7zHRABCR2rh",
              "id": "721DwsHOeKf7zHRABCR2rh",
              "is_local": false,
              "is_playable": true,
              "name": "You're the Voice",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:721DwsHOeKf7zHRABCR2rh"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 216466,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7jLle55anRpmJd99gKgPZ3"
              },
              "href": "https://api.spotify.com/v1/tracks/7jLle55anRpmJd99gKgPZ3",
              "id": "7jLle55anRpmJd99gKgPZ3",
              "is_local": false,
              "is_playable": true,
              "name": "One Step Away",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:7jLle55anRpmJd99gKgPZ3"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 265973,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6Je3RyyP7HReUymQqW2zX7"
              },
              "href": "https://api.spotify.com/v1/tracks/6Je3RyyP7HReUymQqW2zX7",
              "id": "6Je3RyyP7HReUymQqW2zX7",
              "is_local": false,
              "is_playable": true,
              "name": "Reasons",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:6Je3RyyP7HReUymQqW2zX7"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 213400,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6YiYfY4Wu6W1UlCtquKhMi"
              },
              "href": "https://api.spotify.com/v1/tracks/6YiYfY4Wu6W1UlCtquKhMi",
              "id": "6YiYfY4Wu6W1UlCtquKhMi",
              "is_local": false,
              "is_playable": true,
              "name": "Going, Going, Gone",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:6YiYfY4Wu6W1UlCtquKhMi"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 245466,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/4G30aYeMvSIWYEcxrulhXT"
              },
              "href": "https://api.spotify.com/v1/tracks/4G30aYeMvSIWYEcxrulhXT",
              "id": "4G30aYeMvSIWYEcxrulhXT",
              "is_local": false,
              "is_playable": true,
              "name": "No One Comes Close",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:4G30aYeMvSIWYEcxrulhXT"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 235360,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/4sJ9ulD2jqrx5Ggc2XNWxv"
              },
              "href": "https://api.spotify.com/v1/tracks/4sJ9ulD2jqrx5Ggc2XNWxv",
              "id": "4sJ9ulD2jqrx5Ggc2XNWxv",
              "is_local": false,
              "is_playable": true,
              "name": "Love to Shine",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:4sJ9ulD2jqrx5Ggc2XNWxv"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 202466,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1LyXOMnVGsMH2MpaComf1S"
              },
              "href": "https://api.spotify.com/v1/tracks/1LyXOMnVGsMH2MpaComf1S",
              "id": "1LyXOMnVGsMH2MpaComf1S",
              "is_local": false,
              "is_playable": true,
              "name": "Trouble",
              "preview_url": null,
              "track_number": 8,
              "type": "track",
              "uri": "spotify:track:1LyXOMnVGsMH2MpaComf1S"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 288173,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2qYEr60oPI6qIjF4KLQUr0"
              },
              "href": "https://api.spotify.com/v1/tracks/2qYEr60oPI6qIjF4KLQUr0",
              "id": "2qYEr60oPI6qIjF4KLQUr0",
              "is_local": false,
              "is_playable": true,
              "name": "A Touch of Paradise",
              "preview_url": null,
              "track_number": 9,
              "type": "track",
              "uri": "spotify:track:2qYEr60oPI6qIjF4KLQUr0"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1QxaPWG1POM8Ul6WwsHq4y"
                  },
                  "href": "https://api.spotify.com/v1/artists/1QxaPWG1POM8Ul6WwsHq4y",
                  "id": "1QxaPWG1POM8Ul6WwsHq4y",
                  "name": "John Farnham",
                  "type": "artist",
                  "uri": "spotify:artist:1QxaPWG1POM8Ul6WwsHq4y"
                }
              ],
              "disc_number": 1,
              "duration_ms": 265093,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0DrquF46H8IsuNLRVkGvRV"
              },
              "href": "https://api.spotify.com/v1/tracks/0DrquF46H8IsuNLRVkGvRV",
              "id": "0DrquF46H8IsuNLRVkGvRV",
              "is_local": false,
              "is_playable": true,
              "name": "Let Me Out",
              "preview_url": null,
              "track_number": 10,
              "type": "track",
              "uri": "spotify:track:0DrquF46H8IsuNLRVkGvRV"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 10
        },
        "type": "album",
        "uri": "spotify:album:4cBfyeNYbJAmOq0sl3Hijd"
      },
      "release_date": "1986",
      "release_date_precision": "year",
      "total_tracks": 10,
      "tracks": [
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 227360,
          "explicit": false,
          "id": "6OKxpfca25E4UC23VR7E73",
          "name": "Pressure Down",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 300733,
          "explicit": false,
          "id": "721DwsHOeKf7zHRABCR2rh",
          "name": "You're the Voice",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 216466,
          "explicit": false,
          "id": "7jLle55anRpmJd99gKgPZ3",
          "name": "One Step Away",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 265973,
          "explicit": false,
          "id": "6Je3RyyP7HReUymQqW2zX7",
          "name": "Reasons",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 213400,
          "explicit": false,
          "id": "6YiYfY4Wu6W1UlCtquKhMi",
          "name": "Going, Going, Gone",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 245466,
          "explicit": false,
          "id": "4G30aYeMvSIWYEcxrulhXT",
          "name": "No One Comes Close",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 235360,
          "explicit": false,
          "id": "4sJ9ulD2jqrx5Ggc2XNWxv",
          "name": "Love to Shine",
          "preview_url": null,
          "track_number": 7
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 202466,
          "explicit": false,
          "id": "1LyXOMnVGsMH2MpaComf1S",
          "name": "Trouble",
          "preview_url": null,
          "track_number": 8
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 288173,
          "explicit": false,
          "id": "2qYEr60oPI6qIjF4KLQUr0",
          "name": "A Touch of Paradise",
          "preview_url": null,
          "track_number": 9
        },
        {
          "artists": [
            {
              "id": "1QxaPWG1POM8Ul6WwsHq4y",
              "name": "John Farnham"
            }
          ],
          "duration_ms": 265093,
          "explicit": false,
          "id": "0DrquF46H8IsuNLRVkGvRV",
          "name": "Let Me Out",
          "preview_url": null,
          "track_number": 10
        }
      ],
      "url": "https://open.spotify.com/album/4cBfyeNYbJAmOq0sl3Hijd"
    }
  },
  "spotify_id": "4cBfyeNYbJAmOq0sl3Hijd",
  "spotify_url": "https://open.spotify.com/album/4cBfyeNYbJAmOq0sl3Hijd",
  "styles": [
    "Pop Rock"
  ],
  "title": "Whispering Jack",
  "tracklist": [
    {
      "artists": [],
      "duration": "3:45",
      "position": "A1",
      "title": "Pressure Down"
    },
    {
      "artists": [],
      "duration": "4:58",
      "position": "A2",
      "title": "You're The Voice"
    },
    {
      "artists": [],
      "duration": "3:35",
      "position": "A3",
      "title": "One Step Away"
    },
    {
      "artists": [],
      "duration": "4:23",
      "position": "A4",
      "title": "Reasons"
    },
    {
      "artists": [],
      "duration": "3:31",
      "position": "A5",
      "title": "Going, Going, Gone"
    },
    {
      "artists": [],
      "duration": "4:06",
      "position": "B1",
      "title": "No One Comes Close"
    },
    {
      "artists": [],
      "duration": "3:59",
      "position": "B2",
      "title": "Love To Shine"
    },
    {
      "artists": [],
      "duration": "3:25",
      "position": "B3",
      "title": "Trouble"
    },
    {
      "artists": [],
      "duration": "4:45",
      "position": "B4",
      "title": "A Touch Of Paradise"
    },
    {
      "artists": [],
      "duration": "4:20",
      "position": "B5",
      "title": "Let Me Out"
    }
  ],
  "updated_at": "2025-07-05T18:04:18.679043",
  "year": 1986
}