{
  "apple_music_id": "214473832",
  "apple_music_url": "https://music.apple.com/gb/album/roots/214473832",
  "artists": [
    {
      "apple_music_id": "918092",
      "biography": "Sepultura (Portuguese word for \"grave\") are a Brazilian metal band from Belo Horizonte. Formed in 1984 by brothers Max and Igor Cavalera, the band was a major force in the groove metal, thrash metal, and death metal genres during the late 1980s and early 1990s, with their later experiments drawing influence from alternative metal, world music, nu metal, hardcore punk, and industrial metal. Sepultura has also been credited as one of the second wave of thrash metal acts from the late 1980s and early-to-mid 1990s.\n\nThe band has had several lineup changes throughout its existence, with Max and Igor Cavalera departing in 1996 and 2006, respectively. Sepultura's current lineup consists of vocalist Derrick Green, guitarist Andreas Kisser, bassist Paulo Jr. and drummer Eloy Casagrande. Since Igor Cavalera's departure in 2006, there have been no original members left in the band. Paulo Jr., who has been a member of Sepultura since 1985, is the only member to appear on every release. Kisser, who replaced onetime guitarist Jairo Guedz, debuted on record with Sepultura on their second full-length Schizophrenia (1987); he and Paulo Jr. are the only members to appear on the rest of the band's studio albums.\n\nSepultura has released sixteen studio albums to date, the latest being Sepulquarta (2021). Their most successful records are Beneath the Remains (1989), Arise (1991), Chaos A.D. (1993) and Roots (1996). Sepultura has sold over three million units in the United States and almost 20 million worldwide, gaining multiple gold and platinum records around the globe, including in countries as diverse as France, Australia, Indonesia, United States, Cyprus and their native Brazil.\n\nHistory:\nSinger and guitarist Max Cavalera formed Sepultura, along with his brother Igor, in 1984, and stayed with the band until 1996. Sepultura was formed in 1984 in Belo Horizonte, the capital city of Minas Gerais, Brazil. Teen brothers Max and Igor Cavalera, the impoverished sons of Vânia, a model, and Graciliano, a well-to-do Italian diplomat whose fatal heart attack left his family in financial ruin, founded the band. Graciliano's death deeply affected his sons, inspiring them to form a band after Max heard the album Black Sabbath Vol. 4 the very same day. They chose the band name Sepultura, the Portuguese word for \"grave,\" when Max translated the lyrics of the Motörhead song \"Dancing on Your Grave.\"\n\nThe brothers' early influences included Led Zeppelin, Black Sabbath, and Deep Purple, and metal and hard rock artists of the early 1980s, such as Van Halen, Iron Maiden, Motörhead, AC/DC, Judas Priest, Ozzy Osbourne, and V8. They would travel to a record shop in São Paulo that mixed tapes of the latest records by American bands. Their listening habits changed dramatically after being introduced to Venom. As Igor Cavalera put it:\n\n“I remember the first time I listened to Venom; it was on a friend's borrowed tape. It was similar to Motörhead, only a lot heavier. I remember someone saying: it's the devil's Motörhead! After we got acquainted with Venom, we stopped listening to Iron Maiden and all that lighter stuff.”\n\n—Max Cavalera \n\nThe Cavalera brothers started listening to bands such as Hellhammer, Celtic Frost, Kreator, Sodom, Slayer, Megadeth, Exodus, and Exciter. They also had influences on Brazilian metal from bands like Stress, Sagrado Inferno, and Dorsal Atlântica. By 1984, they had dropped out of school. After several early membership changes, Sepultura established a stable lineup of Max on guitar, Igor on drums, vocalist Wagner Lamounier, and bassist Paulo Jr. Lamounier departed in March 1985 after disagreements with the band, and moved on to become the leader of the pioneering Brazilian black metal band Sarcófago. After his departure, Max took over the vocal duties. Jairo Guedes was invited to join the band as lead guitarist.\n\nBestial Devastation and Morbid Visions (1984–1986)\nAfter about a year of performing, Sepultura signed to Cogumelo Records in 1985. Later that year, they released Bestial Devastation, a shared EP with fellow Brazilian band Overdose. It was recorded and self-produced in just two days. The band recorded their first full-length album, Morbid Visions, in August 1986. It contained their first hit, \"Troops of Doom\", which gained some media attention. The band then decided to relocate to the larger city of São Paulo.\n\nSchizophrenia, Beneath the Remains, and Arise (1987–1992)\nAndreas Kisser has been the lead guitarist of Sepultura since 1987. His arrival provided the group with a more technical experience. In early 1987, Jairo Guedz quit the band. São Paulo-based guitarist Andreas Kisser replaced Guedz, and they released their second studio album, Schizophrenia, in 1987. The album reflected a stylistic change towards a more thrash metal-oriented sound, while still keeping the death metal elements of Morbid Visions. Schizophrenia was an improvement in production and performance, and became a minor critical sensation across Europe and America as a much sought-after import. The band sent tapes to the United States that made radio playlists at a time when they were struggling to book gigs, because club owners were afraid to book them due to their style. The band gained attention from Roadrunner Records who signed them and released Schizophrenia internationally before seeing the band perform in person. During a May 2018 interview with teenyrockers.com, Kisser noted that Sepultura would not have been possible without family support, not only from his own family, but also from the families of Max & Igor and Paulo Jr.\n\nThe band's third studio album, Beneath the Remains, was released in 1989. The album was recorded in a rustic studio in Rio de Janeiro while the band communicated through translators with the American producer Scott Burns. It was an immediate success and became known in thrash metal circles as a classic approximately Slayer's Reign in Blood. It was hailed by Terrorizer magazine as one of the all-time top 20 thrash metal albums, as well as gaining a place in their all-time top 40 death metal records. AllMusic gave the album 4.5 stars out of five and said, \"The complete absence of filler here makes this one of the most essential death/thrash metal albums of all time.\" A long European and American tour furthered the band's reputation, despite the fact that they were still very limited English speakers. Their first US show was held on October 31, 1989 at the Ritz in New York City, opening for Danish heavy metal band King Diamond. The band filmed its first video for the single \"Inner Self.\"\n\n“Traveling on trains. Getting beat up by cops. Sleeping behind the stage. It’s part of growing up. It’s part of the nature of this stuff. If you don't have that kind of background, you can’t be a band like us.”\n\n— Max Cavalera reflecting on Sepultura’s past in Brazil.\n\nIn January 1991, Sepultura played for more than 100,000 people at the Rock in Rio II festival. The band relocated from their native Brazil to Phoenix, Arizona in 1990, obtained new management, and recorded the album Arise at Morrisound Studios in Tampa, Florida. By the time the album was released in March 1991, the band had become one of the most critically praised thrash/death metal bands of the time. The first single \"Dead Embryonic Cells\" was a success, and the title track gained additional attention when MTV America banned its video due to its apocalyptic religious imagery. The album was critically acclaimed and their first to chart on the Billboard 200, reaching No. 119.\n\nMax Cavalera married the band's manager Gloria Bujnowski during this period. In 1992, Sepultura was part of two major tours: Helmet/Ministry and Alice in Chains/Ozzy Osbourne.\n\nChaos A.D., Nailbomb and Roots (1993–1996)\nSepultura's fifth album, Chaos A.D., was released in 1993. It saw a departure from their death metal style, adding influences of groove metal, industrial and hardcore punk. While Chaos A.D. is not a death metal album, the album does include elements of thrash metal music. AllMusic gave the album 4.5 stars out of five and wrote that, \"Chaos A.D. ranks as one of the greatest heavy metal albums of all time.\" In 1994, Max and Igor collaborated with Alex Newport of Fudge Tunnel to form Nailbomb. They released an even more industrial-oriented album, Point Blank the same year. The group performed only one full live gig at Dynamo Open Air in 1995, and the performance was released as Proud to Commit Commercial Suicide. Nailbomb was disbanded shortly afterwards.\n\nSepultura's sound change continued with their sixth album, Roots, which was released in 1996. On this album, the band experimented with elements of the music of Brazil's indigenous peoples, and adopted a slower, down-tuned sound. The album was hailed as a modern-day heavy metal classic and a major influence on the then-nascent nu metal scene. AllMusic gave it 4.5 stars out of five and said, \"Roots consolidates Sepultura's position as perhaps the most distinctive, original heavy metal band of the 1990s.\" In 1996, Sepultura performed \"War (Guerra)\" for the AIDS benefit album Silencio=Muerte: Red Hot + Latin produced by the Red Hot Organization.\n\nDeparture of Max Cavalera (1996–1997)\nIn August 1996, Sepultura played on the Castle Donington Monsters of Rock main stage alongside Ozzy Osbourne, Paradise Lost, Type O Negative, Biohazard, and Fear Factory. The band was suddenly a three-piece with Andreas Kisser taking over on lead vocals, after Max Cavalera left the concert site earlier in the day upon learning of the death of his stepson Dana Wells in a car accident. After Dana Wells' funeral was finished, Max returned and continued to tour with Sepultura. A few months after Wells' death, the band had a meeting with Max and said that they wanted to fire their manager Gloria Bujnowski, who was Max's wife and Dana's mother, and find new management. Their reasoning was that Bujnowski was paying too much attention to Max and not enough to the rest of the band. Max, who was still coming to terms with the death of Wells, felt betrayed by his bandmates for wanting to rid of Bujnowski and abruptly quit the band. Max Cavalera's final performance with Sepultura was at Brixton Academy in England on December 16, 1996.\n\nI started Sepultura back in the day. I used to write that name on my schoolbooks. What I'm going through now, is like watching my own son die. I cry every day, I feel hurt, sad, and angry, it's as if half of me has died.\nMax Cavalera explaining his feelings on leaving Sepultura. — In an interview with Faceculture in 2010, Max Cavalera explained that one of the reasons he left Sepultura was that Kisser's wife attempted to arrange Dana Wells' funeral before he and Bujnowski could return home from England. Max also claimed that he had recently attempted to reach out to Kisser for a possible reunion in which Bujnowski could manage him and Igor Cavalera while someone else could manage Kisser and Paulo Jr., but Kisser rejected the plan.\n\nDerrick Green era - Against, Against and Roorback (1998–2005)\nFollowing Max Cavalera's departure, the remaining members of Sepultura announced plans to find a new vocalist. Among those who auditioned were Chuck Billy of Testament, Phil Demmel of Machine Head and Vio-lence, Marc Grewe of Morgoth, Jorge Rosado of Merauder and a then-unknown Jason \"Gong\" Jones. American musician Derrick Green from Cleveland, Ohio, was selected as the band's new front man. The first album with the new line-up was against, which was released in 1998. The album was critically and commercially less successful than previous albums and sold considerably fewer copies than the debut album by Max Cavalera's new band Soulfly. AllMusic gave the album 3 stars out of 5, stating that ”there are enough flashes of the old Sepultura brilliance to suggest that great things are still to come.”\n\nThe band's eighth album, Nation, released in 2001, sold poorly. It would be their last studio album with Roadrunner Records. AllMusic gave the album 3 stars out of 5 and said, “As Green scrapes the lining of his vocal chords through the brash, impassioned tracks, he's singing about more than just 'one nation, Sepulnation'; he's suggesting something bigger, something worth shouting about and fighting for.” In an interview, Derrick Green said that, “Every song will be related to the idea of building this nation. We will have our own flags, our own anthem.” Roadrunner Records released a recording of Max Cavalera’s last live show with Sepultura, titled Under a Pale Grey Sky, in 2002.\n\nAfter recording Revolusongs, an EP of covers in 2002, the band released their ninth studio album, Roorback, in 2003. Despite receiving greater critical acclaim than its predecessors receive, sales remained low. It was their first album with SPV Records. AllMusic gave the album 4 stars out of five and said, “If there are still any lingering doubts about the Green/Sepultura match, 2003's excellent Roorback should put them to rest for good. Green is passionate and focused throughout the album — he has no problem going that extra mile — and the writing is consistently strong.” In 2005, the band played in Dubai for the annual Dubai Desert Rock Festival. In November of that year, a live double DVD/double CD package, Live in São Paulo, was released. This was the first official live album from the band.\n\nDante XXI, A-Lex, and departure of Igor Cavalera (2006–2010)\n\nSepultura's tenth album, Dante XXI, was released on March 14, 2006. It is a concept album based on Dante Alighieri's The Divine Comedy. Music videos were recorded for the songs \"Convicted in Life\" and \"Ostia\". AllMusic gave the album 3.5 stars out of five and said that, “Overall, Dante XXI is easily one of Sepultura's strongest releases to feature Green on vocals.”\n\nIn a 2007 interview with Revolver magazine, Max Cavalera stated that he and Igor, both of whom having recently reconciled after a decade-long feud, would reunite with the original Sepultura lineup. There were also rumors that the reunited line up would play on the main stage at Ozzfest 2007. However, Kisser denied this and the reunion did not occur. Instead, Igor Cavalera left the band after the release of Dante XXI and was replaced by Brazilian drummer Jean Dolabella, leaving the band without any of its original members. After leaving Sepultura, Igor and Max formed Cavalera Conspiracy.\n\nThe band was one of the featured musical guests at the Latin Grammy Awards of 2008 on November 13. They performed a cover of \"The Girl from Ipanema,\" and \"We've Lost You\" from the album A-Lex. The 9th annual Latin Grammy Awards ceremony was held at the Toyota Center in Houston, Texas and aired on Univision. Sepultura also appeared in a successful ad campaign for Volkswagen motors commercial that aired nationally throughout Brazil in 2008. The spot said, “It’s the first time you've seen Sepultura like this. And a Sedan likes this one too.” The Volkswagen TV spot shows Sepultura playing bossa nova, the opposite of its heavy metal style, to say, “You never saw something like this, as you never saw a car like the new Voyage.”\n\nSepultura released the album A-Lex on 26 January 2009. This was the first Sepultura album to include neither of the Cavalera brothers, with bassist Paulo Jr. as the sole remaining member from the band's debut album. A-Lex is a concept album based on the book A Clockwork Orange. The album was recorded at Trama Studios in São Paulo, Brazil, with producer Stanley Soares. AllMusic gave the album 4 stars out of five and said, “Personnel changes can have a very negative effect on a band, but Sepultura have maintained their vitality all these years – and that vitality is alive and well on the superb A-Lex.” In the same year, Andreas Kisser contributed his recipe for \"Churrasco in Soy Sauce\" to Hellbent for Cooking: The Heavy Metal Cookbook, stating in the recipe that he prefers his meat “medium-rare.” Sepultura supported Metallica on January 30 and January 31, 2010, at Morumbi Stadium in São Paulo, Brazil. 100,000 people attended the two concerts. The band filmed a concert DVD in 2010. Sepultura played at Kucukciftlik Park, Istanbul, on April 27, 2010. On August 8, 2010 visited the UK to play at the Heavy Music Festival near Folkestone.\n\nKairos and The Mediator Between Head and Hands Must Be the Heart (2010–2014)\n\nOn July 6, 2010, it was announced that Sepultura were signed with Nuclear Blast Records, and would release their first album for the label in 2011. The band confirmed that there would be no reunion of the classic lineup. By the end of 2010, the band began writing new material and entered the studio to begin recording their 12th album with producer Roy Z (Judas Priest, Halford, Iron Maiden's Bruce Dickinson, Helloween and Andre Matos). On March 1, 2011, Sepultura had completed recording their new album, entitled Kairos, which was released in June 2011.The album includes cover versions of Ministry's \"Just One Fix\" and The Prodigy's \"Firestarter\", both of which are available as bonus tracks on various special-edition releases. Sepultura played on the Kairos World Tour and at Wacken Open Air 2011. Drummer Jean Dolabella left the band and was replaced by 20-year-old Eloy Casagrande in November 2011, who had already played in Brazilian heavy metal singer Andre Matos' solo band and in the Brazilian post-hardcore band Gloria. In November and December 2011 Sepultura participated the Thrashfest Classics 2011 tour alongside thrash metal bands like Exodus, Destruction, Heathen, and Mortal Sin.\n\nIn May 2012, guitarist Andreas Kisser told Metal Underground that Sepultura would soon \"start working on something new with Eloy\" and see if they could \"get ready for new music early next year\". In an interview at England's Bloodstock Open Air on August 10, 2012, Kisser revealed that Sepultura would be filming a live DVD with the French percussive group Les Tambours du Bronx. He also revealed that the band was \"already thinking about new ideas\" for their next album and would \"have something new going on\" in 2013. On December 10, 2012, producer Ross Robinson, who produced Sepultura's Roots album, tweeted: \"Oh, didn't mention... Spoke to Andreas, it's on. My vision, smoke Roots- It can be done,\" suggesting he would be producing the band's next album. This was later confirmed, as well as an announcement that the album would be co-produced by Steve Evetts. Former Slayer drummer Dave Lombardo made a guest appearance on the album. \n\nOn January 25, 2013, it was announced that author Jason Korolenko was working on Relentless – 30 Years of Sepultura, which is described in a press release as \"the only book-length biography to cover the band's entire 30-year career.\" Relentless was published on October 8, 2014 in Poland under the title Brazylijska Furia, and the English language edition was published via Rocket 88 on December 4, 2014.The Brazilian edition, titled Relentless – 30 Anos de Sepultura, is scheduled for publication via Benvira in early 2015. The French language edition of \"Relentless\" was published in France on October 19, 2015. On July 19, 2013, it was revealed that the title of the band's thirteenth album was The Mediator Between Head and Hands Must Be the Heart. In September 2013, they performed at Rock in Rio with Brazilian rock/MPB artist Zé Ramalho – this line-up was named \"Zépultura\", a portmanteau of both artists' names. Machine Messiah and next album (2015–present)\n\nIn a June 2015 interview with Yell! Magazine, guitarist Andreas Kisser stated that Sepultura would begin work on their fourteenth studio album after the completion of The Mediator Between Head and Hands Must Be the Heart tour. Sepultura's fourteenth studio album, Machine Messiah, was released on January 13, 2017. In support of the album, Sepultura (along with Soilwork and Aborted) supported Kreator on the Gods of Violencetour in Europe in February–March 2017, and along with Prong, they supported Testament on the Brotherhood of the Snake tour in the United States in April–May 2017. The band also toured Europe in February and March 2018 with Obscura, Goatwhore and Fit for an Autopsy and Australia in May with Death Angel. The first official Sepultura documentary, Sepultura Endurance, was premiered in May 2017 and released on June 17. Max and Igor declined to be interviewed for the film and also refused to allow early material of the band to be used.\n\nIn an August 2018 interview at Wacken Open Air, Kisser confirmed that Sepultura had begun the songwriting process of their fifteenth studio album, and stated later that month that it was not expected to be released before 2020. The band will begin recording the album in August 2019 with producer Jens Bogren for a tentative February 2020 release.\nMusical style, influences, and legacy:\nSepultura's early influences were heavy metal and hard rock groups such as Kiss, Black Sabbath, Judas Priest, Motörhead, Iron Maiden, Venom, Celtic Frost, Twisted Sister and Whitesnake, as well as thrash metal bands like Metallica, Slayer, Exodus, Testament, Anthrax, Kreator, Sodom and Destruction and death metal bands Possessed and Death. They were also influenced by punk rock music, including bands such as the Ramones, the Sex Pistols, Black Flag, Dead Kennedys, Discharge, S.O.D., Amebix and New Model Army. Andreas Kisser affirmed, \"Without Slayer, Sepultura would never be possible.\"\n\nSepultura's music comes in a wide range of heavy metal musical styles. The band has been described mainly as thrash metal and death metal. Another genre the band has been commonly categorized under is groove metal. The band later on started experimenting elements of other musical genres such as hardcore punk, industrial metal, alternative metal, world music and nu metal. Looking back on the band's career arc for a 2016 article on Max and Igor Cavalera's retrospective Return to Roots tour (in commemoration of the album's 20th anniversary), Nashville Scene contributor Saby Reyes-Kulkarni observed that “Before Chaos A.D., the overwhelming majority of metal had a 'white' feel to it. Sepultura changed that forever. And with Roots, the band went a step further, asserting once and for all that the genre can accommodate native styling from any culture, much like jazz had done for decades prior.”\n\nMTV has called Sepultura the most successful Brazilian heavy metal band in history and “perhaps the most important heavy metal band of the '90s.” In 1993, Robert Baird of Phoenix New Times wrote that the band played “machine-gun-tempo mayhem” and that the members “love to attack organized religion and repressive government.”\n\nStudio albums\nMorbid Visions (1986)\nSchizophrenia (1987)\nBeneath the Remains (1989)\nArise (1991)\nChaos A.D. (1993)\nRoots (1996)\nAgainst (1998)\nNation (2001)\nRoorback (2003)\nDante XXI (2006)\nA-Lex (2009)\nKairos (2011)\nThe Mediator Between Head and Hands Must Be the Heart (2013)\nMachine Messiah (2017)  \nQuadra (2020)  \nSepulquarta (2021) <a href=\"https://www.last.fm/music/Sepultura\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "34058",
      "discogs_original_name": "Sepultura",
      "id": null,
      "lastfm_mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
      "name": "Sepultura",
      "role": "",
      "spotify_id": "6JW8wliOEwaDZ231ZY7cf4",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Sepultura": {
      "biography": "Sepultura (Portuguese word for \"grave\") are a Brazilian metal band from Belo Horizonte. Formed in 1984 by brothers Max and Igor Cavalera, the band was a major force in the groove metal, thrash metal, and death metal genres during the late 1980s and early 1990s, with their later experiments drawing influence from alternative metal, world music, nu metal, hardcore punk, and industrial metal. Sepultura has also been credited as one of the second wave of thrash metal acts from the late 1980s and early-to-mid 1990s.\n\nThe band has had several lineup changes throughout its existence, with Max and Igor Cavalera departing in 1996 and 2006, respectively. Sepultura's current lineup consists of vocalist Derrick Green, guitarist Andreas Kisser, bassist Paulo Jr. and drummer Eloy Casagrande. Since Igor Cavalera's departure in 2006, there have been no original members left in the band. Paulo Jr., who has been a member of Sepultura since 1985, is the only member to appear on every release. Kisser, who replaced onetime guitarist Jairo Guedz, debuted on record with Sepultura on their second full-length Schizophrenia (1987); he and Paulo Jr. are the only members to appear on the rest of the band's studio albums.\n\nSepultura has released sixteen studio albums to date, the latest being Sepulquarta (2021). Their most successful records are Beneath the Remains (1989), Arise (1991), Chaos A.D. (1993) and Roots (1996). Sepultura has sold over three million units in the United States and almost 20 million worldwide, gaining multiple gold and platinum records around the globe, including in countries as diverse as France, Australia, Indonesia, United States, Cyprus and their native Brazil.\n\nHistory:\nSinger and guitarist Max Cavalera formed Sepultura, along with his brother Igor, in 1984, and stayed with the band until 1996. Sepultura was formed in 1984 in Belo Horizonte, the capital city of Minas Gerais, Brazil. Teen brothers Max and Igor Cavalera, the impoverished sons of Vânia, a model, and Graciliano, a well-to-do Italian diplomat whose fatal heart attack left his family in financial ruin, founded the band. Graciliano's death deeply affected his sons, inspiring them to form a band after Max heard the album Black Sabbath Vol. 4 the very same day. They chose the band name Sepultura, the Portuguese word for \"grave,\" when Max translated the lyrics of the Motörhead song \"Dancing on Your Grave.\"\n\nThe brothers' early influences included Led Zeppelin, Black Sabbath, and Deep Purple, and metal and hard rock artists of the early 1980s, such as Van Halen, Iron Maiden, Motörhead, AC/DC, Judas Priest, Ozzy Osbourne, and V8. They would travel to a record shop in São Paulo that mixed tapes of the latest records by American bands. Their listening habits changed dramatically after being introduced to Venom. As Igor Cavalera put it:\n\n“I remember the first time I listened to Venom; it was on a friend's borrowed tape. It was similar to Motörhead, only a lot heavier. I remember someone saying: it's the devil's Motörhead! After we got acquainted with Venom, we stopped listening to Iron Maiden and all that lighter stuff.”\n\n—Max Cavalera \n\nThe Cavalera brothers started listening to bands such as Hellhammer, Celtic Frost, Kreator, Sodom, Slayer, Megadeth, Exodus, and Exciter. They also had influences on Brazilian metal from bands like Stress, Sagrado Inferno, and Dorsal Atlântica. By 1984, they had dropped out of school. After several early membership changes, Sepultura established a stable lineup of Max on guitar, Igor on drums, vocalist Wagner Lamounier, and bassist Paulo Jr. Lamounier departed in March 1985 after disagreements with the band, and moved on to become the leader of the pioneering Brazilian black metal band Sarcófago. After his departure, Max took over the vocal duties. Jairo Guedes was invited to join the band as lead guitarist.\n\nBestial Devastation and Morbid Visions (1984–1986)\nAfter about a year of performing, Sepultura signed to Cogumelo Records in 1985. Later that year, they released Bestial Devastation, a shared EP with fellow Brazilian band Overdose. It was recorded and self-produced in just two days. The band recorded their first full-length album, Morbid Visions, in August 1986. It contained their first hit, \"Troops of Doom\", which gained some media attention. The band then decided to relocate to the larger city of São Paulo.\n\nSchizophrenia, Beneath the Remains, and Arise (1987–1992)\nAndreas Kisser has been the lead guitarist of Sepultura since 1987. His arrival provided the group with a more technical experience. In early 1987, Jairo Guedz quit the band. São Paulo-based guitarist Andreas Kisser replaced Guedz, and they released their second studio album, Schizophrenia, in 1987. The album reflected a stylistic change towards a more thrash metal-oriented sound, while still keeping the death metal elements of Morbid Visions. Schizophrenia was an improvement in production and performance, and became a minor critical sensation across Europe and America as a much sought-after import. The band sent tapes to the United States that made radio playlists at a time when they were struggling to book gigs, because club owners were afraid to book them due to their style. The band gained attention from Roadrunner Records who signed them and released Schizophrenia internationally before seeing the band perform in person. During a May 2018 interview with teenyrockers.com, Kisser noted that Sepultura would not have been possible without family support, not only from his own family, but also from the families of Max & Igor and Paulo Jr.\n\nThe band's third studio album, Beneath the Remains, was released in 1989. The album was recorded in a rustic studio in Rio de Janeiro while the band communicated through translators with the American producer Scott Burns. It was an immediate success and became known in thrash metal circles as a classic approximately Slayer's Reign in Blood. It was hailed by Terrorizer magazine as one of the all-time top 20 thrash metal albums, as well as gaining a place in their all-time top 40 death metal records. AllMusic gave the album 4.5 stars out of five and said, \"The complete absence of filler here makes this one of the most essential death/thrash metal albums of all time.\" A long European and American tour furthered the band's reputation, despite the fact that they were still very limited English speakers. Their first US show was held on October 31, 1989 at the Ritz in New York City, opening for Danish heavy metal band King Diamond. The band filmed its first video for the single \"Inner Self.\"\n\n“Traveling on trains. Getting beat up by cops. Sleeping behind the stage. It’s part of growing up. It’s part of the nature of this stuff. If you don't have that kind of background, you can’t be a band like us.”\n\n— Max Cavalera reflecting on Sepultura’s past in Brazil.\n\nIn January 1991, Sepultura played for more than 100,000 people at the Rock in Rio II festival. The band relocated from their native Brazil to Phoenix, Arizona in 1990, obtained new management, and recorded the album Arise at Morrisound Studios in Tampa, Florida. By the time the album was released in March 1991, the band had become one of the most critically praised thrash/death metal bands of the time. The first single \"Dead Embryonic Cells\" was a success, and the title track gained additional attention when MTV America banned its video due to its apocalyptic religious imagery. The album was critically acclaimed and their first to chart on the Billboard 200, reaching No. 119.\n\nMax Cavalera married the band's manager Gloria Bujnowski during this period. In 1992, Sepultura was part of two major tours: Helmet/Ministry and Alice in Chains/Ozzy Osbourne.\n\nChaos A.D., Nailbomb and Roots (1993–1996)\nSepultura's fifth album, Chaos A.D., was released in 1993. It saw a departure from their death metal style, adding influences of groove metal, industrial and hardcore punk. While Chaos A.D. is not a death metal album, the album does include elements of thrash metal music. AllMusic gave the album 4.5 stars out of five and wrote that, \"Chaos A.D. ranks as one of the greatest heavy metal albums of all time.\" In 1994, Max and Igor collaborated with Alex Newport of Fudge Tunnel to form Nailbomb. They released an even more industrial-oriented album, Point Blank the same year. The group performed only one full live gig at Dynamo Open Air in 1995, and the performance was released as Proud to Commit Commercial Suicide. Nailbomb was disbanded shortly afterwards.\n\nSepultura's sound change continued with their sixth album, Roots, which was released in 1996. On this album, the band experimented with elements of the music of Brazil's indigenous peoples, and adopted a slower, down-tuned sound. The album was hailed as a modern-day heavy metal classic and a major influence on the then-nascent nu metal scene. AllMusic gave it 4.5 stars out of five and said, \"Roots consolidates Sepultura's position as perhaps the most distinctive, original heavy metal band of the 1990s.\" In 1996, Sepultura performed \"War (Guerra)\" for the AIDS benefit album Silencio=Muerte: Red Hot + Latin produced by the Red Hot Organization.\n\nDeparture of Max Cavalera (1996–1997)\nIn August 1996, Sepultura played on the Castle Donington Monsters of Rock main stage alongside Ozzy Osbourne, Paradise Lost, Type O Negative, Biohazard, and Fear Factory. The band was suddenly a three-piece with Andreas Kisser taking over on lead vocals, after Max Cavalera left the concert site earlier in the day upon learning of the death of his stepson Dana Wells in a car accident. After Dana Wells' funeral was finished, Max returned and continued to tour with Sepultura. A few months after Wells' death, the band had a meeting with Max and said that they wanted to fire their manager Gloria Bujnowski, who was Max's wife and Dana's mother, and find new management. Their reasoning was that Bujnowski was paying too much attention to Max and not enough to the rest of the band. Max, who was still coming to terms with the death of Wells, felt betrayed by his bandmates for wanting to rid of Bujnowski and abruptly quit the band. Max Cavalera's final performance with Sepultura was at Brixton Academy in England on December 16, 1996.\n\nI started Sepultura back in the day. I used to write that name on my schoolbooks. What I'm going through now, is like watching my own son die. I cry every day, I feel hurt, sad, and angry, it's as if half of me has died.\nMax Cavalera explaining his feelings on leaving Sepultura. — In an interview with Faceculture in 2010, Max Cavalera explained that one of the reasons he left Sepultura was that Kisser's wife attempted to arrange Dana Wells' funeral before he and Bujnowski could return home from England. Max also claimed that he had recently attempted to reach out to Kisser for a possible reunion in which Bujnowski could manage him and Igor Cavalera while someone else could manage Kisser and Paulo Jr., but Kisser rejected the plan.\n\nDerrick Green era - Against, Against and Roorback (1998–2005)\nFollowing Max Cavalera's departure, the remaining members of Sepultura announced plans to find a new vocalist. Among those who auditioned were Chuck Billy of Testament, Phil Demmel of Machine Head and Vio-lence, Marc Grewe of Morgoth, Jorge Rosado of Merauder and a then-unknown Jason \"Gong\" Jones. American musician Derrick Green from Cleveland, Ohio, was selected as the band's new front man. The first album with the new line-up was against, which was released in 1998. The album was critically and commercially less successful than previous albums and sold considerably fewer copies than the debut album by Max Cavalera's new band Soulfly. AllMusic gave the album 3 stars out of 5, stating that ”there are enough flashes of the old Sepultura brilliance to suggest that great things are still to come.”\n\nThe band's eighth album, Nation, released in 2001, sold poorly. It would be their last studio album with Roadrunner Records. AllMusic gave the album 3 stars out of 5 and said, “As Green scrapes the lining of his vocal chords through the brash, impassioned tracks, he's singing about more than just 'one nation, Sepulnation'; he's suggesting something bigger, something worth shouting about and fighting for.” In an interview, Derrick Green said that, “Every song will be related to the idea of building this nation. We will have our own flags, our own anthem.” Roadrunner Records released a recording of Max Cavalera’s last live show with Sepultura, titled Under a Pale Grey Sky, in 2002.\n\nAfter recording Revolusongs, an EP of covers in 2002, the band released their ninth studio album, Roorback, in 2003. Despite receiving greater critical acclaim than its predecessors receive, sales remained low. It was their first album with SPV Records. AllMusic gave the album 4 stars out of five and said, “If there are still any lingering doubts about the Green/Sepultura match, 2003's excellent Roorback should put them to rest for good. Green is passionate and focused throughout the album — he has no problem going that extra mile — and the writing is consistently strong.” In 2005, the band played in Dubai for the annual Dubai Desert Rock Festival. In November of that year, a live double DVD/double CD package, Live in São Paulo, was released. This was the first official live album from the band.\n\nDante XXI, A-Lex, and departure of Igor Cavalera (2006–2010)\n\nSepultura's tenth album, Dante XXI, was released on March 14, 2006. It is a concept album based on Dante Alighieri's The Divine Comedy. Music videos were recorded for the songs \"Convicted in Life\" and \"Ostia\". AllMusic gave the album 3.5 stars out of five and said that, “Overall, Dante XXI is easily one of Sepultura's strongest releases to feature Green on vocals.”\n\nIn a 2007 interview with Revolver magazine, Max Cavalera stated that he and Igor, both of whom having recently reconciled after a decade-long feud, would reunite with the original Sepultura lineup. There were also rumors that the reunited line up would play on the main stage at Ozzfest 2007. However, Kisser denied this and the reunion did not occur. Instead, Igor Cavalera left the band after the release of Dante XXI and was replaced by Brazilian drummer Jean Dolabella, leaving the band without any of its original members. After leaving Sepultura, Igor and Max formed Cavalera Conspiracy.\n\nThe band was one of the featured musical guests at the Latin Grammy Awards of 2008 on November 13. They performed a cover of \"The Girl from Ipanema,\" and \"We've Lost You\" from the album A-Lex. The 9th annual Latin Grammy Awards ceremony was held at the Toyota Center in Houston, Texas and aired on Univision. Sepultura also appeared in a successful ad campaign for Volkswagen motors commercial that aired nationally throughout Brazil in 2008. The spot said, “It’s the first time you've seen Sepultura like this. And a Sedan likes this one too.” The Volkswagen TV spot shows Sepultura playing bossa nova, the opposite of its heavy metal style, to say, “You never saw something like this, as you never saw a car like the new Voyage.”\n\nSepultura released the album A-Lex on 26 January 2009. This was the first Sepultura album to include neither of the Cavalera brothers, with bassist Paulo Jr. as the sole remaining member from the band's debut album. A-Lex is a concept album based on the book A Clockwork Orange. The album was recorded at Trama Studios in São Paulo, Brazil, with producer Stanley Soares. AllMusic gave the album 4 stars out of five and said, “Personnel changes can have a very negative effect on a band, but Sepultura have maintained their vitality all these years – and that vitality is alive and well on the superb A-Lex.” In the same year, Andreas Kisser contributed his recipe for \"Churrasco in Soy Sauce\" to Hellbent for Cooking: The Heavy Metal Cookbook, stating in the recipe that he prefers his meat “medium-rare.” Sepultura supported Metallica on January 30 and January 31, 2010, at Morumbi Stadium in São Paulo, Brazil. 100,000 people attended the two concerts. The band filmed a concert DVD in 2010. Sepultura played at Kucukciftlik Park, Istanbul, on April 27, 2010. On August 8, 2010 visited the UK to play at the Heavy Music Festival near Folkestone.\n\nKairos and The Mediator Between Head and Hands Must Be the Heart (2010–2014)\n\nOn July 6, 2010, it was announced that Sepultura were signed with Nuclear Blast Records, and would release their first album for the label in 2011. The band confirmed that there would be no reunion of the classic lineup. By the end of 2010, the band began writing new material and entered the studio to begin recording their 12th album with producer Roy Z (Judas Priest, Halford, Iron Maiden's Bruce Dickinson, Helloween and Andre Matos). On March 1, 2011, Sepultura had completed recording their new album, entitled Kairos, which was released in June 2011.The album includes cover versions of Ministry's \"Just One Fix\" and The Prodigy's \"Firestarter\", both of which are available as bonus tracks on various special-edition releases. Sepultura played on the Kairos World Tour and at Wacken Open Air 2011. Drummer Jean Dolabella left the band and was replaced by 20-year-old Eloy Casagrande in November 2011, who had already played in Brazilian heavy metal singer Andre Matos' solo band and in the Brazilian post-hardcore band Gloria. In November and December 2011 Sepultura participated the Thrashfest Classics 2011 tour alongside thrash metal bands like Exodus, Destruction, Heathen, and Mortal Sin.\n\nIn May 2012, guitarist Andreas Kisser told Metal Underground that Sepultura would soon \"start working on something new with Eloy\" and see if they could \"get ready for new music early next year\". In an interview at England's Bloodstock Open Air on August 10, 2012, Kisser revealed that Sepultura would be filming a live DVD with the French percussive group Les Tambours du Bronx. He also revealed that the band was \"already thinking about new ideas\" for their next album and would \"have something new going on\" in 2013. On December 10, 2012, producer Ross Robinson, who produced Sepultura's Roots album, tweeted: \"Oh, didn't mention... Spoke to Andreas, it's on. My vision, smoke Roots- It can be done,\" suggesting he would be producing the band's next album. This was later confirmed, as well as an announcement that the album would be co-produced by Steve Evetts. Former Slayer drummer Dave Lombardo made a guest appearance on the album. \n\nOn January 25, 2013, it was announced that author Jason Korolenko was working on Relentless – 30 Years of Sepultura, which is described in a press release as \"the only book-length biography to cover the band's entire 30-year career.\" Relentless was published on October 8, 2014 in Poland under the title Brazylijska Furia, and the English language edition was published via Rocket 88 on December 4, 2014.The Brazilian edition, titled Relentless – 30 Anos de Sepultura, is scheduled for publication via Benvira in early 2015. The French language edition of \"Relentless\" was published in France on October 19, 2015. On July 19, 2013, it was revealed that the title of the band's thirteenth album was The Mediator Between Head and Hands Must Be the Heart. In September 2013, they performed at Rock in Rio with Brazilian rock/MPB artist Zé Ramalho – this line-up was named \"Zépultura\", a portmanteau of both artists' names. Machine Messiah and next album (2015–present)\n\nIn a June 2015 interview with Yell! Magazine, guitarist Andreas Kisser stated that Sepultura would begin work on their fourteenth studio album after the completion of The Mediator Between Head and Hands Must Be the Heart tour. Sepultura's fourteenth studio album, Machine Messiah, was released on January 13, 2017. In support of the album, Sepultura (along with Soilwork and Aborted) supported Kreator on the Gods of Violencetour in Europe in February–March 2017, and along with Prong, they supported Testament on the Brotherhood of the Snake tour in the United States in April–May 2017. The band also toured Europe in February and March 2018 with Obscura, Goatwhore and Fit for an Autopsy and Australia in May with Death Angel. The first official Sepultura documentary, Sepultura Endurance, was premiered in May 2017 and released on June 17. Max and Igor declined to be interviewed for the film and also refused to allow early material of the band to be used.\n\nIn an August 2018 interview at Wacken Open Air, Kisser confirmed that Sepultura had begun the songwriting process of their fifteenth studio album, and stated later that month that it was not expected to be released before 2020. The band will begin recording the album in August 2019 with producer Jens Bogren for a tentative February 2020 release.\nMusical style, influences, and legacy:\nSepultura's early influences were heavy metal and hard rock groups such as Kiss, Black Sabbath, Judas Priest, Motörhead, Iron Maiden, Venom, Celtic Frost, Twisted Sister and Whitesnake, as well as thrash metal bands like Metallica, Slayer, Exodus, Testament, Anthrax, Kreator, Sodom and Destruction and death metal bands Possessed and Death. They were also influenced by punk rock music, including bands such as the Ramones, the Sex Pistols, Black Flag, Dead Kennedys, Discharge, S.O.D., Amebix and New Model Army. Andreas Kisser affirmed, \"Without Slayer, Sepultura would never be possible.\"\n\nSepultura's music comes in a wide range of heavy metal musical styles. The band has been described mainly as thrash metal and death metal. Another genre the band has been commonly categorized under is groove metal. The band later on started experimenting elements of other musical genres such as hardcore punk, industrial metal, alternative metal, world music and nu metal. Looking back on the band's career arc for a 2016 article on Max and Igor Cavalera's retrospective Return to Roots tour (in commemoration of the album's 20th anniversary), Nashville Scene contributor Saby Reyes-Kulkarni observed that “Before Chaos A.D., the overwhelming majority of metal had a 'white' feel to it. Sepultura changed that forever. And with Roots, the band went a step further, asserting once and for all that the genre can accommodate native styling from any culture, much like jazz had done for decades prior.”\n\nMTV has called Sepultura the most successful Brazilian heavy metal band in history and “perhaps the most important heavy metal band of the '90s.” In 1993, Robert Baird of Phoenix New Times wrote that the band played “machine-gun-tempo mayhem” and that the members “love to attack organized religion and repressive government.”\n\nStudio albums\nMorbid Visions (1986)\nSchizophrenia (1987)\nBeneath the Remains (1989)\nArise (1991)\nChaos A.D. (1993)\nRoots (1996)\nAgainst (1998)\nNation (2001)\nRoorback (2003)\nDante XXI (2006)\nA-Lex (2009)\nKairos (2011)\nThe Mediator Between Head and Hands Must Be the Heart (2013)\nMachine Messiah (2017)  \nQuadra (2020)  \nSepulquarta (2021) <a href=\"https://www.last.fm/music/Sepultura\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "Europe",
  "created_at": "2025-07-05T17:07:26.524076",
  "date_added": "2017-11-03T18:39:15-07:00",
  "discogs_id": "11088399",
  "discogs_url": "https://www.discogs.com/release/11088399-Sepultura-Roots",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock",
    "thrash metal",
    "metal",
    "death metal",
    "groove metal",
    "heavy metal"
  ],
  "id": "11088399",
  "images": [
    {
      "height": 555,
      "resource_url": "https://i.discogs.com/HcaSkb3m4PBEJArRs3HD6S_V1SB3SvbgbUaRHGq57oI/rs:fit/g:sm/q:90/h:555/w:555/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MDk2NDM2/MDktMTE3MC5qcGVn.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/HcaSkb3m4PBEJArRs3HD6S_V1SB3SvbgbUaRHGq57oI/rs:fit/g:sm/q:90/h:555/w:555/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MDk2NDM2/MDktMTE3MC5qcGVn.jpeg",
      "width": 555
    },
    {
      "height": 581,
      "resource_url": "https://i.discogs.com/tEqJla-n-fu_5gmm7L-aKEeNvx417PObAV_xhuSDzUQ/rs:fit/g:sm/q:90/h:581/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTYtNzU4Ny5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/tEqJla-n-fu_5gmm7L-aKEeNvx417PObAV_xhuSDzUQ/rs:fit/g:sm/q:90/h:581/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTYtNzU4Ny5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 578,
      "resource_url": "https://i.discogs.com/c5SC5M4GDO1WSPzMh1yYCXHGgDf-whp-voG3_qoC28I/rs:fit/g:sm/q:90/h:578/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTYtODgwNi5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/c5SC5M4GDO1WSPzMh1yYCXHGgDf-whp-voG3_qoC28I/rs:fit/g:sm/q:90/h:578/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTYtODgwNi5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 592,
      "resource_url": "https://i.discogs.com/Rmbnx8lnFSqg6gqaCPmd_9iumiHrIC_0LJa6BGu4YqA/rs:fit/g:sm/q:90/h:592/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTYtMzk4Ny5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/Rmbnx8lnFSqg6gqaCPmd_9iumiHrIC_0LJa6BGu4YqA/rs:fit/g:sm/q:90/h:592/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTYtMzk4Ny5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/FXlJGjLqfRz8WWZpTV6BiJ0W8_FMCgUIn3MlutXOXBw/rs:fit/g:sm/q:90/h:600/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NDYtOTM3OC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/FXlJGjLqfRz8WWZpTV6BiJ0W8_FMCgUIn3MlutXOXBw/rs:fit/g:sm/q:90/h:600/w:480/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NDYtOTM3OC5qcGVn.jpeg",
      "width": 480
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/QKlCdTuzZws7L84_82oHRLgD_RcXSngK_BRYa1F2GwU/rs:fit/g:sm/q:90/h:600/w:521/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NTEtODgwOS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/QKlCdTuzZws7L84_82oHRLgD_RcXSngK_BRYa1F2GwU/rs:fit/g:sm/q:90/h:600/w:521/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NTEtODgwOS5qcGVn.jpeg",
      "width": 521
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/Gy4Xsa4hNuuvbpzXzOc7OuxjpafBAA5MgksOc9oU7dg/rs:fit/g:sm/q:90/h:600/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NTgtODI5NS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/Gy4Xsa4hNuuvbpzXzOc7OuxjpafBAA5MgksOc9oU7dg/rs:fit/g:sm/q:90/h:600/w:532/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NTgtODI5NS5qcGVn.jpeg",
      "width": 532
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/dRCC_pu_kohlJIYQkxPPya0NrVA1b0F__QVca8717V8/rs:fit/g:sm/q:90/h:600/w:507/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NjctODMzOC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/dRCC_pu_kohlJIYQkxPPya0NrVA1b0F__QVca8717V8/rs:fit/g:sm/q:90/h:600/w:507/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE1MjYwNTQx/NjctODMzOC5qcGVn.jpeg",
      "width": 507
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/qahWowmJS_bKy1IR6AbcBk_GbsLtfvwid3YVfU-1ruI/rs:fit/g:sm/q:90/h:600/w:430/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTUtNzM1NS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/qahWowmJS_bKy1IR6AbcBk_GbsLtfvwid3YVfU-1ruI/rs:fit/g:sm/q:90/h:600/w:430/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTExMDg4/Mzk5LTE2MTMwMjM2/NTUtNzM1NS5qcGVn.jpeg",
      "width": 430
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music115/v4/48/12/7b/48127b38-656d-b69b-ff3c-03a34ddfc9de/mzi.rlwgbfor.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "Roadrunner Records"
  ],
  "lastfm_mbid": null,
  "lastfm_url": "https://www.last.fm/music/Sepultura/Roots",
  "local_images": {
    "hi-res": "public/album/roots-11088399/roots-11088399-hi-res.jpg",
    "medium": "public/album/roots-11088399/roots-11088399-medium.jpg",
    "small": "public/album/roots-11088399/roots-11088399-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T17:07:27.650055",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "Roots",
  "release_name_discogs": "Roots",
  "release_name_spotify": "Roots",
  "released": "2017-11-03",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music115/v4/48/12/7b/48127b38-656d-b69b-ff3c-03a34ddfc9de/mzi.rlwgbfor.jpg/2000x2000bb.jpg",
      "content_rating": "explicit",
      "copyright": "℗ 1996 The All Blacks B.V.",
      "editorial_notes": "Blurring the line between mosh pits and tribal dances, <i>Roots</i> is a rush of down-tuned guitar chug, Amazonian rhythms and industrial electronics. Mid-’90s groove metal doesn’t get any more funky or furious than “Breed Apart” and “Ratamahatta”, a riot of wildly clattering percussion with singer Max Cavalera venting volcanic anger at his government’s treatment of Brazil’s indigenous population. Sepultura team up with musicians from the Xavante tribe for “Itsari”, an enchanting foray into Brazilian folk music that speaks to the band’s grand vision.",
      "id": "214473832",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Sepultura",
        "artwork": {
          "bgColor": "050402",
          "height": 1425,
          "textColor1": "f0a96b",
          "textColor2": "e68e49",
          "textColor3": "c18856",
          "textColor4": "b9733b",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music115/v4/48/12/7b/48127b38-656d-b69b-ff3c-03a34ddfc9de/mzi.rlwgbfor.jpg/{w}x{h}bb.jpg",
          "width": 1425
        },
        "contentRating": "explicit",
        "copyright": "℗ 1996 The All Blacks B.V.",
        "editorialNotes": {
          "short": "The Brazilian band churn out groove metal tougher than a jiu-jitsu master.",
          "standard": "Blurring the line between mosh pits and tribal dances, <i>Roots</i> is a rush of down-tuned guitar chug, Amazonian rhythms and industrial electronics. Mid-’90s groove metal doesn’t get any more funky or furious than “Breed Apart” and “Ratamahatta”, a riot of wildly clattering percussion with singer Max Cavalera venting volcanic anger at his government’s treatment of Brazil’s indigenous population. Sepultura team up with musicians from the Xavante tribe for “Itsari”, an enchanting foray into Brazilian folk music that speaks to the band’s grand vision."
        },
        "genreNames": [
          "Metal",
          "Music",
          "Rock",
          "Hard Rock",
          "Death Metal/Black Metal"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "Roots",
        "playParams": {
          "id": "214473832",
          "kind": "album"
        },
        "recordLabel": "Roadrunner Records",
        "releaseDate": "1996-02-20",
        "trackCount": 16,
        "upc": "016861101008",
        "url": "https://music.apple.com/gb/album/roots/214473832"
      },
      "url": "https://music.apple.com/gb/album/roots/214473832"
    },
    "lastfm": {
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/6317c8389b36366800f02583398db3e0.jpg"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/6317c8389b36366800f02583398db3e0.jpg"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/6317c8389b36366800f02583398db3e0.jpg"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/6317c8389b36366800f02583398db3e0.jpg"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/6317c8389b36366800f02583398db3e0.jpg"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/6317c8389b36366800f02583398db3e0.jpg"
        }
      ],
      "listeners": 624789,
      "mbid": "12e92d5f-72f3-4cfe-bfae-2cc743036c52",
      "playcount": 10583678,
      "raw_data": {
        "album": {
          "artist": "Sepultura",
          "image": [
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/34s/6317c8389b36366800f02583398db3e0.jpg",
              "size": "small"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/64s/6317c8389b36366800f02583398db3e0.jpg",
              "size": "medium"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/174s/6317c8389b36366800f02583398db3e0.jpg",
              "size": "large"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6317c8389b36366800f02583398db3e0.jpg",
              "size": "extralarge"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6317c8389b36366800f02583398db3e0.jpg",
              "size": "mega"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6317c8389b36366800f02583398db3e0.jpg",
              "size": ""
            }
          ],
          "listeners": "624789",
          "mbid": "12e92d5f-72f3-4cfe-bfae-2cc743036c52",
          "name": "Roots",
          "playcount": "10583678",
          "tags": {
            "tag": [
              {
                "name": "thrash metal",
                "url": "https://www.last.fm/tag/thrash+metal"
              },
              {
                "name": "metal",
                "url": "https://www.last.fm/tag/metal"
              },
              {
                "name": "death metal",
                "url": "https://www.last.fm/tag/death+metal"
              },
              {
                "name": "groove metal",
                "url": "https://www.last.fm/tag/groove+metal"
              },
              {
                "name": "heavy metal",
                "url": "https://www.last.fm/tag/heavy+metal"
              }
            ]
          },
          "tracks": {
            "track": [
              {
                "@attr": {
                  "rank": 1
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 213,
                "name": "Roots Bloody Roots",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Roots+Bloody+Roots"
              },
              {
                "@attr": {
                  "rank": 2
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 255,
                "name": "Attitude",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Attitude"
              },
              {
                "@attr": {
                  "rank": 3
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 165,
                "name": "Cut-Throat",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Cut-Throat"
              },
              {
                "@attr": {
                  "rank": 4
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 270,
                "name": "Ratamahatta",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Ratamahatta"
              },
              {
                "@attr": {
                  "rank": 5
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 369,
                "name": "Breed Apart",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Breed+Apart"
              },
              {
                "@attr": {
                  "rank": 6
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 321,
                "name": "Straighthate",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Straighthate"
              },
              {
                "@attr": {
                  "rank": 7
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 165,
                "name": "Spit",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Spit"
              },
              {
                "@attr": {
                  "rank": 8
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 325,
                "name": "Lookaway",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Lookaway"
              },
              {
                "@attr": {
                  "rank": 9
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 243,
                "name": "Dusted",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Dusted"
              },
              {
                "@attr": {
                  "rank": 10
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 247,
                "name": "Born Stubborn",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Born+Stubborn"
              },
              {
                "@attr": {
                  "rank": 11
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 117,
                "name": "Jasco",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Jasco"
              },
              {
                "@attr": {
                  "rank": 12
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 288,
                "name": "Itsari",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Itsari"
              },
              {
                "@attr": {
                  "rank": 13
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 278,
                "name": "Ambush",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Ambush"
              },
              {
                "@attr": {
                  "rank": 14
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 320,
                "name": "Endangered Species",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Endangered+Species"
              },
              {
                "@attr": {
                  "rank": 15
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 84,
                "name": "Dictatorshit",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Dictatorshit"
              },
              {
                "@attr": {
                  "rank": 16
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 312,
                "name": "Chaos B.C.",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Chaos+B.C."
              },
              {
                "@attr": {
                  "rank": 17
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 255,
                "name": "Symptom Of The Universe",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Symptom+Of+The+Universe"
              },
              {
                "@attr": {
                  "rank": 18
                },
                "artist": {
                  "mbid": "1d93c839-22e7-4f76-ad84-d27039efc048",
                  "name": "Sepultura",
                  "url": "https://www.last.fm/music/Sepultura"
                },
                "duration": 163,
                "name": "Kaiowas (Live)",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Sepultura/Roots/Kaiowas+(Live)"
              }
            ]
          },
          "url": "https://www.last.fm/music/Sepultura/Roots",
          "wiki": {
            "content": "Roots is the sixth studio album by Brazilian heavy metal band Sepultura. Roadrunner Records released it in Europe on February 20, 1996, and in the U.S. three weeks later March 12. It is the band's last studio album to feature founding member and vocalist and rhythm guitarist Max Cavalera. Following the shift to slower tempos and Latin-tinged rhythms on the album Chaos, A.D. Roots delves even further into Brazilian musical textures and features significant contributions from Brazilian musician Carlinhos Brown. Who guided and arranged the sections throughout the album that feature ensemble percussion playing. The song \"Lookaway\" also features guest appearances by Korn vocalist Jonathan Davis, former Korn drummer David Silveria, former Limp Bizkit turntablist DJ Lethal, and Faith No More/Mr. Bungle/Tomahawk/Fantômas vocalist Mike Patton. The album draws influence from the then-surging nu-metal movement, specifically Korn (whose first two albums were also produced by Ross Robinson) and Deftones. (After leaving the band, Max Cavalera would continue to follow the nu-metal and \"world\" stylings of Roots with his solo project Soulfly.) Since its release, Roots has sold over 2 million copies worldwide.\n\nProduction and lyrics:\nRoss Robinson produced the album. Most of the themes presented on Roots are centred on Brazilian politics and culture. The film At Play in the Fields of the Lord inspired the idea for the album. The movie inspired Max Cavalera to travel to Mato Grosso, Brazil to visit the Xavante tribe. The album cover features an indigenous woman taken from a banknote of the discontinued Brazilian Cruzeiro, to which artist Michael Whelan added a locket with Sepultura's \"tribal S\" logo and a background of red roots.\nThe music on Roots reflects Brazil's history and culture. According to Max Cavalera, \"Roots Bloody Roots\" is \"about believing in yourself, about being proud of your heritage, proud of where you come from, powerful but simple lyrics. So it's about just being down with your own roots and believing in your roots.\" \"Cut-throat\" is about Epic Records. \"Ratamahatta\" is \"a celebration of life in Brazil's slums, sung all in Portuguese, which tells the stories of\" people \"like Ze Do Caixao (Coffin Joe) and Lampiao, the leader of an early 1900s outlaw gang from north Brazil, whose head was put on public display after he was captured.\" \"Ambush\" is \"a tribute to murdered South American rain-forest activist Chico Mendes.\"\n\nMusical style and influences:\nThe inspiration for Roots's new musical direction was two-fold. One was the desire to further experiment with the music of Brazil, especially the percussive type played by Salvador, Bahia samba reggae group Olodum. Another innovation Roots brought was the inspiration taken from the sound of Korn - especially their debut, with its heavily down-tuned guitars.\nThe music of Roots has sounds of world music, death metal, nu metal, thrash metal, tribal music, and Brazilian folk music. The band incorporated these elements into almost all songs in the album, and one of them (\"Itsári\") was recorded with members of the Xavante Indians at their ancestral home. Meeting the Xavante Indians meant a lot to Roots. Igor says the band identified a lot with the natives: \"In a certain way, I think that we, as a band, had many things in common with the Xavante Indians. We also lived on the edge of society, and our music and lifestyle is a long way from being assimilated and respected by that society.\" A representative of the tribe declared: \"We had seen pictures of Roots and we knew that they were different, with their long hair and many tattoos. We also knew that they had been discriminated, as if we were. Because of that, we were curious about them.\" Some songs also include participation (\"Ratamahatta\", \"Dictatorshit\" and \"Endangered Species\") and co-writing (\"Ratamahatta\") from Carlinhos Brown, a popular Brazilian musician. The political theme and influence of hardcore punk on the album are further reflected in the topic of \"Dictatorshit\", namely the 1964 Brazilian coup d'état. The lyrics to \"Attitude\" were co-written by Dana Wells, Max Cavalera's stepson, whose death (in part) led to the events which caused Max to leave the band. Dana also came up with the concept for the video for the song, featuring Brazilian Jiu-Jitsu experts the Gracie family.\nIn 2008, speaking to Kerrang, Max Cavalera remembered:\n\"Roots came from a blurry dream I had about going to the rainforest. Wine may have been involved. In the end, when we went into the forest to record, it was unbelievable. The whole album was a huge personal journey for me, and as a Brazilian, it felt as an incredible achievement. Everyone was inspired and Igor was at the top of his game. The percussion was crazy and we worked with so many great musicians, in the end coming out with a 15-minute drum jam that someone likened to a crazy Brazilian Pink Floyd. When we took the album to Roadrunner, they loved it except for the title. They thought it would sound like a Bob Marley tribute album. We explained it to them, and thankfully they got it.\"\nThe last words in the song \"Cut-Throat\" are \"Enslavement, Pathetic, Ignorant, Corporations\". This spells EPIC, the record company with which Sepultura had some trouble during their previous album, Chaos A.D.\n\nCritical reception:\nAmerican newspapers like The New Times, the Daily News and the Los Angeles Times reviewed the Brazilian band: \"The mixture of the dense metal of Roots and the Brazilian music has an intoxicating effect,\" wrote a Los Angeles Times reviewer. The Daily News praised the album saying: \"Sepultura reinvented the wheel. By mixing metal with native instruments, the band resuscitates the tired style, reminding of Led Zeppelin times. But while Zeppelin mixed English metal with African beats, it's still more moving to hear a band that uses elements of its own country. By extracting the sounds of the past, Sepultura determines the future direction of metal.\" Specialized heavy metal critics also reviewed the album positively. Martin Popoff, an author of the book The Collector's Guide to Heavy Metal, ranked Roots as the 11th best metal record of all time. \"This is a spectacular metal and futurist hardcore LP\", wrote Popoff, \"A masterpiece, accomplished by a band with an enormous heart and an even larger intellect.\" Kerrang! Magazine awarded Roots second place in the list of \"100 records that you have to hear before dying\"; just after In Utero from Nirvana. In 2001 Q magazine named Roots as one of the 50 Heaviest Albums Of All-Time. Rolling Stone Brasil named it the 57th best Brazilian music album. Rolling Stone (3/21/96, p. 98) Gave the album three stars out of five and said, \"Sepultura play a violent game of sonic overload... the band uses its catharsis as a creative force, funnelling torrents of noise into a tunnel of hate.\" Music critic Robert Christgau gave the album a negative \"dud\" rating. Looking back on the album 20 years later, PopMatters contributor Saby Reyes-Kulkarni referred to Roots as \"inarguably one of the most radical  departures from a convention in heavy metal history.\" <a href=\"https://www.last.fm/music/Sepultura/Roots\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
            "published": "05 May 2023, 11:06",
            "summary": "Roots is the sixth studio album by Brazilian heavy metal band Sepultura. Roadrunner Records released it in Europe on February 20, 1996, and in the U.S. three weeks later March 12. It is the band's last studio album to feature founding member and vocalist and rhythm guitarist Max Cavalera. Following the shift to slower tempos and Latin-tinged rhythms on the album Chaos, A.D. Roots delves even further into Brazilian musical textures and features significant contributions from Brazilian musician Carlinhos Brown. Who guided and arranged the sections throughout the album that feature ensemble percussion playing. The song \"Lookaway\" also features guest <a href=\"https://www.last.fm/music/Sepultura/Roots\">Read more on Last.fm</a>."
          }
        }
      },
      "similar_artists": [],
      "tags": [
        "thrash metal",
        "metal",
        "death metal",
        "groove metal",
        "heavy metal"
      ],
      "top_albums": [],
      "top_tracks": [],
      "url": "https://www.last.fm/music/Sepultura/Roots",
      "wiki_content": "Roots is the sixth studio album by Brazilian heavy metal band Sepultura. Roadrunner Records released it in Europe on February 20, 1996, and in the U.S. three weeks later March 12. It is the band's last studio album to feature founding member and vocalist and rhythm guitarist Max Cavalera. Following the shift to slower tempos and Latin-tinged rhythms on the album Chaos, A.D. Roots delves even further into Brazilian musical textures and features significant contributions from Brazilian musician Carlinhos Brown. Who guided and arranged the sections throughout the album that feature ensemble percussion playing. The song \"Lookaway\" also features guest appearances by Korn vocalist Jonathan Davis, former Korn drummer David Silveria, former Limp Bizkit turntablist DJ Lethal, and Faith No More/Mr. Bungle/Tomahawk/Fantômas vocalist Mike Patton. The album draws influence from the then-surging nu-metal movement, specifically Korn (whose first two albums were also produced by Ross Robinson) and Deftones. (After leaving the band, Max Cavalera would continue to follow the nu-metal and \"world\" stylings of Roots with his solo project Soulfly.) Since its release, Roots has sold over 2 million copies worldwide.\n\nProduction and lyrics:\nRoss Robinson produced the album. Most of the themes presented on Roots are centred on Brazilian politics and culture. The film At Play in the Fields of the Lord inspired the idea for the album. The movie inspired Max Cavalera to travel to Mato Grosso, Brazil to visit the Xavante tribe. The album cover features an indigenous woman taken from a banknote of the discontinued Brazilian Cruzeiro, to which artist Michael Whelan added a locket with Sepultura's \"tribal S\" logo and a background of red roots.\nThe music on Roots reflects Brazil's history and culture. According to Max Cavalera, \"Roots Bloody Roots\" is \"about believing in yourself, about being proud of your heritage, proud of where you come from, powerful but simple lyrics. So it's about just being down with your own roots and believing in your roots.\" \"Cut-throat\" is about Epic Records. \"Ratamahatta\" is \"a celebration of life in Brazil's slums, sung all in Portuguese, which tells the stories of\" people \"like Ze Do Caixao (Coffin Joe) and Lampiao, the leader of an early 1900s outlaw gang from north Brazil, whose head was put on public display after he was captured.\" \"Ambush\" is \"a tribute to murdered South American rain-forest activist Chico Mendes.\"\n\nMusical style and influences:\nThe inspiration for Roots's new musical direction was two-fold. One was the desire to further experiment with the music of Brazil, especially the percussive type played by Salvador, Bahia samba reggae group Olodum. Another innovation Roots brought was the inspiration taken from the sound of Korn - especially their debut, with its heavily down-tuned guitars.\nThe music of Roots has sounds of world music, death metal, nu metal, thrash metal, tribal music, and Brazilian folk music. The band incorporated these elements into almost all songs in the album, and one of them (\"Itsári\") was recorded with members of the Xavante Indians at their ancestral home. Meeting the Xavante Indians meant a lot to Roots. Igor says the band identified a lot with the natives: \"In a certain way, I think that we, as a band, had many things in common with the Xavante Indians. We also lived on the edge of society, and our music and lifestyle is a long way from being assimilated and respected by that society.\" A representative of the tribe declared: \"We had seen pictures of Roots and we knew that they were different, with their long hair and many tattoos. We also knew that they had been discriminated, as if we were. Because of that, we were curious about them.\" Some songs also include participation (\"Ratamahatta\", \"Dictatorshit\" and \"Endangered Species\") and co-writing (\"Ratamahatta\") from Carlinhos Brown, a popular Brazilian musician. The political theme and influence of hardcore punk on the album are further reflected in the topic of \"Dictatorshit\", namely the 1964 Brazilian coup d'état. The lyrics to \"Attitude\" were co-written by Dana Wells, Max Cavalera's stepson, whose death (in part) led to the events which caused Max to leave the band. Dana also came up with the concept for the video for the song, featuring Brazilian Jiu-Jitsu experts the Gracie family.\nIn 2008, speaking to Kerrang, Max Cavalera remembered:\n\"Roots came from a blurry dream I had about going to the rainforest. Wine may have been involved. In the end, when we went into the forest to record, it was unbelievable. The whole album was a huge personal journey for me, and as a Brazilian, it felt as an incredible achievement. Everyone was inspired and Igor was at the top of his game. The percussion was crazy and we worked with so many great musicians, in the end coming out with a 15-minute drum jam that someone likened to a crazy Brazilian Pink Floyd. When we took the album to Roadrunner, they loved it except for the title. They thought it would sound like a Bob Marley tribute album. We explained it to them, and thankfully they got it.\"\nThe last words in the song \"Cut-Throat\" are \"Enslavement, Pathetic, Ignorant, Corporations\". This spells EPIC, the record company with which Sepultura had some trouble during their previous album, Chaos A.D.\n\nCritical reception:\nAmerican newspapers like The New Times, the Daily News and the Los Angeles Times reviewed the Brazilian band: \"The mixture of the dense metal of Roots and the Brazilian music has an intoxicating effect,\" wrote a Los Angeles Times reviewer. The Daily News praised the album saying: \"Sepultura reinvented the wheel. By mixing metal with native instruments, the band resuscitates the tired style, reminding of Led Zeppelin times. But while Zeppelin mixed English metal with African beats, it's still more moving to hear a band that uses elements of its own country. By extracting the sounds of the past, Sepultura determines the future direction of metal.\" Specialized heavy metal critics also reviewed the album positively. Martin Popoff, an author of the book The Collector's Guide to Heavy Metal, ranked Roots as the 11th best metal record of all time. \"This is a spectacular metal and futurist hardcore LP\", wrote Popoff, \"A masterpiece, accomplished by a band with an enormous heart and an even larger intellect.\" Kerrang! Magazine awarded Roots second place in the list of \"100 records that you have to hear before dying\"; just after In Utero from Nirvana. In 2001 Q magazine named Roots as one of the 50 Heaviest Albums Of All-Time. Rolling Stone Brasil named it the 57th best Brazilian music album. Rolling Stone (3/21/96, p. 98) Gave the album three stars out of five and said, \"Sepultura play a violent game of sonic overload... the band uses its catharsis as a creative force, funnelling torrents of noise into a tunnel of hate.\" Music critic Robert Christgau gave the album a negative \"dud\" rating. Looking back on the album 20 years later, PopMatters contributor Saby Reyes-Kulkarni referred to Roots as \"inarguably one of the most radical  departures from a convention in heavy metal history.\" <a href=\"https://www.last.fm/music/Sepultura/Roots\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wiki_summary": "Roots is the sixth studio album by Brazilian heavy metal band Sepultura. Roadrunner Records released it in Europe on February 20, 1996, and in the U.S. three weeks later March 12. It is the band's last studio album to feature founding member and vocalist and rhythm guitarist Max Cavalera. Following the shift to slower tempos and Latin-tinged rhythms on the album Chaos, A.D. Roots delves even further into Brazilian musical textures and features significant contributions from Brazilian musician Carlinhos Brown. Who guided and arranged the sections throughout the album that feature ensemble percussion playing. The song \"Lookaway\" also features guest <a href=\"https://www.last.fm/music/Sepultura/Roots\">Read more on Last.fm</a>."
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "© 1996 The All Blacks B.V.",
          "type": "C"
        },
        {
          "text": "℗ 1996 The All Blacks B.V.",
          "type": "P"
        }
      ],
      "explicit": true,
      "external_ids": {
        "upc": "016861101008"
      },
      "id": "5JjnPCfpp6redrkKpXZAs8",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b2730bd5e7cce9765c2ef519424e",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e020bd5e7cce9765c2ef519424e",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d000048510bd5e7cce9765c2ef519424e",
          "width": 64
        }
      ],
      "label": "Roadrunner Records",
      "popularity": 64,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
            },
            "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
            "id": "6JW8wliOEwaDZ231ZY7cf4",
            "name": "Sepultura",
            "type": "artist",
            "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
          }
        ],
        "copyrights": [
          {
            "text": "© 1996 The All Blacks B.V.",
            "type": "C"
          },
          {
            "text": "℗ 1996 The All Blacks B.V.",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "016861101008"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/5JjnPCfpp6redrkKpXZAs8"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/5JjnPCfpp6redrkKpXZAs8?market=US",
        "id": "5JjnPCfpp6redrkKpXZAs8",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b2730bd5e7cce9765c2ef519424e",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e020bd5e7cce9765c2ef519424e",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d000048510bd5e7cce9765c2ef519424e",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "Roadrunner Records",
        "name": "Roots",
        "popularity": 64,
        "release_date": "1996-02-20",
        "release_date_precision": "day",
        "total_tracks": 16,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/5JjnPCfpp6redrkKpXZAs8/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 212253,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6ursmCnbc9oDRGa2yHKkoZ"
              },
              "href": "https://api.spotify.com/v1/tracks/6ursmCnbc9oDRGa2yHKkoZ",
              "id": "6ursmCnbc9oDRGa2yHKkoZ",
              "is_local": false,
              "is_playable": true,
              "name": "Roots Bloody Roots",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:6ursmCnbc9oDRGa2yHKkoZ"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 255400,
              "explicit": true,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1k5Jr3Ir3tXJLrI5ZsJ0fo"
              },
              "href": "https://api.spotify.com/v1/tracks/1k5Jr3Ir3tXJLrI5ZsJ0fo",
              "id": "1k5Jr3Ir3tXJLrI5ZsJ0fo",
              "is_local": false,
              "is_playable": true,
              "name": "Attitude",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:1k5Jr3Ir3tXJLrI5ZsJ0fo"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 164733,
              "explicit": true,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7xIGe2EodcQMU51kmmWJhs"
              },
              "href": "https://api.spotify.com/v1/tracks/7xIGe2EodcQMU51kmmWJhs",
              "id": "7xIGe2EodcQMU51kmmWJhs",
              "is_local": false,
              "is_playable": true,
              "name": "Cut-Throat",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:7xIGe2EodcQMU51kmmWJhs"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 270640,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3Tg8JctqoeIwZ3Rue8BjaI"
              },
              "href": "https://api.spotify.com/v1/tracks/3Tg8JctqoeIwZ3Rue8BjaI",
              "id": "3Tg8JctqoeIwZ3Rue8BjaI",
              "is_local": false,
              "is_playable": true,
              "name": "Ratamahatta",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:3Tg8JctqoeIwZ3Rue8BjaI"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 241133,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3mv3V9Ed2tgb3voqeuUAYI"
              },
              "href": "https://api.spotify.com/v1/tracks/3mv3V9Ed2tgb3voqeuUAYI",
              "id": "3mv3V9Ed2tgb3voqeuUAYI",
              "is_local": false,
              "is_playable": true,
              "name": "Breed Apart",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:3mv3V9Ed2tgb3voqeuUAYI"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 321626,
              "explicit": true,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0b5p5ABN0LcKMSlpEcnsk9"
              },
              "href": "https://api.spotify.com/v1/tracks/0b5p5ABN0LcKMSlpEcnsk9",
              "id": "0b5p5ABN0LcKMSlpEcnsk9",
              "is_local": false,
              "is_playable": true,
              "name": "Straighthate",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:0b5p5ABN0LcKMSlpEcnsk9"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 165840,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6VYQ5HXqK4veRkuicaF7vW"
              },
              "href": "https://api.spotify.com/v1/tracks/6VYQ5HXqK4veRkuicaF7vW",
              "id": "6VYQ5HXqK4veRkuicaF7vW",
              "is_local": false,
              "is_playable": true,
              "name": "Spit",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:6VYQ5HXqK4veRkuicaF7vW"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 325733,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/15s9W4YHKtPCGKMubsdA5f"
              },
              "href": "https://api.spotify.com/v1/tracks/15s9W4YHKtPCGKMubsdA5f",
              "id": "15s9W4YHKtPCGKMubsdA5f",
              "is_local": false,
              "is_playable": true,
              "name": "Lookaway",
              "preview_url": null,
              "track_number": 8,
              "type": "track",
              "uri": "spotify:track:15s9W4YHKtPCGKMubsdA5f"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 243800,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3VOSbVUAwGu7z8NVtEq2Yi"
              },
              "href": "https://api.spotify.com/v1/tracks/3VOSbVUAwGu7z8NVtEq2Yi",
              "id": "3VOSbVUAwGu7z8NVtEq2Yi",
              "is_local": false,
              "is_playable": true,
              "name": "Dusted",
              "preview_url": null,
              "track_number": 9,
              "type": "track",
              "uri": "spotify:track:3VOSbVUAwGu7z8NVtEq2Yi"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 247666,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6fDkvAtV0lrIKLfHrllN0H"
              },
              "href": "https://api.spotify.com/v1/tracks/6fDkvAtV0lrIKLfHrllN0H",
              "id": "6fDkvAtV0lrIKLfHrllN0H",
              "is_local": false,
              "is_playable": true,
              "name": "Born Stubborn",
              "preview_url": null,
              "track_number": 10,
              "type": "track",
              "uri": "spotify:track:6fDkvAtV0lrIKLfHrllN0H"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 117826,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2ft5DQtntkEdw3sQL7hQHO"
              },
              "href": "https://api.spotify.com/v1/tracks/2ft5DQtntkEdw3sQL7hQHO",
              "id": "2ft5DQtntkEdw3sQL7hQHO",
              "is_local": false,
              "is_playable": true,
              "name": "Jasco",
              "preview_url": null,
              "track_number": 11,
              "type": "track",
              "uri": "spotify:track:2ft5DQtntkEdw3sQL7hQHO"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 288666,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/78DGy5xF9IQhWrmz71Wuf7"
              },
              "href": "https://api.spotify.com/v1/tracks/78DGy5xF9IQhWrmz71Wuf7",
              "id": "78DGy5xF9IQhWrmz71Wuf7",
              "is_local": false,
              "is_playable": true,
              "name": "Itsári",
              "preview_url": null,
              "track_number": 12,
              "type": "track",
              "uri": "spotify:track:78DGy5xF9IQhWrmz71Wuf7"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 278373,
              "explicit": true,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0jPLDCNOPHKjdwMIRRS9NR"
              },
              "href": "https://api.spotify.com/v1/tracks/0jPLDCNOPHKjdwMIRRS9NR",
              "id": "0jPLDCNOPHKjdwMIRRS9NR",
              "is_local": false,
              "is_playable": true,
              "name": "Ambush",
              "preview_url": null,
              "track_number": 13,
              "type": "track",
              "uri": "spotify:track:0jPLDCNOPHKjdwMIRRS9NR"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 320426,
              "explicit": true,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1J339w8ZGvf8IiY7oLCEYa"
              },
              "href": "https://api.spotify.com/v1/tracks/1J339w8ZGvf8IiY7oLCEYa",
              "id": "1J339w8ZGvf8IiY7oLCEYa",
              "is_local": false,
              "is_playable": true,
              "name": "Endangered Species",
              "preview_url": null,
              "track_number": 14,
              "type": "track",
              "uri": "spotify:track:1J339w8ZGvf8IiY7oLCEYa"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 84133,
              "explicit": true,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7jbEwkIEcmqtAeYEw2k2fB"
              },
              "href": "https://api.spotify.com/v1/tracks/7jbEwkIEcmqtAeYEw2k2fB",
              "id": "7jbEwkIEcmqtAeYEw2k2fB",
              "is_local": false,
              "is_playable": true,
              "name": "Dictatorshit",
              "preview_url": null,
              "track_number": 15,
              "type": "track",
              "uri": "spotify:track:7jbEwkIEcmqtAeYEw2k2fB"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/6JW8wliOEwaDZ231ZY7cf4"
                  },
                  "href": "https://api.spotify.com/v1/artists/6JW8wliOEwaDZ231ZY7cf4",
                  "id": "6JW8wliOEwaDZ231ZY7cf4",
                  "name": "Sepultura",
                  "type": "artist",
                  "uri": "spotify:artist:6JW8wliOEwaDZ231ZY7cf4"
                }
              ],
              "disc_number": 1,
              "duration_ms": 799200,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3l41iYzGOf1S50XIYl86Hh"
              },
              "href": "https://api.spotify.com/v1/tracks/3l41iYzGOf1S50XIYl86Hh",
              "id": "3l41iYzGOf1S50XIYl86Hh",
              "is_local": false,
              "is_playable": true,
              "name": "Canyon Jam",
              "preview_url": null,
              "track_number": 16,
              "type": "track",
              "uri": "spotify:track:3l41iYzGOf1S50XIYl86Hh"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 16
        },
        "type": "album",
        "uri": "spotify:album:5JjnPCfpp6redrkKpXZAs8"
      },
      "release_date": "1996-02-20",
      "release_date_precision": "day",
      "total_tracks": 16,
      "tracks": [
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 212253,
          "explicit": false,
          "id": "6ursmCnbc9oDRGa2yHKkoZ",
          "name": "Roots Bloody Roots",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 255400,
          "explicit": true,
          "id": "1k5Jr3Ir3tXJLrI5ZsJ0fo",
          "name": "Attitude",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 164733,
          "explicit": true,
          "id": "7xIGe2EodcQMU51kmmWJhs",
          "name": "Cut-Throat",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 270640,
          "explicit": false,
          "id": "3Tg8JctqoeIwZ3Rue8BjaI",
          "name": "Ratamahatta",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 241133,
          "explicit": false,
          "id": "3mv3V9Ed2tgb3voqeuUAYI",
          "name": "Breed Apart",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 321626,
          "explicit": true,
          "id": "0b5p5ABN0LcKMSlpEcnsk9",
          "name": "Straighthate",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 165840,
          "explicit": false,
          "id": "6VYQ5HXqK4veRkuicaF7vW",
          "name": "Spit",
          "preview_url": null,
          "track_number": 7
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 325733,
          "explicit": false,
          "id": "15s9W4YHKtPCGKMubsdA5f",
          "name": "Lookaway",
          "preview_url": null,
          "track_number": 8
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 243800,
          "explicit": false,
          "id": "3VOSbVUAwGu7z8NVtEq2Yi",
          "name": "Dusted",
          "preview_url": null,
          "track_number": 9
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 247666,
          "explicit": false,
          "id": "6fDkvAtV0lrIKLfHrllN0H",
          "name": "Born Stubborn",
          "preview_url": null,
          "track_number": 10
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 117826,
          "explicit": false,
          "id": "2ft5DQtntkEdw3sQL7hQHO",
          "name": "Jasco",
          "preview_url": null,
          "track_number": 11
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 288666,
          "explicit": false,
          "id": "78DGy5xF9IQhWrmz71Wuf7",
          "name": "Itsári",
          "preview_url": null,
          "track_number": 12
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 278373,
          "explicit": true,
          "id": "0jPLDCNOPHKjdwMIRRS9NR",
          "name": "Ambush",
          "preview_url": null,
          "track_number": 13
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 320426,
          "explicit": true,
          "id": "1J339w8ZGvf8IiY7oLCEYa",
          "name": "Endangered Species",
          "preview_url": null,
          "track_number": 14
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 84133,
          "explicit": true,
          "id": "7jbEwkIEcmqtAeYEw2k2fB",
          "name": "Dictatorshit",
          "preview_url": null,
          "track_number": 15
        },
        {
          "artists": [
            {
              "id": "6JW8wliOEwaDZ231ZY7cf4",
              "name": "Sepultura"
            }
          ],
          "duration_ms": 799200,
          "explicit": false,
          "id": "3l41iYzGOf1S50XIYl86Hh",
          "name": "Canyon Jam",
          "preview_url": null,
          "track_number": 16
        }
      ],
      "url": "https://open.spotify.com/album/5JjnPCfpp6redrkKpXZAs8"
    }
  },
  "spotify_id": "5JjnPCfpp6redrkKpXZAs8",
  "spotify_url": "https://open.spotify.com/album/5JjnPCfpp6redrkKpXZAs8",
  "styles": [
    "Thrash",
    "Nu Metal"
  ],
  "title": "Roots",
  "tracklist": [
    {
      "artists": [],
      "duration": "",
      "position": "A1",
      "title": "Roots Bloody Roots"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A2",
      "title": "Attitude"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A3",
      "title": "Cut-Throat"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A4",
      "title": "Ratamahatta"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A5",
      "title": "Breed Apart"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A6",
      "title": "Straighthate"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B1",
      "title": "Spit"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B2",
      "title": "Lookaway"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B3",
      "title": "Dusted"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B4",
      "title": "Born Stubborn"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B5",
      "title": "Jasco"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B6",
      "title": "Itsári"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B7",
      "title": "Ambush"
    },
    {
      "artists": [],
      "duration": "",
      "position": "C1",
      "title": "Endangered Species"
    },
    {
      "artists": [],
      "duration": "",
      "position": "C2",
      "title": "Dictatorshit"
    },
    {
      "artists": [],
      "duration": "",
      "position": "",
      "title": "Bonus Tracks"
    },
    {
      "artists": [],
      "duration": "",
      "position": "C3",
      "title": "Ratamahatta (2 Meter Sessions)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "C4",
      "title": "Roots Bloody Roots (2 Meter Sessions)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "C5",
      "title": "Attitude (2 Meter Sessions)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "C6",
      "title": "Kaiowas (Take 1, Previously Unreleased)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D1",
      "title": "Procreation (Of The Wicked)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D2",
      "title": "Roots Bloody Roots (Demo)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D3",
      "title": "Attitude (Instrumental Rough Mix)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D4",
      "title": "Cutthroat (Instrumental Rough Mix)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D5",
      "title": "Dictatorshit (Instrumental Rough Mix)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D6",
      "title": "Untitled (Demo)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D7",
      "title": "R.D.P. (Demo)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "D8",
      "title": "Dusted (Demo)"
    }
  ],
  "updated_at": "2025-07-05T17:07:27.498994",
  "year": 2017
}