{
  "apple_music_id": "106580",
  "apple_music_url": "https://music.apple.com/gb/artist/the-the/106580",
  "biography": "The The are an English post-punk band. They have been active in various forms since 1979, with singer-songwriter Matt Johnson being the only constant band member. The The achieved critical acclaim and commercial success in the UK, with 15 chart singles (seven reaching the top 40), and their most successful album, Infected (1986), spent 30 weeks on the chart. They followed this with the top ten albums Mind Bomb (1989) and Dusk (1993).\n\nEarly years (1977–1981)\nIn November 1977, Matt Johnson placed an advertisement in NME, asking for \"Bass/lead guitarist into The Velvet Underground/Syd Barrett\". Johnson later placed a second advertisement in the NME, stating his new influences as \"The Residents/Throbbing Gristle\".\n\nWhile trying to get his band going, in 1978 Johnson had recorded a demo solo album (See Without Being Seen) which he continued to sell at various underground gigs on cassettes. In 1979, working with Colin Lloyd-Tucker (a friend and colleague at De Wolfe Music, the Soho music publisher/recording studio) Johnson recorded his first album proper, Spirits. This album remains unreleased, although the track \"What Stanley Saw\" was later licensed to Cherry Red Records for their Perspectives & Distortion compilation album, which also featured Virgin Prunes, Lemon Kittens, Thomas Leer, Kevin Coyne and Mark Perry.\n\nThe The made their debut at London's Africa Centre on 11 May 1979, third on the bill to Scritti Politti and PragVEC, using backing tape tracks that Johnson created at his day job at De Wolfe studios for the drums and bass. The band at this point consisted of Johnson on vocal, electric piano, guitar and tapes and Keith Laws on synthesiser and tapes. It was Keith Laws who suggested the name 'the The' to Matt Johnson.\n\nAs the The was now getting underway, Johnson was simultaneously working with experimental synth-pop combo the Gadgets, a studio group he formed with Colin Lloyd Tucker, his colleague at De Wolfe recording studios.\n\nPeter Ashworth, then known as 'Triash' and later to become a noted photographer, became the The's drummer in 1980, and Tom Johnston (also managing the The at this point and later to become a cartoonist for the Evening Standard, Daily Mirror and The Sun newspapers) was added on bass. Although both Ashworth and Johnston were credited with appearing on the The's debut single (\"Controversial Subject\"/\"Black and White\") on 4AD Records, neither actually played on the recordings, which were produced by Wire members Bruce Gilbert and Graham Lewis. All instruments were played by Johnson and Laws. Johnston and Ashworth soon dropped out of the The and returned to their respective day jobs. As a duo (Johnson and Laws), the The began performing concerts with Wire, Cabaret Voltaire, DAF, This Heat, the Birthday Party and Scritti Politti.\n\nIn early 1981 the The also contributed the composition 'Untitled' to the Some Bizzare Album. In September of that year Johnson and Laws signed a deal with Some Bizzare Records and released the 7\" single \"Cold Spell Ahead\". By this stage Matt Johnson had begun playing all the instruments himself so Laws left to pursue his studies, leaving Johnson as a solo artist using a group moniker.\n\nJohnson was signed up later in 1981 to 4AD Records by Ivo Watts-Russell to record a solo album, Burning Blue Soul. Although all of the instruments and vocals were performed by Johnson, the album featured various producers including Wire's Bruce Gilbert and Graham Lewis, Ivo and Johnson himself. Years later, owing to a request from Johnson, it would be re-issued and credited to the The so all of his albums would be in the same rack together.\n\nTowards the end of 1981, Colin Lloyd-Tucker and Simon Fisher-Turner joined the band for a series of stripped down The acoustic concerts in London.\n\nSolo years (1982–1987)\nNow freed from the politics of a permanent group line-up, Johnson was able to take the The up to the next level, and spent the next few years collaborating with a diverse range of creative individuals, freely changing personnel from project to project.\n\nThe The's next single was a retooling of \"Cold Spell Ahead\", now entitled \"Uncertain Smile\". Produced in New York by Mike Thorne, it reached No. 68 UK. This version is different from the more familiar album version, and featured sax and flute by session player Crispin Cioe rather than (as on the album version) the piano of Squeeze's Jools Holland.\n\nIn 1982, the intended debut album by the The (The Pornography of Despair) was recorded, but was never officially mixed nor released. Johnson apparently ran off some cassette copies for friends, and several tracks (\"Mental Healing Process\", \"Leap into The Wind\", \"Absolute Liberation\") were subsequently issued as additional tracks on the \"This Is the Day\" single. \"Three Orange Kisses from Kazan\" and \"Waitin' for the Upturn\" (featuring Steve James Sherlock playing flute and saxophone) also date from this era, and appeared as B-sides. Some of the previously-mentioned cuts, along with the tracks \"The Nature of Virtue\" and \"Fruit of the Heart\" (which were similarly recorded around the same time), appeared as bonus selections on a cassette-only issue of the band's eventual debut album, but The Pornography of Despair album as a whole remains unissued.\n\nAround 1982 the The played a series of four concerts at the Marque Club in Wardour Street, Soho, entitled 'An evening of Rock n Roll with the The'. These concerts were weekly for four weeks and featured Marc Almond on guitar and vocals.\n\nThe The released their official album debut, the synth-noir classic Soul Mining, in 1983. It featured the minor UK No. 71 hit \"This Is the Day\", as well as a new recording of the The performing \"Uncertain Smile\". Produced by Johnson and Paul Hardiman, it featured guest appearances from Orange Juice's drummer Zeke Manyika, Jools Holland, Thomas Leer and J. G. Thirlwell (aka Foetus).\n\nDuring the The's more prolific period of releases, from Soul Mining (1983) to Dusk (1992), most artwork used on the albums and single releases was produced by Johnson's brother Andrew Johnson, using the pseudonym Andy Dog. The artwork has a distinctive style, and sometimes courted controversy, most notably the initial release of the 1986 single \"Infected\", which featured a masturbating devil and was withdrawn from sale and re-issued with an edited version of the same drawing.\n\nFor the 1986 album Infected, the The still consisted only of Johnson, but was augmented by session musicians and featured friends such as Manyika and Rip Rig + Panic singer Neneh Cherry and Anna Domino. This album spawned four charting singles in the UK, notably \"Heartland\", which made the UK top 30. It was also unusual for having a full-length accompanying film. Costing hundreds of thousands of pounds, Infected: The Movie was shot on locations in Bolivia, Peru and New York. Different songs were directed by different directors, mainly Tim Pope and Peter 'Sleazy' Christopherson (of Throbbing Gristle).\n\nThroughout 1986-1987 Johnson toured the world extensively with Infected: The Movie, showing the film in cinemas in place of performing live concerts. The film was also shown twice in its entirety on Channel 4 in the UK and on MTV's 120 Minutes in the US.\n\nIn 1987 Johnson also took some tentative steps back into live performance. Whilst promoting Infected: The Movie in Australia he had a chance encounter with Billy Bragg, who persuaded him to return to Britain and support Red Wedge, a coalition of like-minded musicians supporting the British Labour Party in its election campaign. Johnson agreed and enrolled longtime friend and collaborator Manyika to join him in performing shows in London featuring stripped-down versions of political the The songs such as \"Heartland\". This experience convinced Johnson to put a band together once again.\n\nReturn to a full band (1988–2002)\nBy 1988, the The was an actual band again, Johnson having recruited ex-Smiths guitarist Johnny Marr, ex-Nick Lowe bassist James Eller and ex-ABC drummer David Palmer as fully-fledged members. This line-up, plus guest singer Sinéad O'Connor, recorded the album Mind Bomb, which debuted at No. 4 in the UK Albums Chart and featured the band's highest charting single to that time, \"The Beat(en) Generation\", which peaked at No. 18 in the UK Singles Chart. The first single from Mind Bomb was actually scheduled to be \"Armageddon Days Are Here (Again)\" but with its chorus of \"Islam is rising, the Christians mobilising\" and sensitivities over the Salman Rushdie affair that had recently erupted, this song was deemed unsuitable for release by Epic/CBS.\n\nKeyboardist D.C. Collard was added to the official line-up in 1989 (keyboard player Steve Hogarth, who'd played on Infected, had initially been asked to join but opted instead to become the new lead vocalist of Marillion). The band embarked on a lengthy world tour in 1989–90 called the The Versus the World. The live film of the same name, directed by Tim Pope, was filmed during the three nights The The performed at London's Royal Albert Hall at the end of the tour. Vocalist Melanie Redmond, who had just completed a world tour with Duran Duran, joined the tour during the European leg as a session musician.\n\nThe studio EP Shades of Blue was released in 1990. This included cover versions of Fred Neil's \"Dolphins\" and Duke Ellington's \"Solitude\" as well as a new original song \"Jealous of Youth\" and a live version of \"Another Boy Drowning\" from Burning Blue Soul. This and a later EP of remixes, 1993's Dis-infected, were compiled into a 1994 full-length album for the North American market called Solitude.\n\nIn 1993, with Johnson, Marr, Collard, Eller and Palmer, Some Bizzare Records/Epic issued the album Dusk, which debuted at No. 2 in the UK and spun off three top 40 singles in the UK, led by \"Dogs of Lust\". Another world tour followed, the Lonely Planet tour, at which point the band's line-up was reshuffled; Marr and Eller left, and were replaced by Atlanta-based guitarist Keith Joyner and New York bassist Jared Michael Nickerson after Johnson relocated the band to the U.S. Also added was Boston harmonica player Jim Fitting (formerly of Treat Her Right), who auditioned in New York in early 1993. Palmer bowed out partway through the tour and was replaced by ex-Stabbing Westward drummer Andy Kubiszewski. The band headlined the main stage at the 1993 Reading Festival.\n\nAnother full-length film, directed by longtime collaborator Tim Pope, was made for this album. From Dusk Til Dawn was shot in New Orleans and New York, and along with Johnson and Johnny Marr also featured various characters from the New York underground scene such as sexologist Annie Sprinkle, writer and raconteur Quentin Crisp, Guardian Angels founder Curtis Sliwa, and porn star Rick Savage amongst many carnival characters.\n\nNow permanently relocated to New York, the The's next project was 1995's Hanky Panky, an album that consisted entirely of Hank Williams cover tunes. Hanky Panky was recorded by a new group consisting of Johnson, Collard, Fitting, ex Iggy Pop guitarist Eric Schermerhorn, ex David Bowie bass guitarist Gail Ann Dorsey (billed as \"Hollywood\" Dorsey), and drummer the \"Reverend\" Brian MacLeod. Their cover version of \"I Saw the Light\" hit No. 31 UK.Released by Some Bizzare Label / Epic\n\nAn experimental album called Gun Sluts was recorded in 1997, but left unreleased by the band after it was rejected for being too uncommercial by their label. The The severed their eighteen-year relationship with Sony and moved to Interscope, on Trent Reznor's Nothing Records imprint.\n\nIn 2000, the The, now consisting of Johnson, Schermerhorn, Nashville bassist Spencer Campbell and New Jersey drummer Earl Harvin, released NakedSelf and embarked on yet another lengthy world tour, the Naked Tour, this one lasting 14 months. Not counting soundtrack albums, NakedSelf remains the The's final released studio album to date.\n\nThis same line-up also recorded two new tracks, \"Deep Down Truth\", featuring Angela McCluskey on vocals and \"Pillar Box Red\". Both songs were produced by Clive Langer and Alan Winstanley for the 2002 compilation album '45 RPM: The Singles of The The.\n\nIn June 2002 the The made a sole live appearance at the Meltdown Festival at London's Royal Festival Hall as guests of David Bowie. At this point, the band consisted solely of Johnson and longtime friend and collaborator J. G. Thirlwell aka Foetus on tapes and loops, and young film director [[]] on film and video. This was the last live performance by The The for sixteen years; Johnson had stated on the official the The website in the FAQ section that \"There are no plans for one-off shows or tours in the near future but there will undoubtedly be another The The tour at some point.\"\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/The_The\n\nStudio albums\nSoul Mining (1983)\nInfected (1986)\nMind Bomb (1989)\nDusk (1993)\nHanky Panky (1995)\nNakedSelf (2000)\nTony (soundtrack) (2010)\nMoonbug (soundtrack) (2012)\nHyena (soundtrack) (2015)\nMuscle (soundtrack) (2020)\nThe Comeback Special: Live at the Royal Albert Hall (2021) <a href=\"https://www.last.fm/music/The+The\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T14:41:58.652316",
  "discogs_id": "23368",
  "discogs_url": "https://www.discogs.com/artist/23368",
  "followers": 383323,
  "formed_date": null,
  "genres": [
    "Rock",
    "new wave",
    "post-punk",
    "alternative",
    "80s",
    "indie"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/25/9f/ee/259fee71-c54c-7156-a095-288e760b2b09/mza_2692345089151184473.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5ebf7141fa845d562afdc8cfab9",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174f7141fa845d562afdc8cfab9",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178f7141fa845d562afdc8cfab9",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "a7409219-a681-4072-adb2-5285106ce6f2",
  "lastfm_url": "https://www.last.fm/music/The+The",
  "local_images": {
    "hi-res": "public/artist/the-the/the-the-hi-res.jpg",
    "medium": "public/artist/the-the/the-the-medium.jpg",
    "small": "public/artist/the-the/the-the-small.jpg"
  },
  "name": "The The",
  "popularity": 55,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/25/9f/ee/259fee71-c54c-7156-a095-288e760b2b09/mza_2692345089151184473.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "106580",
      "name": "The The",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/the-the/106580"
    },
    "discogs": {
      "id": 23368,
      "original_name": "The The",
      "role": ""
    },
    "lastfm": {
      "bio_content": "The The are an English post-punk band. They have been active in various forms since 1979, with singer-songwriter Matt Johnson being the only constant band member. The The achieved critical acclaim and commercial success in the UK, with 15 chart singles (seven reaching the top 40), and their most successful album, Infected (1986), spent 30 weeks on the chart. They followed this with the top ten albums Mind Bomb (1989) and Dusk (1993).\n\nEarly years (1977–1981)\nIn November 1977, Matt Johnson placed an advertisement in NME, asking for \"Bass/lead guitarist into The Velvet Underground/Syd Barrett\". Johnson later placed a second advertisement in the NME, stating his new influences as \"The Residents/Throbbing Gristle\".\n\nWhile trying to get his band going, in 1978 Johnson had recorded a demo solo album (See Without Being Seen) which he continued to sell at various underground gigs on cassettes. In 1979, working with Colin Lloyd-Tucker (a friend and colleague at De Wolfe Music, the Soho music publisher/recording studio) Johnson recorded his first album proper, Spirits. This album remains unreleased, although the track \"What Stanley Saw\" was later licensed to Cherry Red Records for their Perspectives & Distortion compilation album, which also featured Virgin Prunes, Lemon Kittens, Thomas Leer, Kevin Coyne and Mark Perry.\n\nThe The made their debut at London's Africa Centre on 11 May 1979, third on the bill to Scritti Politti and PragVEC, using backing tape tracks that Johnson created at his day job at De Wolfe studios for the drums and bass. The band at this point consisted of Johnson on vocal, electric piano, guitar and tapes and Keith Laws on synthesiser and tapes. It was Keith Laws who suggested the name 'the The' to Matt Johnson.\n\nAs the The was now getting underway, Johnson was simultaneously working with experimental synth-pop combo the Gadgets, a studio group he formed with Colin Lloyd Tucker, his colleague at De Wolfe recording studios.\n\nPeter Ashworth, then known as 'Triash' and later to become a noted photographer, became the The's drummer in 1980, and Tom Johnston (also managing the The at this point and later to become a cartoonist for the Evening Standard, Daily Mirror and The Sun newspapers) was added on bass. Although both Ashworth and Johnston were credited with appearing on the The's debut single (\"Controversial Subject\"/\"Black and White\") on 4AD Records, neither actually played on the recordings, which were produced by Wire members Bruce Gilbert and Graham Lewis. All instruments were played by Johnson and Laws. Johnston and Ashworth soon dropped out of the The and returned to their respective day jobs. As a duo (Johnson and Laws), the The began performing concerts with Wire, Cabaret Voltaire, DAF, This Heat, the Birthday Party and Scritti Politti.\n\nIn early 1981 the The also contributed the composition 'Untitled' to the Some Bizzare Album. In September of that year Johnson and Laws signed a deal with Some Bizzare Records and released the 7\" single \"Cold Spell Ahead\". By this stage Matt Johnson had begun playing all the instruments himself so Laws left to pursue his studies, leaving Johnson as a solo artist using a group moniker.\n\nJohnson was signed up later in 1981 to 4AD Records by Ivo Watts-Russell to record a solo album, Burning Blue Soul. Although all of the instruments and vocals were performed by Johnson, the album featured various producers including Wire's Bruce Gilbert and Graham Lewis, Ivo and Johnson himself. Years later, owing to a request from Johnson, it would be re-issued and credited to the The so all of his albums would be in the same rack together.\n\nTowards the end of 1981, Colin Lloyd-Tucker and Simon Fisher-Turner joined the band for a series of stripped down The acoustic concerts in London.\n\nSolo years (1982–1987)\nNow freed from the politics of a permanent group line-up, Johnson was able to take the The up to the next level, and spent the next few years collaborating with a diverse range of creative individuals, freely changing personnel from project to project.\n\nThe The's next single was a retooling of \"Cold Spell Ahead\", now entitled \"Uncertain Smile\". Produced in New York by Mike Thorne, it reached No. 68 UK. This version is different from the more familiar album version, and featured sax and flute by session player Crispin Cioe rather than (as on the album version) the piano of Squeeze's Jools Holland.\n\nIn 1982, the intended debut album by the The (The Pornography of Despair) was recorded, but was never officially mixed nor released. Johnson apparently ran off some cassette copies for friends, and several tracks (\"Mental Healing Process\", \"Leap into The Wind\", \"Absolute Liberation\") were subsequently issued as additional tracks on the \"This Is the Day\" single. \"Three Orange Kisses from Kazan\" and \"Waitin' for the Upturn\" (featuring Steve James Sherlock playing flute and saxophone) also date from this era, and appeared as B-sides. Some of the previously-mentioned cuts, along with the tracks \"The Nature of Virtue\" and \"Fruit of the Heart\" (which were similarly recorded around the same time), appeared as bonus selections on a cassette-only issue of the band's eventual debut album, but The Pornography of Despair album as a whole remains unissued.\n\nAround 1982 the The played a series of four concerts at the Marque Club in Wardour Street, Soho, entitled 'An evening of Rock n Roll with the The'. These concerts were weekly for four weeks and featured Marc Almond on guitar and vocals.\n\nThe The released their official album debut, the synth-noir classic Soul Mining, in 1983. It featured the minor UK No. 71 hit \"This Is the Day\", as well as a new recording of the The performing \"Uncertain Smile\". Produced by Johnson and Paul Hardiman, it featured guest appearances from Orange Juice's drummer Zeke Manyika, Jools Holland, Thomas Leer and J. G. Thirlwell (aka Foetus).\n\nDuring the The's more prolific period of releases, from Soul Mining (1983) to Dusk (1992), most artwork used on the albums and single releases was produced by Johnson's brother Andrew Johnson, using the pseudonym Andy Dog. The artwork has a distinctive style, and sometimes courted controversy, most notably the initial release of the 1986 single \"Infected\", which featured a masturbating devil and was withdrawn from sale and re-issued with an edited version of the same drawing.\n\nFor the 1986 album Infected, the The still consisted only of Johnson, but was augmented by session musicians and featured friends such as Manyika and Rip Rig + Panic singer Neneh Cherry and Anna Domino. This album spawned four charting singles in the UK, notably \"Heartland\", which made the UK top 30. It was also unusual for having a full-length accompanying film. Costing hundreds of thousands of pounds, Infected: The Movie was shot on locations in Bolivia, Peru and New York. Different songs were directed by different directors, mainly Tim Pope and Peter 'Sleazy' Christopherson (of Throbbing Gristle).\n\nThroughout 1986-1987 Johnson toured the world extensively with Infected: The Movie, showing the film in cinemas in place of performing live concerts. The film was also shown twice in its entirety on Channel 4 in the UK and on MTV's 120 Minutes in the US.\n\nIn 1987 Johnson also took some tentative steps back into live performance. Whilst promoting Infected: The Movie in Australia he had a chance encounter with Billy Bragg, who persuaded him to return to Britain and support Red Wedge, a coalition of like-minded musicians supporting the British Labour Party in its election campaign. Johnson agreed and enrolled longtime friend and collaborator Manyika to join him in performing shows in London featuring stripped-down versions of political the The songs such as \"Heartland\". This experience convinced Johnson to put a band together once again.\n\nReturn to a full band (1988–2002)\nBy 1988, the The was an actual band again, Johnson having recruited ex-Smiths guitarist Johnny Marr, ex-Nick Lowe bassist James Eller and ex-ABC drummer David Palmer as fully-fledged members. This line-up, plus guest singer Sinéad O'Connor, recorded the album Mind Bomb, which debuted at No. 4 in the UK Albums Chart and featured the band's highest charting single to that time, \"The Beat(en) Generation\", which peaked at No. 18 in the UK Singles Chart. The first single from Mind Bomb was actually scheduled to be \"Armageddon Days Are Here (Again)\" but with its chorus of \"Islam is rising, the Christians mobilising\" and sensitivities over the Salman Rushdie affair that had recently erupted, this song was deemed unsuitable for release by Epic/CBS.\n\nKeyboardist D.C. Collard was added to the official line-up in 1989 (keyboard player Steve Hogarth, who'd played on Infected, had initially been asked to join but opted instead to become the new lead vocalist of Marillion). The band embarked on a lengthy world tour in 1989–90 called the The Versus the World. The live film of the same name, directed by Tim Pope, was filmed during the three nights The The performed at London's Royal Albert Hall at the end of the tour. Vocalist Melanie Redmond, who had just completed a world tour with Duran Duran, joined the tour during the European leg as a session musician.\n\nThe studio EP Shades of Blue was released in 1990. This included cover versions of Fred Neil's \"Dolphins\" and Duke Ellington's \"Solitude\" as well as a new original song \"Jealous of Youth\" and a live version of \"Another Boy Drowning\" from Burning Blue Soul. This and a later EP of remixes, 1993's Dis-infected, were compiled into a 1994 full-length album for the North American market called Solitude.\n\nIn 1993, with Johnson, Marr, Collard, Eller and Palmer, Some Bizzare Records/Epic issued the album Dusk, which debuted at No. 2 in the UK and spun off three top 40 singles in the UK, led by \"Dogs of Lust\". Another world tour followed, the Lonely Planet tour, at which point the band's line-up was reshuffled; Marr and Eller left, and were replaced by Atlanta-based guitarist Keith Joyner and New York bassist Jared Michael Nickerson after Johnson relocated the band to the U.S. Also added was Boston harmonica player Jim Fitting (formerly of Treat Her Right), who auditioned in New York in early 1993. Palmer bowed out partway through the tour and was replaced by ex-Stabbing Westward drummer Andy Kubiszewski. The band headlined the main stage at the 1993 Reading Festival.\n\nAnother full-length film, directed by longtime collaborator Tim Pope, was made for this album. From Dusk Til Dawn was shot in New Orleans and New York, and along with Johnson and Johnny Marr also featured various characters from the New York underground scene such as sexologist Annie Sprinkle, writer and raconteur Quentin Crisp, Guardian Angels founder Curtis Sliwa, and porn star Rick Savage amongst many carnival characters.\n\nNow permanently relocated to New York, the The's next project was 1995's Hanky Panky, an album that consisted entirely of Hank Williams cover tunes. Hanky Panky was recorded by a new group consisting of Johnson, Collard, Fitting, ex Iggy Pop guitarist Eric Schermerhorn, ex David Bowie bass guitarist Gail Ann Dorsey (billed as \"Hollywood\" Dorsey), and drummer the \"Reverend\" Brian MacLeod. Their cover version of \"I Saw the Light\" hit No. 31 UK.Released by Some Bizzare Label / Epic\n\nAn experimental album called Gun Sluts was recorded in 1997, but left unreleased by the band after it was rejected for being too uncommercial by their label. The The severed their eighteen-year relationship with Sony and moved to Interscope, on Trent Reznor's Nothing Records imprint.\n\nIn 2000, the The, now consisting of Johnson, Schermerhorn, Nashville bassist Spencer Campbell and New Jersey drummer Earl Harvin, released NakedSelf and embarked on yet another lengthy world tour, the Naked Tour, this one lasting 14 months. Not counting soundtrack albums, NakedSelf remains the The's final released studio album to date.\n\nThis same line-up also recorded two new tracks, \"Deep Down Truth\", featuring Angela McCluskey on vocals and \"Pillar Box Red\". Both songs were produced by Clive Langer and Alan Winstanley for the 2002 compilation album '45 RPM: The Singles of The The.\n\nIn June 2002 the The made a sole live appearance at the Meltdown Festival at London's Royal Festival Hall as guests of David Bowie. At this point, the band consisted solely of Johnson and longtime friend and collaborator J. G. Thirlwell aka Foetus on tapes and loops, and young film director [[]] on film and video. This was the last live performance by The The for sixteen years; Johnson had stated on the official the The website in the FAQ section that \"There are no plans for one-off shows or tours in the near future but there will undoubtedly be another The The tour at some point.\"\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/The_The\n\nStudio albums\nSoul Mining (1983)\nInfected (1986)\nMind Bomb (1989)\nDusk (1993)\nHanky Panky (1995)\nNakedSelf (2000)\nTony (soundtrack) (2010)\nMoonbug (soundtrack) (2012)\nHyena (soundtrack) (2015)\nMuscle (soundtrack) (2020)\nThe Comeback Special: Live at the Royal Albert Hall (2021) <a href=\"https://www.last.fm/music/The+The\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "The The are an English post-punk band. They have been active in various forms since 1979, with singer-songwriter Matt Johnson being the only constant band member. The The achieved critical acclaim and commercial success in the UK, with 15 chart singles (seven reaching the top 40), and their most successful album, Infected (1986), spent 30 weeks on the chart. They followed this with the top ten albums Mind Bomb (1989) and Dusk (1993).\n\nEarly years (1977–1981) <a href=\"https://www.last.fm/music/The+The\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 627744,
      "mbid": "a7409219-a681-4072-adb2-5285106ce6f2",
      "name": "The The",
      "playcount": 9200639,
      "similar_artists": [
        {
          "name": "Lloyd Cole and The Commotions",
          "url": "https://www.last.fm/music/Lloyd+Cole+and+The+Commotions"
        },
        {
          "name": "Echo & the Bunnymen",
          "url": "https://www.last.fm/music/Echo+&+the+Bunnymen"
        },
        {
          "name": "Simple Minds",
          "url": "https://www.last.fm/music/Simple+Minds"
        },
        {
          "name": "Ultravox",
          "url": "https://www.last.fm/music/Ultravox"
        },
        {
          "name": "New Order",
          "url": "https://www.last.fm/music/New+Order"
        }
      ],
      "tags": [
        "new wave",
        "post-punk",
        "alternative",
        "80s",
        "indie"
      ],
      "url": "https://www.last.fm/music/The+The"
    },
    "spotify": {
      "followers": 383323,
      "genres": [
        "new wave"
      ],
      "id": "7cKtqv9cYVlOwnuCFH95ce",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5ebf7141fa845d562afdc8cfab9",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174f7141fa845d562afdc8cfab9",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178f7141fa845d562afdc8cfab9",
          "width": 160
        }
      ],
      "name": "The The",
      "popularity": 55,
      "url": "https://open.spotify.com/artist/7cKtqv9cYVlOwnuCFH95ce"
    }
  },
  "spotify_id": "7cKtqv9cYVlOwnuCFH95ce",
  "spotify_url": "https://open.spotify.com/artist/7cKtqv9cYVlOwnuCFH95ce",
  "updated_at": "2025-07-05T14:41:59.549038",
  "wikipedia_url": null
}