{
  "apple_music_id": "1654233350",
  "apple_music_url": "https://music.apple.com/gb/album/stereo-mind-game/1654233350",
  "artists": [
    {
      "apple_music_id": "469701923",
      "biography": "Daughter are an English indie folk band originating from London in 2010. Originally the solo work of Elena Tonra, they are now a trio with the addition of guitarist Igor Haefeli and drummer Remi Aguilella. After releasing three EPs in 2010 and 2011, they were signed by 4AD and are set to release their first full-length album, If You Leave, in March 2013. Of Irish-Italian parentage, Elena Tonra (b. 1990) was raised in Northwood, London, with her older brother, Kieran. Through her Dublin-born grandfather she experienced traditional Irish music from an early age. Her interest in music began when she received a copy of the album Grace by Jeff Buckley. After being bullied at school she used writing to \"deal emotionally with life\". Changing schools at the age of 12 had a great impact and since then Tonra writes \"about things I feel difficult talking about in adulthood”.\n\nTonra began her career in music, performing acoustic shows under her own name around London, she found that this \"didn’t suit me at all. As a musician, I’m self-taught and felt I was restricted by my abilities\". Haefeli attended one of the acoustic shows that Tonra was performing and found that \"she had this power which drew everyone in\". Originally from Neuchatel, he also attend London's Institute of Contemporary Music Performance. They began performing together with Haefeli adding electric guitars. After their first demo started word of mouth on the band, Daughter self-released their debut EP, His Young Heart, on 20 April 2011, recorded in Haefeli's bedsit. Later that same year, they released another EP, The Wild Youth, on 2 October through artist-led Communion Records. The latter EP earned praise from British website For Folk's Sake who described Daughter as \"one of the unique sounds in the pop landscape today.\" BBC Radio 1 DJ Huw Stephens also invited them to perform a Maida Vale Session for his show.\n\nTonra and Haefeli became romantically involved and the guitarist insisted that they \"keep our couple life and our band life separate,  I don’t want Elena to stop saying things in her songs that are personal  songwriters need to be expansive and they need to be unafraid”. While Tonra concurred with \"Igor doesn’t question my lyrics. He regards what we do as an art form. He certainly doesn’t try to rewrite my words. I never tell anyone what my songs are about, not even him. I feel they are direct enough, anyway. They aren’t especially obscure\".\n\nIn 2012, shortly after headlining a 700-capacity show in London, Daughter announce their signing to UK label 4AD. Speaking of this, Elena commented \"we couldn't be happier to be working with 4AD, a label that has released so many inspirational records and whose ethos we hold in very high regard. It really is a privilege.\" Their first single proper, \"Smother\", was released in October of that year. It was playlisted by both BBC Radio 1 and 6Music, while being awarded Single of the Week by long-time supporter Huw Stephens. In December 2012 the band appeared on the David Letterman Show prior to the release of the record, which Tonra described as \"perhaps (...) a cart-before-the-horse situation\".",
      "discogs_id": "2218596",
      "discogs_original_name": "Daughter",
      "id": null,
      "lastfm_mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
      "name": "Daughter",
      "role": "",
      "spotify_id": "46CitWgnWrvF9t70C2p1Me",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Daughter": {
      "biography": "Daughter are an English indie folk band originating from London in 2010. Originally the solo work of Elena Tonra, they are now a trio with the addition of guitarist Igor Haefeli and drummer Remi Aguilella. After releasing three EPs in 2010 and 2011, they were signed by 4AD and are set to release their first full-length album, If You Leave, in March 2013. Of Irish-Italian parentage, Elena Tonra (b. 1990) was raised in Northwood, London, with her older brother, Kieran. Through her Dublin-born grandfather she experienced traditional Irish music from an early age. Her interest in music began when she received a copy of the album Grace by Jeff Buckley. After being bullied at school she used writing to \"deal emotionally with life\". Changing schools at the age of 12 had a great impact and since then Tonra writes \"about things I feel difficult talking about in adulthood”.\n\nTonra began her career in music, performing acoustic shows under her own name around London, she found that this \"didn’t suit me at all. As a musician, I’m self-taught and felt I was restricted by my abilities\". Haefeli attended one of the acoustic shows that Tonra was performing and found that \"she had this power which drew everyone in\". Originally from Neuchatel, he also attend London's Institute of Contemporary Music Performance. They began performing together with Haefeli adding electric guitars. After their first demo started word of mouth on the band, Daughter self-released their debut EP, His Young Heart, on 20 April 2011, recorded in Haefeli's bedsit. Later that same year, they released another EP, The Wild Youth, on 2 October through artist-led Communion Records. The latter EP earned praise from British website For Folk's Sake who described Daughter as \"one of the unique sounds in the pop landscape today.\" BBC Radio 1 DJ Huw Stephens also invited them to perform a Maida Vale Session for his show.\n\nTonra and Haefeli became romantically involved and the guitarist insisted that they \"keep our couple life and our band life separate,  I don’t want Elena to stop saying things in her songs that are personal  songwriters need to be expansive and they need to be unafraid”. While Tonra concurred with \"Igor doesn’t question my lyrics. He regards what we do as an art form. He certainly doesn’t try to rewrite my words. I never tell anyone what my songs are about, not even him. I feel they are direct enough, anyway. They aren’t especially obscure\".\n\nIn 2012, shortly after headlining a 700-capacity show in London, Daughter announce their signing to UK label 4AD. Speaking of this, Elena commented \"we couldn't be happier to be working with 4AD, a label that has released so many inspirational records and whose ethos we hold in very high regard. It really is a privilege.\" Their first single proper, \"Smother\", was released in October of that year. It was playlisted by both BBC Radio 1 and 6Music, while being awarded Single of the Week by long-time supporter Huw Stephens. In December 2012 the band appeared on the David Letterman Show prior to the release of the record, which Tonra described as \"perhaps (...) a cart-before-the-horse situation\".",
      "wikipedia_url": null
    }
  },
  "country": "UK & US",
  "created_at": "2025-07-09T08:18:38.002737",
  "date_added": "2023-04-23T04:35:10-07:00",
  "discogs_id": "26675387",
  "discogs_url": "https://www.discogs.com/release/26675387-Daughter-2-Stereo-Mind-Game",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock",
    "2023",
    "rock",
    "indie rock",
    "post-rock",
    "dream pop"
  ],
  "id": "26675387",
  "images": [
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/UpXJuTv81tTJP7NIN-xQaI9PkKuCTSvDdTpfzsgBhAk/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtOTM5MS5qcGVn.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/UpXJuTv81tTJP7NIN-xQaI9PkKuCTSvDdTpfzsgBhAk/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtOTM5MS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/dDnJoiFn5iaXg0ptZ5dD2_0DI_xUhWbzloTi78NmaPQ/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/MzktMzUzNi5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/dDnJoiFn5iaXg0ptZ5dD2_0DI_xUhWbzloTi78NmaPQ/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/MzktMzUzNi5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/1vwt7YVbpfW69zka9VHaVhX7npnFBXOUDJzMinnYSow/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtMjUyOS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/1vwt7YVbpfW69zka9VHaVhX7npnFBXOUDJzMinnYSow/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtMjUyOS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/FGvq2sqsgotxunKJpDHfP9J7TbYets1qwhiGpRoBjSo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtMzk2NS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/FGvq2sqsgotxunKJpDHfP9J7TbYets1qwhiGpRoBjSo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtMzk2NS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/kImg0fSORn--mklOpqI_vPI8RQU28EbOxwdcdsEVoeE/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtMzg0OC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/kImg0fSORn--mklOpqI_vPI8RQU28EbOxwdcdsEVoeE/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtMzg0OC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/iw9tgGtmkxIDsWd1n6A-P_zZsXVVhkKfEoXqHLQ7Aq0/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtODgzNC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/iw9tgGtmkxIDsWd1n6A-P_zZsXVVhkKfEoXqHLQ7Aq0/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtODgzNC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/A6xTOpQWM5svbhPAGOszL4j9m41wIGX80GvQmUGRtR0/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtNzY1OC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/A6xTOpQWM5svbhPAGOszL4j9m41wIGX80GvQmUGRtR0/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTI2Njc1/Mzg3LTE2ODA4Nzcx/NDEtNzY1OC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music116/v4/5f/1a/b9/5f1ab9f2-b5d0-3428-2ec8-eb4010964bb3/191400051270.png/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "4AD"
  ],
  "lastfm_mbid": null,
  "lastfm_url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game",
  "local_images": {
    "hi-res": "../public/album/stereo-mind-game-26675387/stereo-mind-game-26675387-hi-res.jpg",
    "medium": "../public/album/stereo-mind-game-26675387/stereo-mind-game-26675387-medium.jpg",
    "small": "../public/album/stereo-mind-game-26675387/stereo-mind-game-26675387-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-09T08:18:40.591027",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "Stereo Mind Game",
  "release_name_discogs": "Stereo Mind Game",
  "release_name_spotify": "Stereo Mind Game",
  "released": "2023-04-07",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music116/v4/5f/1a/b9/5f1ab9f2-b5d0-3428-2ec8-eb4010964bb3/191400051270.png/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 2023 4AD Ltd",
      "editorial_notes": "When Daughter decided to take a break in 2017, they didn’t expect it would be six years until they’d next put out an album. They’d needed time away from touring and from each other, to halt the natural autopilot any band can fall into, and a moment to concentrate on life beyond Daughter (vocalist Elena Tonra released her solo debut as Ex:Re in 2018). Then, right when they were ready to work on ideas they’d started on just before their hiatus, the pandemic hit. But they discovered some advantages to working miles apart. “Everything was more considerate,” guitarist and producer Igor Haefeli tells Apple Music. “Like when you’d write a letter, you can look over it and correct your mistakes and give it more thought, as opposed to the immediacy of being in a room together.” With live music off indefinitely, they also found more room to experiment. “With previous albums, there was always a limitation of ‘How are we going to play this live?’” says drummer Remi Aguilella. “[This time] it was like, ‘It would be great to have all those different parts, so let’s add them and see what happens.’” \n\n<i>Stereo Mind Game</i>, then, sees Daughter widen and finesse their whisper-close yet atmospheric indie-folk sound. Expect lush string and horn arrangements, warm backing vocals and reverb-laden acoustic guitars that rub alongside chopped-up voice notes, driving drum machines and even electronic birdsong. “We’re all interested in having electronic and acoustic elements together,” says Tonra. “How big can the live sounds feel, and how textural the electronics can feel. We've tried to push both of those to a good new level for us.” For a band whose MO has always been emotional intensity, there was another new frontier: acceptance, as Tonra details falling for someone who lives too far away to make it work, connection and distance from loved ones, and conflicts between her own internal voices. “I guess every record we've made is [about] growth, change,” says Haefeli. “But with this one, it was about having a bit more optimism and emotional maturity.” Read on as Daughter talk through their third album, one track at a time. \n\n<b>“Intro”</b>\nIgor Haefeli: “It’s like a weird orchestra or different sounds and strings. It wasn’t made necessarily with the idea that it would be the first track, but it was always linked to ‘Be On Your Way’—they’re very connected.”\n\n<b>“Be On Your Way”</b>\nElena Tonra: “This was the first song where it felt like, ‘Oh, we’re making an album now.’ I think up until that point, we were working on a lot of songs, but this was the first one where I was like, ‘This feels like the direction, like the door into the record.’ So I think it’s good that it’s the first song on it.”\nIH: “It was finding the balance between the lightness and the love song part of this with the crushing feeling of not being close to the person you’re falling in love with.” \nET: “I was feeling hopefulness but also acceptance when I wrote this: It’s ‘I don’t know if we’ll see each other again, but I hope we will.’ On previous records, it would have been ‘This is the end of me!’ This is not like that.”\n\n<b>“Party”</b>\nET: “It's reflecting on the moment I decided to stop drinking alcohol, written years after that decision and looking back at that time. It’s celebrating moving forward from it. It’s quite a classic-sounding arrangement with bass and drums and guitars and vocals. It’s quite upbeat and I think that's really good to contrast with the lyrics. We’re trying to balance those things across the record.”\n\n<b>“Dandelion”</b>\nRemi Aguilella: “About a year before [writing] this, my wife and I had bought a house and there were about a million dandelions in my yard. It felt like my whole life was dandelions and there was no getting out of it. One day, I went into my music room and wrote the start of a song, a new idea, and just decided to name it ‘Dandelion’. We sent that to Elena and I was absolutely amazed that she was able to take that random word and just [write] pretty much all the lyrics. It was like, ‘How is that even possible?’ But it was amazing to watch and I'm still in awe of the whole thing.” \nET: “I was talking about that the time passing and your surroundings changing and you just feel like you are just there with this phone or whatever it is, just frozen in time while everything around you is moving.”\n\n<b>“Neptune”</b>\nET: “The vocal in this song is the first take. It has that rawness in it, which is what the song needed. It's about falling down the well, as I always call it: You’re in your own mind but also trying to appear outwardly fine and having that conflict between how you appear to everyone else and how you're actually feeling inside and your emotions. It’s mainly a conversation with myself, but I’m also talking about love as well. In the second half, the voices of Igor and [composer, singer, arranger and instrumentalist] Josephine Stephenson have that warmth of friends and family pulling you out of those very difficult moments. It’s a bit of a tribute to them.” \n\n<b>“Swim Back”</b>\nET: “I didn’t realise how much water is involved until after writing the record. It’s interesting, because my relationship towards it is that I can’t swim! I'm really fighting with the sea, but also longing for it at the same time.”\nIH: “This is a bit more rock than the other songs; it does have a little bit more distortion going on, stuff like that. But then there is a bunch of other things happening: We have all these re-sampled vocals of Elena. It’s trying to create a dreamscape that is also slightly unnerving because it's not quite real. And I think often dreams can border into the nightmare territory where this is feeling very odd and disconcerting.”\nET: “Your string arrangement is so melted, it's like dripping wax almost.”\n\n<b>“Junkmail”</b>\nET: “The method of writing it was different from every other song because it's literally made from me trying to clear my emails. I wanted to take a word from each bit of junk mail or advert—whatever was coming through to my inbox—and would put it on a piece of paper, and let my mind link up everything to make the lyrics. It does actually mean a lot to me, even though it seems like it would be a completely meaningless stream. It felt like a new way of writing that just allowed me to get out some things I wanted to say that didn't have a route somehow.”\nIH: “I really like Remi's drums and I love the juxtaposition of those with the more drum-machine elements. I think it's the song in a way that's the most genre-less, and also maybe, at the same time, the most different to what we've done in the past.”\n\n<b>”Future Lover”</b>\nET: “This is a bit more of a fun one, it’s quite joyful in some ways, even if the subject isn’t particularly. It’s about longing for someone but there’s a playfulness to it—a little tiny bit of humour. The song is actually really old and it’s the last one we finished, so it’s had a really long life. It’s just missing someone and feeling like they're there—the ‘sweet nothings from the ghost in the room’. It’s still very loving towards the person that's not there. It's not always in pain.”\n\n<b>“(Missed Calls)”</b>\nIH: “This is the interlude on the record for us. It’s real voice memos from a friend of Elena’s and also her niece and nephew who make an appearance in another song. That’s part of the themes of the album, this connection from a distance—as a result of the pandemic but also in terms of people moving away, being in separate countries, but feeling you can still be connected in a way. But it’s not the same as being in a room together. Production-wise, this one manipulates sounds and uses strings to create, again, some dream or otherworldly feeling that’s also connected back to reality and memory through those voices.”\n\n<b>“Isolation”</b>\nET: “This is opposite in some ways to ‘Be On Your Way’, in that the distance leaves me feeling very crushed and empty, as opposed to that peace of ‘Be On Your Way’. This definitely has a weight to it. Yet at the end, there’s the feeling of ‘I’ll compose myself, I’ll get over it.’ It’s still never fully allowing the vocal or the theme to descend into total doom or negativity. It’s very minimal, and I love the end part of this song, where these electronic glitches come in and sound like birdsong—I don’t know how Igor did that, but it’s genius.” \n\n<b>“To Rage”</b>\nIH: “It’s a calm song about anger. It was about how to work in restraint for a large part of it, up until the very emotional section. It's a little bit more atmospheric both musically and lyrically than some of the other songs, but still with that kind of driving rhythm section, great drumbeat from Remi and great bass part from Elena. We wanted the big section with the strings and the horns and everyone coming in to be so loud and emotional—the release of all this meditative vibe.”\n\n<b>”Wish I Could Cross the Sea”</b>\nIH: “The way the cellos and maybe the piano loop moves from the start of the song feels like the sea. I just love being in the water—for me, music feels like water most of the time. With the strings, the idea was to create a big hug at the end, to represent the love one might feel for their family. Funnily enough, this one was written way before the pandemic, which is again an example of how a lot of these songs can find relevance in lots of different situations.”",
      "id": "1654233350",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Daughter",
        "artwork": {
          "bgColor": "bfc1c0",
          "height": 4000,
          "textColor1": "0d0b00",
          "textColor2": "2e2922",
          "textColor3": "312f26",
          "textColor4": "4b4741",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music116/v4/5f/1a/b9/5f1ab9f2-b5d0-3428-2ec8-eb4010964bb3/191400051270.png/{w}x{h}bb.jpg",
          "width": 4000
        },
        "copyright": "℗ 2023 4AD Ltd",
        "editorialNotes": {
          "short": "“It was about having a bit more optimism and emotional maturity.”",
          "standard": "When Daughter decided to take a break in 2017, they didn’t expect it would be six years until they’d next put out an album. They’d needed time away from touring and from each other, to halt the natural autopilot any band can fall into, and a moment to concentrate on life beyond Daughter (vocalist Elena Tonra released her solo debut as Ex:Re in 2018). Then, right when they were ready to work on ideas they’d started on just before their hiatus, the pandemic hit. But they discovered some advantages to working miles apart. “Everything was more considerate,” guitarist and producer Igor Haefeli tells Apple Music. “Like when you’d write a letter, you can look over it and correct your mistakes and give it more thought, as opposed to the immediacy of being in a room together.” With live music off indefinitely, they also found more room to experiment. “With previous albums, there was always a limitation of ‘How are we going to play this live?’” says drummer Remi Aguilella. “[This time] it was like, ‘It would be great to have all those different parts, so let’s add them and see what happens.’” \n\n<i>Stereo Mind Game</i>, then, sees Daughter widen and finesse their whisper-close yet atmospheric indie-folk sound. Expect lush string and horn arrangements, warm backing vocals and reverb-laden acoustic guitars that rub alongside chopped-up voice notes, driving drum machines and even electronic birdsong. “We’re all interested in having electronic and acoustic elements together,” says Tonra. “How big can the live sounds feel, and how textural the electronics can feel. We've tried to push both of those to a good new level for us.” For a band whose MO has always been emotional intensity, there was another new frontier: acceptance, as Tonra details falling for someone who lives too far away to make it work, connection and distance from loved ones, and conflicts between her own internal voices. “I guess every record we've made is [about] growth, change,” says Haefeli. “But with this one, it was about having a bit more optimism and emotional maturity.” Read on as Daughter talk through their third album, one track at a time. \n\n<b>“Intro”</b>\nIgor Haefeli: “It’s like a weird orchestra or different sounds and strings. It wasn’t made necessarily with the idea that it would be the first track, but it was always linked to ‘Be On Your Way’—they’re very connected.”\n\n<b>“Be On Your Way”</b>\nElena Tonra: “This was the first song where it felt like, ‘Oh, we’re making an album now.’ I think up until that point, we were working on a lot of songs, but this was the first one where I was like, ‘This feels like the direction, like the door into the record.’ So I think it’s good that it’s the first song on it.”\nIH: “It was finding the balance between the lightness and the love song part of this with the crushing feeling of not being close to the person you’re falling in love with.” \nET: “I was feeling hopefulness but also acceptance when I wrote this: It’s ‘I don’t know if we’ll see each other again, but I hope we will.’ On previous records, it would have been ‘This is the end of me!’ This is not like that.”\n\n<b>“Party”</b>\nET: “It's reflecting on the moment I decided to stop drinking alcohol, written years after that decision and looking back at that time. It’s celebrating moving forward from it. It’s quite a classic-sounding arrangement with bass and drums and guitars and vocals. It’s quite upbeat and I think that's really good to contrast with the lyrics. We’re trying to balance those things across the record.”\n\n<b>“Dandelion”</b>\nRemi Aguilella: “About a year before [writing] this, my wife and I had bought a house and there were about a million dandelions in my yard. It felt like my whole life was dandelions and there was no getting out of it. One day, I went into my music room and wrote the start of a song, a new idea, and just decided to name it ‘Dandelion’. We sent that to Elena and I was absolutely amazed that she was able to take that random word and just [write] pretty much all the lyrics. It was like, ‘How is that even possible?’ But it was amazing to watch and I'm still in awe of the whole thing.” \nET: “I was talking about that the time passing and your surroundings changing and you just feel like you are just there with this phone or whatever it is, just frozen in time while everything around you is moving.”\n\n<b>“Neptune”</b>\nET: “The vocal in this song is the first take. It has that rawness in it, which is what the song needed. It's about falling down the well, as I always call it: You’re in your own mind but also trying to appear outwardly fine and having that conflict between how you appear to everyone else and how you're actually feeling inside and your emotions. It’s mainly a conversation with myself, but I’m also talking about love as well. In the second half, the voices of Igor and [composer, singer, arranger and instrumentalist] Josephine Stephenson have that warmth of friends and family pulling you out of those very difficult moments. It’s a bit of a tribute to them.” \n\n<b>“Swim Back”</b>\nET: “I didn’t realise how much water is involved until after writing the record. It’s interesting, because my relationship towards it is that I can’t swim! I'm really fighting with the sea, but also longing for it at the same time.”\nIH: “This is a bit more rock than the other songs; it does have a little bit more distortion going on, stuff like that. But then there is a bunch of other things happening: We have all these re-sampled vocals of Elena. It’s trying to create a dreamscape that is also slightly unnerving because it's not quite real. And I think often dreams can border into the nightmare territory where this is feeling very odd and disconcerting.”\nET: “Your string arrangement is so melted, it's like dripping wax almost.”\n\n<b>“Junkmail”</b>\nET: “The method of writing it was different from every other song because it's literally made from me trying to clear my emails. I wanted to take a word from each bit of junk mail or advert—whatever was coming through to my inbox—and would put it on a piece of paper, and let my mind link up everything to make the lyrics. It does actually mean a lot to me, even though it seems like it would be a completely meaningless stream. It felt like a new way of writing that just allowed me to get out some things I wanted to say that didn't have a route somehow.”\nIH: “I really like Remi's drums and I love the juxtaposition of those with the more drum-machine elements. I think it's the song in a way that's the most genre-less, and also maybe, at the same time, the most different to what we've done in the past.”\n\n<b>”Future Lover”</b>\nET: “This is a bit more of a fun one, it’s quite joyful in some ways, even if the subject isn’t particularly. It’s about longing for someone but there’s a playfulness to it—a little tiny bit of humour. The song is actually really old and it’s the last one we finished, so it’s had a really long life. It’s just missing someone and feeling like they're there—the ‘sweet nothings from the ghost in the room’. It’s still very loving towards the person that's not there. It's not always in pain.”\n\n<b>“(Missed Calls)”</b>\nIH: “This is the interlude on the record for us. It’s real voice memos from a friend of Elena’s and also her niece and nephew who make an appearance in another song. That’s part of the themes of the album, this connection from a distance—as a result of the pandemic but also in terms of people moving away, being in separate countries, but feeling you can still be connected in a way. But it’s not the same as being in a room together. Production-wise, this one manipulates sounds and uses strings to create, again, some dream or otherworldly feeling that’s also connected back to reality and memory through those voices.”\n\n<b>“Isolation”</b>\nET: “This is opposite in some ways to ‘Be On Your Way’, in that the distance leaves me feeling very crushed and empty, as opposed to that peace of ‘Be On Your Way’. This definitely has a weight to it. Yet at the end, there’s the feeling of ‘I’ll compose myself, I’ll get over it.’ It’s still never fully allowing the vocal or the theme to descend into total doom or negativity. It’s very minimal, and I love the end part of this song, where these electronic glitches come in and sound like birdsong—I don’t know how Igor did that, but it’s genius.” \n\n<b>“To Rage”</b>\nIH: “It’s a calm song about anger. It was about how to work in restraint for a large part of it, up until the very emotional section. It's a little bit more atmospheric both musically and lyrically than some of the other songs, but still with that kind of driving rhythm section, great drumbeat from Remi and great bass part from Elena. We wanted the big section with the strings and the horns and everyone coming in to be so loud and emotional—the release of all this meditative vibe.”\n\n<b>”Wish I Could Cross the Sea”</b>\nIH: “The way the cellos and maybe the piano loop moves from the start of the song feels like the sea. I just love being in the water—for me, music feels like water most of the time. With the strings, the idea was to create a big hug at the end, to represent the love one might feel for their family. Funnily enough, this one was written way before the pandemic, which is again an example of how a lot of these songs can find relevance in lots of different situations.”",
          "tagline": "New Album + Track by Track"
        },
        "genreNames": [
          "Alternative",
          "Music"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": true,
        "isSingle": false,
        "name": "Stereo Mind Game",
        "playParams": {
          "id": "1654233350",
          "kind": "album"
        },
        "recordLabel": "4AD",
        "releaseDate": "2023-04-07",
        "trackCount": 12,
        "upc": "191400051270",
        "url": "https://music.apple.com/gb/album/stereo-mind-game/1654233350"
      },
      "url": "https://music.apple.com/gb/album/stereo-mind-game/1654233350"
    },
    "lastfm": {
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/119af18c8c7cce4d93bf649d0e07a71f.jpg"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/119af18c8c7cce4d93bf649d0e07a71f.jpg"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/119af18c8c7cce4d93bf649d0e07a71f.jpg"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/119af18c8c7cce4d93bf649d0e07a71f.jpg"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/119af18c8c7cce4d93bf649d0e07a71f.jpg"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/119af18c8c7cce4d93bf649d0e07a71f.jpg"
        }
      ],
      "listeners": 97803,
      "mbid": "52c17eee-9ab6-428d-b90f-a4269d330921",
      "playcount": 2172866,
      "raw_data": {
        "album": {
          "artist": "Daughter",
          "image": [
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/34s/119af18c8c7cce4d93bf649d0e07a71f.jpg",
              "size": "small"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/64s/119af18c8c7cce4d93bf649d0e07a71f.jpg",
              "size": "medium"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/174s/119af18c8c7cce4d93bf649d0e07a71f.jpg",
              "size": "large"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/119af18c8c7cce4d93bf649d0e07a71f.jpg",
              "size": "extralarge"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/119af18c8c7cce4d93bf649d0e07a71f.jpg",
              "size": "mega"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/119af18c8c7cce4d93bf649d0e07a71f.jpg",
              "size": ""
            }
          ],
          "listeners": "97803",
          "mbid": "52c17eee-9ab6-428d-b90f-a4269d330921",
          "name": "Stereo Mind Game",
          "playcount": "2172866",
          "tags": {
            "tag": [
              {
                "name": "2023",
                "url": "https://www.last.fm/tag/2023"
              },
              {
                "name": "rock",
                "url": "https://www.last.fm/tag/rock"
              },
              {
                "name": "indie rock",
                "url": "https://www.last.fm/tag/indie+rock"
              },
              {
                "name": "post-rock",
                "url": "https://www.last.fm/tag/post-rock"
              },
              {
                "name": "dream pop",
                "url": "https://www.last.fm/tag/dream+pop"
              }
            ]
          },
          "tracks": {
            "track": [
              {
                "@attr": {
                  "rank": 1
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 55,
                "name": "Intro",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Intro"
              },
              {
                "@attr": {
                  "rank": 2
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 244,
                "name": "Be on Your Way",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Be+on+Your+Way"
              },
              {
                "@attr": {
                  "rank": 3
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 267,
                "name": "Party",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Party"
              },
              {
                "@attr": {
                  "rank": 4
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 231,
                "name": "Dandelion",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Dandelion"
              },
              {
                "@attr": {
                  "rank": 5
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 325,
                "name": "Neptune",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Neptune"
              },
              {
                "@attr": {
                  "rank": 6
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 274,
                "name": "Swim Back",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Swim+Back"
              },
              {
                "@attr": {
                  "rank": 7
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 245,
                "name": "Junkmail",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Junkmail"
              },
              {
                "@attr": {
                  "rank": 8
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 253,
                "name": "Future Lover",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Future+Lover"
              },
              {
                "@attr": {
                  "rank": 9
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 103,
                "name": "(Missed Calls)",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/(Missed+Calls)"
              },
              {
                "@attr": {
                  "rank": 10
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 157,
                "name": "Isolation",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Isolation"
              },
              {
                "@attr": {
                  "rank": 11
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 285,
                "name": "To Rage",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/To+Rage"
              },
              {
                "@attr": {
                  "rank": 12
                },
                "artist": {
                  "mbid": "a1ced3e5-476c-4046-bd74-d428f419989b",
                  "name": "Daughter",
                  "url": "https://www.last.fm/music/Daughter"
                },
                "duration": 218,
                "name": "Wish I Could Cross The Sea",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game/Wish+I+Could+Cross+The+Sea"
              }
            ]
          },
          "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game",
          "wiki": {
            "content": "When Daughter decided to take a break in 2017, they didn’t expect it would be six years until they’d next put out an album. They’d needed time away from touring and from each other, to halt the natural autopilot any band can fall into, and a moment to concentrate on life beyond Daughter (vocalist Elena Tonra released her solo debut as Ex:Re in 2018). Then, right when they were ready to work on ideas they’d started on just before their hiatus, the pandemic hit. But they discovered some advantages to working miles apart. “Everything was more considerate,” guitarist and producer Igor Haefeli tells Apple Music. “Like when you’d write a letter, you can look over it and correct your mistakes and give it more thought, as opposed to the immediacy of being in a room together.” With live music off indefinitely, they also found more room to experiment. “With previous albums, there was always a limitation of ‘How are we going to play this live?’” says drummer Remi Aguilella. “ it was like, ‘It would be great to have all those different parts, so let’s add them and see what happens.’” \n\nStereo Mind Game, then, sees Daughter widen and finesse their whisper-close yet atmospheric indie-folk sound. Expect lush string and horn arrangements, warm backing vocals, and reverb-laden acoustic guitars that rub alongside chopped-up voice notes, driving drum machines, and even electronic birdsong. “We’re all interested in having electronic and acoustic elements together,” says Tonra. “How big can the live sounds feel, and how textural the electronics can feel. We've tried to push both of those to a good new level for us.” For a band whose MO has always been emotional intensity, there was another new frontier: acceptance, as Tonra details falling for someone who lives too far away to make it work, connection and distance from loved ones, and conflicts between her own internal voices. “I guess every record we've made is  growth, change,” says Haefeli. “But with this one, it was about having a bit more optimism and emotional maturity.” Read on as Daughter talks through their third album, one track at a time. \n\n“Intro”\nIgor Haefeli: “It’s like a weird orchestra or different sounds and strings. It wasn’t made necessarily with the idea that it would be the first track, but it was always linked to ‘Be On Your Way’—they’re very connected.”\n\n“Be On Your Way”\nElena Tonra: “This was the first song where it felt like, ‘Oh, we’re making an album now.’ I think up until that point, we were working on a lot of songs, but this was the first one where I was like, ‘This feels like the direction, like the door into the record.’ So I think it’s good that it’s the first song on it.”\nIH: “It was finding the balance between the lightness and the love song part of this with the crushing feeling of not being close to the person you’re falling in love with.” \nET: “I was feeling hopefulness but also acceptance when I wrote this: It’s ‘I don’t know if we’ll see each other again, but I hope we will.’ On previous records, it would have been ‘This is the end of me!’ This is not like that.”\n\n“Party”\nET: “It's reflecting on the moment I decided to stop drinking alcohol, written years after that decision and looking back at that time. It’s celebrating moving forward from it. It’s quite a classic-sounding arrangement with bass and drums and guitars and vocals. It’s quite upbeat and I think that's really good to contrast with the lyrics. We’re trying to balance those things across the record.”\n\n“Dandelion”\nRemi Aguilella: “About a year before  this, my wife and I had bought a house and there were about a million dandelions in my yard. It felt like my whole life was dandelions and there was no getting out of it. One day, I went into my music room and wrote the start of a song, a new idea, and just decided to name it ‘Dandelion.’ We sent that to Elena and I was absolutely amazed that she was able to take that random word and just  pretty much all the lyrics. It was like, ‘How is that even possible?’ But it was amazing to watch and I'm still in awe of the whole thing.” \nET: “I was talking about that the time passing and your surroundings changing and you just feel like you are just there with this phone or whatever it is, just frozen in time while everything around you is moving.”\n\n“Neptune”\nET: “The vocal in this song is the first take. It has that rawness in it, which is what the song needed. It's about falling down the well, as I always call it: You’re in your own mind but also trying to appear outwardly fine and having that conflict between how you appear to everyone else and how you're actually feeling inside and your emotions. It’s mainly a conversation with myself, but I’m also talking about love as well. In the second half, the voices of Igor and  Josephine Stephenson have that warmth of friends and family pulling you out of those very difficult moments. It’s a bit of a tribute to them.” \n\n“Swim Back”\nET: “I didn’t realize how much water is involved until after writing the record. It’s interesting, because my relationship towards it is that I can’t swim! I'm really fighting with the sea, but also longing for it at the same time.”\nIH: “This is a bit more rock than the other songs; it does have a little bit more distortion going on, stuff like that. But then there is a bunch of other things happening: We have all these re-sampled vocals of Elena. It’s trying to create a dreamscape that is also slightly unnerving because it's not quite real. And I think often dreams can border into the nightmare territory where this is feeling very odd and disconcerting.”\nET: “Your string arrangement is so melted, it's like dripping wax almost.”\n\n“Junkmail”\nET: “The method of writing it was different from every other song because it's literally made from me trying to clear my emails. I wanted to take a word from each bit of junk mail or advert—whatever was coming through to my inbox—and would put it on a piece of paper, and let my mind link up everything to make the lyrics. It does actually mean a lot to me, even though it seems like it would be a completely meaningless stream. It felt like a new way of writing that just allowed me to get out some things I wanted to say that didn't have a route somehow.”\nIH: “I really like Remi's drums and I love the juxtaposition of those with the more drum-machine elements. I think it's the song in a way that's the most genre-less, and also maybe, at the same time, the most different to what we've done in the past.”\n\n”Future Lover”\nET: “This is a bit more of a fun one, it’s quite joyful in some ways, even if the subject isn’t particularly. It’s about longing for someone but there’s a playfulness to it—a little tiny bit of humor. The song is actually really old and it’s the last one we finished, so it’s had a really long life. It’s just missing someone and feeling like they're there—the ‘sweet nothings from the ghost in the room.’ It’s still very loving towards the person that's not there. It's not always in pain.”\n\n“(Missed Calls)”\nIH: “This is the interlude on the record for us. It’s real voice memos from a friend of Elena’s and also her niece and nephew who make an appearance in another song. That’s part of the themes of the album, this connection from a distance—as a result of the pandemic but also in terms of people moving away, being in separate countries, but feeling you can still be connected in a way. But it’s not the same as being in a room together. Production-wise, this one manipulates sounds and uses strings to create, again, some dream or otherworldly feeling that’s also connected back to reality and memory through those voices.”\n\n“Isolation”\nET: “This is opposite in some ways to ‘Be On Your Way,’ in that the distance leaves me feeling very crushed and empty, as opposed to that peace of ‘Be On Your Way.’ This definitely has a weight to it. Yet at the end, there’s the feeling of ‘I’ll compose myself, I’ll get over it.’ It’s still never fully allowing the vocal or the theme to descend into total doom or negativity. It’s very minimal, and I love the end part of this song, where these electronic glitches come in and sound like birdsong—I don’t know how Igor did that, but it’s genius.” \n\n“To Rage”\nIH: “It’s a calm song about anger. It was about how to work in restraint for a large part of it, up until the very emotional section. It's a little bit more atmospheric both musically and lyrically than some of the other songs, but still with that kind of driving rhythm section, great drumbeat from Remi and great bass part from Elena. We wanted the big section with the strings and the horns and everyone coming in to be so loud and emotional—the release of all this meditative vibe.”\n\n”Wish I Could Cross the Sea”\nIH: “The way the cellos and maybe the piano loop moves from the start of the song feels like the sea. I just love being in the water—for me, music feels like water most of the time. With the strings, the idea was to create a big hug at the end, to represent the love one might feel for their family. Funnily enough, this one was written way before the pandemic, which is again an example of how a lot of these songs can find relevance in lots of different situations.” <a href=\"https://www.last.fm/music/Daughter/Stereo+Mind+Game\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
            "published": "12 Dec 2024, 03:14",
            "summary": "When Daughter decided to take a break in 2017, they didn’t expect it would be six years until they’d next put out an album. They’d needed time away from touring and from each other, to halt the natural autopilot any band can fall into, and a moment to concentrate on life beyond Daughter (vocalist Elena Tonra released her solo debut as Ex:Re in 2018). Then, right when they were ready to work on ideas they’d started on just before their hiatus, the pandemic hit. But they discovered some advantages to working miles apart. “Everything was more considerate,” guitarist and producer <a href=\"https://www.last.fm/music/Daughter/Stereo+Mind+Game\">Read more on Last.fm</a>."
          }
        }
      },
      "similar_artists": [],
      "tags": [
        "2023",
        "rock",
        "indie rock",
        "post-rock",
        "dream pop"
      ],
      "top_albums": [],
      "top_tracks": [],
      "url": "https://www.last.fm/music/Daughter/Stereo+Mind+Game",
      "wiki_content": "When Daughter decided to take a break in 2017, they didn’t expect it would be six years until they’d next put out an album. They’d needed time away from touring and from each other, to halt the natural autopilot any band can fall into, and a moment to concentrate on life beyond Daughter (vocalist Elena Tonra released her solo debut as Ex:Re in 2018). Then, right when they were ready to work on ideas they’d started on just before their hiatus, the pandemic hit. But they discovered some advantages to working miles apart. “Everything was more considerate,” guitarist and producer Igor Haefeli tells Apple Music. “Like when you’d write a letter, you can look over it and correct your mistakes and give it more thought, as opposed to the immediacy of being in a room together.” With live music off indefinitely, they also found more room to experiment. “With previous albums, there was always a limitation of ‘How are we going to play this live?’” says drummer Remi Aguilella. “ it was like, ‘It would be great to have all those different parts, so let’s add them and see what happens.’” \n\nStereo Mind Game, then, sees Daughter widen and finesse their whisper-close yet atmospheric indie-folk sound. Expect lush string and horn arrangements, warm backing vocals, and reverb-laden acoustic guitars that rub alongside chopped-up voice notes, driving drum machines, and even electronic birdsong. “We’re all interested in having electronic and acoustic elements together,” says Tonra. “How big can the live sounds feel, and how textural the electronics can feel. We've tried to push both of those to a good new level for us.” For a band whose MO has always been emotional intensity, there was another new frontier: acceptance, as Tonra details falling for someone who lives too far away to make it work, connection and distance from loved ones, and conflicts between her own internal voices. “I guess every record we've made is  growth, change,” says Haefeli. “But with this one, it was about having a bit more optimism and emotional maturity.” Read on as Daughter talks through their third album, one track at a time. \n\n“Intro”\nIgor Haefeli: “It’s like a weird orchestra or different sounds and strings. It wasn’t made necessarily with the idea that it would be the first track, but it was always linked to ‘Be On Your Way’—they’re very connected.”\n\n“Be On Your Way”\nElena Tonra: “This was the first song where it felt like, ‘Oh, we’re making an album now.’ I think up until that point, we were working on a lot of songs, but this was the first one where I was like, ‘This feels like the direction, like the door into the record.’ So I think it’s good that it’s the first song on it.”\nIH: “It was finding the balance between the lightness and the love song part of this with the crushing feeling of not being close to the person you’re falling in love with.” \nET: “I was feeling hopefulness but also acceptance when I wrote this: It’s ‘I don’t know if we’ll see each other again, but I hope we will.’ On previous records, it would have been ‘This is the end of me!’ This is not like that.”\n\n“Party”\nET: “It's reflecting on the moment I decided to stop drinking alcohol, written years after that decision and looking back at that time. It’s celebrating moving forward from it. It’s quite a classic-sounding arrangement with bass and drums and guitars and vocals. It’s quite upbeat and I think that's really good to contrast with the lyrics. We’re trying to balance those things across the record.”\n\n“Dandelion”\nRemi Aguilella: “About a year before  this, my wife and I had bought a house and there were about a million dandelions in my yard. It felt like my whole life was dandelions and there was no getting out of it. One day, I went into my music room and wrote the start of a song, a new idea, and just decided to name it ‘Dandelion.’ We sent that to Elena and I was absolutely amazed that she was able to take that random word and just  pretty much all the lyrics. It was like, ‘How is that even possible?’ But it was amazing to watch and I'm still in awe of the whole thing.” \nET: “I was talking about that the time passing and your surroundings changing and you just feel like you are just there with this phone or whatever it is, just frozen in time while everything around you is moving.”\n\n“Neptune”\nET: “The vocal in this song is the first take. It has that rawness in it, which is what the song needed. It's about falling down the well, as I always call it: You’re in your own mind but also trying to appear outwardly fine and having that conflict between how you appear to everyone else and how you're actually feeling inside and your emotions. It’s mainly a conversation with myself, but I’m also talking about love as well. In the second half, the voices of Igor and  Josephine Stephenson have that warmth of friends and family pulling you out of those very difficult moments. It’s a bit of a tribute to them.” \n\n“Swim Back”\nET: “I didn’t realize how much water is involved until after writing the record. It’s interesting, because my relationship towards it is that I can’t swim! I'm really fighting with the sea, but also longing for it at the same time.”\nIH: “This is a bit more rock than the other songs; it does have a little bit more distortion going on, stuff like that. But then there is a bunch of other things happening: We have all these re-sampled vocals of Elena. It’s trying to create a dreamscape that is also slightly unnerving because it's not quite real. And I think often dreams can border into the nightmare territory where this is feeling very odd and disconcerting.”\nET: “Your string arrangement is so melted, it's like dripping wax almost.”\n\n“Junkmail”\nET: “The method of writing it was different from every other song because it's literally made from me trying to clear my emails. I wanted to take a word from each bit of junk mail or advert—whatever was coming through to my inbox—and would put it on a piece of paper, and let my mind link up everything to make the lyrics. It does actually mean a lot to me, even though it seems like it would be a completely meaningless stream. It felt like a new way of writing that just allowed me to get out some things I wanted to say that didn't have a route somehow.”\nIH: “I really like Remi's drums and I love the juxtaposition of those with the more drum-machine elements. I think it's the song in a way that's the most genre-less, and also maybe, at the same time, the most different to what we've done in the past.”\n\n”Future Lover”\nET: “This is a bit more of a fun one, it’s quite joyful in some ways, even if the subject isn’t particularly. It’s about longing for someone but there’s a playfulness to it—a little tiny bit of humor. The song is actually really old and it’s the last one we finished, so it’s had a really long life. It’s just missing someone and feeling like they're there—the ‘sweet nothings from the ghost in the room.’ It’s still very loving towards the person that's not there. It's not always in pain.”\n\n“(Missed Calls)”\nIH: “This is the interlude on the record for us. It’s real voice memos from a friend of Elena’s and also her niece and nephew who make an appearance in another song. That’s part of the themes of the album, this connection from a distance—as a result of the pandemic but also in terms of people moving away, being in separate countries, but feeling you can still be connected in a way. But it’s not the same as being in a room together. Production-wise, this one manipulates sounds and uses strings to create, again, some dream or otherworldly feeling that’s also connected back to reality and memory through those voices.”\n\n“Isolation”\nET: “This is opposite in some ways to ‘Be On Your Way,’ in that the distance leaves me feeling very crushed and empty, as opposed to that peace of ‘Be On Your Way.’ This definitely has a weight to it. Yet at the end, there’s the feeling of ‘I’ll compose myself, I’ll get over it.’ It’s still never fully allowing the vocal or the theme to descend into total doom or negativity. It’s very minimal, and I love the end part of this song, where these electronic glitches come in and sound like birdsong—I don’t know how Igor did that, but it’s genius.” \n\n“To Rage”\nIH: “It’s a calm song about anger. It was about how to work in restraint for a large part of it, up until the very emotional section. It's a little bit more atmospheric both musically and lyrically than some of the other songs, but still with that kind of driving rhythm section, great drumbeat from Remi and great bass part from Elena. We wanted the big section with the strings and the horns and everyone coming in to be so loud and emotional—the release of all this meditative vibe.”\n\n”Wish I Could Cross the Sea”\nIH: “The way the cellos and maybe the piano loop moves from the start of the song feels like the sea. I just love being in the water—for me, music feels like water most of the time. With the strings, the idea was to create a big hug at the end, to represent the love one might feel for their family. Funnily enough, this one was written way before the pandemic, which is again an example of how a lot of these songs can find relevance in lots of different situations.” <a href=\"https://www.last.fm/music/Daughter/Stereo+Mind+Game\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wiki_summary": "When Daughter decided to take a break in 2017, they didn’t expect it would be six years until they’d next put out an album. They’d needed time away from touring and from each other, to halt the natural autopilot any band can fall into, and a moment to concentrate on life beyond Daughter (vocalist Elena Tonra released her solo debut as Ex:Re in 2018). Then, right when they were ready to work on ideas they’d started on just before their hiatus, the pandemic hit. But they discovered some advantages to working miles apart. “Everything was more considerate,” guitarist and producer <a href=\"https://www.last.fm/music/Daughter/Stereo+Mind+Game\">Read more on Last.fm</a>."
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "(C) 2023 Glassnote Entertainment Group LLC",
          "type": "C"
        },
        {
          "text": "(P) 2023 Glassnote Entertainment Group LLC",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "197187660162"
      },
      "id": "6xzsQpZtlqLFxmO1GeM7Cf",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b273067c32cb91267e911a6dcde5",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e02067c32cb91267e911a6dcde5",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d00004851067c32cb91267e911a6dcde5",
          "width": 64
        }
      ],
      "label": "Glassnote Entertainment Group LLC",
      "popularity": 39,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
            },
            "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
            "id": "46CitWgnWrvF9t70C2p1Me",
            "name": "Daughter",
            "type": "artist",
            "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
          }
        ],
        "copyrights": [
          {
            "text": "(C) 2023 Glassnote Entertainment Group LLC",
            "type": "C"
          },
          {
            "text": "(P) 2023 Glassnote Entertainment Group LLC",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "197187660162"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/6xzsQpZtlqLFxmO1GeM7Cf"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/6xzsQpZtlqLFxmO1GeM7Cf?market=US",
        "id": "6xzsQpZtlqLFxmO1GeM7Cf",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b273067c32cb91267e911a6dcde5",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e02067c32cb91267e911a6dcde5",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d00004851067c32cb91267e911a6dcde5",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "Glassnote Entertainment Group LLC",
        "name": "Stereo Mind Game",
        "popularity": 39,
        "release_date": "2023-04-07",
        "release_date_precision": "day",
        "total_tracks": 12,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/6xzsQpZtlqLFxmO1GeM7Cf/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 55739,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/5YrMulUEHy0nwgLlqD9g3w"
              },
              "href": "https://api.spotify.com/v1/tracks/5YrMulUEHy0nwgLlqD9g3w",
              "id": "5YrMulUEHy0nwgLlqD9g3w",
              "is_local": false,
              "is_playable": true,
              "name": "Intro",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:5YrMulUEHy0nwgLlqD9g3w"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 244772,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2LadlqFWLPRJAQu3PEe9CN"
              },
              "href": "https://api.spotify.com/v1/tracks/2LadlqFWLPRJAQu3PEe9CN",
              "id": "2LadlqFWLPRJAQu3PEe9CN",
              "is_local": false,
              "is_playable": true,
              "name": "Be On Your Way",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:2LadlqFWLPRJAQu3PEe9CN"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 267994,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2tLLgIhHr3AFv0etCbjth2"
              },
              "href": "https://api.spotify.com/v1/tracks/2tLLgIhHr3AFv0etCbjth2",
              "id": "2tLLgIhHr3AFv0etCbjth2",
              "is_local": false,
              "is_playable": true,
              "name": "Party",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:2tLLgIhHr3AFv0etCbjth2"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 231717,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0FaTDETtzCRxYIf3noMnsF"
              },
              "href": "https://api.spotify.com/v1/tracks/0FaTDETtzCRxYIf3noMnsF",
              "id": "0FaTDETtzCRxYIf3noMnsF",
              "is_local": false,
              "is_playable": true,
              "name": "Dandelion",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:0FaTDETtzCRxYIf3noMnsF"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 325511,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0Gqw2VCa5wtCibC22niG39"
              },
              "href": "https://api.spotify.com/v1/tracks/0Gqw2VCa5wtCibC22niG39",
              "id": "0Gqw2VCa5wtCibC22niG39",
              "is_local": false,
              "is_playable": true,
              "name": "Neptune",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:0Gqw2VCa5wtCibC22niG39"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 274337,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0SB7Ew45h690xWhmWvWixm"
              },
              "href": "https://api.spotify.com/v1/tracks/0SB7Ew45h690xWhmWvWixm",
              "id": "0SB7Ew45h690xWhmWvWixm",
              "is_local": false,
              "is_playable": true,
              "name": "Swim Back",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:0SB7Ew45h690xWhmWvWixm"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 245509,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/7nu25XWqnLNRnqf8UGS10s"
              },
              "href": "https://api.spotify.com/v1/tracks/7nu25XWqnLNRnqf8UGS10s",
              "id": "7nu25XWqnLNRnqf8UGS10s",
              "is_local": false,
              "is_playable": true,
              "name": "Junkmail",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:7nu25XWqnLNRnqf8UGS10s"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 253038,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/14iMoEpgyNjJ3y7bYJ9TTG"
              },
              "href": "https://api.spotify.com/v1/tracks/14iMoEpgyNjJ3y7bYJ9TTG",
              "id": "14iMoEpgyNjJ3y7bYJ9TTG",
              "is_local": false,
              "is_playable": true,
              "name": "Future Lover",
              "preview_url": null,
              "track_number": 8,
              "type": "track",
              "uri": "spotify:track:14iMoEpgyNjJ3y7bYJ9TTG"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 103263,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2fgMcXCUP0yf2pXOAmYXRB"
              },
              "href": "https://api.spotify.com/v1/tracks/2fgMcXCUP0yf2pXOAmYXRB",
              "id": "2fgMcXCUP0yf2pXOAmYXRB",
              "is_local": false,
              "is_playable": true,
              "name": "(Missed Calls)",
              "preview_url": null,
              "track_number": 9,
              "type": "track",
              "uri": "spotify:track:2fgMcXCUP0yf2pXOAmYXRB"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 157791,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3LKSRV0wMzYTnuGJvwLYrs"
              },
              "href": "https://api.spotify.com/v1/tracks/3LKSRV0wMzYTnuGJvwLYrs",
              "id": "3LKSRV0wMzYTnuGJvwLYrs",
              "is_local": false,
              "is_playable": true,
              "name": "Isolation",
              "preview_url": null,
              "track_number": 10,
              "type": "track",
              "uri": "spotify:track:3LKSRV0wMzYTnuGJvwLYrs"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 285839,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3yYPoZq0fsQ6d5iLvraz72"
              },
              "href": "https://api.spotify.com/v1/tracks/3yYPoZq0fsQ6d5iLvraz72",
              "id": "3yYPoZq0fsQ6d5iLvraz72",
              "is_local": false,
              "is_playable": true,
              "name": "To Rage",
              "preview_url": null,
              "track_number": 11,
              "type": "track",
              "uri": "spotify:track:3yYPoZq0fsQ6d5iLvraz72"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/46CitWgnWrvF9t70C2p1Me"
                  },
                  "href": "https://api.spotify.com/v1/artists/46CitWgnWrvF9t70C2p1Me",
                  "id": "46CitWgnWrvF9t70C2p1Me",
                  "name": "Daughter",
                  "type": "artist",
                  "uri": "spotify:artist:46CitWgnWrvF9t70C2p1Me"
                }
              ],
              "disc_number": 1,
              "duration_ms": 218557,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/2cbnub8j1WFuUVmLOY56AQ"
              },
              "href": "https://api.spotify.com/v1/tracks/2cbnub8j1WFuUVmLOY56AQ",
              "id": "2cbnub8j1WFuUVmLOY56AQ",
              "is_local": false,
              "is_playable": true,
              "name": "Wish I Could Cross the Sea",
              "preview_url": null,
              "track_number": 12,
              "type": "track",
              "uri": "spotify:track:2cbnub8j1WFuUVmLOY56AQ"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 12
        },
        "type": "album",
        "uri": "spotify:album:6xzsQpZtlqLFxmO1GeM7Cf"
      },
      "release_date": "2023-04-07",
      "release_date_precision": "day",
      "total_tracks": 12,
      "tracks": [
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 55739,
          "explicit": false,
          "id": "5YrMulUEHy0nwgLlqD9g3w",
          "name": "Intro",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 244772,
          "explicit": false,
          "id": "2LadlqFWLPRJAQu3PEe9CN",
          "name": "Be On Your Way",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 267994,
          "explicit": false,
          "id": "2tLLgIhHr3AFv0etCbjth2",
          "name": "Party",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 231717,
          "explicit": false,
          "id": "0FaTDETtzCRxYIf3noMnsF",
          "name": "Dandelion",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 325511,
          "explicit": false,
          "id": "0Gqw2VCa5wtCibC22niG39",
          "name": "Neptune",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 274337,
          "explicit": false,
          "id": "0SB7Ew45h690xWhmWvWixm",
          "name": "Swim Back",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 245509,
          "explicit": false,
          "id": "7nu25XWqnLNRnqf8UGS10s",
          "name": "Junkmail",
          "preview_url": null,
          "track_number": 7
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 253038,
          "explicit": false,
          "id": "14iMoEpgyNjJ3y7bYJ9TTG",
          "name": "Future Lover",
          "preview_url": null,
          "track_number": 8
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 103263,
          "explicit": false,
          "id": "2fgMcXCUP0yf2pXOAmYXRB",
          "name": "(Missed Calls)",
          "preview_url": null,
          "track_number": 9
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 157791,
          "explicit": false,
          "id": "3LKSRV0wMzYTnuGJvwLYrs",
          "name": "Isolation",
          "preview_url": null,
          "track_number": 10
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 285839,
          "explicit": false,
          "id": "3yYPoZq0fsQ6d5iLvraz72",
          "name": "To Rage",
          "preview_url": null,
          "track_number": 11
        },
        {
          "artists": [
            {
              "id": "46CitWgnWrvF9t70C2p1Me",
              "name": "Daughter"
            }
          ],
          "duration_ms": 218557,
          "explicit": false,
          "id": "2cbnub8j1WFuUVmLOY56AQ",
          "name": "Wish I Could Cross the Sea",
          "preview_url": null,
          "track_number": 12
        }
      ],
      "url": "https://open.spotify.com/album/6xzsQpZtlqLFxmO1GeM7Cf"
    }
  },
  "spotify_id": "6xzsQpZtlqLFxmO1GeM7Cf",
  "spotify_url": "https://open.spotify.com/album/6xzsQpZtlqLFxmO1GeM7Cf",
  "styles": [
    "Indie Rock"
  ],
  "title": "Stereo Mind Game",
  "tracklist": [
    {
      "artists": [],
      "duration": "",
      "position": "A1",
      "title": "Intro"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A2",
      "title": "Be On Your Way"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A3",
      "title": "Party"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A4",
      "title": "Dandelion"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A5",
      "title": "Neptune"
    },
    {
      "artists": [],
      "duration": "",
      "position": "A6",
      "title": "Swim Back"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B7",
      "title": "Junkmail"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B8",
      "title": "Future Lover"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B9",
      "title": "(Missed Calls)"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B10",
      "title": "Isolation"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B11",
      "title": "To Rage"
    },
    {
      "artists": [],
      "duration": "",
      "position": "B12",
      "title": "Wish I Could Cross The Sea"
    }
  ],
  "updated_at": "2025-07-09T08:18:39.337802",
  "year": 2023
}