{
  "apple_music_id": "373911",
  "apple_music_url": "https://music.apple.com/gb/artist/big-country/373911",
  "biography": "Big Country comprised Stuart Adamson (formerly of The Skids, vocals/guitar/keyboards), Bruce Watson (guitar/mandolin/sitar/vocals), Tony Butler (bass guitar/vocals) and Mark Brzezicki (drums/percussion/vocals). Before the recruitment of Butler and Brzezicki an early incarnation of Big Country was a five-piece band, featuring Peter Wishart (later of Runrig and now an SNP MP) on keyboards, his brother Alan on bass, and Clive Parker, drummer from Spizz Energi / Athletico Spizz '80 (Rough Trade & A&M Records). Parker had approached Adamson to join his new band after the demise of The Skids. Adamson auditioned Parker (1980) at The Members rehearsal room in Ladbroke Grove, London, and the next day was called on to play drums on demos for CBS Records at their Whitfield Street studios. The demos were produced by Adam Sieff and just featured Adamson, Parker, with scarcely a contribution from Watson. Adamson had asked bassist Dave Allen from the Gang of Four to join the band but he declined. Adamson asked Parker to join the band, which led to 8 months of rehearsal in Dunfermline in a disused furniture warehouse. The culmination was a successful concert at the Glen Pavilion at Dunfermline, (playing to a home crowd, mainly Skids fans), and an interview with BBC Radio Scotland where the CBS Studio demos were utilised. What followed were live dates with Alice Cooper's Special Forces tour in 1982. The band appeared out of their depth with their rambling Echo & The Bunnymen-keyboard oriented-sound which went down badly with the metal crowds. Thus the band was dumped from the tour after only two gigs at The Brighton Centre  and Birmingham Odeon. Adamson's management issued an ultimatum and the Wisharts and Parker were sacked. Adamson later asked Peter Wishart to rejoin on keyboards, but Peter declined without his brother in the band. Parker formed the synth pop band Scary Thieves, and signed to EMI Records, and later went on to play session drums for ex-Jesus and Mary Chain member John Moore in The Expressway, (Polydor Records) touring the UK and USA. Alan Wishart later joined Parker in contemporary folk band Barra (Sony/ATV Music/Hi-Note Records). The manager Ian Grant brought in Brzezicki, and Butler, and along with Watson, the classic line-up was formed. Although the band's music drew from Scottish traditional music, none of its members were born in Scotland. Adamson grew up in Dunfermline though, and his family was of Scottish descent, so to that extent his Scottish accent was genuine.\n\nTheir first single was \"Harvest Home\", recorded and released in 1982. It was a modest success, reaching No. 91 on the UK Singles Chart. Their next single was 1983's \"Fields of Fire\", which reached the UK's Top Ten and was rapidly followed by the album The Crossing. The album was a hit in the United States (reaching the US Billboard Top 20), powered by \"In a Big Country\", their only U.S. Top 40 hit single. The song featured heavily engineered guitar playing, strongly reminiscent of bagpipes; Adamson and fellow guitarist, Watson, achieved this through the use of the MXR Pitch Transposer 129 Guitar Effect. Also contributing to the band's unique sound was their use of the e-bow, a device which allows a guitar to sound more like strings or synthesizer. The Crossing sold over a million copies in the UK and obtained gold record status (sales of over 500,000) in the U.S. The band also performed on both the Grammys and Saturday Night Live.\n\nThe band released the non-LP extended play single \"Wonderland\" in 1984 while undergoing a lengthy worldwide tour. The song, considered by some critics to be one of their finest, was a Top Ten hit (No. 8) in the UK singles chart but despite heavy airplay and a positive critical response, was a comparative flop in the U.S., reaching only No. 86 on the Billboard Hot 100. It was the last single by the band to make a U.S. chart appearance.\n\nTheir second album Steeltown (1984) was a hit as soon as it was released, entering the UK Albums Chart at number one. The album featured three UK top 30 hit singles, and received considerable critical acclaim on both sides of the Atlantic, but like Wonderland (and, in fact, all subsequent releases) it was a commercial disappointment in the U.S, peaking at No. 70 on the Billboard album charts.\n\nThroughout 1984 and 1985, the band toured the UK, Europe, and, to a lesser extent, the U.S., both as headliners themselves and in support of such artists as Queen and Roger Daltrey. They also recorded prolifically, and provided the musical score to a Scottish independent film, Restless Natives (1985), which was not released on CD until years later on the band's Restless Natives and Rarities (1998) collection.\n\n1986's The Seer, the band's third album, was another big success in the UK, peaking at Number 2. It produced three further Top 30 singles, including the Irish number one hit \"Look Away\", which would also prove to be the band's biggest hit in the U.K., peaking at No. 7. Kate Bush provided backing vocals on the album's title track, and as was the norm for the band at the time, the album received good reviews from the music press. In the U.S., The Seer sold a little bit better than Steeltown, reaching No. 59 on the Billboard charts.\n\nIn what some critics felt was an apparent attempt to regain their dwindling U.S. following, Big Country used producer Peter Wolf for their next album, Peace in Our Time (1988), which was recorded in Los Angeles. It reached No. 9 in the UK Album chart, but sold poorly in the United States. During the \"Peace In Our Time\" Tour, the band were supported by Diesel Park West and Cry Before Dawn.\nThe 1990s\n\nNo Place Like Home (1991) not only effectively killed off the band's commercial hopes in the US, it nearly broke up the band. Drummer Mark Brzezicki returned to the studio as a session drummer after leaving the band. The album found the band trying to reinvent themselves and shift away from their '80s image. It was not a commercial success and was not released in America, although two re-recorded tracks showed up on 1993's The Buffalo Skinners.\n\nIn 1991, the band was dropped by Phonogram, the label that had released all of their material for ten years. After that, Big Country became a minor act, popping up in the lower echelons of the charts in the UK and Europe with the release of every subsequent album. Only one of these, 1993's The Buffalo Skinners, received a major label release (via Chrysalis Records), and it seemed a return to form of sorts for the band, reaching the UK Top 25. The album obtained a surprisingly enthusiastic critical response, and although it produced two UK Top 30 singles in \"Alone\" and \"Ships\", its sales were meagre and, in retrospect, it can be seen as Big Country's last, lost chance to regain a mass audience. Regardless, the band retained an intensely devoted cult following, as evidenced by their deceptively large post-1990 discography, which consists mostly of live concert recordings and singles/rarities collections.\n\nThroughout the 1990s, Big Country became a popular supporting act, supporting bands such as Rolling Stones and The Who. Big Country had backed Daltrey on his 1985 solo album Under the Raging Moon, and Tony Butler played bass and backing vocals on Pete Townshend's 1980 hit single \"Let My Love Open the Door\". Both Butler and Brzezicki performed on Townshend's 1985 solo album White City: A Novel. Brzezicki played drums for The Cult on their 1985 Love album and featured in the video for the single, \"She Sells Sanctuary\".\n\nOf growing concern was the mental and emotional health of lead singer Adamson, who reportedly had struggled with alcoholism for several years. Adamson split with his first wife, who later spoke to Scottish and English tabloids about his heavy drinking. He moved to Nashville in the mid-1990s where he took up residence and married a hairdresser. While in Nashville, he met artist Marcus Hummon and released a studio album with him under the moniker The Raphaels.\n\nIn 1995 Big Country released another album, Why the Long Face.\n\n1999 saw the release of Big Country's eighth and final studio album, Driving to Damascus (titled in its slightly different, augmented U.S. release John Wayne's Dream). Adamson said publicly that he was disappointed that the album did not fare better on the charts, which led to depression. Later that year, he disappeared for a while before resurfacing, stating that he had needed some time off.\nFarewell tour, Adamson's death\n\nAdamson returned for the band's 'Final Fling' farewell tour, culminating in a sold-out concert at Glasgow's Barrowland Ballroom on 31 May 2000. Although that marked the end of Big Country as a touring band, they were always adamant that they would appear together again. They played what turned out to be their last gig in Kuala Lumpur, Malaysia, in October that year.\n\nIn November 2001, Adamson disappeared again. Numerous appeals were put on the Big Country website asking for Adamson to call home and speak to anyone in the band, the management company, or his ex-wife. The website also requested that any fans who might have been 'harbouring' the singer to contact the management company and alert them to his whereabouts. Mark Brzezicki and Tony Butler had indicated they were concerned but the reason Big Country had lasted so long was they stayed out of one another's personal lives, and both later noted they were unaware of the extent of Adamson's problems. He was found dead in a room at the Best Western Plaza Hotel in Honolulu, Hawaii on 16 December 2001. The autopsy revealed that he had hanged himself.\n\nAt the time of death he had a blood-alcohol content of 0.279%.\n\nA memorial to Adamson was held at Dunfermline's Carnegie Hall in January 2002, followed by a tribute concert at the Barrowlands in May. It brought together the remaining members of both Big Country and The Skids; Adamson's teenage children, Callum and Kirsten; as well as Steve Harley, Runrig, Simon Townshend, Midge Ure and Bill Nelson.\n2007 reunion\n\nIn 2007, to celebrate 25 years of Big Country, founding members Bruce Watson, Tony Butler (now lead vocalist for the first time), and Mark Brzezicki reunited to embark on a tour of the UK with dates in Scotland and England and a gig in Cologne (Germany). They also released a new album, twenty five live, on the trackrecords label.\n\nAs of September 2008 the band returned to an indefinite hiatus.\n2010–11 tour\n\nThe surviving original members toured again in late December 2010 and January 2011 with Mike Peters of the Alarm and Jamie Watson, Bruce's son, added to the lineup. They played another set of concerts in April 2011. Big Country have been announced at six major UK/Irish festivals in 2011 — Isle of Wight, T in the Park, Oxegen in Kildare and V Festival (Chelmsford and Stafford), plus Inverness with Simple Minds.\n\nSteve Lillywhite, who had produced Big Country's first and second albums, produced the band's first single in over twelve years. He remarked: \"When I heard the demo of their new song, I was impressed on first listen. I am looking forward to working with the band again whom I last worked with in the 80s on one of my favourite albums I have ever produced — The Crossing.\"\n\n\"It will be a real buzz working with Steve again\", Tony Butler said in response. \"He is a producer we all have a great regard for and are looking forward to working with again. We'd also like to thank all the festival promoters for having faith in us.\"\n\nThe band will also soon announce a series of smaller dates where they will be \"breaking in\" new songs for a future release. \"These will be places we have never played before,\" Mark Brzezicki added, \"giving us the chance to work in new songs in the more intimate type of venues.”\n\nMike Peters said, \"Due to the success of the January and April tours, the band have decided to continue and have already started planning for a new album and a 30th anniversary tour in the new year.\"\n\nBruce Watson commented: \"We are 100% dedicated and intent on making this new line up a permanent one. We can finally look forward to completing unfinished business from the past, particularly internationally, and look to a creative and active future\".\n\nAround August 2011, Big Country released their first single in 11 years called \"Another Country\" with Peters on vocals.\n2012 tour\n\nIn 2012 the band have played many festivals around Europe including Hard Rock Calling in Hyde Park, The Isle of Wight Festival and Fairport's Cropredy Convention as special guests of Fairport Convention on the Saturday.\n\nOn 20 September 2012 guitarist Bruce Watson announced in the forum on the bands website that bassist Tony Butler had announced his retirement from the band during the last tour and that the remaining members of the band would not be continuing their involvement with long time manager Ian Grant. Butler's replacement in Big Country will be Derek Forbes, formerly of Simple Minds.",
  "country": null,
  "created_at": "2025-07-05T17:15:34.062156",
  "discogs_id": "91685",
  "discogs_url": "https://www.discogs.com/artist/91685-Big-Country",
  "followers": 257222,
  "formed_date": null,
  "genres": [
    "Rock",
    "new wave",
    "celtic rock",
    "80s",
    "rock",
    "Scottish",
    "alternative",
    "Rock/Pop"
  ],
  "id": "big-country-1751732137",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features124/v4/dd/df/28/dddf28b2-8e5b-c93f-8fdb-74eed1a744dc/mzl.pcexrqjr.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 681,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/9da85bf614f13433da4c789d13e815f664430809",
      "width": 1000
    },
    {
      "height": 436,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/02210504df6db274a954c4ed9a86a550efd61c23",
      "width": 640
    },
    {
      "height": 136,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/be6fc1f7f692f493e48af29dd607f51f572051c5",
      "width": 200
    },
    {
      "height": 44,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/9fa13f5625d2493655f33f4e416059ceb50df317",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/qchex21638974978.jpg",
      "width": 1000
    },
    {
      "height": 185,
      "type": "banner",
      "url": "https://www.theaudiodb.com/images/media/artist/banner/sruvuy1355681737.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/big-country-502ec07b502ed.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/MJYFq-JbOEdB2OG_groNeN46cJeRqphb8gFGb7tWAl8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "b4013ff1-d7ce-4b1a-af6e-e0b19ca7f378",
  "lastfm_url": "https://www.last.fm/music/Big+Country",
  "local_images": {
    "hi-res": "../public/artist/big-country/big-country-hi-res.jpg",
    "medium": "../public/artist/big-country/big-country-medium.jpg",
    "small": "../public/artist/big-country/big-country-small.jpg"
  },
  "name": "Big Country",
  "popularity": 51,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='373911', url='https://music.apple.com/gb/artist/big-country/373911', name='Big Country', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Features124/v4/dd/df/28/dddf28b2-8e5b-c93f-8fdb-74eed1a744dc/mzl.pcexrqjr.jpg/2000x2000bb.jpg', genres=['Rock'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '373911', 'type': 'artists', 'href': '/v1/catalog/gb/artists/373911', 'attributes': {'name': 'Big Country', 'genreNames': ['Rock'], 'artwork': {'width': 2400, 'height': 2400, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Features124/v4/dd/df/28/dddf28b2-8e5b-c93f-8fdb-74eed1a744dc/mzl.pcexrqjr.jpg/{w}x{h}bb.jpg', 'bgColor': '061122', 'textColor1': 'c8d5e8', 'textColor2': 'acc1e0', 'textColor3': 'a1aec0', 'textColor4': '8a9eba'}, 'url': 'https://music.apple.com/gb/artist/big-country/373911'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/373911/albums', 'next': '/v1/catalog/gb/artists/373911/albums?offset=25', 'data': [{'id': '1440911129', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1440911129'}, {'id': '1440737962', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1440737962'}, {'id': '1440921045', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1440921045'}, {'id': '1443939008', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1443939008'}, {'id': '1443258958', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1443258958'}, {'id': '1444004518', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1444004518'}, {'id': '1629179210', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1629179210'}, {'id': '1442725740', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1442725740'}, {'id': '1443745359', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1443745359'}, {'id': '1631044651', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1631044651'}, {'id': '1443430143', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1443430143'}, {'id': '1442921978', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1442921978'}, {'id': '1485051882', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1485051882'}, {'id': '264187929', 'type': 'albums', 'href': '/v1/catalog/gb/albums/264187929'}, {'id': '1452801939', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1452801939'}, {'id': '1590330478', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1590330478'}, {'id': '1444104531', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1444104531'}, {'id': '1442308175', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1442308175'}, {'id': '1436168723', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1436168723'}, {'id': '1436173066', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1436173066'}, {'id': '1443815473', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1443815473'}, {'id': '1652754640', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1652754640'}, {'id': '452456771', 'type': 'albums', 'href': '/v1/catalog/gb/albums/452456771'}, {'id': '1502317792', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1502317792'}, {'id': '377976067', 'type': 'albums', 'href': '/v1/catalog/gb/albums/377976067'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "91685",
      "images": [
        {
          "height": 607,
          "resource_url": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
          "uri150": "https://i.discogs.com/MJYFq-JbOEdB2OG_groNeN46cJeRqphb8gFGb7tWAl8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
          "width": 600
        },
        {
          "height": 325,
          "resource_url": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
          "uri150": "https://i.discogs.com/Vb_W73cKWwIfpFG9Q-JZNQGCdBOZJ03kXi-Q2GFCHwQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
          "width": 286
        },
        {
          "height": 204,
          "resource_url": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
          "uri150": "https://i.discogs.com/5pjrSTE7Tbr0fReh5eAmvmHQwwmuRkTLHrrKUvA395k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
          "width": 200
        },
        {
          "height": 151,
          "resource_url": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
          "uri150": "https://i.discogs.com/DUTNV2TpCyGFoK-7HgKyNk40mstJgAZulKldQqRXQQ4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
          "width": 200
        },
        {
          "height": 152,
          "resource_url": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
          "uri150": "https://i.discogs.com/VTIi8fBGkt--d64RrHkIoV3JFMyHLsyurDAd5gaPv_A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
          "width": 200
        },
        {
          "height": 244,
          "resource_url": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/dcI1KsFkf7JnQMhvrHdZIxEr_AlMbdlfVTEXLB9X420/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
          "width": 246
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/9D6-WWYEikkifBXqr1n9b-NTfecXR5ACO0prdIhHZdk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 375,
          "resource_url": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Wre0KUTWuuo95QGDRF9ArKo3uHRuv0IKBxjyN-a7XbI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 399,
          "resource_url": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/f-2l04owguG9CnXcrgLLgU56Iq8WfDYjzvkPjhIhoDU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 285,
          "resource_url": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/f1Z6iFykGHmRbMIXHkzT6aQ7mgyHZmu_7XOTzUCXFnk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
          "width": 400
        }
      ],
      "members": [
        {
          "active": true,
          "id": 112841,
          "name": "Mark Brzezicki",
          "resource_url": "https://api.discogs.com/artists/112841",
          "thumbnail_url": "https://i.discogs.com/nVgZExQMx9jaOH7K5mxwH-J7U1x_50UDKTv5S5ddWfk/rs:fit/g:sm/q:40/h:600/w:595/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMjg0/MS0xMjU0NTYwODEy/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 232842,
          "name": "Mike Peters",
          "resource_url": "https://api.discogs.com/artists/232842",
          "thumbnail_url": "https://i.discogs.com/p67j5Ozcg6t-86oRaroLwo7lcSc0vYFc_TCzPsX8kfo/rs:fit/g:sm/q:40/h:572/w:316/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzMjg0/Mi0xNTUzMzM2NzM1/LTgzMzAuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 253622,
          "name": "Stuart Adamson",
          "resource_url": "https://api.discogs.com/artists/253622",
          "thumbnail_url": "https://i.discogs.com/OFbsHwQUDQHKgvdxupZ2guRUOkPVKoTE7ATTDhVZJdc/rs:fit/g:sm/q:40/h:548/w:520/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1MzYy/Mi0xNDQxNTc3MzQy/LTIwMjkuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 255730,
          "name": "Bruce Watson",
          "resource_url": "https://api.discogs.com/artists/255730",
          "thumbnail_url": "https://i.discogs.com/3S-6O8M28JKR2zlsvFKE6LxGLHNRVs9y0RFf3XMOjFg/rs:fit/g:sm/q:40/h:599/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1NTcz/MC0xMjU0NTYwNjc4/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 287983,
          "name": "Derek Forbes",
          "resource_url": "https://api.discogs.com/artists/287983",
          "thumbnail_url": "https://i.discogs.com/lJNVcYKKywy8QYoGQODJK0zSE7WrVSIJry13skfoamc/rs:fit/g:sm/q:40/h:416/w:340/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4Nzk4/My0xMTQ4MjU1MjQ0/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 418624,
          "name": "Tony Butler",
          "resource_url": "https://api.discogs.com/artists/418624",
          "thumbnail_url": "https://i.discogs.com/WsJeFgarPIudPUl3DL_c-RDcEIiu51ISImrmxmwA65w/rs:fit/g:sm/q:40/h:600/w:593/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxODYy/NC0xMjU0NTYwOTA4/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 544449,
          "name": "Peter Wishart",
          "resource_url": "https://api.discogs.com/artists/544449",
          "thumbnail_url": "https://i.discogs.com/3tuLmAiFbO66QIXqpP94L_knLyCM-f7SPyV0LXvzhnA/rs:fit/g:sm/q:40/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU0NDQ0/OS0xNzA3MTQwODE3/LTU2NzAuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 724275,
          "name": "Clive Parker",
          "resource_url": "https://api.discogs.com/artists/724275",
          "thumbnail_url": "https://i.discogs.com/okzcID4ts0NaJJjj_aovPfPmaf_quZdTnV_lD6SetyY/rs:fit/g:sm/q:40/h:502/w:451/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcyNDI3/NS0xNjg0MjUzMjY3/LTUzNjcuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 2527264,
          "name": "Jamie Watson (6)",
          "resource_url": "https://api.discogs.com/artists/2527264",
          "thumbnail_url": "https://i.discogs.com/uvlZTldZfzFKmP-6hfmsSFovlcpSrUGq1VqAF6-pQaY/rs:fit/g:sm/q:40/h:160/w:160/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1Mjcy/NjQtMTM5ODM1Mzg4/OC05NDI1LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 3214655,
          "name": "Scott Whitley",
          "resource_url": "https://api.discogs.com/artists/3214655",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 4005619,
          "name": "Simon Hough",
          "resource_url": "https://api.discogs.com/artists/4005619",
          "thumbnail_url": "https://i.discogs.com/aQGHBAiYeArpTJvxQB0WIZRpE10KGnqlo51EX9ROQIA/rs:fit/g:sm/q:40/h:960/w:546/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMDU2/MTktMTUwNDg2MzY4/Mi03NDE4LmpwZWc.jpeg"
        }
      ],
      "name": "Big Country",
      "namevariations": [
        "Adamson/Watson/Butler/Brzezicki",
        "B. Country",
        "Big Country Hats",
        "The Big Country",
        "ビッグ・カントリー"
      ],
      "profile": "Scottish rock band formed in the early 1980s.\r\nManaged By [a=Ian Grant] of [a=Grant Edwards Management]\r\n[b]Lineup:[/b]\r\nStuart Adamson: Vocals, Guitar, Synthesizer. Born April 11, 1958, died December 16, 2001 (suicide)\r\nBruce Watson: Guitar\r\nTony Butler: Bass (until 2012)\r\nMark Brzezicki: Drums\r\nMike Peters: Vocals, Guitar (2010 - 2013; died 2025)\r\nJamie Watson (Son of Bruce): Guitar (since 2010)\r\nDerek Forbes: Bass (2012 - 2015)\r\nSimon Hough: Vocals, Acoustic Guitar (2014 - 2024)\r\nScott Whitley: Bass (2015 - 2021)\r\nGil Allan: Bass (since 2021)\r\nTommie Paxton: Vocals, Guitar (since 2024)\r\nYears active:\t1981–2000, 2007, 2010–present\r\n\r\n[b]Please note that the UK releases during the '80s should be on the Mercury label, this is not actually mentioned on the label or sleeves of the earliest singles. The only information refers to Phonogram who were the publishing house for Mercury at that time, which is why their name and logo will appear.[/b]",
      "raw_data": {
        "data_quality": "Needs Vote",
        "id": 91685,
        "images": [
          {
            "height": 607,
            "resource_url": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
            "uri150": "https://i.discogs.com/MJYFq-JbOEdB2OG_groNeN46cJeRqphb8gFGb7tWAl8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
            "width": 600
          },
          {
            "height": 325,
            "resource_url": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
            "uri150": "https://i.discogs.com/Vb_W73cKWwIfpFG9Q-JZNQGCdBOZJ03kXi-Q2GFCHwQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
            "width": 286
          },
          {
            "height": 204,
            "resource_url": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
            "uri150": "https://i.discogs.com/5pjrSTE7Tbr0fReh5eAmvmHQwwmuRkTLHrrKUvA395k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
            "width": 200
          },
          {
            "height": 151,
            "resource_url": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
            "uri150": "https://i.discogs.com/DUTNV2TpCyGFoK-7HgKyNk40mstJgAZulKldQqRXQQ4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
            "width": 200
          },
          {
            "height": 152,
            "resource_url": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
            "uri150": "https://i.discogs.com/VTIi8fBGkt--d64RrHkIoV3JFMyHLsyurDAd5gaPv_A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
            "width": 200
          },
          {
            "height": 244,
            "resource_url": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/dcI1KsFkf7JnQMhvrHdZIxEr_AlMbdlfVTEXLB9X420/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
            "width": 246
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/9D6-WWYEikkifBXqr1n9b-NTfecXR5ACO0prdIhHZdk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 375,
            "resource_url": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Wre0KUTWuuo95QGDRF9ArKo3uHRuv0IKBxjyN-a7XbI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 399,
            "resource_url": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/f-2l04owguG9CnXcrgLLgU56Iq8WfDYjzvkPjhIhoDU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 285,
            "resource_url": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/f1Z6iFykGHmRbMIXHkzT6aQ7mgyHZmu_7XOTzUCXFnk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
            "width": 400
          }
        ],
        "members": [
          {
            "active": true,
            "id": 112841,
            "name": "Mark Brzezicki",
            "resource_url": "https://api.discogs.com/artists/112841",
            "thumbnail_url": "https://i.discogs.com/nVgZExQMx9jaOH7K5mxwH-J7U1x_50UDKTv5S5ddWfk/rs:fit/g:sm/q:40/h:600/w:595/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMjg0/MS0xMjU0NTYwODEy/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 232842,
            "name": "Mike Peters",
            "resource_url": "https://api.discogs.com/artists/232842",
            "thumbnail_url": "https://i.discogs.com/p67j5Ozcg6t-86oRaroLwo7lcSc0vYFc_TCzPsX8kfo/rs:fit/g:sm/q:40/h:572/w:316/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzMjg0/Mi0xNTUzMzM2NzM1/LTgzMzAuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 253622,
            "name": "Stuart Adamson",
            "resource_url": "https://api.discogs.com/artists/253622",
            "thumbnail_url": "https://i.discogs.com/OFbsHwQUDQHKgvdxupZ2guRUOkPVKoTE7ATTDhVZJdc/rs:fit/g:sm/q:40/h:548/w:520/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1MzYy/Mi0xNDQxNTc3MzQy/LTIwMjkuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 255730,
            "name": "Bruce Watson",
            "resource_url": "https://api.discogs.com/artists/255730",
            "thumbnail_url": "https://i.discogs.com/3S-6O8M28JKR2zlsvFKE6LxGLHNRVs9y0RFf3XMOjFg/rs:fit/g:sm/q:40/h:599/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1NTcz/MC0xMjU0NTYwNjc4/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 287983,
            "name": "Derek Forbes",
            "resource_url": "https://api.discogs.com/artists/287983",
            "thumbnail_url": "https://i.discogs.com/lJNVcYKKywy8QYoGQODJK0zSE7WrVSIJry13skfoamc/rs:fit/g:sm/q:40/h:416/w:340/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4Nzk4/My0xMTQ4MjU1MjQ0/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 418624,
            "name": "Tony Butler",
            "resource_url": "https://api.discogs.com/artists/418624",
            "thumbnail_url": "https://i.discogs.com/WsJeFgarPIudPUl3DL_c-RDcEIiu51ISImrmxmwA65w/rs:fit/g:sm/q:40/h:600/w:593/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxODYy/NC0xMjU0NTYwOTA4/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 544449,
            "name": "Peter Wishart",
            "resource_url": "https://api.discogs.com/artists/544449",
            "thumbnail_url": "https://i.discogs.com/3tuLmAiFbO66QIXqpP94L_knLyCM-f7SPyV0LXvzhnA/rs:fit/g:sm/q:40/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU0NDQ0/OS0xNzA3MTQwODE3/LTU2NzAuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 724275,
            "name": "Clive Parker",
            "resource_url": "https://api.discogs.com/artists/724275",
            "thumbnail_url": "https://i.discogs.com/okzcID4ts0NaJJjj_aovPfPmaf_quZdTnV_lD6SetyY/rs:fit/g:sm/q:40/h:502/w:451/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcyNDI3/NS0xNjg0MjUzMjY3/LTUzNjcuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 2527264,
            "name": "Jamie Watson (6)",
            "resource_url": "https://api.discogs.com/artists/2527264",
            "thumbnail_url": "https://i.discogs.com/uvlZTldZfzFKmP-6hfmsSFovlcpSrUGq1VqAF6-pQaY/rs:fit/g:sm/q:40/h:160/w:160/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1Mjcy/NjQtMTM5ODM1Mzg4/OC05NDI1LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 3214655,
            "name": "Scott Whitley",
            "resource_url": "https://api.discogs.com/artists/3214655",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 4005619,
            "name": "Simon Hough",
            "resource_url": "https://api.discogs.com/artists/4005619",
            "thumbnail_url": "https://i.discogs.com/aQGHBAiYeArpTJvxQB0WIZRpE10KGnqlo51EX9ROQIA/rs:fit/g:sm/q:40/h:960/w:546/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMDU2/MTktMTUwNDg2MzY4/Mi03NDE4LmpwZWc.jpeg"
          }
        ],
        "name": "Big Country",
        "namevariations": [
          "Adamson/Watson/Butler/Brzezicki",
          "B. Country",
          "Big Country Hats",
          "The Big Country",
          "ビッグ・カントリー"
        ],
        "profile": "Scottish rock band formed in the early 1980s.\r\nManaged By [a=Ian Grant] of [a=Grant Edwards Management]\r\n[b]Lineup:[/b]\r\nStuart Adamson: Vocals, Guitar, Synthesizer. Born April 11, 1958, died December 16, 2001 (suicide)\r\nBruce Watson: Guitar\r\nTony Butler: Bass (until 2012)\r\nMark Brzezicki: Drums\r\nMike Peters: Vocals, Guitar (2010 - 2013; died 2025)\r\nJamie Watson (Son of Bruce): Guitar (since 2010)\r\nDerek Forbes: Bass (2012 - 2015)\r\nSimon Hough: Vocals, Acoustic Guitar (2014 - 2024)\r\nScott Whitley: Bass (2015 - 2021)\r\nGil Allan: Bass (since 2021)\r\nTommie Paxton: Vocals, Guitar (since 2024)\r\nYears active:\t1981–2000, 2007, 2010–present\r\n\r\n[b]Please note that the UK releases during the '80s should be on the Mercury label, this is not actually mentioned on the label or sleeves of the earliest singles. The only information refers to Phonogram who were the publishing house for Mercury at that time, which is why their name and logo will appear.[/b]",
        "releases_url": "https://api.discogs.com/artists/91685/releases",
        "resource_url": "https://api.discogs.com/artists/91685",
        "uri": "https://www.discogs.com/artist/91685-Big-Country",
        "urls": [
          "http://www.bigcountry.co.uk/",
          "https://www.facebook.com/inabigcountry",
          "https://twitter.com/BigCountryUK",
          "https://www.instagram.com/bigcountryofficial",
          "https://www.youtube.com/@BigCountry",
          "https://soundcloud.com/big-country-music",
          "http://en.wikipedia.org/wiki/Big_Country",
          "http://www.bigcountryinfo.com/",
          "https://www.imdb.com/name/nm0081691/"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/91685",
      "thumb": "https://i.discogs.com/MJYFq-JbOEdB2OG_groNeN46cJeRqphb8gFGb7tWAl8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
      "url": "https://www.discogs.com/artist/91685-Big-Country",
      "urls": [
        "http://www.bigcountry.co.uk/",
        "https://www.facebook.com/inabigcountry",
        "https://twitter.com/BigCountryUK",
        "https://www.instagram.com/bigcountryofficial",
        "https://www.youtube.com/@BigCountry",
        "https://soundcloud.com/big-country-music",
        "http://en.wikipedia.org/wiki/Big_Country",
        "http://www.bigcountryinfo.com/",
        "https://www.imdb.com/name/nm0081691/"
      ]
    },
    "lastfm": "ArtistLastFmData(name='Big Country', url='https://www.last.fm/music/Big+Country', mbid='b4013ff1-d7ce-4b1a-af6e-e0b19ca7f378', listeners=299131, playcount=3338774, bio_summary='Big Country are a new wave/alternative rock band which formed in Dunfermline, Scotland in 1981. The original band consisted of Stuart Adamson (vocals, guitar), Bruce Watson (guitar, vocals), Tony Butler (bass) and Mark Brzezicki (drums). Adamson was a former member of the Scottish punk band The Skids. The band\\'s music incorporated Scottish folk and martial music styles, and the band engineered their guitar-driven sound to evoke the sound of bagpipes, fiddles, and other traditional folk instruments.  <a href=\"https://www.last.fm/music/Big+Country\">Read more on Last.fm</a>', bio_content='Big Country are a new wave/alternative rock band which formed in Dunfermline, Scotland in 1981. The original band consisted of Stuart Adamson (vocals, guitar), Bruce Watson (guitar, vocals), Tony Butler (bass) and Mark Brzezicki (drums). Adamson was a former member of the Scottish punk band The Skids. The band\\'s music incorporated Scottish folk and martial music styles, and the band engineered their guitar-driven sound to evoke the sound of bagpipes, fiddles, and other traditional folk instruments. \\n\\nFollowing Adamson\\'s death in 2001, the band reformed in 2007, with the surviving members. Between 2010 and 2013, the band reformed with Mike Peters of The Alarm on lead vocals. Since then the band has continued with only two of the original members (Watson and Brzezicki).\\n\\nBig Country\\'s first single was \"Harvest Home\", recorded and released in 1982. It was a modest success, although it did not reach the UK Singles Chart. Their next single was 1983\\'s \"Fields Of Fire (400 Miles)\", which reached the UK\\'s Top Ten and was followed by the album The Crossing. The album was a hit in the United States (reaching the Top 20 in the Billboard 200), powered by \"In a Big Country\", their only US Top 40 single.\\n\\nStuart Adamson was found dead in a room at the Best Western Plaza Hotel in Honolulu, Hawaii on 16 December 2001, having been believed to have died by suicide.\\n\\nOn 24 May 2024 the band announced that singer Tommie Paxton would being \"helping them out\" for the year. Paxton is guitar player and singer with the Big Country tribute band Restless Natives. <a href=\"https://www.last.fm/music/Big+Country\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['new wave', '80s', 'rock', 'Scottish', 'alternative'], similar_artists=[{'name': 'The Skids', 'url': 'https://www.last.fm/music/The+Skids'}, {'name': 'The Alarm', 'url': 'https://www.last.fm/music/The+Alarm'}, {'name': 'Simple Minds', 'url': 'https://www.last.fm/music/Simple+Minds'}, {'name': 'The Fixx', 'url': 'https://www.last.fm/music/The+Fixx'}, {'name': 'China Crisis', 'url': 'https://www.last.fm/music/China+Crisis'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Big Country', 'mbid': 'b4013ff1-d7ce-4b1a-af6e-e0b19ca7f378', 'url': 'https://www.last.fm/music/Big+Country', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '1', 'stats': {'listeners': '299131', 'playcount': '3338774'}, 'similar': {'artist': [{'name': 'The Skids', 'url': 'https://www.last.fm/music/The+Skids', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'The Alarm', 'url': 'https://www.last.fm/music/The+Alarm', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Simple Minds', 'url': 'https://www.last.fm/music/Simple+Minds', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'The Fixx', 'url': 'https://www.last.fm/music/The+Fixx', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'China Crisis', 'url': 'https://www.last.fm/music/China+Crisis', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'new wave', 'url': 'https://www.last.fm/tag/new+wave'}, {'name': '80s', 'url': 'https://www.last.fm/tag/80s'}, {'name': 'rock', 'url': 'https://www.last.fm/tag/rock'}, {'name': 'Scottish', 'url': 'https://www.last.fm/tag/Scottish'}, {'name': 'alternative', 'url': 'https://www.last.fm/tag/alternative'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Big+Country/+wiki'}}, 'published': '11 Mar 2006, 23:29', 'summary': 'Big Country are a new wave/alternative rock band which formed in Dunfermline, Scotland in 1981. The original band consisted of Stuart Adamson (vocals, guitar), Bruce Watson (guitar, vocals), Tony Butler (bass) and Mark Brzezicki (drums). Adamson was a former member of the Scottish punk band The Skids. The band\\'s music incorporated Scottish folk and martial music styles, and the band engineered their guitar-driven sound to evoke the sound of bagpipes, fiddles, and other traditional folk instruments.  <a href=\"https://www.last.fm/music/Big+Country\">Read more on Last.fm</a>', 'content': 'Big Country are a new wave/alternative rock band which formed in Dunfermline, Scotland in 1981. The original band consisted of Stuart Adamson (vocals, guitar), Bruce Watson (guitar, vocals), Tony Butler (bass) and Mark Brzezicki (drums). Adamson was a former member of the Scottish punk band The Skids. The band\\'s music incorporated Scottish folk and martial music styles, and the band engineered their guitar-driven sound to evoke the sound of bagpipes, fiddles, and other traditional folk instruments. \\n\\nFollowing Adamson\\'s death in 2001, the band reformed in 2007, with the surviving members. Between 2010 and 2013, the band reformed with Mike Peters of The Alarm on lead vocals. Since then the band has continued with only two of the original members (Watson and Brzezicki).\\n\\nBig Country\\'s first single was \"Harvest Home\", recorded and released in 1982. It was a modest success, although it did not reach the UK Singles Chart. Their next single was 1983\\'s \"Fields Of Fire (400 Miles)\", which reached the UK\\'s Top Ten and was followed by the album The Crossing. The album was a hit in the United States (reaching the Top 20 in the Billboard 200), powered by \"In a Big Country\", their only US Top 40 single.\\n\\nStuart Adamson was found dead in a room at the Best Western Plaza Hotel in Honolulu, Hawaii on 16 December 2001, having been believed to have died by suicide.\\n\\nOn 24 May 2024 the band announced that singer Tommie Paxton would being \"helping them out\" for the year. Paxton is guitar player and singer with the Big Country tribute band Restless Natives. <a href=\"https://www.last.fm/music/Big+Country\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='1h8YIw9HLr6E8gdXVDRbVJ', url='https://open.spotify.com/artist/1h8YIw9HLr6E8gdXVDRbVJ', name='Big Country', popularity=51, followers=257222, genres=['new wave', 'celtic rock'], images=[{'url': 'https://i.scdn.co/image/9da85bf614f13433da4c789d13e815f664430809', 'height': 681, 'width': 1000}, {'url': 'https://i.scdn.co/image/02210504df6db274a954c4ed9a86a550efd61c23', 'height': 436, 'width': 640}, {'url': 'https://i.scdn.co/image/be6fc1f7f692f493e48af29dd607f51f572051c5', 'height': 136, 'width': 200}, {'url': 'https://i.scdn.co/image/9fa13f5625d2493655f33f4e416059ceb50df317', 'height': 44, 'width': 64}], external_urls={'spotify': 'https://open.spotify.com/artist/1h8YIw9HLr6E8gdXVDRbVJ'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/1h8YIw9HLr6E8gdXVDRbVJ'}, 'followers': {'href': None, 'total': 257222}, 'genres': ['new wave', 'celtic rock'], 'href': 'https://api.spotify.com/v1/artists/1h8YIw9HLr6E8gdXVDRbVJ', 'id': '1h8YIw9HLr6E8gdXVDRbVJ', 'images': [{'url': 'https://i.scdn.co/image/9da85bf614f13433da4c789d13e815f664430809', 'height': 681, 'width': 1000}, {'url': 'https://i.scdn.co/image/02210504df6db274a954c4ed9a86a550efd61c23', 'height': 436, 'width': 640}, {'url': 'https://i.scdn.co/image/be6fc1f7f692f493e48af29dd607f51f572051c5', 'height': 136, 'width': 200}, {'url': 'https://i.scdn.co/image/9fa13f5625d2493655f33f4e416059ceb50df317', 'height': 44, 'width': 64}], 'name': 'Big Country', 'popularity': 51, 'type': 'artist', 'uri': 'spotify:artist:1h8YIw9HLr6E8gdXVDRbVJ'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Big Country comprised Stuart Adamson (formerly of The Skids, vocals/guitar/keyboards), Bruce Watson (guitar/mandolin/sitar/vocals), Tony Butler (bass guitar/vocals) and Mark Brzezicki (drums/percussion/vocals). Before the recruitment of Butler and Brzezicki an early incarnation of Big Country was a five-piece band, featuring Peter Wishart (later of Runrig and now an SNP MP) on keyboards, his brother Alan on bass, and Clive Parker, drummer from Spizz Energi / Athletico Spizz '80 (Rough Trade & A&M Records). Parker had approached Adamson to join his new band after the demise of The Skids. Adamson auditioned Parker (1980) at The Members rehearsal room in Ladbroke Grove, London, and the next day was called on to play drums on demos for CBS Records at their Whitfield Street studios. The demos were produced by Adam Sieff and just featured Adamson, Parker, with scarcely a contribution from Watson. Adamson had asked bassist Dave Allen from the Gang of Four to join the band but he declined. Adamson asked Parker to join the band, which led to 8 months of rehearsal in Dunfermline in a disused furniture warehouse. The culmination was a successful concert at the Glen Pavilion at Dunfermline, (playing to a home crowd, mainly Skids fans), and an interview with BBC Radio Scotland where the CBS Studio demos were utilised. What followed were live dates with Alice Cooper's Special Forces tour in 1982. The band appeared out of their depth with their rambling Echo & The Bunnymen-keyboard oriented-sound which went down badly with the metal crowds. Thus the band was dumped from the tour after only two gigs at The Brighton Centre  and Birmingham Odeon. Adamson's management issued an ultimatum and the Wisharts and Parker were sacked. Adamson later asked Peter Wishart to rejoin on keyboards, but Peter declined without his brother in the band. Parker formed the synth pop band Scary Thieves, and signed to EMI Records, and later went on to play session drums for ex-Jesus and Mary Chain member John Moore in The Expressway, (Polydor Records) touring the UK and USA. Alan Wishart later joined Parker in contemporary folk band Barra (Sony/ATV Music/Hi-Note Records). The manager Ian Grant brought in Brzezicki, and Butler, and along with Watson, the classic line-up was formed. Although the band's music drew from Scottish traditional music, none of its members were born in Scotland. Adamson grew up in Dunfermline though, and his family was of Scottish descent, so to that extent his Scottish accent was genuine.\n\nTheir first single was \"Harvest Home\", recorded and released in 1982. It was a modest success, reaching No. 91 on the UK Singles Chart. Their next single was 1983's \"Fields of Fire\", which reached the UK's Top Ten and was rapidly followed by the album The Crossing. The album was a hit in the United States (reaching the US Billboard Top 20), powered by \"In a Big Country\", their only U.S. Top 40 hit single. The song featured heavily engineered guitar playing, strongly reminiscent of bagpipes; Adamson and fellow guitarist, Watson, achieved this through the use of the MXR Pitch Transposer 129 Guitar Effect. Also contributing to the band's unique sound was their use of the e-bow, a device which allows a guitar to sound more like strings or synthesizer. The Crossing sold over a million copies in the UK and obtained gold record status (sales of over 500,000) in the U.S. The band also performed on both the Grammys and Saturday Night Live.\n\nThe band released the non-LP extended play single \"Wonderland\" in 1984 while undergoing a lengthy worldwide tour. The song, considered by some critics to be one of their finest, was a Top Ten hit (No. 8) in the UK singles chart but despite heavy airplay and a positive critical response, was a comparative flop in the U.S., reaching only No. 86 on the Billboard Hot 100. It was the last single by the band to make a U.S. chart appearance.\n\nTheir second album Steeltown (1984) was a hit as soon as it was released, entering the UK Albums Chart at number one. The album featured three UK top 30 hit singles, and received considerable critical acclaim on both sides of the Atlantic, but like Wonderland (and, in fact, all subsequent releases) it was a commercial disappointment in the U.S, peaking at No. 70 on the Billboard album charts.\n\nThroughout 1984 and 1985, the band toured the UK, Europe, and, to a lesser extent, the U.S., both as headliners themselves and in support of such artists as Queen and Roger Daltrey. They also recorded prolifically, and provided the musical score to a Scottish independent film, Restless Natives (1985), which was not released on CD until years later on the band's Restless Natives and Rarities (1998) collection.\n\n1986's The Seer, the band's third album, was another big success in the UK, peaking at Number 2. It produced three further Top 30 singles, including the Irish number one hit \"Look Away\", which would also prove to be the band's biggest hit in the U.K., peaking at No. 7. Kate Bush provided backing vocals on the album's title track, and as was the norm for the band at the time, the album received good reviews from the music press. In the U.S., The Seer sold a little bit better than Steeltown, reaching No. 59 on the Billboard charts.\n\nIn what some critics felt was an apparent attempt to regain their dwindling U.S. following, Big Country used producer Peter Wolf for their next album, Peace in Our Time (1988), which was recorded in Los Angeles. It reached No. 9 in the UK Album chart, but sold poorly in the United States. During the \"Peace In Our Time\" Tour, the band were supported by Diesel Park West and Cry Before Dawn.\nThe 1990s\n\nNo Place Like Home (1991) not only effectively killed off the band's commercial hopes in the US, it nearly broke up the band. Drummer Mark Brzezicki returned to the studio as a session drummer after leaving the band. The album found the band trying to reinvent themselves and shift away from their '80s image. It was not a commercial success and was not released in America, although two re-recorded tracks showed up on 1993's The Buffalo Skinners.\n\nIn 1991, the band was dropped by Phonogram, the label that had released all of their material for ten years. After that, Big Country became a minor act, popping up in the lower echelons of the charts in the UK and Europe with the release of every subsequent album. Only one of these, 1993's The Buffalo Skinners, received a major label release (via Chrysalis Records), and it seemed a return to form of sorts for the band, reaching the UK Top 25. The album obtained a surprisingly enthusiastic critical response, and although it produced two UK Top 30 singles in \"Alone\" and \"Ships\", its sales were meagre and, in retrospect, it can be seen as Big Country's last, lost chance to regain a mass audience. Regardless, the band retained an intensely devoted cult following, as evidenced by their deceptively large post-1990 discography, which consists mostly of live concert recordings and singles/rarities collections.\n\nThroughout the 1990s, Big Country became a popular supporting act, supporting bands such as Rolling Stones and The Who. Big Country had backed Daltrey on his 1985 solo album Under the Raging Moon, and Tony Butler played bass and backing vocals on Pete Townshend's 1980 hit single \"Let My Love Open the Door\". Both Butler and Brzezicki performed on Townshend's 1985 solo album White City: A Novel. Brzezicki played drums for The Cult on their 1985 Love album and featured in the video for the single, \"She Sells Sanctuary\".\n\nOf growing concern was the mental and emotional health of lead singer Adamson, who reportedly had struggled with alcoholism for several years. Adamson split with his first wife, who later spoke to Scottish and English tabloids about his heavy drinking. He moved to Nashville in the mid-1990s where he took up residence and married a hairdresser. While in Nashville, he met artist Marcus Hummon and released a studio album with him under the moniker The Raphaels.\n\nIn 1995 Big Country released another album, Why the Long Face.\n\n1999 saw the release of Big Country's eighth and final studio album, Driving to Damascus (titled in its slightly different, augmented U.S. release John Wayne's Dream). Adamson said publicly that he was disappointed that the album did not fare better on the charts, which led to depression. Later that year, he disappeared for a while before resurfacing, stating that he had needed some time off.\nFarewell tour, Adamson's death\n\nAdamson returned for the band's 'Final Fling' farewell tour, culminating in a sold-out concert at Glasgow's Barrowland Ballroom on 31 May 2000. Although that marked the end of Big Country as a touring band, they were always adamant that they would appear together again. They played what turned out to be their last gig in Kuala Lumpur, Malaysia, in October that year.\n\nIn November 2001, Adamson disappeared again. Numerous appeals were put on the Big Country website asking for Adamson to call home and speak to anyone in the band, the management company, or his ex-wife. The website also requested that any fans who might have been 'harbouring' the singer to contact the management company and alert them to his whereabouts. Mark Brzezicki and Tony Butler had indicated they were concerned but the reason Big Country had lasted so long was they stayed out of one another's personal lives, and both later noted they were unaware of the extent of Adamson's problems. He was found dead in a room at the Best Western Plaza Hotel in Honolulu, Hawaii on 16 December 2001. The autopsy revealed that he had hanged himself.\n\nAt the time of death he had a blood-alcohol content of 0.279%.\n\nA memorial to Adamson was held at Dunfermline's Carnegie Hall in January 2002, followed by a tribute concert at the Barrowlands in May. It brought together the remaining members of both Big Country and The Skids; Adamson's teenage children, Callum and Kirsten; as well as Steve Harley, Runrig, Simon Townshend, Midge Ure and Bill Nelson.\n2007 reunion\n\nIn 2007, to celebrate 25 years of Big Country, founding members Bruce Watson, Tony Butler (now lead vocalist for the first time), and Mark Brzezicki reunited to embark on a tour of the UK with dates in Scotland and England and a gig in Cologne (Germany). They also released a new album, twenty five live, on the trackrecords label.\n\nAs of September 2008 the band returned to an indefinite hiatus.\n2010–11 tour\n\nThe surviving original members toured again in late December 2010 and January 2011 with Mike Peters of the Alarm and Jamie Watson, Bruce's son, added to the lineup. They played another set of concerts in April 2011. Big Country have been announced at six major UK/Irish festivals in 2011 — Isle of Wight, T in the Park, Oxegen in Kildare and V Festival (Chelmsford and Stafford), plus Inverness with Simple Minds.\n\nSteve Lillywhite, who had produced Big Country's first and second albums, produced the band's first single in over twelve years. He remarked: \"When I heard the demo of their new song, I was impressed on first listen. I am looking forward to working with the band again whom I last worked with in the 80s on one of my favourite albums I have ever produced — The Crossing.\"\n\n\"It will be a real buzz working with Steve again\", Tony Butler said in response. \"He is a producer we all have a great regard for and are looking forward to working with again. We'd also like to thank all the festival promoters for having faith in us.\"\n\nThe band will also soon announce a series of smaller dates where they will be \"breaking in\" new songs for a future release. \"These will be places we have never played before,\" Mark Brzezicki added, \"giving us the chance to work in new songs in the more intimate type of venues.”\n\nMike Peters said, \"Due to the success of the January and April tours, the band have decided to continue and have already started planning for a new album and a 30th anniversary tour in the new year.\"\n\nBruce Watson commented: \"We are 100% dedicated and intent on making this new line up a permanent one. We can finally look forward to completing unfinished business from the past, particularly internationally, and look to a creative and active future\".\n\nAround August 2011, Big Country released their first single in 11 years called \"Another Country\" with Peters on vocals.\n2012 tour\n\nIn 2012 the band have played many festivals around Europe including Hard Rock Calling in Hyde Park, The Isle of Wight Festival and Fairport's Cropredy Convention as special guests of Fairport Convention on the Saturday.\n\nOn 20 September 2012 guitarist Bruce Watson announced in the forum on the bands website that bassist Tony Butler had announced his retirement from the band during the last tour and that the remaining members of the band would not be continuing their involvement with long time manager Ian Grant. Butler's replacement in Big Country will be Derek Forbes, formerly of Simple Minds.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": "Big Country foi formado por Stuart Adamson e nasceu como uma das maiores promessas do rock escocês durante os anos 80. Seu disco de estréia, The Crossing, é considerado pela crítica como um dos melhores discos da década de 80 e faturou milhões de dólares em vendas, graças ao hit In a Big Country, mas pouca coisa se soube do grupo depois disso.\n\nStuart Adamson formou a banda em 1981, logo depois que saiu do quarteto punk The Skids. Chamou um colega de escola, Bruce Watson, para a segunda guitarra, junto com Clive Parker e Pete e Alan Wishart. Estes últimos foram substituídos rapidamente pelo baixista Tony Blutler e pelo baterista Mark Brzezicki. Conseguiram um contrato com a Polygram em 1982, por onde lançaram o primeiro single, Harvest Home. Com o single na mão, começaram a abrir os shows do The Jam, conseguindo uma visibilidade enorme, já que a banda de Paul Weller estava no auge do sucesso. Logo depois lançam um segundo single, Fields of Fire, que chega facilmente ao Top Ten britânico.\n\nThe Crossing foi lançado em 1983, e é um disco inspirado na música celta, apaixonante e idealista. O disco não chegou a ganhar o disco de platina na Inglaterra, mas levou o disco de ouro nos Estados Unidos, graças a In a Big Country, que entrou no Top 20 americano. A crítica da época amou o trabalho e no começo de 1984 o grupo lança um novo single, Wonderland, que também vai muito bem nas paradas, abrindo caminho para o segundo disco do grupo, Steeltown, que entra diretamente no primeiro posto da parada inglesa, apesar de algumas críticas negativas, que diziam que o disco era apenas uma cópia do trabalho de estréia.\n\nMas as coisas mudam, em 1986 sai o álbum The Seer, o mais fraco disco da banda até então, mas que vem com o hit Look Way, mas era pouco e o discurso político da banda parecia estar perdendo terreno para outros grupos parecidos, como U2 e o Alarm. Kate Bush participa deste disco, nos vocais de Eiledon. Dois anos depois lançam Peace in Our Time e fazer uma turnê pela União Soviética, a canção mais conhecida deste álbum é King of Emotion, que sequer entrou nas paradas americanas, apesar da grana preta gasta pela gravadora do grupo para divulgar o trabalho nos Estados Unidos. No final deste mesmo ano, Brzezicki deixa a banda, em seu lugar entra o baterista Pat Ahern. Com esta nova formação lançam o single de Save Me. Ahern dura pouco e é substituído por Chris Bell que participa de No Place Like Home, em 1991.\n\nNo Place Like Home, devido ao fracasso do disco anterior, não foi lançado nos Estados Unidos e passou batido, mas marcou a volta, pelo menos nas gravações, do baterista Brzezicki. Este trabalho foi uma tentativa de trilhar novos caminhos musicais, mas quase custou a carreira do grupo, que passou a ser comparado com o Cult e com o Duran Duran. The Bufallo Skinners, gravado com um novo baterista, Simon Phillips, se dá um pouco melhor e é lançado nos Estados Unidos, graças ao sucesso de outra banda escocesa, o Del Amitri. Este disco traz algumas músicas do trabalho anterior, que não foi lançado na terra do tio Sam. Na Inglaterra duas faixas, Alone e Ships, entram nas paradas.\n\nEm 1995 sai o sétimo disco do grupo, Why the Long Face, lançado de forma independente, já que a banda havia sido dispensada da Polygram pouco tempo antes. Este disco é a prova cabal de que a banda está à caminho do esquecimento. Why the Long Face traz um grupo perdido no meio do rock que nascia nos anos 90, como atrativo o álbum traz uma versão acústica para In a Big Country e uma cover de Lou Reed, Vicious. Neste mesmo ano, dois discos ao vivo são lançados, o primeiro BBC Live in Concert, mostra a banda em um show gravado em 1989, o álbum é considerado um marco para os fãs da banda. O outro trabalho é Without the Aind of a Safety Net, gravado em 1995. Os dois são ótimas oportunidades de se conhecer uma mesma banda em momentos totalmente distintos.\n\nNo ano seguinte lançam outro trabalho ao vivo, Eclectic, um disco acústico, considerado péssimo pela crítica. Nenhum dos grandes hits da banda estão presentes, apenas King of Emotion, e vários covers aparecem como os feitos para Eleanor Rigby (Beatles), I´m on Fire (Bruce Springsteen) e Ruby Tuesdaey (Stones), entre outras faixas obscuras do próprio Big Country. Logo após o lançamento de Eclectic, Adamson muda-se para Nashville e o Big Country ganha férias forçadas. Nesse meio tempo outros discos ao vivo da banda são lançados com destaque para King Biscuit Flower Hour, uma gravação de um show de ano novo, gravado em 1983. E algumas coletâneas aparecem, a melhor é Restless Natives & Rarities, com raridades e os lado b dos singles já lançados pelo grupo.\n\nApenas em 1999 um novo disco de estúdio é lançado. Driving to Damascus, puxado pelo single Somebody Else, co-escrito por Adamson e Ray Davies, vocalista do Kinks. O disco nada acrescenta a carreira da banda, e, para complicar, Adamson, graças a problemas com alcoolismo, é obrigado a se retirar no meio da turnê de lançamento do trabalho. Em 2000 ele lança o Nashville Album, com apenas seis músicas, muito influenciadas pelo blues e pelo country que é marca registrada da cidade. O disco vem com a regravação de Chance e Look Away. No mesmo ano é lançado Come Up Screaming, disco ao vivo com músicas de toda a carreira da banda.\n\nNo dia 6 de dezembro de 2001, Stuart Adamsom foi encontrado morto em um hotel no Havaii. Poucas semanas antes, ele havia sido dado como desaparecido em Nashiville, onde morava.\n\nAntes da morte de Stuart, o grupo lança Undercover, que, como o nome diz, é recheado de covers de Roxy Music, Bruce Springsteen, Rolling Stones, David Bowie, Al Green e Beach Boys.\n\nEm 2002, o baixista do grupo, Tony Butler, remixa o álbum Driving to Damascus e o lança, mundialmente, com o nome de John Wayne´s Dream. O disco é considerado um dos melhores trabalhos do grupo, mas, infelizmente, seu líder, Adamson, não viveu para ver o reconhecimento deste álbum.\n\nPor Valdir Antonelli",
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1981",
      "country": "Dunfermline, Scotland",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "www.facebook.com/inabigcountry",
      "formed_year": "1981",
      "gender": "Male",
      "genre": "Rock",
      "id": "113789",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/qchex21638974978.jpg",
          "width": 1000
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/sruvuy1355681737.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/big-country-502ec07b502ed.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "4",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "b4013ff1-d7ce-4b1a-af6e-e0b19ca7f378",
      "name": "Big Country",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": "www.bigcountry.co.uk"
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features124/v4/dd/df/28/dddf28b2-8e5b-c93f-8fdb-74eed1a744dc/mzl.pcexrqjr.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "373911",
      "name": "Big Country",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/big-country/373911"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "91685",
      "images": [
        {
          "height": 607,
          "resource_url": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
          "uri150": "https://i.discogs.com/MJYFq-JbOEdB2OG_groNeN46cJeRqphb8gFGb7tWAl8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
          "width": 600
        },
        {
          "height": 325,
          "resource_url": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
          "uri150": "https://i.discogs.com/Vb_W73cKWwIfpFG9Q-JZNQGCdBOZJ03kXi-Q2GFCHwQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
          "width": 286
        },
        {
          "height": 204,
          "resource_url": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
          "uri150": "https://i.discogs.com/5pjrSTE7Tbr0fReh5eAmvmHQwwmuRkTLHrrKUvA395k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
          "width": 200
        },
        {
          "height": 151,
          "resource_url": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
          "uri150": "https://i.discogs.com/DUTNV2TpCyGFoK-7HgKyNk40mstJgAZulKldQqRXQQ4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
          "width": 200
        },
        {
          "height": 152,
          "resource_url": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
          "uri150": "https://i.discogs.com/VTIi8fBGkt--d64RrHkIoV3JFMyHLsyurDAd5gaPv_A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
          "width": 200
        },
        {
          "height": 244,
          "resource_url": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/dcI1KsFkf7JnQMhvrHdZIxEr_AlMbdlfVTEXLB9X420/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
          "width": 246
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/9D6-WWYEikkifBXqr1n9b-NTfecXR5ACO0prdIhHZdk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 375,
          "resource_url": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Wre0KUTWuuo95QGDRF9ArKo3uHRuv0IKBxjyN-a7XbI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 399,
          "resource_url": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/f-2l04owguG9CnXcrgLLgU56Iq8WfDYjzvkPjhIhoDU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 285,
          "resource_url": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/f1Z6iFykGHmRbMIXHkzT6aQ7mgyHZmu_7XOTzUCXFnk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
          "width": 400
        }
      ],
      "members": [
        {
          "active": true,
          "id": 112841,
          "name": "Mark Brzezicki",
          "resource_url": "https://api.discogs.com/artists/112841",
          "thumbnail_url": "https://i.discogs.com/nVgZExQMx9jaOH7K5mxwH-J7U1x_50UDKTv5S5ddWfk/rs:fit/g:sm/q:40/h:600/w:595/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMjg0/MS0xMjU0NTYwODEy/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 232842,
          "name": "Mike Peters",
          "resource_url": "https://api.discogs.com/artists/232842",
          "thumbnail_url": "https://i.discogs.com/p67j5Ozcg6t-86oRaroLwo7lcSc0vYFc_TCzPsX8kfo/rs:fit/g:sm/q:40/h:572/w:316/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzMjg0/Mi0xNTUzMzM2NzM1/LTgzMzAuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 253622,
          "name": "Stuart Adamson",
          "resource_url": "https://api.discogs.com/artists/253622",
          "thumbnail_url": "https://i.discogs.com/OFbsHwQUDQHKgvdxupZ2guRUOkPVKoTE7ATTDhVZJdc/rs:fit/g:sm/q:40/h:548/w:520/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1MzYy/Mi0xNDQxNTc3MzQy/LTIwMjkuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 255730,
          "name": "Bruce Watson",
          "resource_url": "https://api.discogs.com/artists/255730",
          "thumbnail_url": "https://i.discogs.com/3S-6O8M28JKR2zlsvFKE6LxGLHNRVs9y0RFf3XMOjFg/rs:fit/g:sm/q:40/h:599/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1NTcz/MC0xMjU0NTYwNjc4/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 287983,
          "name": "Derek Forbes",
          "resource_url": "https://api.discogs.com/artists/287983",
          "thumbnail_url": "https://i.discogs.com/lJNVcYKKywy8QYoGQODJK0zSE7WrVSIJry13skfoamc/rs:fit/g:sm/q:40/h:416/w:340/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4Nzk4/My0xMTQ4MjU1MjQ0/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 418624,
          "name": "Tony Butler",
          "resource_url": "https://api.discogs.com/artists/418624",
          "thumbnail_url": "https://i.discogs.com/WsJeFgarPIudPUl3DL_c-RDcEIiu51ISImrmxmwA65w/rs:fit/g:sm/q:40/h:600/w:593/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxODYy/NC0xMjU0NTYwOTA4/LmpwZWc.jpeg"
        },
        {
          "active": false,
          "id": 544449,
          "name": "Peter Wishart",
          "resource_url": "https://api.discogs.com/artists/544449",
          "thumbnail_url": "https://i.discogs.com/3tuLmAiFbO66QIXqpP94L_knLyCM-f7SPyV0LXvzhnA/rs:fit/g:sm/q:40/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU0NDQ0/OS0xNzA3MTQwODE3/LTU2NzAuanBlZw.jpeg"
        },
        {
          "active": false,
          "id": 724275,
          "name": "Clive Parker",
          "resource_url": "https://api.discogs.com/artists/724275",
          "thumbnail_url": "https://i.discogs.com/okzcID4ts0NaJJjj_aovPfPmaf_quZdTnV_lD6SetyY/rs:fit/g:sm/q:40/h:502/w:451/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcyNDI3/NS0xNjg0MjUzMjY3/LTUzNjcuanBlZw.jpeg"
        },
        {
          "active": true,
          "id": 2527264,
          "name": "Jamie Watson (6)",
          "resource_url": "https://api.discogs.com/artists/2527264",
          "thumbnail_url": "https://i.discogs.com/uvlZTldZfzFKmP-6hfmsSFovlcpSrUGq1VqAF6-pQaY/rs:fit/g:sm/q:40/h:160/w:160/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1Mjcy/NjQtMTM5ODM1Mzg4/OC05NDI1LmpwZWc.jpeg"
        },
        {
          "active": true,
          "id": 3214655,
          "name": "Scott Whitley",
          "resource_url": "https://api.discogs.com/artists/3214655",
          "thumbnail_url": ""
        },
        {
          "active": true,
          "id": 4005619,
          "name": "Simon Hough",
          "resource_url": "https://api.discogs.com/artists/4005619",
          "thumbnail_url": "https://i.discogs.com/aQGHBAiYeArpTJvxQB0WIZRpE10KGnqlo51EX9ROQIA/rs:fit/g:sm/q:40/h:960/w:546/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMDU2/MTktMTUwNDg2MzY4/Mi03NDE4LmpwZWc.jpeg"
        }
      ],
      "name": "Big Country",
      "namevariations": [
        "Adamson/Watson/Butler/Brzezicki",
        "B. Country",
        "Big Country Hats",
        "The Big Country",
        "ビッグ・カントリー"
      ],
      "profile": "Scottish rock band formed in the early 1980s.\r\nManaged By [a=Ian Grant] of [a=Grant Edwards Management]\r\n[b]Lineup:[/b]\r\nStuart Adamson: Vocals, Guitar, Synthesizer. Born April 11, 1958, died December 16, 2001 (suicide)\r\nBruce Watson: Guitar\r\nTony Butler: Bass (until 2012)\r\nMark Brzezicki: Drums\r\nMike Peters: Vocals, Guitar (2010 - 2013; died 2025)\r\nJamie Watson (Son of Bruce): Guitar (since 2010)\r\nDerek Forbes: Bass (2012 - 2015)\r\nSimon Hough: Vocals, Acoustic Guitar (2014 - 2024)\r\nScott Whitley: Bass (2015 - 2021)\r\nGil Allan: Bass (since 2021)\r\nTommie Paxton: Vocals, Guitar (since 2024)\r\nYears active:\t1981–2000, 2007, 2010–present\r\n\r\n[b]Please note that the UK releases during the '80s should be on the Mercury label, this is not actually mentioned on the label or sleeves of the earliest singles. The only information refers to Phonogram who were the publishing house for Mercury at that time, which is why their name and logo will appear.[/b]",
      "raw_data": {
        "data_quality": "Needs Vote",
        "id": 91685,
        "images": [
          {
            "height": 607,
            "resource_url": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/IVOI2h7KERL6tMQ8w8QhIk-F2PrKSl-Kxp30Uixk5sc/rs:fit/g:sm/q:90/h:607/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
            "uri150": "https://i.discogs.com/MJYFq-JbOEdB2OG_groNeN46cJeRqphb8gFGb7tWAl8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
            "width": 600
          },
          {
            "height": 325,
            "resource_url": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Rz6J8AY2e-Vs31sO8DLnFeT8-oQi5_dkZf5kT1NMohI/rs:fit/g:sm/q:90/h:325/w:286/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
            "uri150": "https://i.discogs.com/Vb_W73cKWwIfpFG9Q-JZNQGCdBOZJ03kXi-Q2GFCHwQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEwNzQwNzI4MDIu/anBn.jpeg",
            "width": 286
          },
          {
            "height": 204,
            "resource_url": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/qkHIK8si8sD-60Mf1l7YLWs_EkwIPFSCN7uNIDGFF5Q/rs:fit/g:sm/q:90/h:204/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
            "uri150": "https://i.discogs.com/5pjrSTE7Tbr0fReh5eAmvmHQwwmuRkTLHrrKUvA395k/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc3Nzcu/anBn.jpeg",
            "width": 200
          },
          {
            "height": 151,
            "resource_url": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/Nfg7xo1QD1xvTXg4-3T-fcagd2ak0NFZo5Lolg26Q0Y/rs:fit/g:sm/q:90/h:151/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
            "uri150": "https://i.discogs.com/DUTNV2TpCyGFoK-7HgKyNk40mstJgAZulKldQqRXQQ4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4NDgu/anBn.jpeg",
            "width": 200
          },
          {
            "height": 152,
            "resource_url": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aHmAB_Qu3Gz-IeIx3QRBa3p-B_s7HN6J3RHFd5z73co/rs:fit/g:sm/q:90/h:152/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
            "uri150": "https://i.discogs.com/VTIi8fBGkt--d64RrHkIoV3JFMyHLsyurDAd5gaPv_A/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTExMDc3ODc4Nzku/anBn.jpeg",
            "width": 200
          },
          {
            "height": 244,
            "resource_url": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/0945An3ifbLsIsqu4rKHsiyshpawuFFRrP3AYbkeGtU/rs:fit/g:sm/q:90/h:244/w:246/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/dcI1KsFkf7JnQMhvrHdZIxEr_AlMbdlfVTEXLB9X420/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyMzA5NzIwMDUu/anBlZw.jpeg",
            "width": 246
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/z75h7IlKNOs5OpsGIgauMAy0EVbNdWzVrXe4o-I3Cu4/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/9D6-WWYEikkifBXqr1n9b-NTfecXR5ACO0prdIhHZdk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTEyNTQ1NjI4MDYu/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 375,
            "resource_url": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/6cPjp4Nqc0BwP9fMz1hG0XBZLDPX3gI8cfb_VjW62-c/rs:fit/g:sm/q:90/h:375/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Wre0KUTWuuo95QGDRF9ArKo3uHRuv0IKBxjyN-a7XbI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0MjgzODU1NjIt/OTIyOS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 399,
            "resource_url": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/6SlooGmur3FmlK2p_Xd0iRzpW-cPGPKCYesoeIqu9FA/rs:fit/g:sm/q:90/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/f-2l04owguG9CnXcrgLLgU56Iq8WfDYjzvkPjhIhoDU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE0NjIzMjg1MDQt/NTY5Mi5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 285,
            "resource_url": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/VunTPoAvae-l5wgIPBC7ROVHHOvBsU9BEVQmfoCqAwk/rs:fit/g:sm/q:90/h:285/w:400/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/f1Z6iFykGHmRbMIXHkzT6aQ7mgyHZmu_7XOTzUCXFnk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE1MDc5MzM1NzMt/MjExMC5qcGVn.jpeg",
            "width": 400
          }
        ],
        "members": [
          {
            "active": true,
            "id": 112841,
            "name": "Mark Brzezicki",
            "resource_url": "https://api.discogs.com/artists/112841",
            "thumbnail_url": "https://i.discogs.com/nVgZExQMx9jaOH7K5mxwH-J7U1x_50UDKTv5S5ddWfk/rs:fit/g:sm/q:40/h:600/w:595/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTExMjg0/MS0xMjU0NTYwODEy/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 232842,
            "name": "Mike Peters",
            "resource_url": "https://api.discogs.com/artists/232842",
            "thumbnail_url": "https://i.discogs.com/p67j5Ozcg6t-86oRaroLwo7lcSc0vYFc_TCzPsX8kfo/rs:fit/g:sm/q:40/h:572/w:316/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIzMjg0/Mi0xNTUzMzM2NzM1/LTgzMzAuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 253622,
            "name": "Stuart Adamson",
            "resource_url": "https://api.discogs.com/artists/253622",
            "thumbnail_url": "https://i.discogs.com/OFbsHwQUDQHKgvdxupZ2guRUOkPVKoTE7ATTDhVZJdc/rs:fit/g:sm/q:40/h:548/w:520/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1MzYy/Mi0xNDQxNTc3MzQy/LTIwMjkuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 255730,
            "name": "Bruce Watson",
            "resource_url": "https://api.discogs.com/artists/255730",
            "thumbnail_url": "https://i.discogs.com/3S-6O8M28JKR2zlsvFKE6LxGLHNRVs9y0RFf3XMOjFg/rs:fit/g:sm/q:40/h:599/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1NTcz/MC0xMjU0NTYwNjc4/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 287983,
            "name": "Derek Forbes",
            "resource_url": "https://api.discogs.com/artists/287983",
            "thumbnail_url": "https://i.discogs.com/lJNVcYKKywy8QYoGQODJK0zSE7WrVSIJry13skfoamc/rs:fit/g:sm/q:40/h:416/w:340/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4Nzk4/My0xMTQ4MjU1MjQ0/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 418624,
            "name": "Tony Butler",
            "resource_url": "https://api.discogs.com/artists/418624",
            "thumbnail_url": "https://i.discogs.com/WsJeFgarPIudPUl3DL_c-RDcEIiu51ISImrmxmwA65w/rs:fit/g:sm/q:40/h:600/w:593/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQxODYy/NC0xMjU0NTYwOTA4/LmpwZWc.jpeg"
          },
          {
            "active": false,
            "id": 544449,
            "name": "Peter Wishart",
            "resource_url": "https://api.discogs.com/artists/544449",
            "thumbnail_url": "https://i.discogs.com/3tuLmAiFbO66QIXqpP94L_knLyCM-f7SPyV0LXvzhnA/rs:fit/g:sm/q:40/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTU0NDQ0/OS0xNzA3MTQwODE3/LTU2NzAuanBlZw.jpeg"
          },
          {
            "active": false,
            "id": 724275,
            "name": "Clive Parker",
            "resource_url": "https://api.discogs.com/artists/724275",
            "thumbnail_url": "https://i.discogs.com/okzcID4ts0NaJJjj_aovPfPmaf_quZdTnV_lD6SetyY/rs:fit/g:sm/q:40/h:502/w:451/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTcyNDI3/NS0xNjg0MjUzMjY3/LTUzNjcuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 2527264,
            "name": "Jamie Watson (6)",
            "resource_url": "https://api.discogs.com/artists/2527264",
            "thumbnail_url": "https://i.discogs.com/uvlZTldZfzFKmP-6hfmsSFovlcpSrUGq1VqAF6-pQaY/rs:fit/g:sm/q:40/h:160/w:160/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1Mjcy/NjQtMTM5ODM1Mzg4/OC05NDI1LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 3214655,
            "name": "Scott Whitley",
            "resource_url": "https://api.discogs.com/artists/3214655",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 4005619,
            "name": "Simon Hough",
            "resource_url": "https://api.discogs.com/artists/4005619",
            "thumbnail_url": "https://i.discogs.com/aQGHBAiYeArpTJvxQB0WIZRpE10KGnqlo51EX9ROQIA/rs:fit/g:sm/q:40/h:960/w:546/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMDU2/MTktMTUwNDg2MzY4/Mi03NDE4LmpwZWc.jpeg"
          }
        ],
        "name": "Big Country",
        "namevariations": [
          "Adamson/Watson/Butler/Brzezicki",
          "B. Country",
          "Big Country Hats",
          "The Big Country",
          "ビッグ・カントリー"
        ],
        "profile": "Scottish rock band formed in the early 1980s.\r\nManaged By [a=Ian Grant] of [a=Grant Edwards Management]\r\n[b]Lineup:[/b]\r\nStuart Adamson: Vocals, Guitar, Synthesizer. Born April 11, 1958, died December 16, 2001 (suicide)\r\nBruce Watson: Guitar\r\nTony Butler: Bass (until 2012)\r\nMark Brzezicki: Drums\r\nMike Peters: Vocals, Guitar (2010 - 2013; died 2025)\r\nJamie Watson (Son of Bruce): Guitar (since 2010)\r\nDerek Forbes: Bass (2012 - 2015)\r\nSimon Hough: Vocals, Acoustic Guitar (2014 - 2024)\r\nScott Whitley: Bass (2015 - 2021)\r\nGil Allan: Bass (since 2021)\r\nTommie Paxton: Vocals, Guitar (since 2024)\r\nYears active:\t1981–2000, 2007, 2010–present\r\n\r\n[b]Please note that the UK releases during the '80s should be on the Mercury label, this is not actually mentioned on the label or sleeves of the earliest singles. The only information refers to Phonogram who were the publishing house for Mercury at that time, which is why their name and logo will appear.[/b]",
        "releases_url": "https://api.discogs.com/artists/91685/releases",
        "resource_url": "https://api.discogs.com/artists/91685",
        "uri": "https://www.discogs.com/artist/91685-Big-Country",
        "urls": [
          "http://www.bigcountry.co.uk/",
          "https://www.facebook.com/inabigcountry",
          "https://twitter.com/BigCountryUK",
          "https://www.instagram.com/bigcountryofficial",
          "https://www.youtube.com/@BigCountry",
          "https://soundcloud.com/big-country-music",
          "http://en.wikipedia.org/wiki/Big_Country",
          "http://www.bigcountryinfo.com/",
          "https://www.imdb.com/name/nm0081691/"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/91685",
      "thumb": "https://i.discogs.com/MJYFq-JbOEdB2OG_groNeN46cJeRqphb8gFGb7tWAl8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTkxNjg1/LTE2ODQ4ODIxMzYt/MjE1OS5wbmc.jpeg",
      "url": "https://www.discogs.com/artist/91685-Big-Country",
      "urls": [
        "http://www.bigcountry.co.uk/",
        "https://www.facebook.com/inabigcountry",
        "https://twitter.com/BigCountryUK",
        "https://www.instagram.com/bigcountryofficial",
        "https://www.youtube.com/@BigCountry",
        "https://soundcloud.com/big-country-music",
        "http://en.wikipedia.org/wiki/Big_Country",
        "http://www.bigcountryinfo.com/",
        "https://www.imdb.com/name/nm0081691/"
      ]
    },
    "lastfm": {
      "bio_content": "Big Country are a new wave/alternative rock band which formed in Dunfermline, Scotland in 1981. The original band consisted of Stuart Adamson (vocals, guitar), Bruce Watson (guitar, vocals), Tony Butler (bass) and Mark Brzezicki (drums). Adamson was a former member of the Scottish punk band The Skids. The band's music incorporated Scottish folk and martial music styles, and the band engineered their guitar-driven sound to evoke the sound of bagpipes, fiddles, and other traditional folk instruments. \n\nFollowing Adamson's death in 2001, the band reformed in 2007, with the surviving members. Between 2010 and 2013, the band reformed with Mike Peters of The Alarm on lead vocals. Since then the band has continued with only two of the original members (Watson and Brzezicki).\n\nBig Country's first single was \"Harvest Home\", recorded and released in 1982. It was a modest success, although it did not reach the UK Singles Chart. Their next single was 1983's \"Fields Of Fire (400 Miles)\", which reached the UK's Top Ten and was followed by the album The Crossing. The album was a hit in the United States (reaching the Top 20 in the Billboard 200), powered by \"In a Big Country\", their only US Top 40 single.\n\nStuart Adamson was found dead in a room at the Best Western Plaza Hotel in Honolulu, Hawaii on 16 December 2001, having been believed to have died by suicide.\n\nOn 24 May 2024 the band announced that singer Tommie Paxton would being \"helping them out\" for the year. Paxton is guitar player and singer with the Big Country tribute band Restless Natives. <a href=\"https://www.last.fm/music/Big+Country\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Big Country are a new wave/alternative rock band which formed in Dunfermline, Scotland in 1981. The original band consisted of Stuart Adamson (vocals, guitar), Bruce Watson (guitar, vocals), Tony Butler (bass) and Mark Brzezicki (drums). Adamson was a former member of the Scottish punk band The Skids. The band's music incorporated Scottish folk and martial music styles, and the band engineered their guitar-driven sound to evoke the sound of bagpipes, fiddles, and other traditional folk instruments.  <a href=\"https://www.last.fm/music/Big+Country\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 299131,
      "mbid": "b4013ff1-d7ce-4b1a-af6e-e0b19ca7f378",
      "name": "Big Country",
      "playcount": 3338774,
      "similar_artists": [
        {
          "name": "The Skids",
          "url": "https://www.last.fm/music/The+Skids"
        },
        {
          "name": "The Alarm",
          "url": "https://www.last.fm/music/The+Alarm"
        },
        {
          "name": "Simple Minds",
          "url": "https://www.last.fm/music/Simple+Minds"
        },
        {
          "name": "The Fixx",
          "url": "https://www.last.fm/music/The+Fixx"
        },
        {
          "name": "China Crisis",
          "url": "https://www.last.fm/music/China+Crisis"
        }
      ],
      "tags": [
        "new wave",
        "80s",
        "rock",
        "Scottish",
        "alternative"
      ],
      "url": "https://www.last.fm/music/Big+Country"
    },
    "spotify": {
      "followers": 257222,
      "genres": [
        "new wave",
        "celtic rock"
      ],
      "id": "1h8YIw9HLr6E8gdXVDRbVJ",
      "images": [
        {
          "height": 681,
          "url": "https://i.scdn.co/image/9da85bf614f13433da4c789d13e815f664430809",
          "width": 1000
        },
        {
          "height": 436,
          "url": "https://i.scdn.co/image/02210504df6db274a954c4ed9a86a550efd61c23",
          "width": 640
        },
        {
          "height": 136,
          "url": "https://i.scdn.co/image/be6fc1f7f692f493e48af29dd607f51f572051c5",
          "width": 200
        },
        {
          "height": 44,
          "url": "https://i.scdn.co/image/9fa13f5625d2493655f33f4e416059ceb50df317",
          "width": 64
        }
      ],
      "name": "Big Country",
      "popularity": 51,
      "url": "https://open.spotify.com/artist/1h8YIw9HLr6E8gdXVDRbVJ"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Big Country comprised Stuart Adamson (formerly of The Skids, vocals/guitar/keyboards), Bruce Watson (guitar/mandolin/sitar/vocals), Tony Butler (bass guitar/vocals) and Mark Brzezicki (drums/percussion/vocals). Before the recruitment of Butler and Brzezicki an early incarnation of Big Country was a five-piece band, featuring Peter Wishart (later of Runrig and now an SNP MP) on keyboards, his brother Alan on bass, and Clive Parker, drummer from Spizz Energi / Athletico Spizz '80 (Rough Trade & A&M Records). Parker had approached Adamson to join his new band after the demise of The Skids. Adamson auditioned Parker (1980) at The Members rehearsal room in Ladbroke Grove, London, and the next day was called on to play drums on demos for CBS Records at their Whitfield Street studios. The demos were produced by Adam Sieff and just featured Adamson, Parker, with scarcely a contribution from Watson. Adamson had asked bassist Dave Allen from the Gang of Four to join the band but he declined. Adamson asked Parker to join the band, which led to 8 months of rehearsal in Dunfermline in a disused furniture warehouse. The culmination was a successful concert at the Glen Pavilion at Dunfermline, (playing to a home crowd, mainly Skids fans), and an interview with BBC Radio Scotland where the CBS Studio demos were utilised. What followed were live dates with Alice Cooper's Special Forces tour in 1982. The band appeared out of their depth with their rambling Echo & The Bunnymen-keyboard oriented-sound which went down badly with the metal crowds. Thus the band was dumped from the tour after only two gigs at The Brighton Centre  and Birmingham Odeon. Adamson's management issued an ultimatum and the Wisharts and Parker were sacked. Adamson later asked Peter Wishart to rejoin on keyboards, but Peter declined without his brother in the band. Parker formed the synth pop band Scary Thieves, and signed to EMI Records, and later went on to play session drums for ex-Jesus and Mary Chain member John Moore in The Expressway, (Polydor Records) touring the UK and USA. Alan Wishart later joined Parker in contemporary folk band Barra (Sony/ATV Music/Hi-Note Records). The manager Ian Grant brought in Brzezicki, and Butler, and along with Watson, the classic line-up was formed. Although the band's music drew from Scottish traditional music, none of its members were born in Scotland. Adamson grew up in Dunfermline though, and his family was of Scottish descent, so to that extent his Scottish accent was genuine.\n\nTheir first single was \"Harvest Home\", recorded and released in 1982. It was a modest success, reaching No. 91 on the UK Singles Chart. Their next single was 1983's \"Fields of Fire\", which reached the UK's Top Ten and was rapidly followed by the album The Crossing. The album was a hit in the United States (reaching the US Billboard Top 20), powered by \"In a Big Country\", their only U.S. Top 40 hit single. The song featured heavily engineered guitar playing, strongly reminiscent of bagpipes; Adamson and fellow guitarist, Watson, achieved this through the use of the MXR Pitch Transposer 129 Guitar Effect. Also contributing to the band's unique sound was their use of the e-bow, a device which allows a guitar to sound more like strings or synthesizer. The Crossing sold over a million copies in the UK and obtained gold record status (sales of over 500,000) in the U.S. The band also performed on both the Grammys and Saturday Night Live.\n\nThe band released the non-LP extended play single \"Wonderland\" in 1984 while undergoing a lengthy worldwide tour. The song, considered by some critics to be one of their finest, was a Top Ten hit (No. 8) in the UK singles chart but despite heavy airplay and a positive critical response, was a comparative flop in the U.S., reaching only No. 86 on the Billboard Hot 100. It was the last single by the band to make a U.S. chart appearance.\n\nTheir second album Steeltown (1984) was a hit as soon as it was released, entering the UK Albums Chart at number one. The album featured three UK top 30 hit singles, and received considerable critical acclaim on both sides of the Atlantic, but like Wonderland (and, in fact, all subsequent releases) it was a commercial disappointment in the U.S, peaking at No. 70 on the Billboard album charts.\n\nThroughout 1984 and 1985, the band toured the UK, Europe, and, to a lesser extent, the U.S., both as headliners themselves and in support of such artists as Queen and Roger Daltrey. They also recorded prolifically, and provided the musical score to a Scottish independent film, Restless Natives (1985), which was not released on CD until years later on the band's Restless Natives and Rarities (1998) collection.\n\n1986's The Seer, the band's third album, was another big success in the UK, peaking at Number 2. It produced three further Top 30 singles, including the Irish number one hit \"Look Away\", which would also prove to be the band's biggest hit in the U.K., peaking at No. 7. Kate Bush provided backing vocals on the album's title track, and as was the norm for the band at the time, the album received good reviews from the music press. In the U.S., The Seer sold a little bit better than Steeltown, reaching No. 59 on the Billboard charts.\n\nIn what some critics felt was an apparent attempt to regain their dwindling U.S. following, Big Country used producer Peter Wolf for their next album, Peace in Our Time (1988), which was recorded in Los Angeles. It reached No. 9 in the UK Album chart, but sold poorly in the United States. During the \"Peace In Our Time\" Tour, the band were supported by Diesel Park West and Cry Before Dawn.\nThe 1990s\n\nNo Place Like Home (1991) not only effectively killed off the band's commercial hopes in the US, it nearly broke up the band. Drummer Mark Brzezicki returned to the studio as a session drummer after leaving the band. The album found the band trying to reinvent themselves and shift away from their '80s image. It was not a commercial success and was not released in America, although two re-recorded tracks showed up on 1993's The Buffalo Skinners.\n\nIn 1991, the band was dropped by Phonogram, the label that had released all of their material for ten years. After that, Big Country became a minor act, popping up in the lower echelons of the charts in the UK and Europe with the release of every subsequent album. Only one of these, 1993's The Buffalo Skinners, received a major label release (via Chrysalis Records), and it seemed a return to form of sorts for the band, reaching the UK Top 25. The album obtained a surprisingly enthusiastic critical response, and although it produced two UK Top 30 singles in \"Alone\" and \"Ships\", its sales were meagre and, in retrospect, it can be seen as Big Country's last, lost chance to regain a mass audience. Regardless, the band retained an intensely devoted cult following, as evidenced by their deceptively large post-1990 discography, which consists mostly of live concert recordings and singles/rarities collections.\n\nThroughout the 1990s, Big Country became a popular supporting act, supporting bands such as Rolling Stones and The Who. Big Country had backed Daltrey on his 1985 solo album Under the Raging Moon, and Tony Butler played bass and backing vocals on Pete Townshend's 1980 hit single \"Let My Love Open the Door\". Both Butler and Brzezicki performed on Townshend's 1985 solo album White City: A Novel. Brzezicki played drums for The Cult on their 1985 Love album and featured in the video for the single, \"She Sells Sanctuary\".\n\nOf growing concern was the mental and emotional health of lead singer Adamson, who reportedly had struggled with alcoholism for several years. Adamson split with his first wife, who later spoke to Scottish and English tabloids about his heavy drinking. He moved to Nashville in the mid-1990s where he took up residence and married a hairdresser. While in Nashville, he met artist Marcus Hummon and released a studio album with him under the moniker The Raphaels.\n\nIn 1995 Big Country released another album, Why the Long Face.\n\n1999 saw the release of Big Country's eighth and final studio album, Driving to Damascus (titled in its slightly different, augmented U.S. release John Wayne's Dream). Adamson said publicly that he was disappointed that the album did not fare better on the charts, which led to depression. Later that year, he disappeared for a while before resurfacing, stating that he had needed some time off.\nFarewell tour, Adamson's death\n\nAdamson returned for the band's 'Final Fling' farewell tour, culminating in a sold-out concert at Glasgow's Barrowland Ballroom on 31 May 2000. Although that marked the end of Big Country as a touring band, they were always adamant that they would appear together again. They played what turned out to be their last gig in Kuala Lumpur, Malaysia, in October that year.\n\nIn November 2001, Adamson disappeared again. Numerous appeals were put on the Big Country website asking for Adamson to call home and speak to anyone in the band, the management company, or his ex-wife. The website also requested that any fans who might have been 'harbouring' the singer to contact the management company and alert them to his whereabouts. Mark Brzezicki and Tony Butler had indicated they were concerned but the reason Big Country had lasted so long was they stayed out of one another's personal lives, and both later noted they were unaware of the extent of Adamson's problems. He was found dead in a room at the Best Western Plaza Hotel in Honolulu, Hawaii on 16 December 2001. The autopsy revealed that he had hanged himself.\n\nAt the time of death he had a blood-alcohol content of 0.279%.\n\nA memorial to Adamson was held at Dunfermline's Carnegie Hall in January 2002, followed by a tribute concert at the Barrowlands in May. It brought together the remaining members of both Big Country and The Skids; Adamson's teenage children, Callum and Kirsten; as well as Steve Harley, Runrig, Simon Townshend, Midge Ure and Bill Nelson.\n2007 reunion\n\nIn 2007, to celebrate 25 years of Big Country, founding members Bruce Watson, Tony Butler (now lead vocalist for the first time), and Mark Brzezicki reunited to embark on a tour of the UK with dates in Scotland and England and a gig in Cologne (Germany). They also released a new album, twenty five live, on the trackrecords label.\n\nAs of September 2008 the band returned to an indefinite hiatus.\n2010–11 tour\n\nThe surviving original members toured again in late December 2010 and January 2011 with Mike Peters of the Alarm and Jamie Watson, Bruce's son, added to the lineup. They played another set of concerts in April 2011. Big Country have been announced at six major UK/Irish festivals in 2011 — Isle of Wight, T in the Park, Oxegen in Kildare and V Festival (Chelmsford and Stafford), plus Inverness with Simple Minds.\n\nSteve Lillywhite, who had produced Big Country's first and second albums, produced the band's first single in over twelve years. He remarked: \"When I heard the demo of their new song, I was impressed on first listen. I am looking forward to working with the band again whom I last worked with in the 80s on one of my favourite albums I have ever produced — The Crossing.\"\n\n\"It will be a real buzz working with Steve again\", Tony Butler said in response. \"He is a producer we all have a great regard for and are looking forward to working with again. We'd also like to thank all the festival promoters for having faith in us.\"\n\nThe band will also soon announce a series of smaller dates where they will be \"breaking in\" new songs for a future release. \"These will be places we have never played before,\" Mark Brzezicki added, \"giving us the chance to work in new songs in the more intimate type of venues.”\n\nMike Peters said, \"Due to the success of the January and April tours, the band have decided to continue and have already started planning for a new album and a 30th anniversary tour in the new year.\"\n\nBruce Watson commented: \"We are 100% dedicated and intent on making this new line up a permanent one. We can finally look forward to completing unfinished business from the past, particularly internationally, and look to a creative and active future\".\n\nAround August 2011, Big Country released their first single in 11 years called \"Another Country\" with Peters on vocals.\n2012 tour\n\nIn 2012 the band have played many festivals around Europe including Hard Rock Calling in Hyde Park, The Isle of Wight Festival and Fairport's Cropredy Convention as special guests of Fairport Convention on the Saturday.\n\nOn 20 September 2012 guitarist Bruce Watson announced in the forum on the bands website that bassist Tony Butler had announced his retirement from the band during the last tour and that the remaining members of the band would not be continuing their involvement with long time manager Ian Grant. Butler's replacement in Big Country will be Derek Forbes, formerly of Simple Minds.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": "Big Country foi formado por Stuart Adamson e nasceu como uma das maiores promessas do rock escocês durante os anos 80. Seu disco de estréia, The Crossing, é considerado pela crítica como um dos melhores discos da década de 80 e faturou milhões de dólares em vendas, graças ao hit In a Big Country, mas pouca coisa se soube do grupo depois disso.\n\nStuart Adamson formou a banda em 1981, logo depois que saiu do quarteto punk The Skids. Chamou um colega de escola, Bruce Watson, para a segunda guitarra, junto com Clive Parker e Pete e Alan Wishart. Estes últimos foram substituídos rapidamente pelo baixista Tony Blutler e pelo baterista Mark Brzezicki. Conseguiram um contrato com a Polygram em 1982, por onde lançaram o primeiro single, Harvest Home. Com o single na mão, começaram a abrir os shows do The Jam, conseguindo uma visibilidade enorme, já que a banda de Paul Weller estava no auge do sucesso. Logo depois lançam um segundo single, Fields of Fire, que chega facilmente ao Top Ten britânico.\n\nThe Crossing foi lançado em 1983, e é um disco inspirado na música celta, apaixonante e idealista. O disco não chegou a ganhar o disco de platina na Inglaterra, mas levou o disco de ouro nos Estados Unidos, graças a In a Big Country, que entrou no Top 20 americano. A crítica da época amou o trabalho e no começo de 1984 o grupo lança um novo single, Wonderland, que também vai muito bem nas paradas, abrindo caminho para o segundo disco do grupo, Steeltown, que entra diretamente no primeiro posto da parada inglesa, apesar de algumas críticas negativas, que diziam que o disco era apenas uma cópia do trabalho de estréia.\n\nMas as coisas mudam, em 1986 sai o álbum The Seer, o mais fraco disco da banda até então, mas que vem com o hit Look Way, mas era pouco e o discurso político da banda parecia estar perdendo terreno para outros grupos parecidos, como U2 e o Alarm. Kate Bush participa deste disco, nos vocais de Eiledon. Dois anos depois lançam Peace in Our Time e fazer uma turnê pela União Soviética, a canção mais conhecida deste álbum é King of Emotion, que sequer entrou nas paradas americanas, apesar da grana preta gasta pela gravadora do grupo para divulgar o trabalho nos Estados Unidos. No final deste mesmo ano, Brzezicki deixa a banda, em seu lugar entra o baterista Pat Ahern. Com esta nova formação lançam o single de Save Me. Ahern dura pouco e é substituído por Chris Bell que participa de No Place Like Home, em 1991.\n\nNo Place Like Home, devido ao fracasso do disco anterior, não foi lançado nos Estados Unidos e passou batido, mas marcou a volta, pelo menos nas gravações, do baterista Brzezicki. Este trabalho foi uma tentativa de trilhar novos caminhos musicais, mas quase custou a carreira do grupo, que passou a ser comparado com o Cult e com o Duran Duran. The Bufallo Skinners, gravado com um novo baterista, Simon Phillips, se dá um pouco melhor e é lançado nos Estados Unidos, graças ao sucesso de outra banda escocesa, o Del Amitri. Este disco traz algumas músicas do trabalho anterior, que não foi lançado na terra do tio Sam. Na Inglaterra duas faixas, Alone e Ships, entram nas paradas.\n\nEm 1995 sai o sétimo disco do grupo, Why the Long Face, lançado de forma independente, já que a banda havia sido dispensada da Polygram pouco tempo antes. Este disco é a prova cabal de que a banda está à caminho do esquecimento. Why the Long Face traz um grupo perdido no meio do rock que nascia nos anos 90, como atrativo o álbum traz uma versão acústica para In a Big Country e uma cover de Lou Reed, Vicious. Neste mesmo ano, dois discos ao vivo são lançados, o primeiro BBC Live in Concert, mostra a banda em um show gravado em 1989, o álbum é considerado um marco para os fãs da banda. O outro trabalho é Without the Aind of a Safety Net, gravado em 1995. Os dois são ótimas oportunidades de se conhecer uma mesma banda em momentos totalmente distintos.\n\nNo ano seguinte lançam outro trabalho ao vivo, Eclectic, um disco acústico, considerado péssimo pela crítica. Nenhum dos grandes hits da banda estão presentes, apenas King of Emotion, e vários covers aparecem como os feitos para Eleanor Rigby (Beatles), I´m on Fire (Bruce Springsteen) e Ruby Tuesdaey (Stones), entre outras faixas obscuras do próprio Big Country. Logo após o lançamento de Eclectic, Adamson muda-se para Nashville e o Big Country ganha férias forçadas. Nesse meio tempo outros discos ao vivo da banda são lançados com destaque para King Biscuit Flower Hour, uma gravação de um show de ano novo, gravado em 1983. E algumas coletâneas aparecem, a melhor é Restless Natives & Rarities, com raridades e os lado b dos singles já lançados pelo grupo.\n\nApenas em 1999 um novo disco de estúdio é lançado. Driving to Damascus, puxado pelo single Somebody Else, co-escrito por Adamson e Ray Davies, vocalista do Kinks. O disco nada acrescenta a carreira da banda, e, para complicar, Adamson, graças a problemas com alcoolismo, é obrigado a se retirar no meio da turnê de lançamento do trabalho. Em 2000 ele lança o Nashville Album, com apenas seis músicas, muito influenciadas pelo blues e pelo country que é marca registrada da cidade. O disco vem com a regravação de Chance e Look Away. No mesmo ano é lançado Come Up Screaming, disco ao vivo com músicas de toda a carreira da banda.\n\nNo dia 6 de dezembro de 2001, Stuart Adamsom foi encontrado morto em um hotel no Havaii. Poucas semanas antes, ele havia sido dado como desaparecido em Nashiville, onde morava.\n\nAntes da morte de Stuart, o grupo lança Undercover, que, como o nome diz, é recheado de covers de Roxy Music, Bruce Springsteen, Rolling Stones, David Bowie, Al Green e Beach Boys.\n\nEm 2002, o baixista do grupo, Tony Butler, remixa o álbum Driving to Damascus e o lança, mundialmente, com o nome de John Wayne´s Dream. O disco é considerado um dos melhores trabalhos do grupo, mas, infelizmente, seu líder, Adamson, não viveu para ver o reconhecimento deste álbum.\n\nPor Valdir Antonelli",
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1981",
      "country": "Dunfermline, Scotland",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "www.facebook.com/inabigcountry",
      "formed_year": "1981",
      "gender": "Male",
      "genre": "Rock",
      "id": "113789",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/qchex21638974978.jpg",
          "width": 1000
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/sruvuy1355681737.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/big-country-502ec07b502ed.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "4",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "b4013ff1-d7ce-4b1a-af6e-e0b19ca7f378",
      "name": "Big Country",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": "www.bigcountry.co.uk"
    }
  },
  "spotify_id": "1h8YIw9HLr6E8gdXVDRbVJ",
  "spotify_url": "https://open.spotify.com/artist/1h8YIw9HLr6E8gdXVDRbVJ",
  "updated_at": "2025-07-08T20:55:34.212392",
  "wikipedia_url": null
}