{
  "apple_music_id": "552740",
  "apple_music_url": "https://music.apple.com/gb/artist/howard-jones/552740",
  "biography": "Howard Jones is a English musician, singer and songwriter. According to the Guinness Book of British Hit Singles & Albums, \"Jones is an accomplished singer-songwriter who was a regular chart visitor in the mid-1980s with his brand of synthpop. Jones, who was equally popular in the U.S., appeared at Live Aid\". Allmusic journalist, Stephen Thomas Erlewine adds, \"Jones was one of the defining figures of mid-1980s synthpop. His music merged the technology intensive sound of New Wave with the cheery optimism of hippies and late 1960s pop. Jones racked up a string of hits in the mid and late 1980s, before he retreated into being a cult figure in the 1990s\". \nJohn Howard Jones is the eldest of four boys (Howard's brothers, Roy, Martin, and Paul, were all musicians and had their own band, called Red Beat, in the late 1970s and early 1980s). Born in Southampton to Welsh parents, he spent his early years growing up in Rhiwbina, Cardiff, South Wales where he attended Heol Llanishen Fach primary school, and then Whitchurch Grammar School; and later in Stokenchurch, near High Wycombe, Buckinghamshire, where he attended the Royal Grammar School. Jones took piano lessons from the age of seven, and when he was a teen, his family had relocated to Canada, which is where he joined his first band, a progressive rock group called Warrior. Eventually, Jones moved back to the United Kingdom, where he played in a number of different groups. He then spent a year at the Royal Northern College of Music in Manchester. \nJones appeared as a solo artist in local venues in High Wycombe, before inviting the mime artist Jed Hoile, who used to do improvised choreography, whilst doused in white paint, as Jones played behind him. In 1983, Jones hired the Marquee Club in London and invited record labels to come and see him perform. After a BBC Radio 1 session, he obtained support slots with China Crisis and OMD before signing to WEA in the UK and Elektra in the US in mid 1983. \nHis first single called \"New Song\" was released in September 1983 and reached the UK Top 5 and US Top 30. He made his debut performance on BBC Television's Top of the Pops in October 1983, and he watched his tape-delayed performance on a borrowed television resting on an ironing board before a concert at the University of Kent. He subsequently had four more hits over the next twelve months and a UK Number 1 album, Human's Lib, which eventually went double platinum. Credited with jointly writing the lyrics for six songs on the album was the lyricist Bill Bryant. Thanks to repeated exposure on MTV, the album became a moderate hit in the US. Later in 1984, \"New Song\" and \"What Is Love\" became American Top 40 hits, while \"Pearl in the Shell\" became his third UK Top 10 single. Human's Lib went gold and platinum in a number of countries. Jones had developed a loyal teen following, and his mother and father, Thelma and John Jones, ran his fan club. \nIn the summer of 1984, he released \"Like to Get to Know You Well\", which he said was 'dedicated to the original spirit of the Olympic Games'. Although it was not an official Olympic anthem for the Games in Los Angeles that summer, it was a worldwide hit. It reached Number 4 in the UK Singles Chart. The sleeve featured the song title in ten different languages; while Jones sang the title line in French and German on the extended 12\" version. The song also appeared in the film Better Off Dead (1985) and the computer game Grand Theft Auto: Vice City Stories (2006).\nJones' second long player was a remix album. It contained six songs, all but one of which had been previously released, but which appeared in elongated formats, including the multilingual version of \"Like to Get to Know You Well\". The record sleeve for The 12 Inch Album, featured a miniature Jones standing next to a 12-inch ruler. The album went gold in the UK.\nIn 1985, Jones released his second studio album, Dream into Action. He introduced his own backing band, including the female backing vocalist trio, Afrodiziak. Afrodiziak featured Caron Wheeler and Claudia Fontaine. Playing bass guitar was Jones' own brother, Martin. He had to have an extra string added to his instrument to play some of the bass lines, which had originally been played on a keyboard. One of the singles released from this album, \"No One Is to Blame\", was later re-recorded and featured Phil Collins as drummer and producer. Dream into Action was a worldwide hit and Jones' most successful album, reaching number 2 in the UK and number 10 in the US, staying on the US chart for almost a year. The album spawned the hit singles \"Things Can Only Get Better\", \"Life In One Day\", and \"Look Mama\". In July 1985, Jones performed at Wembley Stadium as part of the Live Aid concert, singing his 1984 hit \"Hide and Seek\" while playing a piano belonging to Freddie Mercury. He also embarked on a world tour reaching Japan, Australia and the US.\nIn the spring of 1986 in the US, he released Action Replay, an EP of remixes that featured a new version of \"No One Is to Blame\". It became Jones' biggest US hit, peaking at number 4. However, by this time, Jones' fortunes were changing in his native UK and \"No One Is To Blame\" peaked at number 16. His next single, \"All I Want\", peaked at number 35, and would be his last UK Top 40 hit. Jones released his third studio album, One To One, in October 1986, which peaked at number 10 in the UK and would be his last UK hit album, despite going gold there.  Stateside, however, Jones continued to fill large arenas and the single \"You Know I Love You Don't You?\" went top twenty in 1986 on the Billboard charts.\nIn June 1988, Jones performed at Amnesty International's Festival of Youth at the Milton Keynes Bowl. Jones' subsequent albums Cross That Line (1989) and In the Running (1992) both performed poorly in the UK, the latter even failing to chart there. However,he had further hits on the Billboard charts in the US during this period, including \"Everlasting Love\" (1989, his second number 1 hit on the US Hot Adult Contemporary Tracks chart after \"No One Is to Blame\"), \"The Prisoner\" (1989), and \"Lift Me Up\" (1992). \n\nJones continued to play large venues in the US during the late 1980s, and the Cross That line tour played major outdoor venues in the US, during 1989. With his ten-year tenure on the Warner music label at an end, a greatest hits compilation The Best of Howard Jones was released in 1993. The album peaked at number 36 in the UK, and by 2005 (12 years after its release) it was certified silver by the BPI for over 60,000 copies sold in the UK.\n\nJones also had success as a songwriter for other artists in the early 1990s. He co-wrote the dance music hits \"Heaven Give Me Words\" and \"Your Wildlife\" with the members of Propaganda. The tracks appeared on the 1990 album 1234; \"Heaven Give Me Words\" reached number 22 on the Adult Contemporary chart and \"Your Wildlife\" reached number 22 on the Dance Music/Club Play Singles chart.\nAfter Jones' contract with Warner Music UK expired, he concentrated on production, songwriting and running a successful vegetarian restaurant called 'Nowhere' (originally at 11 Waverly Place, New York City). He started his own record label, Dtox, releasing a number of albums through the label, such as Working in the Backroom, produced in his own recording studio ('The Shed'). The album, which sold over 20,000 copies in the first year of release, was made available only at concerts and through his official website.\nFor the next two years, Jones continually toured the US and Europe. In 1996, he released Live Acoustic America and People followed two years later.\nThe track \"If You Love\", was featured on the soundtrack to the TV series Party of Five. Jones continued to produce and write for a number of artists during the mid to late 1990s, including Martin Grech, DBA, and Sandie Shaw. In 2001, Jones played keyboards for Ringo Starr on his All Starr Band tour.\nOn 20 September 2003, Jones played a 20th anniversary concert at the Shepherds Bush Empire, London, commemorating the release of his first single. He was joined by Midge Ure and Nena, as well as his mime artist, Jed Hoile. A recording of this concert was later released on DVD. Jones continued to tour and write new music, collaborating with Robbie Bronnimann to co-write and co-produce music for Sugababes, and Jones' own 2005 album Revolution of the Heart. He toured playing gigs in the United States, Italy, Germany and Sweden and played a number of times at the Edinburgh Festival in 2006. The same year Jones provided a vocal for the song \"Into the Dark\" by Ferry Corsten for the latter's album, L.E.F. Jones also re-recorded \"Things Can Only Get Better\" in Simlish, the fictional language spoken by characters in Electronic Arts', The Sims 2. Jones was also featured on Katrina Carlson's cover of \"No One Is to Blame\", which entered the US Hot Adult Contemporary Tracks chart in 2007. \nIn October 2006, Jones released \"Building Our Own Future\" as a podsafe track, as one of several established artists looking to use podcasts as a new means of promoting their music and tours. The song debuted at number 1 on the PMC Top10 on 29 October 2006 and spent four weeks at the top of the chart. Howard's track \"Revolution of the Heart\" spent five weeks at number 1 on the PMC Top10 during 2007 and finished the year as the number 2 song in their annual countdown.\n\nJones embarked on an acoustic tour of Australia in 2007, beginning in Brisbane and concluding on 5 April in Perth. The Revolution Remixed & Surrounded album was followed in November by Live in Birkenhead. Jones performed another acoustic set, with other 1980s acts at the Retrofest, on 1 September 2007 at Culzean Castle in Ayrshire, Scotland. Jones also went into the studios with The Young Punx to record vocals for their summer 2008 release, \"And The Feel Goes On\".\n\nJones is a member of Sōka Gakkai International, and is musical director of one of its choirs, the Glorious Life Chorus. The chorus performs some of his songs in its repertoire, including \"Building Our Own Future\" and \"Respected\". He returned to Australia again in 2009, this time accompanied by vocalist Laura Clapp and music technologist Robbie Bronnimann. On 26 February 2009, Jones was at the UK premiere of Roland's new V-Piano in Bristol, and performed \"Hide and Seek\". He continues to tour, and played the 'Big Hair Affair 2009' on 1 August 2009 at the Ryedale Arena, Pickering, North Yorkshire.\nHis latest album, Ordinary Heroes was released in November 2009, and he toured London, Cardiff and Manchester with a string section and the Morriston Orpheus Choir (in St David's Hall in Cardiff). A single, \"Soon You'll Go\", preceded the album's launch.\n\nOn 29 November 2011, a UK tour was announced. Human's Lib and Dream Into Action were performed in April 2012 across eight venues. A weekly radio series coincided with tour called Electronic 80s with Howard Jones on Absolute Radio.\n\nHe recently appeared in \"The Song That Changed My Life\" on BYUtv, the cable station for Brigham Young University focusing on programming relating to the Church of Jesus Christ of Latter-day Saints. \nHe is a member of the board of directors for the Featured Artists Coalition. Jones currently lives in Creech St Michael, near Taunton, Somerset.",
  "country": null,
  "created_at": "2025-07-05T16:38:55.809314",
  "discogs_id": "40360",
  "discogs_url": "https://www.discogs.com/artist/40360-Howard-Jones",
  "followers": 448491,
  "formed_date": null,
  "genres": [
    "Pop",
    "new wave",
    "synthpop",
    "80s",
    "pop",
    "synth pop",
    "Rock/Pop"
  ],
  "id": "howard-jones-1751729936",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music112/v4/db/17/08/db1708be-f35a-113e-b906-2acab4d233a3/pr_source.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb81c1534a3a9cf64fd6deb02f",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000517481c1534a3a9cf64fd6deb02f",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f17881c1534a3a9cf64fd6deb02f",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/jones-howard-50fbc0fcc99a1.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/howard-jones-4f3a82bb3bd83.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/jones-howard-51c692c8f2609.jpg",
      "width": 1920
    },
    {
      "height": 185,
      "type": "banner",
      "url": "https://www.theaudiodb.com/images/media/artist/banner/jones-howard-580739732907c.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/eagu1h1710879537.png",
      "width": 400
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/jQjdwHDDVwFh0-_CH3pF4L844znDBVluyhR3n3XIIS8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "72448711-5c5c-4b45-a607-99336456029a",
  "lastfm_url": "https://www.last.fm/music/Howard+Jones",
  "local_images": {
    "hi-res": "../public/artist/howard-jones/howard-jones-hi-res.jpg",
    "medium": "../public/artist/howard-jones/howard-jones-medium.jpg",
    "small": "../public/artist/howard-jones/howard-jones-small.jpg"
  },
  "name": "Howard Jones",
  "popularity": 53,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='552740', url='https://music.apple.com/gb/artist/howard-jones/552740', name='Howard Jones', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Music112/v4/db/17/08/db1708be-f35a-113e-b906-2acab4d233a3/pr_source.png/2000x2000bb.jpg', genres=['Pop'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '552740', 'type': 'artists', 'href': '/v1/catalog/gb/artists/552740', 'attributes': {'name': 'Howard Jones', 'genreNames': ['Pop'], 'artwork': {'width': 891, 'height': 891, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Music112/v4/db/17/08/db1708be-f35a-113e-b906-2acab4d233a3/pr_source.png/{w}x{h}bb.jpg', 'bgColor': '001303', 'textColor1': '869cef', 'textColor2': '719cef', 'textColor3': '6b80c0', 'textColor4': '5b80c0'}, 'url': 'https://music.apple.com/gb/artist/howard-jones/552740'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/552740/albums', 'next': '/v1/catalog/gb/artists/552740/albums?offset=25', 'data': [{'id': '1765620273', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1765620273'}, {'id': '1768100787', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1768100787'}, {'id': '1765552095', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1765552095'}, {'id': '1765552735', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1765552735'}, {'id': '1766765246', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1766765246'}, {'id': '1765607223', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1765607223'}, {'id': '1452896905', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1452896905'}, {'id': '1760579324', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1760579324'}, {'id': '1760579189', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1760579189'}, {'id': '1641371270', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1641371270'}, {'id': '1764364415', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1764364415'}, {'id': '1766775064', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1766775064'}, {'id': '1765603558', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1765603558'}, {'id': '1765167225', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1765167225'}, {'id': '1764332125', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1764332125'}, {'id': '1491995807', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1491995807'}, {'id': '1762061394', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1762061394'}, {'id': '1445904257', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1445904257'}, {'id': '1615460600', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1615460600'}, {'id': '1760005342', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1760005342'}, {'id': '1542586311', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1542586311'}, {'id': '1540572464', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1540572464'}, {'id': '1765170610', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1765170610'}, {'id': '1775933545', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1775933545'}, {'id': '1773385150', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1773385150'}]}}})",
    "discogs": {
      "cover_image": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "40360",
      "images": [
        {
          "height": 750,
          "resource_url": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/jQjdwHDDVwFh0-_CH3pF4L844znDBVluyhR3n3XIIS8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 501,
          "resource_url": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/n-2rXmGGKct6eITmdNkkZxcHOcGqKECrwwT9Tj6Px0Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
          "width": 500
        },
        {
          "height": 622,
          "resource_url": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/Zxr5I0VaUU-m5vtNiXUEgQqbeQIMSWX4zz5QOXCGHFs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 366,
          "resource_url": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/fiAun-qn5Ecfcz-LUOpEOweOqPjzmUbsA_Q34bLxEHQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
          "width": 243
        },
        {
          "height": 247,
          "resource_url": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
          "uri150": "https://i.discogs.com/FdVlXEUeHSi3SRi8F92-MOAiYC2ezQwixxQbwo1ASLE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
          "width": 200
        },
        {
          "height": 174,
          "resource_url": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
          "uri150": "https://i.discogs.com/CjAqqmBHusBNXL0yUR5iJJQMYBJ5zQV_ipPMJ-_nDho/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
          "width": 155
        },
        {
          "height": 599,
          "resource_url": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
          "uri150": "https://i.discogs.com/cRuxTzi50Mu8LpWYHTmuhjVHhy3wEWAmR_-x7GvYfec/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
          "width": 598
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
          "uri150": "https://i.discogs.com/Dy-kLlSRygr5yv6ws7qKaHlb5Z9llAEakpqF7FvZ2sc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
          "width": 411
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/MGJ6xW1QhebzAvDGVIaMbhgr5L3r1taN9MNLlEHGphU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 544,
          "resource_url": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Mz639QajsDpBD2t1BT5PHX9CKWrzQPXqozAhOdqOBuA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
          "width": 282
        },
        {
          "height": 650,
          "resource_url": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Gz3mIQv5lgIMQhEYEU5fFs8pmmsbNIvoVVq1Ylnh5Bc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
          "width": 266
        },
        {
          "height": 615,
          "resource_url": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/HbpU9W_vFIYoRjKguJYpTQ2grv0g2yIlWsUqwdSuwbU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
          "width": 460
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/HZ5ovdJyb_7sC0HAh7HAspLnf3RO1pdf3sJSwOFoO70/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
          "width": 348
        },
        {
          "height": 437,
          "resource_url": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/UX85FyOnHhReFs8n79FL8buO-2Hsw2HpcymCjXXrbfY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
          "width": 454
        }
      ],
      "members": [],
      "name": "Howard Jones",
      "namevariations": [
        "H Jones",
        "H. Jones",
        "H.J.",
        "H.Jones",
        "HJ",
        "HoJo",
        "Howard",
        "Howardjones.",
        "Jhones",
        "Jones",
        "Jones, J.H.",
        "Хауърд Джоунс",
        "ハワード・ジョーンズ",
        "허워드 존스"
      ],
      "profile": "Classically-trained pianist turned synthpop star, born February 23, 1955, Southampton. He's a singer/songwriter, musician and producer. He signed with WEA June 24th, 1983 and enjoyed ten Top 40 hit singles in the UK during 1983-86, including six which reached the top ten. His 1984 album \"Human's Lib\" went to number one, while the follow up \"Dream Into Action\" reached number two a year later. He continues to tour and record new material.  Brother of [a695303].",
      "raw_data": {
        "data_quality": "Correct",
        "groups": [
          {
            "active": true,
            "id": 399297,
            "name": "Man Doki Soulmates",
            "resource_url": "https://api.discogs.com/artists/399297",
            "thumbnail_url": "https://i.discogs.com/9-sYzRTV7jBdBtZ9KAp5cbmi-7dI_q6m13BkeqYT0OA/rs:fit/g:sm/q:40/h:431/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5OTI5/Ny0xNTc0NzM5NTU5/LTQ5NTcuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 673799,
            "name": "The Amnesty Allstars",
            "resource_url": "https://api.discogs.com/artists/673799",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 1232899,
            "name": "Midge Ure All Star Band",
            "resource_url": "https://api.discogs.com/artists/1232899",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 3527728,
            "name": "The Conspirators (2)",
            "resource_url": "https://api.discogs.com/artists/3527728",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 5152877,
            "name": "A∀A∀A",
            "resource_url": "https://api.discogs.com/artists/5152877",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 6030966,
            "name": "Warrior (18)",
            "resource_url": "https://api.discogs.com/artists/6030966",
            "thumbnail_url": "https://i.discogs.com/Smli0CMkwvzxx9wD7F4V152gQw072XXfYEkPA7USl7c/rs:fit/g:sm/q:40/h:415/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYwMzA5/NjYtMTUzNDgzNDk2/OC00MzE2LmpwZWc.jpeg"
          }
        ],
        "id": 40360,
        "images": [
          {
            "height": 750,
            "resource_url": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/jQjdwHDDVwFh0-_CH3pF4L844znDBVluyhR3n3XIIS8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 501,
            "resource_url": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/n-2rXmGGKct6eITmdNkkZxcHOcGqKECrwwT9Tj6Px0Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
            "width": 500
          },
          {
            "height": 622,
            "resource_url": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/Zxr5I0VaUU-m5vtNiXUEgQqbeQIMSWX4zz5QOXCGHFs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 366,
            "resource_url": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/fiAun-qn5Ecfcz-LUOpEOweOqPjzmUbsA_Q34bLxEHQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
            "width": 243
          },
          {
            "height": 247,
            "resource_url": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
            "uri150": "https://i.discogs.com/FdVlXEUeHSi3SRi8F92-MOAiYC2ezQwixxQbwo1ASLE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
            "width": 200
          },
          {
            "height": 174,
            "resource_url": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
            "uri150": "https://i.discogs.com/CjAqqmBHusBNXL0yUR5iJJQMYBJ5zQV_ipPMJ-_nDho/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
            "width": 155
          },
          {
            "height": 599,
            "resource_url": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
            "uri150": "https://i.discogs.com/cRuxTzi50Mu8LpWYHTmuhjVHhy3wEWAmR_-x7GvYfec/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
            "width": 598
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
            "uri150": "https://i.discogs.com/Dy-kLlSRygr5yv6ws7qKaHlb5Z9llAEakpqF7FvZ2sc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
            "width": 411
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/MGJ6xW1QhebzAvDGVIaMbhgr5L3r1taN9MNLlEHGphU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 544,
            "resource_url": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Mz639QajsDpBD2t1BT5PHX9CKWrzQPXqozAhOdqOBuA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
            "width": 282
          },
          {
            "height": 650,
            "resource_url": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Gz3mIQv5lgIMQhEYEU5fFs8pmmsbNIvoVVq1Ylnh5Bc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
            "width": 266
          },
          {
            "height": 615,
            "resource_url": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/HbpU9W_vFIYoRjKguJYpTQ2grv0g2yIlWsUqwdSuwbU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
            "width": 460
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/HZ5ovdJyb_7sC0HAh7HAspLnf3RO1pdf3sJSwOFoO70/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
            "width": 348
          },
          {
            "height": 437,
            "resource_url": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/UX85FyOnHhReFs8n79FL8buO-2Hsw2HpcymCjXXrbfY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
            "width": 454
          }
        ],
        "name": "Howard Jones",
        "namevariations": [
          "H Jones",
          "H. Jones",
          "H.J.",
          "H.Jones",
          "HJ",
          "HoJo",
          "Howard",
          "Howardjones.",
          "Jhones",
          "Jones",
          "Jones, J.H.",
          "Хауърд Джоунс",
          "ハワード・ジョーンズ",
          "허워드 존스"
        ],
        "profile": "Classically-trained pianist turned synthpop star, born February 23, 1955, Southampton. He's a singer/songwriter, musician and producer. He signed with WEA June 24th, 1983 and enjoyed ten Top 40 hit singles in the UK during 1983-86, including six which reached the top ten. His 1984 album \"Human's Lib\" went to number one, while the follow up \"Dream Into Action\" reached number two a year later. He continues to tour and record new material.  Brother of [a695303].",
        "realname": "John Howard Jones",
        "releases_url": "https://api.discogs.com/artists/40360/releases",
        "resource_url": "https://api.discogs.com/artists/40360",
        "uri": "https://www.discogs.com/artist/40360-Howard-Jones",
        "urls": [
          "https://www.howardjones.com",
          "http://www.howardjones.com/",
          "https://www.facebook.com/howardjones",
          "https://en.wikipedia.org/wiki/Howard_Jones_(British_musician)",
          "https://www.youtube.com/user/howardjonesmusic"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/40360",
      "thumb": "https://i.discogs.com/jQjdwHDDVwFh0-_CH3pF4L844znDBVluyhR3n3XIIS8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/40360-Howard-Jones",
      "urls": [
        "https://www.howardjones.com",
        "http://www.howardjones.com/",
        "https://www.facebook.com/howardjones",
        "https://en.wikipedia.org/wiki/Howard_Jones_(British_musician)",
        "https://www.youtube.com/user/howardjonesmusic"
      ]
    },
    "lastfm": "ArtistLastFmData(name='Howard Jones', url='https://www.last.fm/music/Howard+Jones', mbid='72448711-5c5c-4b45-a607-99336456029a', listeners=467690, playcount=4022799, bio_summary='Howard Jones (born John Howard Jones on February 23, 1955) is an English singer and songwriter.\\n\\nHe is the eldest of three boys. His birthplace is Southampton, England, and he spent his early years in High Wycombe in Buckinghamshire, and attended the Royal Grammar School. He now lives with his family in Somerset, England.\\n\\nWhen he was young, he used to give piano lessons. One of his clients was a girl named Jan Smith, who he later married. Whilst working with her, a vehicle crashed into their van, injuring Jan. <a href=\"https://www.last.fm/music/Howard+Jones\">Read more on Last.fm</a>', bio_content='Howard Jones (born John Howard Jones on February 23, 1955) is an English singer and songwriter.\\n\\nHe is the eldest of three boys. His birthplace is Southampton, England, and he spent his early years in High Wycombe in Buckinghamshire, and attended the Royal Grammar School. He now lives with his family in Somerset, England.\\n\\nWhen he was young, he used to give piano lessons. One of his clients was a girl named Jan Smith, who he later married. Whilst working with her, a vehicle crashed into their van, injuring Jan. She claimed compensation and used the money to buy Howard a synthesiser, a Moog Prodigy. The shop delivered two by mistake, and Howard liked the combination of the two so much that he paid for the extra one.\\n\\nHe hit the charts in 1983 with a song called \"New Song,\" which made it into the UK top ten. Speaking with Songfacts, Jones explained the song is his manifesto, and why he wanted to get in the music business and write songs to begin with. Said Jones: \"I was working in the factory at the time - I was doing the gigs at night and I was working in the factory. And I wanted to say to people, \\'You can. It is possible to do what you really want to do if you\\'ve got enough guts and determination. You can do what you\\'re really good at in this life if you set your mind to it.\\' And so really that\\'s what that song\\'s about. It\\'s about letting go of fear and seeing both sides of an argument and throwing off the things that hold you back mentally.\"\\n\\nJones subsequently had three more hits over the next twelve months and a UK Number 1 album, Human\\'s Lib. He acquired a hardcore fanbase made up of both starstruck teenagers and more mature music lovers, who saw the musicianship which went into the electronic sounds of his songs. His mother ran his fan club. Jones was a close temporal and stylistic contemporary of Nik Kershaw, and the two musicians were often conflated in the affections of the contemporary pop audience.\\n\\nHoward was known as a respectable face of pop, combining innovative synthesiser music with strong feelings on animal rights and life\\'s excesses. In his early days, he performed with a mime artist called Jed Hoile, who used to do improvised choreography while doused in white paint as Howard played behind him.\\n\\nIn the summer of 1984, he released a single called \"Like To Get To Know You Well\", which he said was \\'dedicated to the original spirit of the Olympic Games\\'. Although it wasn\\'t an official Olympic anthem for the Games in Los Angeles that summer, it caught on and was a huge worldwide hit. The sleeve featured the song title in ten different languages; while Howard sang the title line in French and German on the extended version. The song appeared in the film Better Off Dead.\\n\\nHoward\\'s second album was a ground breaking \\'remix\\' album. It contained six songs, all but one of which had been previously released, but which appeared in elongated formats, including the multi-lingual version of \"Like To Get To Know You Well\". The album was called The 12 Inch Album and the sleeve featured a miniature Howard standing next to a 12-inch ruler.\\n\\nWhen he released his second studio album, Dream Into Action, in 1985, he introduced his own backing band, including future Soul II Soul singer Caron Wheeler as one third of female backing vocal trio Afrodiziak. Playing bass guitar, meanwhile, was Howard\\'s own brother Martin, who had to have an extra string added to his instrument to play some of Howard\\'s bass lines, which were originally played on a keyboard without regard for the range of a real bass guitar. One of the singles released from this album, \"No One Is To Blame\", was later re-recorded and featured Phil Collins as drummer and producer.\\n\\nIn July 1985, Howard performed at Wembley Stadium as part of the Live Aid concert, singing his 1984 hit \"Hide And Seek\" while playing a piano belonging to Freddie Mercury.\\n\\nHoward had his last UK Top 40 hit in 1986 and thereafter concentrated on production, songwriting and running a successful vegetarian restaurant, though he had Billboard Top 10 success in the States in the 1990s. His eldest son, Oisín (pronounced Osheen), was born in 1985 and is now an actor.\\n\\nIn 2005, he competed on the American TV show Hit Me Baby One More Time, losing to Irene Cara. Although he lost the in-studio vote to Cara, he won the online poll vote.\\n\\nThere are other artists with the same name:\\n\\n2. Howard Jones is the current lead singer of American metalcore bands Killswitch Engage and Blood Has Been Shed.\\n\\nJones resides in Connecticut. His first success was in Connecticut with the band Blood Has Been Shed. After the release of The Novella of Uriel, the band went on tour, but Jones was eventually approached for a bigger project. Howard Jones replaced the lead singer of Killswitch Engage, Jesse Leach, in July of 2002, shortly after the release of Alive or Just Breathing, Killswitch Engage\\'s Roadrunner Records debut album.\\n\\nMeanwhile, Blood Has Been Shed released their third album, Spirals in 2003. Critical reviews were mixed, with some saying the album was a bit stray from the music found on I Dwell and Novella, while fans found it to be the band\\'s most sonically-challenging album yet.\\n\\nThe first time KSE fans heard Jones they were impressed by him. Later he would be heard on the song \"When Darkness Falls\", which was first released on the soundtrack for the movie Freddy vs. Jason. Finally, Killswitch Engage released their first album with Jones as the new singer, as well as Blood Has Been Shed drummer Justin Foley. The End of Heartache would spawn two successful singles, \"Rose of Sharyn\" and the Grammy-nominated title track, \"The End of Heartache\". There was a minor spot of controversy with some fans over the Grammy nomination, as the song that was picked was a remixed version that would eventually appear on the Resident Evil: Apocalypse soundtrack. The differences between the original recording and the remixed version are the fact that the song is sung in a traditional singing style rather than using the original scream track that appears on the album, and several sections of the song have been shortened for a more commercially dynamic vision.\\n\\nIn November 2006, Killswitch Engage released their fourth album (and second with Howard Jones) entitled As Daylight Dies. The album has spawned the singles \"My Curse\" and \"Arms of Sorrow\", and it has been cited by the band through numerous interviews that the album recalls influences from bands in the NOLA music scene, as well as metal bands like Pantera and Machine Head.\\n\\nDespite his front man role in Killswitch Engage, Jones is still the lead singer for Blood Has Been Shed.\\n\\nAside from singing, Jones has also taken on the role of a manager to new and upcoming artists. Currently, he manages two bands, Twelve Tribes, Mikoto, and also the producer Zeuss.\\n\\nHe is also known for his vocal styles, which include deep, booming roars, a higher, raspier scream, and operatic clean vocals. The clean style is absent from most of his work with Blood Has Been Shed, however, with Killswitch Engage, he usually makes use of all of his vocal styles in almost every song, particularly in As Daylight Dies and Holy Diver.\\n\\n3.  Howard Jones is an English folk singer and musician.  He was a member of The Electropathics  and currently performs with Albireo and as a solo performer. <a href=\"https://www.last.fm/music/Howard+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['80s', 'new wave', 'pop', 'synth pop', 'synthpop'], similar_artists=[{'name': 'Thompson Twins', 'url': 'https://www.last.fm/music/Thompson+Twins'}, {'name': 'ABC', 'url': 'https://www.last.fm/music/ABC'}, {'name': 'Nik Kershaw', 'url': 'https://www.last.fm/music/Nik+Kershaw'}, {'name': 'The Fixx', 'url': 'https://www.last.fm/music/The+Fixx'}, {'name': 'Kajagoogoo', 'url': 'https://www.last.fm/music/Kajagoogoo'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Howard Jones', 'mbid': '72448711-5c5c-4b45-a607-99336456029a', 'url': 'https://www.last.fm/music/Howard+Jones', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '1', 'stats': {'listeners': '467690', 'playcount': '4022799'}, 'similar': {'artist': [{'name': 'Thompson Twins', 'url': 'https://www.last.fm/music/Thompson+Twins', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'ABC', 'url': 'https://www.last.fm/music/ABC', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Nik Kershaw', 'url': 'https://www.last.fm/music/Nik+Kershaw', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'The Fixx', 'url': 'https://www.last.fm/music/The+Fixx', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Kajagoogoo', 'url': 'https://www.last.fm/music/Kajagoogoo', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': '80s', 'url': 'https://www.last.fm/tag/80s'}, {'name': 'new wave', 'url': 'https://www.last.fm/tag/new+wave'}, {'name': 'pop', 'url': 'https://www.last.fm/tag/pop'}, {'name': 'synth pop', 'url': 'https://www.last.fm/tag/synth+pop'}, {'name': 'synthpop', 'url': 'https://www.last.fm/tag/synthpop'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Howard+Jones/+wiki'}}, 'published': '16 Mar 2006, 23:37', 'summary': 'Howard Jones (born John Howard Jones on February 23, 1955) is an English singer and songwriter.\\n\\nHe is the eldest of three boys. His birthplace is Southampton, England, and he spent his early years in High Wycombe in Buckinghamshire, and attended the Royal Grammar School. He now lives with his family in Somerset, England.\\n\\nWhen he was young, he used to give piano lessons. One of his clients was a girl named Jan Smith, who he later married. Whilst working with her, a vehicle crashed into their van, injuring Jan. <a href=\"https://www.last.fm/music/Howard+Jones\">Read more on Last.fm</a>', 'content': 'Howard Jones (born John Howard Jones on February 23, 1955) is an English singer and songwriter.\\n\\nHe is the eldest of three boys. His birthplace is Southampton, England, and he spent his early years in High Wycombe in Buckinghamshire, and attended the Royal Grammar School. He now lives with his family in Somerset, England.\\n\\nWhen he was young, he used to give piano lessons. One of his clients was a girl named Jan Smith, who he later married. Whilst working with her, a vehicle crashed into their van, injuring Jan. She claimed compensation and used the money to buy Howard a synthesiser, a Moog Prodigy. The shop delivered two by mistake, and Howard liked the combination of the two so much that he paid for the extra one.\\n\\nHe hit the charts in 1983 with a song called \"New Song,\" which made it into the UK top ten. Speaking with Songfacts, Jones explained the song is his manifesto, and why he wanted to get in the music business and write songs to begin with. Said Jones: \"I was working in the factory at the time - I was doing the gigs at night and I was working in the factory. And I wanted to say to people, \\'You can. It is possible to do what you really want to do if you\\'ve got enough guts and determination. You can do what you\\'re really good at in this life if you set your mind to it.\\' And so really that\\'s what that song\\'s about. It\\'s about letting go of fear and seeing both sides of an argument and throwing off the things that hold you back mentally.\"\\n\\nJones subsequently had three more hits over the next twelve months and a UK Number 1 album, Human\\'s Lib. He acquired a hardcore fanbase made up of both starstruck teenagers and more mature music lovers, who saw the musicianship which went into the electronic sounds of his songs. His mother ran his fan club. Jones was a close temporal and stylistic contemporary of Nik Kershaw, and the two musicians were often conflated in the affections of the contemporary pop audience.\\n\\nHoward was known as a respectable face of pop, combining innovative synthesiser music with strong feelings on animal rights and life\\'s excesses. In his early days, he performed with a mime artist called Jed Hoile, who used to do improvised choreography while doused in white paint as Howard played behind him.\\n\\nIn the summer of 1984, he released a single called \"Like To Get To Know You Well\", which he said was \\'dedicated to the original spirit of the Olympic Games\\'. Although it wasn\\'t an official Olympic anthem for the Games in Los Angeles that summer, it caught on and was a huge worldwide hit. The sleeve featured the song title in ten different languages; while Howard sang the title line in French and German on the extended version. The song appeared in the film Better Off Dead.\\n\\nHoward\\'s second album was a ground breaking \\'remix\\' album. It contained six songs, all but one of which had been previously released, but which appeared in elongated formats, including the multi-lingual version of \"Like To Get To Know You Well\". The album was called The 12 Inch Album and the sleeve featured a miniature Howard standing next to a 12-inch ruler.\\n\\nWhen he released his second studio album, Dream Into Action, in 1985, he introduced his own backing band, including future Soul II Soul singer Caron Wheeler as one third of female backing vocal trio Afrodiziak. Playing bass guitar, meanwhile, was Howard\\'s own brother Martin, who had to have an extra string added to his instrument to play some of Howard\\'s bass lines, which were originally played on a keyboard without regard for the range of a real bass guitar. One of the singles released from this album, \"No One Is To Blame\", was later re-recorded and featured Phil Collins as drummer and producer.\\n\\nIn July 1985, Howard performed at Wembley Stadium as part of the Live Aid concert, singing his 1984 hit \"Hide And Seek\" while playing a piano belonging to Freddie Mercury.\\n\\nHoward had his last UK Top 40 hit in 1986 and thereafter concentrated on production, songwriting and running a successful vegetarian restaurant, though he had Billboard Top 10 success in the States in the 1990s. His eldest son, Oisín (pronounced Osheen), was born in 1985 and is now an actor.\\n\\nIn 2005, he competed on the American TV show Hit Me Baby One More Time, losing to Irene Cara. Although he lost the in-studio vote to Cara, he won the online poll vote.\\n\\nThere are other artists with the same name:\\n\\n2. Howard Jones is the current lead singer of American metalcore bands Killswitch Engage and Blood Has Been Shed.\\n\\nJones resides in Connecticut. His first success was in Connecticut with the band Blood Has Been Shed. After the release of The Novella of Uriel, the band went on tour, but Jones was eventually approached for a bigger project. Howard Jones replaced the lead singer of Killswitch Engage, Jesse Leach, in July of 2002, shortly after the release of Alive or Just Breathing, Killswitch Engage\\'s Roadrunner Records debut album.\\n\\nMeanwhile, Blood Has Been Shed released their third album, Spirals in 2003. Critical reviews were mixed, with some saying the album was a bit stray from the music found on I Dwell and Novella, while fans found it to be the band\\'s most sonically-challenging album yet.\\n\\nThe first time KSE fans heard Jones they were impressed by him. Later he would be heard on the song \"When Darkness Falls\", which was first released on the soundtrack for the movie Freddy vs. Jason. Finally, Killswitch Engage released their first album with Jones as the new singer, as well as Blood Has Been Shed drummer Justin Foley. The End of Heartache would spawn two successful singles, \"Rose of Sharyn\" and the Grammy-nominated title track, \"The End of Heartache\". There was a minor spot of controversy with some fans over the Grammy nomination, as the song that was picked was a remixed version that would eventually appear on the Resident Evil: Apocalypse soundtrack. The differences between the original recording and the remixed version are the fact that the song is sung in a traditional singing style rather than using the original scream track that appears on the album, and several sections of the song have been shortened for a more commercially dynamic vision.\\n\\nIn November 2006, Killswitch Engage released their fourth album (and second with Howard Jones) entitled As Daylight Dies. The album has spawned the singles \"My Curse\" and \"Arms of Sorrow\", and it has been cited by the band through numerous interviews that the album recalls influences from bands in the NOLA music scene, as well as metal bands like Pantera and Machine Head.\\n\\nDespite his front man role in Killswitch Engage, Jones is still the lead singer for Blood Has Been Shed.\\n\\nAside from singing, Jones has also taken on the role of a manager to new and upcoming artists. Currently, he manages two bands, Twelve Tribes, Mikoto, and also the producer Zeuss.\\n\\nHe is also known for his vocal styles, which include deep, booming roars, a higher, raspier scream, and operatic clean vocals. The clean style is absent from most of his work with Blood Has Been Shed, however, with Killswitch Engage, he usually makes use of all of his vocal styles in almost every song, particularly in As Daylight Dies and Holy Diver.\\n\\n3.  Howard Jones is an English folk singer and musician.  He was a member of The Electropathics  and currently performs with Albireo and as a solo performer. <a href=\"https://www.last.fm/music/Howard+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='6loBF9iQdE11WSX29fNKqY', url='https://open.spotify.com/artist/6loBF9iQdE11WSX29fNKqY', name='Howard Jones', popularity=53, followers=448491, genres=['new wave', 'synthpop'], images=[{'url': 'https://i.scdn.co/image/ab6761610000e5eb81c1534a3a9cf64fd6deb02f', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab6761610000517481c1534a3a9cf64fd6deb02f', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f17881c1534a3a9cf64fd6deb02f', 'height': 160, 'width': 160}], external_urls={'spotify': 'https://open.spotify.com/artist/6loBF9iQdE11WSX29fNKqY'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/6loBF9iQdE11WSX29fNKqY'}, 'followers': {'href': None, 'total': 448491}, 'genres': ['new wave', 'synthpop'], 'href': 'https://api.spotify.com/v1/artists/6loBF9iQdE11WSX29fNKqY', 'id': '6loBF9iQdE11WSX29fNKqY', 'images': [{'url': 'https://i.scdn.co/image/ab6761610000e5eb81c1534a3a9cf64fd6deb02f', 'height': 640, 'width': 640}, {'url': 'https://i.scdn.co/image/ab6761610000517481c1534a3a9cf64fd6deb02f', 'height': 320, 'width': 320}, {'url': 'https://i.scdn.co/image/ab6761610000f17881c1534a3a9cf64fd6deb02f', 'height': 160, 'width': 160}], 'name': 'Howard Jones', 'popularity': 53, 'type': 'artist', 'uri': 'spotify:artist:6loBF9iQdE11WSX29fNKqY'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": "John Howard Jones (* 23. Februar 1955 in Southampton, England) ist ein britischer Sänger und Musiker. \n\nHoward Jones ist das älteste von vier Geschwistern einer walisischen Familie. Ab dem siebten Lebensjahr begann er Klavier zu spielen. Später schrieb er sich an der Royal Northern College of Music in Manchester für das Studium des klassischen Pianos ein. Um seine Studiengebühren zu bezahlen, verdiente er sich mit Nachtschichten bei dem Radiosender Picadilly Radio Geld. Er spielte alle 20 Minuten zwischen Mitternacht und sechs Uhr morgens ein Musikstück seiner Wahl auf dem Synthesizer. Zwar sollten alle Sessions ausschließlich instrumental sein, Jones sang aber auch hin und wieder.\n\nNachdem er sein Studium am Musik-College abgebrochen hatte, gründete Jones mit seiner späteren Ehefrau Jan Smith einen kleinen fahrbaren Gemüsehandel in High Wycombe. In dieser Zeit hatten sie mit ihrem Stand einen Unfall, bei dem ein anderer Wagen in ihren fuhr. Obwohl Smith sich nur leicht verletzte, überredete Jones sie, Schmerzensgeld zu verlangen. Von diesem Geld kaufte sich Jones einen Synthesizer. Anstatt eines Moog Prodigy wurden irrtümlicherweise zwei angeliefert. Das zweite Gerät bezahlte er aus eigener Tasche und gewöhnte sich schnell daran, beide miteinander zu kombinieren. Howard Jones begann Anfang der 1980er Jahre, in kleinen Bars und Kneipen zu spielen und nutzte dabei die technischen Möglichkeiten, um seine Musik unabhängig von einer Band zu produzieren und aufzuführen. Seine drei Brüder betrieben zu dieser Zeit in London eine Band namens Red Beat.\n\n1983 spielte Jones ein 24-Spur-Demo ein und verschickte es an diverse Plattenfirmen. WEA Records nahm ihn für Europa unter Vertrag. Im September 1983 erschien sein erstes Stück New Song und im November What Is Love?. Das Video zu What Is Love? wurde 1983 in Paris gedreht.\n\nDas erste Album Human’s Lib verkaufte sich sehr gut (Nr. 1 in Großbritannien). Es folgten Hits wie Hide and Seek, Pearl in the Shell und Like to Get to Know You Well.\n\nJones präsentiert sich auf der Human’s-Lib-Welttournee mit einer One-Man-Show, bestehend aus sich und einer ganzen Bastion von Synthesizern, Sequenzern und Drumcomputern wie dem Roland Jupiter 8, dem Roland TR808, dem Moog Prodigy oder dem Yamaha DX7. Unterstützt wird er dabei von dem Pantomimen Jed Hoile, der für die visuelle Präsentation sorgt.\n\nEin Jahr nach Human’s Lib erschien im Frühjahr 1985 das zweite Studioalbum Dream into Action. Dieses Album wurde, wie bereits Human’s Lib, von Rupert Hine produziert. Es konnte in Großbritannien an die Erfolge des ersten Albums anschließen. In den USA schafft er mit dem Album den großen Durchbruch. Dies gelang mit der Unterstützung von Phil Collins, der mit ihm No One Is to Blame neu aufnahm und Platz 4 in den US-Charts erreichte. Weitere Singles waren Things Can Only Get Better, Look Mama und Life in One Day. Am 13. Juli 1985 trat Jones beim Live Aid Konzert auf.\n\nDas Album One to One veröffentlichte Howard Jones im Herbst 1986. Es wurde von Arif Mardin produziert und war auf den US-Markt ausgerichtet. Es konnte nicht ganz an die großen Erfolge der ersten beiden Alben anknüpfen. Das Video zur ersten Single You Know I love You … Don’t You? erinnerte an das a-ha-Video Take On Me, allerdings waren hier die Zeichnungen farbig. Das Video erhielt eine Grammy-Nominierung. One to One selbst erreichte in Großbritannien Platz 10 der Albumcharts.\n\nNach einer weiteren Welttournee nahm sich Jones eine Auszeit und meldete sich erst im April 1989 mit Cross That Line zurück, das seine Abkehr von der Elektronik bereits ankündigte und viele eher klassisch instrumentierte Titel enthält. In Europa blieb das Album relativ unbeachtet, in den USA erreicht Everlasting Love eine hohe Chartplatzierung.\n\n1992 erschien das Album In the Running. Bei nahezu allen Liedern steht das Klavier im Vordergrund. Zwar enthielt es mit Lift Me Up einen weiteren Top-10-Hit in den USA, trotzdem verlängert WEA Records den Vertrag mit dem Musiker nicht. 1993 erscheint ein Best Of als letzte Veröffentlichung bei dem Major-Label.\n\nIm selben Jahr gründete Jones sein eigenes Plattenlabel DTOX und veröffentlichte im August 1993 Working in the Backroom. Verkauft wird das Album bis heute lediglich auf Konzerten und über den Online-Shop seiner Webseite. 1993 präsentiert Howard Jones das Album mit einer Rückkehr zu seiner alten One-Man-Show-Idee, die auf der Bühne nur ihn selbst umringt von Computern und Synthesizern zeigt.\n\nNach den Bandausflügen kehrt Jones im Jahr 2002 wieder zu seinen Anfängen und somit zu seinen Wurzeln in der Elektronik zurück. Zusammen mit dem Gitarristen Robin Boult und dem Dance-Producer Robbie Bronniman tourt er mit der Peaceful Tour durch Großbritannien. Die Zuschauer konnten \"ihr\" Konzert am Hallenausgang gleich auf CD mitnehmen. Die besten Mitschnitte erschienen auf dem Album The Peaceful Tour Live, das in erster Linie runderneuerte Versionen der Jones-Klassiker enthält.\n\nZum ersten Mal veröffentlicht der Brite 2003 ein Album, das lediglich Klavier-Soli enthält, die er für Freunde geschrieben hat. Piano Solos for Friends and Loved Ones ist lediglich auf Konzerten, über den DTOX-Webshop und bei iTunes erhältlich. Im Jahr 2007 war ein zweites Album mit akustischen Pianostücken erhältlich.\n\nWarner veröffentlichte 2003 The Very Best Of.\n\nDas Jahr 2003 markiert auch das zwanzigjährige Bühnenjubiläum von Howard Jones, das er mit einem ausverkauften Konzert im Shepards Bush Empire in London feiert. Das Konzert ist mittlerweile auf einer Doppel-DVD erhältlich.\n\nIm September 2005 erscheint das lang erwartete Album Revolution of the Heart, das Jones wiederum in seiner elektronischen Umgebung zeigt. Mit Just Look at You Now enthält es ein Lied, das in Schweden bereits hohe Chartplatzierungen erreichen konnte. Jones tourt im Jahr 2005 vornehmlich in Großbritannien und in den USA.\n\n2006 wurde sein Hit Things Can Only Get Better von der Gruppe The Disco Boys gecovert. Stilrichtung dieser Version ist House. Außerdem nahm Jones das Lied für die Videospielserie The Sims nochmals auf.\n\nIn seiner Karriere hat Howard Jones mit zahlreichen anderen Musikern zusammengearbeitet, wie z. B. Nick Beggs, Midge Ure, Robin Boult, Kevin Wilkinson, Ringo Starr, Nena, Juliane Werding oder Phil Collins.\n\nIm Juni 2006 fand eine Deutschland-Tournee mit Howard Jones statt. Die Tour startete am 16. Juni in Köln und endete am 23. Juni in Mainz. Dazwischen besuchte er die Städte Dortmund, Bochum, Berlin, Magdeburg und Halle an der Saale.\n\n2007 kam es zur Veröffentlichung einer Surround-Variante des Electronic-Albums Revolution of the Heart sowie dem zweiten Klavieralbum des Künstlers. Jones tourte mit akustischen Auftritten durch die Vereinigten Staaten, Großbritannien und Australien und stellte dabei auch neue Stücke vor.\n\nIm November 2009 erschien das neue Album Ordinary Heroes, von dem es auch eine limitierte Fassung mit 2 CDs gab, für die die enthaltenen Lieder nochmals als Orchesterversion aufgenommen wurden.\n\nHoward Jones lebt heute mit seiner Frau Jan und seinen drei Kindern im englischen Somerset. Er bekennt sich zum Buddhismus und ist aktiver Anhänger der neuen religiösen Bewegung Sōka Gakkai. \n(Wikipedia)",
      "biography_en": "Howard Jones is a English musician, singer and songwriter. According to the Guinness Book of British Hit Singles & Albums, \"Jones is an accomplished singer-songwriter who was a regular chart visitor in the mid-1980s with his brand of synthpop. Jones, who was equally popular in the U.S., appeared at Live Aid\". Allmusic journalist, Stephen Thomas Erlewine adds, \"Jones was one of the defining figures of mid-1980s synthpop. His music merged the technology intensive sound of New Wave with the cheery optimism of hippies and late 1960s pop. Jones racked up a string of hits in the mid and late 1980s, before he retreated into being a cult figure in the 1990s\". \nJohn Howard Jones is the eldest of four boys (Howard's brothers, Roy, Martin, and Paul, were all musicians and had their own band, called Red Beat, in the late 1970s and early 1980s). Born in Southampton to Welsh parents, he spent his early years growing up in Rhiwbina, Cardiff, South Wales where he attended Heol Llanishen Fach primary school, and then Whitchurch Grammar School; and later in Stokenchurch, near High Wycombe, Buckinghamshire, where he attended the Royal Grammar School. Jones took piano lessons from the age of seven, and when he was a teen, his family had relocated to Canada, which is where he joined his first band, a progressive rock group called Warrior. Eventually, Jones moved back to the United Kingdom, where he played in a number of different groups. He then spent a year at the Royal Northern College of Music in Manchester. \nJones appeared as a solo artist in local venues in High Wycombe, before inviting the mime artist Jed Hoile, who used to do improvised choreography, whilst doused in white paint, as Jones played behind him. In 1983, Jones hired the Marquee Club in London and invited record labels to come and see him perform. After a BBC Radio 1 session, he obtained support slots with China Crisis and OMD before signing to WEA in the UK and Elektra in the US in mid 1983. \nHis first single called \"New Song\" was released in September 1983 and reached the UK Top 5 and US Top 30. He made his debut performance on BBC Television's Top of the Pops in October 1983, and he watched his tape-delayed performance on a borrowed television resting on an ironing board before a concert at the University of Kent. He subsequently had four more hits over the next twelve months and a UK Number 1 album, Human's Lib, which eventually went double platinum. Credited with jointly writing the lyrics for six songs on the album was the lyricist Bill Bryant. Thanks to repeated exposure on MTV, the album became a moderate hit in the US. Later in 1984, \"New Song\" and \"What Is Love\" became American Top 40 hits, while \"Pearl in the Shell\" became his third UK Top 10 single. Human's Lib went gold and platinum in a number of countries. Jones had developed a loyal teen following, and his mother and father, Thelma and John Jones, ran his fan club. \nIn the summer of 1984, he released \"Like to Get to Know You Well\", which he said was 'dedicated to the original spirit of the Olympic Games'. Although it was not an official Olympic anthem for the Games in Los Angeles that summer, it was a worldwide hit. It reached Number 4 in the UK Singles Chart. The sleeve featured the song title in ten different languages; while Jones sang the title line in French and German on the extended 12\" version. The song also appeared in the film Better Off Dead (1985) and the computer game Grand Theft Auto: Vice City Stories (2006).\nJones' second long player was a remix album. It contained six songs, all but one of which had been previously released, but which appeared in elongated formats, including the multilingual version of \"Like to Get to Know You Well\". The record sleeve for The 12 Inch Album, featured a miniature Jones standing next to a 12-inch ruler. The album went gold in the UK.\nIn 1985, Jones released his second studio album, Dream into Action. He introduced his own backing band, including the female backing vocalist trio, Afrodiziak. Afrodiziak featured Caron Wheeler and Claudia Fontaine. Playing bass guitar was Jones' own brother, Martin. He had to have an extra string added to his instrument to play some of the bass lines, which had originally been played on a keyboard. One of the singles released from this album, \"No One Is to Blame\", was later re-recorded and featured Phil Collins as drummer and producer. Dream into Action was a worldwide hit and Jones' most successful album, reaching number 2 in the UK and number 10 in the US, staying on the US chart for almost a year. The album spawned the hit singles \"Things Can Only Get Better\", \"Life In One Day\", and \"Look Mama\". In July 1985, Jones performed at Wembley Stadium as part of the Live Aid concert, singing his 1984 hit \"Hide and Seek\" while playing a piano belonging to Freddie Mercury. He also embarked on a world tour reaching Japan, Australia and the US.\nIn the spring of 1986 in the US, he released Action Replay, an EP of remixes that featured a new version of \"No One Is to Blame\". It became Jones' biggest US hit, peaking at number 4. However, by this time, Jones' fortunes were changing in his native UK and \"No One Is To Blame\" peaked at number 16. His next single, \"All I Want\", peaked at number 35, and would be his last UK Top 40 hit. Jones released his third studio album, One To One, in October 1986, which peaked at number 10 in the UK and would be his last UK hit album, despite going gold there.  Stateside, however, Jones continued to fill large arenas and the single \"You Know I Love You Don't You?\" went top twenty in 1986 on the Billboard charts.\nIn June 1988, Jones performed at Amnesty International's Festival of Youth at the Milton Keynes Bowl. Jones' subsequent albums Cross That Line (1989) and In the Running (1992) both performed poorly in the UK, the latter even failing to chart there. However,he had further hits on the Billboard charts in the US during this period, including \"Everlasting Love\" (1989, his second number 1 hit on the US Hot Adult Contemporary Tracks chart after \"No One Is to Blame\"), \"The Prisoner\" (1989), and \"Lift Me Up\" (1992). \n\nJones continued to play large venues in the US during the late 1980s, and the Cross That line tour played major outdoor venues in the US, during 1989. With his ten-year tenure on the Warner music label at an end, a greatest hits compilation The Best of Howard Jones was released in 1993. The album peaked at number 36 in the UK, and by 2005 (12 years after its release) it was certified silver by the BPI for over 60,000 copies sold in the UK.\n\nJones also had success as a songwriter for other artists in the early 1990s. He co-wrote the dance music hits \"Heaven Give Me Words\" and \"Your Wildlife\" with the members of Propaganda. The tracks appeared on the 1990 album 1234; \"Heaven Give Me Words\" reached number 22 on the Adult Contemporary chart and \"Your Wildlife\" reached number 22 on the Dance Music/Club Play Singles chart.\nAfter Jones' contract with Warner Music UK expired, he concentrated on production, songwriting and running a successful vegetarian restaurant called 'Nowhere' (originally at 11 Waverly Place, New York City). He started his own record label, Dtox, releasing a number of albums through the label, such as Working in the Backroom, produced in his own recording studio ('The Shed'). The album, which sold over 20,000 copies in the first year of release, was made available only at concerts and through his official website.\nFor the next two years, Jones continually toured the US and Europe. In 1996, he released Live Acoustic America and People followed two years later.\nThe track \"If You Love\", was featured on the soundtrack to the TV series Party of Five. Jones continued to produce and write for a number of artists during the mid to late 1990s, including Martin Grech, DBA, and Sandie Shaw. In 2001, Jones played keyboards for Ringo Starr on his All Starr Band tour.\nOn 20 September 2003, Jones played a 20th anniversary concert at the Shepherds Bush Empire, London, commemorating the release of his first single. He was joined by Midge Ure and Nena, as well as his mime artist, Jed Hoile. A recording of this concert was later released on DVD. Jones continued to tour and write new music, collaborating with Robbie Bronnimann to co-write and co-produce music for Sugababes, and Jones' own 2005 album Revolution of the Heart. He toured playing gigs in the United States, Italy, Germany and Sweden and played a number of times at the Edinburgh Festival in 2006. The same year Jones provided a vocal for the song \"Into the Dark\" by Ferry Corsten for the latter's album, L.E.F. Jones also re-recorded \"Things Can Only Get Better\" in Simlish, the fictional language spoken by characters in Electronic Arts', The Sims 2. Jones was also featured on Katrina Carlson's cover of \"No One Is to Blame\", which entered the US Hot Adult Contemporary Tracks chart in 2007. \nIn October 2006, Jones released \"Building Our Own Future\" as a podsafe track, as one of several established artists looking to use podcasts as a new means of promoting their music and tours. The song debuted at number 1 on the PMC Top10 on 29 October 2006 and spent four weeks at the top of the chart. Howard's track \"Revolution of the Heart\" spent five weeks at number 1 on the PMC Top10 during 2007 and finished the year as the number 2 song in their annual countdown.\n\nJones embarked on an acoustic tour of Australia in 2007, beginning in Brisbane and concluding on 5 April in Perth. The Revolution Remixed & Surrounded album was followed in November by Live in Birkenhead. Jones performed another acoustic set, with other 1980s acts at the Retrofest, on 1 September 2007 at Culzean Castle in Ayrshire, Scotland. Jones also went into the studios with The Young Punx to record vocals for their summer 2008 release, \"And The Feel Goes On\".\n\nJones is a member of Sōka Gakkai International, and is musical director of one of its choirs, the Glorious Life Chorus. The chorus performs some of his songs in its repertoire, including \"Building Our Own Future\" and \"Respected\". He returned to Australia again in 2009, this time accompanied by vocalist Laura Clapp and music technologist Robbie Bronnimann. On 26 February 2009, Jones was at the UK premiere of Roland's new V-Piano in Bristol, and performed \"Hide and Seek\". He continues to tour, and played the 'Big Hair Affair 2009' on 1 August 2009 at the Ryedale Arena, Pickering, North Yorkshire.\nHis latest album, Ordinary Heroes was released in November 2009, and he toured London, Cardiff and Manchester with a string section and the Morriston Orpheus Choir (in St David's Hall in Cardiff). A single, \"Soon You'll Go\", preceded the album's launch.\n\nOn 29 November 2011, a UK tour was announced. Human's Lib and Dream Into Action were performed in April 2012 across eight venues. A weekly radio series coincided with tour called Electronic 80s with Howard Jones on Absolute Radio.\n\nHe recently appeared in \"The Song That Changed My Life\" on BYUtv, the cable station for Brigham Young University focusing on programming relating to the Church of Jesus Christ of Latter-day Saints. \nHe is a member of the board of directors for the Featured Artists Coalition. Jones currently lives in Creech St Michael, near Taunton, Somerset.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1955",
      "country": "Southampton, England, UK",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1955",
      "gender": "Male",
      "genre": "Pop",
      "id": "123254",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/jones-howard-50fbc0fcc99a1.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/howard-jones-4f3a82bb3bd83.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/jones-howard-51c692c8f2609.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/jones-howard-580739732907c.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/eagu1h1710879537.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "Good Natured",
      "music_videos": null,
      "musicbrainz_id": "23b2cc78-7595-4630-bebb-a349a4f25262",
      "name": "Howard Jones",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music112/v4/db/17/08/db1708be-f35a-113e-b906-2acab4d233a3/pr_source.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Pop"
      ],
      "id": "552740",
      "name": "Howard Jones",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/howard-jones/552740"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "40360",
      "images": [
        {
          "height": 750,
          "resource_url": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/jQjdwHDDVwFh0-_CH3pF4L844znDBVluyhR3n3XIIS8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 501,
          "resource_url": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/n-2rXmGGKct6eITmdNkkZxcHOcGqKECrwwT9Tj6Px0Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
          "width": 500
        },
        {
          "height": 622,
          "resource_url": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/Zxr5I0VaUU-m5vtNiXUEgQqbeQIMSWX4zz5QOXCGHFs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 366,
          "resource_url": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/fiAun-qn5Ecfcz-LUOpEOweOqPjzmUbsA_Q34bLxEHQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
          "width": 243
        },
        {
          "height": 247,
          "resource_url": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
          "uri150": "https://i.discogs.com/FdVlXEUeHSi3SRi8F92-MOAiYC2ezQwixxQbwo1ASLE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
          "width": 200
        },
        {
          "height": 174,
          "resource_url": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
          "uri150": "https://i.discogs.com/CjAqqmBHusBNXL0yUR5iJJQMYBJ5zQV_ipPMJ-_nDho/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
          "width": 155
        },
        {
          "height": 599,
          "resource_url": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
          "uri150": "https://i.discogs.com/cRuxTzi50Mu8LpWYHTmuhjVHhy3wEWAmR_-x7GvYfec/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
          "width": 598
        },
        {
          "height": 300,
          "resource_url": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
          "uri150": "https://i.discogs.com/Dy-kLlSRygr5yv6ws7qKaHlb5Z9llAEakpqF7FvZ2sc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
          "width": 411
        },
        {
          "height": 337,
          "resource_url": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/MGJ6xW1QhebzAvDGVIaMbhgr5L3r1taN9MNLlEHGphU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 544,
          "resource_url": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Mz639QajsDpBD2t1BT5PHX9CKWrzQPXqozAhOdqOBuA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
          "width": 282
        },
        {
          "height": 650,
          "resource_url": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/Gz3mIQv5lgIMQhEYEU5fFs8pmmsbNIvoVVq1Ylnh5Bc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
          "width": 266
        },
        {
          "height": 615,
          "resource_url": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/HbpU9W_vFIYoRjKguJYpTQ2grv0g2yIlWsUqwdSuwbU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
          "width": 460
        },
        {
          "height": 400,
          "resource_url": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/HZ5ovdJyb_7sC0HAh7HAspLnf3RO1pdf3sJSwOFoO70/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
          "width": 348
        },
        {
          "height": 437,
          "resource_url": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/UX85FyOnHhReFs8n79FL8buO-2Hsw2HpcymCjXXrbfY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
          "width": 454
        }
      ],
      "members": [],
      "name": "Howard Jones",
      "namevariations": [
        "H Jones",
        "H. Jones",
        "H.J.",
        "H.Jones",
        "HJ",
        "HoJo",
        "Howard",
        "Howardjones.",
        "Jhones",
        "Jones",
        "Jones, J.H.",
        "Хауърд Джоунс",
        "ハワード・ジョーンズ",
        "허워드 존스"
      ],
      "profile": "Classically-trained pianist turned synthpop star, born February 23, 1955, Southampton. He's a singer/songwriter, musician and producer. He signed with WEA June 24th, 1983 and enjoyed ten Top 40 hit singles in the UK during 1983-86, including six which reached the top ten. His 1984 album \"Human's Lib\" went to number one, while the follow up \"Dream Into Action\" reached number two a year later. He continues to tour and record new material.  Brother of [a695303].",
      "raw_data": {
        "data_quality": "Correct",
        "groups": [
          {
            "active": true,
            "id": 399297,
            "name": "Man Doki Soulmates",
            "resource_url": "https://api.discogs.com/artists/399297",
            "thumbnail_url": "https://i.discogs.com/9-sYzRTV7jBdBtZ9KAp5cbmi-7dI_q6m13BkeqYT0OA/rs:fit/g:sm/q:40/h:431/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTM5OTI5/Ny0xNTc0NzM5NTU5/LTQ5NTcuanBlZw.jpeg"
          },
          {
            "active": true,
            "id": 673799,
            "name": "The Amnesty Allstars",
            "resource_url": "https://api.discogs.com/artists/673799",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 1232899,
            "name": "Midge Ure All Star Band",
            "resource_url": "https://api.discogs.com/artists/1232899",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 3527728,
            "name": "The Conspirators (2)",
            "resource_url": "https://api.discogs.com/artists/3527728",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 5152877,
            "name": "A∀A∀A",
            "resource_url": "https://api.discogs.com/artists/5152877",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 6030966,
            "name": "Warrior (18)",
            "resource_url": "https://api.discogs.com/artists/6030966",
            "thumbnail_url": "https://i.discogs.com/Smli0CMkwvzxx9wD7F4V152gQw072XXfYEkPA7USl7c/rs:fit/g:sm/q:40/h:415/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYwMzA5/NjYtMTUzNDgzNDk2/OC00MzE2LmpwZWc.jpeg"
          }
        ],
        "id": 40360,
        "images": [
          {
            "height": 750,
            "resource_url": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/zh-OSTmjFBHgglzsHbrxg--aM9JG5qVt309_SKfWk04/rs:fit/g:sm/q:90/h:750/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/jQjdwHDDVwFh0-_CH3pF4L844znDBVluyhR3n3XIIS8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 501,
            "resource_url": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/7RmYYU5LoEZK4meEN5RpgsWtFFsGKa7dJkHki81HHQs/rs:fit/g:sm/q:90/h:501/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/n-2rXmGGKct6eITmdNkkZxcHOcGqKECrwwT9Tj6Px0Q/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEyOTM2MzUzODku/anBlZw.jpeg",
            "width": 500
          },
          {
            "height": 622,
            "resource_url": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/jVvvb8u8fcLsxqKI_tQww1FwndTsLZrQ-qnhnfspSaE/rs:fit/g:sm/q:90/h:622/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/Zxr5I0VaUU-m5vtNiXUEgQqbeQIMSWX4zz5QOXCGHFs/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEzMjcxNjAyNjku/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 366,
            "resource_url": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/4sQ7DgkJ7Sla8RjO5LTtysJomkglZyIaE7lebbZDnbs/rs:fit/g:sm/q:90/h:366/w:243/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/fiAun-qn5Ecfcz-LUOpEOweOqPjzmUbsA_Q34bLxEHQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExNDM1MjA5ODUu/anBlZw.jpeg",
            "width": 243
          },
          {
            "height": 247,
            "resource_url": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/6IA4tQPWKmImZVRnKeJV69vsoWKx4sXcJjtK3w4uozM/rs:fit/g:sm/q:90/h:247/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
            "uri150": "https://i.discogs.com/FdVlXEUeHSi3SRi8F92-MOAiYC2ezQwixxQbwo1ASLE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTEwODQxODM0MjEu/anBn.jpeg",
            "width": 200
          },
          {
            "height": 174,
            "resource_url": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/r6YpiiW8NPvlcBGS3AK9iyoA3k8JACZILrmlf5DbGDg/rs:fit/g:sm/q:90/h:174/w:155/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
            "uri150": "https://i.discogs.com/CjAqqmBHusBNXL0yUR5iJJQMYBJ5zQV_ipPMJ-_nDho/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTAwMi5naWY.jpeg",
            "width": 155
          },
          {
            "height": 599,
            "resource_url": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/zTR84SvxWZ6iiWQa3H6fkd6Pt0Bd3Z11KdqrNVTfLAs/rs:fit/g:sm/q:90/h:599/w:598/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
            "uri150": "https://i.discogs.com/cRuxTzi50Mu8LpWYHTmuhjVHhy3wEWAmR_-x7GvYfec/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzI5MDE2MDIt/NjcwMS5wbmc.jpeg",
            "width": 598
          },
          {
            "height": 300,
            "resource_url": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aU50OgiYlraII00PjC4igVRJ8JieNsn-cODZcyxD9dc/rs:fit/g:sm/q:90/h:300/w:411/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
            "uri150": "https://i.discogs.com/Dy-kLlSRygr5yv6ws7qKaHlb5Z9llAEakpqF7FvZ2sc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTExMTkyODg1MDIu/anBn.jpeg",
            "width": 411
          },
          {
            "height": 337,
            "resource_url": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/aBaTkGXlxcwysyp642F2uGtxfOq07Bggi8Vuiu0o_7Q/rs:fit/g:sm/q:90/h:337/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/MGJ6xW1QhebzAvDGVIaMbhgr5L3r1taN9MNLlEHGphU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE1NTc2NDA0OTct/NDU1Ni5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 544,
            "resource_url": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/cgEkfF0qa5DUtUJe8kh9RWotG2WmbSJ-TWwtXFopkBY/rs:fit/g:sm/q:90/h:544/w:282/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Mz639QajsDpBD2t1BT5PHX9CKWrzQPXqozAhOdqOBuA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MjkzOTg1OTUt/MTYzMS5qcGVn.jpeg",
            "width": 282
          },
          {
            "height": 650,
            "resource_url": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/wEMrIcYXSNgjS_rtJkIOswchprI9F33U_luG111Fa_M/rs:fit/g:sm/q:90/h:650/w:266/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/Gz3mIQv5lgIMQhEYEU5fFs8pmmsbNIvoVVq1Ylnh5Bc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTUt/OTI3Mi5qcGVn.jpeg",
            "width": 266
          },
          {
            "height": 615,
            "resource_url": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/8IlcTxk-oQtZkgJ253a3wwfODy2MjoClXr0Boz2MQI0/rs:fit/g:sm/q:90/h:615/w:460/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/HbpU9W_vFIYoRjKguJYpTQ2grv0g2yIlWsUqwdSuwbU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MTct/Mzk0NS5qcGVn.jpeg",
            "width": 460
          },
          {
            "height": 400,
            "resource_url": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/II_3eALPUjw5j8EQQB4qwJrFqdbslpncosqFFOYB6Vk/rs:fit/g:sm/q:90/h:400/w:348/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/HZ5ovdJyb_7sC0HAh7HAspLnf3RO1pdf3sJSwOFoO70/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzMt/NTU2MS5qcGVn.jpeg",
            "width": 348
          },
          {
            "height": 437,
            "resource_url": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/j62vWBxqxhshXDtj1jmgBxGLLlsnGchdKQbi9g8lisY/rs:fit/g:sm/q:90/h:437/w:454/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/UX85FyOnHhReFs8n79FL8buO-2Hsw2HpcymCjXXrbfY/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2NjIyMTU4MzYt/NTI4OS5qcGVn.jpeg",
            "width": 454
          }
        ],
        "name": "Howard Jones",
        "namevariations": [
          "H Jones",
          "H. Jones",
          "H.J.",
          "H.Jones",
          "HJ",
          "HoJo",
          "Howard",
          "Howardjones.",
          "Jhones",
          "Jones",
          "Jones, J.H.",
          "Хауърд Джоунс",
          "ハワード・ジョーンズ",
          "허워드 존스"
        ],
        "profile": "Classically-trained pianist turned synthpop star, born February 23, 1955, Southampton. He's a singer/songwriter, musician and producer. He signed with WEA June 24th, 1983 and enjoyed ten Top 40 hit singles in the UK during 1983-86, including six which reached the top ten. His 1984 album \"Human's Lib\" went to number one, while the follow up \"Dream Into Action\" reached number two a year later. He continues to tour and record new material.  Brother of [a695303].",
        "realname": "John Howard Jones",
        "releases_url": "https://api.discogs.com/artists/40360/releases",
        "resource_url": "https://api.discogs.com/artists/40360",
        "uri": "https://www.discogs.com/artist/40360-Howard-Jones",
        "urls": [
          "https://www.howardjones.com",
          "http://www.howardjones.com/",
          "https://www.facebook.com/howardjones",
          "https://en.wikipedia.org/wiki/Howard_Jones_(British_musician)",
          "https://www.youtube.com/user/howardjonesmusic"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/40360",
      "thumb": "https://i.discogs.com/jQjdwHDDVwFh0-_CH3pF4L844znDBVluyhR3n3XIIS8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTQwMzYw/LTE2MzcyMzYwNjYt/MjE5Ny5qcGVn.jpeg",
      "url": "https://www.discogs.com/artist/40360-Howard-Jones",
      "urls": [
        "https://www.howardjones.com",
        "http://www.howardjones.com/",
        "https://www.facebook.com/howardjones",
        "https://en.wikipedia.org/wiki/Howard_Jones_(British_musician)",
        "https://www.youtube.com/user/howardjonesmusic"
      ]
    },
    "lastfm": {
      "bio_content": "Howard Jones (born John Howard Jones on February 23, 1955) is an English singer and songwriter.\n\nHe is the eldest of three boys. His birthplace is Southampton, England, and he spent his early years in High Wycombe in Buckinghamshire, and attended the Royal Grammar School. He now lives with his family in Somerset, England.\n\nWhen he was young, he used to give piano lessons. One of his clients was a girl named Jan Smith, who he later married. Whilst working with her, a vehicle crashed into their van, injuring Jan. She claimed compensation and used the money to buy Howard a synthesiser, a Moog Prodigy. The shop delivered two by mistake, and Howard liked the combination of the two so much that he paid for the extra one.\n\nHe hit the charts in 1983 with a song called \"New Song,\" which made it into the UK top ten. Speaking with Songfacts, Jones explained the song is his manifesto, and why he wanted to get in the music business and write songs to begin with. Said Jones: \"I was working in the factory at the time - I was doing the gigs at night and I was working in the factory. And I wanted to say to people, 'You can. It is possible to do what you really want to do if you've got enough guts and determination. You can do what you're really good at in this life if you set your mind to it.' And so really that's what that song's about. It's about letting go of fear and seeing both sides of an argument and throwing off the things that hold you back mentally.\"\n\nJones subsequently had three more hits over the next twelve months and a UK Number 1 album, Human's Lib. He acquired a hardcore fanbase made up of both starstruck teenagers and more mature music lovers, who saw the musicianship which went into the electronic sounds of his songs. His mother ran his fan club. Jones was a close temporal and stylistic contemporary of Nik Kershaw, and the two musicians were often conflated in the affections of the contemporary pop audience.\n\nHoward was known as a respectable face of pop, combining innovative synthesiser music with strong feelings on animal rights and life's excesses. In his early days, he performed with a mime artist called Jed Hoile, who used to do improvised choreography while doused in white paint as Howard played behind him.\n\nIn the summer of 1984, he released a single called \"Like To Get To Know You Well\", which he said was 'dedicated to the original spirit of the Olympic Games'. Although it wasn't an official Olympic anthem for the Games in Los Angeles that summer, it caught on and was a huge worldwide hit. The sleeve featured the song title in ten different languages; while Howard sang the title line in French and German on the extended version. The song appeared in the film Better Off Dead.\n\nHoward's second album was a ground breaking 'remix' album. It contained six songs, all but one of which had been previously released, but which appeared in elongated formats, including the multi-lingual version of \"Like To Get To Know You Well\". The album was called The 12 Inch Album and the sleeve featured a miniature Howard standing next to a 12-inch ruler.\n\nWhen he released his second studio album, Dream Into Action, in 1985, he introduced his own backing band, including future Soul II Soul singer Caron Wheeler as one third of female backing vocal trio Afrodiziak. Playing bass guitar, meanwhile, was Howard's own brother Martin, who had to have an extra string added to his instrument to play some of Howard's bass lines, which were originally played on a keyboard without regard for the range of a real bass guitar. One of the singles released from this album, \"No One Is To Blame\", was later re-recorded and featured Phil Collins as drummer and producer.\n\nIn July 1985, Howard performed at Wembley Stadium as part of the Live Aid concert, singing his 1984 hit \"Hide And Seek\" while playing a piano belonging to Freddie Mercury.\n\nHoward had his last UK Top 40 hit in 1986 and thereafter concentrated on production, songwriting and running a successful vegetarian restaurant, though he had Billboard Top 10 success in the States in the 1990s. His eldest son, Oisín (pronounced Osheen), was born in 1985 and is now an actor.\n\nIn 2005, he competed on the American TV show Hit Me Baby One More Time, losing to Irene Cara. Although he lost the in-studio vote to Cara, he won the online poll vote.\n\nThere are other artists with the same name:\n\n2. Howard Jones is the current lead singer of American metalcore bands Killswitch Engage and Blood Has Been Shed.\n\nJones resides in Connecticut. His first success was in Connecticut with the band Blood Has Been Shed. After the release of The Novella of Uriel, the band went on tour, but Jones was eventually approached for a bigger project. Howard Jones replaced the lead singer of Killswitch Engage, Jesse Leach, in July of 2002, shortly after the release of Alive or Just Breathing, Killswitch Engage's Roadrunner Records debut album.\n\nMeanwhile, Blood Has Been Shed released their third album, Spirals in 2003. Critical reviews were mixed, with some saying the album was a bit stray from the music found on I Dwell and Novella, while fans found it to be the band's most sonically-challenging album yet.\n\nThe first time KSE fans heard Jones they were impressed by him. Later he would be heard on the song \"When Darkness Falls\", which was first released on the soundtrack for the movie Freddy vs. Jason. Finally, Killswitch Engage released their first album with Jones as the new singer, as well as Blood Has Been Shed drummer Justin Foley. The End of Heartache would spawn two successful singles, \"Rose of Sharyn\" and the Grammy-nominated title track, \"The End of Heartache\". There was a minor spot of controversy with some fans over the Grammy nomination, as the song that was picked was a remixed version that would eventually appear on the Resident Evil: Apocalypse soundtrack. The differences between the original recording and the remixed version are the fact that the song is sung in a traditional singing style rather than using the original scream track that appears on the album, and several sections of the song have been shortened for a more commercially dynamic vision.\n\nIn November 2006, Killswitch Engage released their fourth album (and second with Howard Jones) entitled As Daylight Dies. The album has spawned the singles \"My Curse\" and \"Arms of Sorrow\", and it has been cited by the band through numerous interviews that the album recalls influences from bands in the NOLA music scene, as well as metal bands like Pantera and Machine Head.\n\nDespite his front man role in Killswitch Engage, Jones is still the lead singer for Blood Has Been Shed.\n\nAside from singing, Jones has also taken on the role of a manager to new and upcoming artists. Currently, he manages two bands, Twelve Tribes, Mikoto, and also the producer Zeuss.\n\nHe is also known for his vocal styles, which include deep, booming roars, a higher, raspier scream, and operatic clean vocals. The clean style is absent from most of his work with Blood Has Been Shed, however, with Killswitch Engage, he usually makes use of all of his vocal styles in almost every song, particularly in As Daylight Dies and Holy Diver.\n\n3.  Howard Jones is an English folk singer and musician.  He was a member of The Electropathics  and currently performs with Albireo and as a solo performer. <a href=\"https://www.last.fm/music/Howard+Jones\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Howard Jones (born John Howard Jones on February 23, 1955) is an English singer and songwriter.\n\nHe is the eldest of three boys. His birthplace is Southampton, England, and he spent his early years in High Wycombe in Buckinghamshire, and attended the Royal Grammar School. He now lives with his family in Somerset, England.\n\nWhen he was young, he used to give piano lessons. One of his clients was a girl named Jan Smith, who he later married. Whilst working with her, a vehicle crashed into their van, injuring Jan. <a href=\"https://www.last.fm/music/Howard+Jones\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 467690,
      "mbid": "72448711-5c5c-4b45-a607-99336456029a",
      "name": "Howard Jones",
      "playcount": 4022799,
      "similar_artists": [
        {
          "name": "Thompson Twins",
          "url": "https://www.last.fm/music/Thompson+Twins"
        },
        {
          "name": "ABC",
          "url": "https://www.last.fm/music/ABC"
        },
        {
          "name": "Nik Kershaw",
          "url": "https://www.last.fm/music/Nik+Kershaw"
        },
        {
          "name": "The Fixx",
          "url": "https://www.last.fm/music/The+Fixx"
        },
        {
          "name": "Kajagoogoo",
          "url": "https://www.last.fm/music/Kajagoogoo"
        }
      ],
      "tags": [
        "80s",
        "new wave",
        "pop",
        "synth pop",
        "synthpop"
      ],
      "url": "https://www.last.fm/music/Howard+Jones"
    },
    "spotify": {
      "followers": 448491,
      "genres": [
        "new wave",
        "synthpop"
      ],
      "id": "6loBF9iQdE11WSX29fNKqY",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb81c1534a3a9cf64fd6deb02f",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab6761610000517481c1534a3a9cf64fd6deb02f",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f17881c1534a3a9cf64fd6deb02f",
          "width": 160
        }
      ],
      "name": "Howard Jones",
      "popularity": 53,
      "url": "https://open.spotify.com/artist/6loBF9iQdE11WSX29fNKqY"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": "John Howard Jones (* 23. Februar 1955 in Southampton, England) ist ein britischer Sänger und Musiker. \n\nHoward Jones ist das älteste von vier Geschwistern einer walisischen Familie. Ab dem siebten Lebensjahr begann er Klavier zu spielen. Später schrieb er sich an der Royal Northern College of Music in Manchester für das Studium des klassischen Pianos ein. Um seine Studiengebühren zu bezahlen, verdiente er sich mit Nachtschichten bei dem Radiosender Picadilly Radio Geld. Er spielte alle 20 Minuten zwischen Mitternacht und sechs Uhr morgens ein Musikstück seiner Wahl auf dem Synthesizer. Zwar sollten alle Sessions ausschließlich instrumental sein, Jones sang aber auch hin und wieder.\n\nNachdem er sein Studium am Musik-College abgebrochen hatte, gründete Jones mit seiner späteren Ehefrau Jan Smith einen kleinen fahrbaren Gemüsehandel in High Wycombe. In dieser Zeit hatten sie mit ihrem Stand einen Unfall, bei dem ein anderer Wagen in ihren fuhr. Obwohl Smith sich nur leicht verletzte, überredete Jones sie, Schmerzensgeld zu verlangen. Von diesem Geld kaufte sich Jones einen Synthesizer. Anstatt eines Moog Prodigy wurden irrtümlicherweise zwei angeliefert. Das zweite Gerät bezahlte er aus eigener Tasche und gewöhnte sich schnell daran, beide miteinander zu kombinieren. Howard Jones begann Anfang der 1980er Jahre, in kleinen Bars und Kneipen zu spielen und nutzte dabei die technischen Möglichkeiten, um seine Musik unabhängig von einer Band zu produzieren und aufzuführen. Seine drei Brüder betrieben zu dieser Zeit in London eine Band namens Red Beat.\n\n1983 spielte Jones ein 24-Spur-Demo ein und verschickte es an diverse Plattenfirmen. WEA Records nahm ihn für Europa unter Vertrag. Im September 1983 erschien sein erstes Stück New Song und im November What Is Love?. Das Video zu What Is Love? wurde 1983 in Paris gedreht.\n\nDas erste Album Human’s Lib verkaufte sich sehr gut (Nr. 1 in Großbritannien). Es folgten Hits wie Hide and Seek, Pearl in the Shell und Like to Get to Know You Well.\n\nJones präsentiert sich auf der Human’s-Lib-Welttournee mit einer One-Man-Show, bestehend aus sich und einer ganzen Bastion von Synthesizern, Sequenzern und Drumcomputern wie dem Roland Jupiter 8, dem Roland TR808, dem Moog Prodigy oder dem Yamaha DX7. Unterstützt wird er dabei von dem Pantomimen Jed Hoile, der für die visuelle Präsentation sorgt.\n\nEin Jahr nach Human’s Lib erschien im Frühjahr 1985 das zweite Studioalbum Dream into Action. Dieses Album wurde, wie bereits Human’s Lib, von Rupert Hine produziert. Es konnte in Großbritannien an die Erfolge des ersten Albums anschließen. In den USA schafft er mit dem Album den großen Durchbruch. Dies gelang mit der Unterstützung von Phil Collins, der mit ihm No One Is to Blame neu aufnahm und Platz 4 in den US-Charts erreichte. Weitere Singles waren Things Can Only Get Better, Look Mama und Life in One Day. Am 13. Juli 1985 trat Jones beim Live Aid Konzert auf.\n\nDas Album One to One veröffentlichte Howard Jones im Herbst 1986. Es wurde von Arif Mardin produziert und war auf den US-Markt ausgerichtet. Es konnte nicht ganz an die großen Erfolge der ersten beiden Alben anknüpfen. Das Video zur ersten Single You Know I love You … Don’t You? erinnerte an das a-ha-Video Take On Me, allerdings waren hier die Zeichnungen farbig. Das Video erhielt eine Grammy-Nominierung. One to One selbst erreichte in Großbritannien Platz 10 der Albumcharts.\n\nNach einer weiteren Welttournee nahm sich Jones eine Auszeit und meldete sich erst im April 1989 mit Cross That Line zurück, das seine Abkehr von der Elektronik bereits ankündigte und viele eher klassisch instrumentierte Titel enthält. In Europa blieb das Album relativ unbeachtet, in den USA erreicht Everlasting Love eine hohe Chartplatzierung.\n\n1992 erschien das Album In the Running. Bei nahezu allen Liedern steht das Klavier im Vordergrund. Zwar enthielt es mit Lift Me Up einen weiteren Top-10-Hit in den USA, trotzdem verlängert WEA Records den Vertrag mit dem Musiker nicht. 1993 erscheint ein Best Of als letzte Veröffentlichung bei dem Major-Label.\n\nIm selben Jahr gründete Jones sein eigenes Plattenlabel DTOX und veröffentlichte im August 1993 Working in the Backroom. Verkauft wird das Album bis heute lediglich auf Konzerten und über den Online-Shop seiner Webseite. 1993 präsentiert Howard Jones das Album mit einer Rückkehr zu seiner alten One-Man-Show-Idee, die auf der Bühne nur ihn selbst umringt von Computern und Synthesizern zeigt.\n\nNach den Bandausflügen kehrt Jones im Jahr 2002 wieder zu seinen Anfängen und somit zu seinen Wurzeln in der Elektronik zurück. Zusammen mit dem Gitarristen Robin Boult und dem Dance-Producer Robbie Bronniman tourt er mit der Peaceful Tour durch Großbritannien. Die Zuschauer konnten \"ihr\" Konzert am Hallenausgang gleich auf CD mitnehmen. Die besten Mitschnitte erschienen auf dem Album The Peaceful Tour Live, das in erster Linie runderneuerte Versionen der Jones-Klassiker enthält.\n\nZum ersten Mal veröffentlicht der Brite 2003 ein Album, das lediglich Klavier-Soli enthält, die er für Freunde geschrieben hat. Piano Solos for Friends and Loved Ones ist lediglich auf Konzerten, über den DTOX-Webshop und bei iTunes erhältlich. Im Jahr 2007 war ein zweites Album mit akustischen Pianostücken erhältlich.\n\nWarner veröffentlichte 2003 The Very Best Of.\n\nDas Jahr 2003 markiert auch das zwanzigjährige Bühnenjubiläum von Howard Jones, das er mit einem ausverkauften Konzert im Shepards Bush Empire in London feiert. Das Konzert ist mittlerweile auf einer Doppel-DVD erhältlich.\n\nIm September 2005 erscheint das lang erwartete Album Revolution of the Heart, das Jones wiederum in seiner elektronischen Umgebung zeigt. Mit Just Look at You Now enthält es ein Lied, das in Schweden bereits hohe Chartplatzierungen erreichen konnte. Jones tourt im Jahr 2005 vornehmlich in Großbritannien und in den USA.\n\n2006 wurde sein Hit Things Can Only Get Better von der Gruppe The Disco Boys gecovert. Stilrichtung dieser Version ist House. Außerdem nahm Jones das Lied für die Videospielserie The Sims nochmals auf.\n\nIn seiner Karriere hat Howard Jones mit zahlreichen anderen Musikern zusammengearbeitet, wie z. B. Nick Beggs, Midge Ure, Robin Boult, Kevin Wilkinson, Ringo Starr, Nena, Juliane Werding oder Phil Collins.\n\nIm Juni 2006 fand eine Deutschland-Tournee mit Howard Jones statt. Die Tour startete am 16. Juni in Köln und endete am 23. Juni in Mainz. Dazwischen besuchte er die Städte Dortmund, Bochum, Berlin, Magdeburg und Halle an der Saale.\n\n2007 kam es zur Veröffentlichung einer Surround-Variante des Electronic-Albums Revolution of the Heart sowie dem zweiten Klavieralbum des Künstlers. Jones tourte mit akustischen Auftritten durch die Vereinigten Staaten, Großbritannien und Australien und stellte dabei auch neue Stücke vor.\n\nIm November 2009 erschien das neue Album Ordinary Heroes, von dem es auch eine limitierte Fassung mit 2 CDs gab, für die die enthaltenen Lieder nochmals als Orchesterversion aufgenommen wurden.\n\nHoward Jones lebt heute mit seiner Frau Jan und seinen drei Kindern im englischen Somerset. Er bekennt sich zum Buddhismus und ist aktiver Anhänger der neuen religiösen Bewegung Sōka Gakkai. \n(Wikipedia)",
      "biography_en": "Howard Jones is a English musician, singer and songwriter. According to the Guinness Book of British Hit Singles & Albums, \"Jones is an accomplished singer-songwriter who was a regular chart visitor in the mid-1980s with his brand of synthpop. Jones, who was equally popular in the U.S., appeared at Live Aid\". Allmusic journalist, Stephen Thomas Erlewine adds, \"Jones was one of the defining figures of mid-1980s synthpop. His music merged the technology intensive sound of New Wave with the cheery optimism of hippies and late 1960s pop. Jones racked up a string of hits in the mid and late 1980s, before he retreated into being a cult figure in the 1990s\". \nJohn Howard Jones is the eldest of four boys (Howard's brothers, Roy, Martin, and Paul, were all musicians and had their own band, called Red Beat, in the late 1970s and early 1980s). Born in Southampton to Welsh parents, he spent his early years growing up in Rhiwbina, Cardiff, South Wales where he attended Heol Llanishen Fach primary school, and then Whitchurch Grammar School; and later in Stokenchurch, near High Wycombe, Buckinghamshire, where he attended the Royal Grammar School. Jones took piano lessons from the age of seven, and when he was a teen, his family had relocated to Canada, which is where he joined his first band, a progressive rock group called Warrior. Eventually, Jones moved back to the United Kingdom, where he played in a number of different groups. He then spent a year at the Royal Northern College of Music in Manchester. \nJones appeared as a solo artist in local venues in High Wycombe, before inviting the mime artist Jed Hoile, who used to do improvised choreography, whilst doused in white paint, as Jones played behind him. In 1983, Jones hired the Marquee Club in London and invited record labels to come and see him perform. After a BBC Radio 1 session, he obtained support slots with China Crisis and OMD before signing to WEA in the UK and Elektra in the US in mid 1983. \nHis first single called \"New Song\" was released in September 1983 and reached the UK Top 5 and US Top 30. He made his debut performance on BBC Television's Top of the Pops in October 1983, and he watched his tape-delayed performance on a borrowed television resting on an ironing board before a concert at the University of Kent. He subsequently had four more hits over the next twelve months and a UK Number 1 album, Human's Lib, which eventually went double platinum. Credited with jointly writing the lyrics for six songs on the album was the lyricist Bill Bryant. Thanks to repeated exposure on MTV, the album became a moderate hit in the US. Later in 1984, \"New Song\" and \"What Is Love\" became American Top 40 hits, while \"Pearl in the Shell\" became his third UK Top 10 single. Human's Lib went gold and platinum in a number of countries. Jones had developed a loyal teen following, and his mother and father, Thelma and John Jones, ran his fan club. \nIn the summer of 1984, he released \"Like to Get to Know You Well\", which he said was 'dedicated to the original spirit of the Olympic Games'. Although it was not an official Olympic anthem for the Games in Los Angeles that summer, it was a worldwide hit. It reached Number 4 in the UK Singles Chart. The sleeve featured the song title in ten different languages; while Jones sang the title line in French and German on the extended 12\" version. The song also appeared in the film Better Off Dead (1985) and the computer game Grand Theft Auto: Vice City Stories (2006).\nJones' second long player was a remix album. It contained six songs, all but one of which had been previously released, but which appeared in elongated formats, including the multilingual version of \"Like to Get to Know You Well\". The record sleeve for The 12 Inch Album, featured a miniature Jones standing next to a 12-inch ruler. The album went gold in the UK.\nIn 1985, Jones released his second studio album, Dream into Action. He introduced his own backing band, including the female backing vocalist trio, Afrodiziak. Afrodiziak featured Caron Wheeler and Claudia Fontaine. Playing bass guitar was Jones' own brother, Martin. He had to have an extra string added to his instrument to play some of the bass lines, which had originally been played on a keyboard. One of the singles released from this album, \"No One Is to Blame\", was later re-recorded and featured Phil Collins as drummer and producer. Dream into Action was a worldwide hit and Jones' most successful album, reaching number 2 in the UK and number 10 in the US, staying on the US chart for almost a year. The album spawned the hit singles \"Things Can Only Get Better\", \"Life In One Day\", and \"Look Mama\". In July 1985, Jones performed at Wembley Stadium as part of the Live Aid concert, singing his 1984 hit \"Hide and Seek\" while playing a piano belonging to Freddie Mercury. He also embarked on a world tour reaching Japan, Australia and the US.\nIn the spring of 1986 in the US, he released Action Replay, an EP of remixes that featured a new version of \"No One Is to Blame\". It became Jones' biggest US hit, peaking at number 4. However, by this time, Jones' fortunes were changing in his native UK and \"No One Is To Blame\" peaked at number 16. His next single, \"All I Want\", peaked at number 35, and would be his last UK Top 40 hit. Jones released his third studio album, One To One, in October 1986, which peaked at number 10 in the UK and would be his last UK hit album, despite going gold there.  Stateside, however, Jones continued to fill large arenas and the single \"You Know I Love You Don't You?\" went top twenty in 1986 on the Billboard charts.\nIn June 1988, Jones performed at Amnesty International's Festival of Youth at the Milton Keynes Bowl. Jones' subsequent albums Cross That Line (1989) and In the Running (1992) both performed poorly in the UK, the latter even failing to chart there. However,he had further hits on the Billboard charts in the US during this period, including \"Everlasting Love\" (1989, his second number 1 hit on the US Hot Adult Contemporary Tracks chart after \"No One Is to Blame\"), \"The Prisoner\" (1989), and \"Lift Me Up\" (1992). \n\nJones continued to play large venues in the US during the late 1980s, and the Cross That line tour played major outdoor venues in the US, during 1989. With his ten-year tenure on the Warner music label at an end, a greatest hits compilation The Best of Howard Jones was released in 1993. The album peaked at number 36 in the UK, and by 2005 (12 years after its release) it was certified silver by the BPI for over 60,000 copies sold in the UK.\n\nJones also had success as a songwriter for other artists in the early 1990s. He co-wrote the dance music hits \"Heaven Give Me Words\" and \"Your Wildlife\" with the members of Propaganda. The tracks appeared on the 1990 album 1234; \"Heaven Give Me Words\" reached number 22 on the Adult Contemporary chart and \"Your Wildlife\" reached number 22 on the Dance Music/Club Play Singles chart.\nAfter Jones' contract with Warner Music UK expired, he concentrated on production, songwriting and running a successful vegetarian restaurant called 'Nowhere' (originally at 11 Waverly Place, New York City). He started his own record label, Dtox, releasing a number of albums through the label, such as Working in the Backroom, produced in his own recording studio ('The Shed'). The album, which sold over 20,000 copies in the first year of release, was made available only at concerts and through his official website.\nFor the next two years, Jones continually toured the US and Europe. In 1996, he released Live Acoustic America and People followed two years later.\nThe track \"If You Love\", was featured on the soundtrack to the TV series Party of Five. Jones continued to produce and write for a number of artists during the mid to late 1990s, including Martin Grech, DBA, and Sandie Shaw. In 2001, Jones played keyboards for Ringo Starr on his All Starr Band tour.\nOn 20 September 2003, Jones played a 20th anniversary concert at the Shepherds Bush Empire, London, commemorating the release of his first single. He was joined by Midge Ure and Nena, as well as his mime artist, Jed Hoile. A recording of this concert was later released on DVD. Jones continued to tour and write new music, collaborating with Robbie Bronnimann to co-write and co-produce music for Sugababes, and Jones' own 2005 album Revolution of the Heart. He toured playing gigs in the United States, Italy, Germany and Sweden and played a number of times at the Edinburgh Festival in 2006. The same year Jones provided a vocal for the song \"Into the Dark\" by Ferry Corsten for the latter's album, L.E.F. Jones also re-recorded \"Things Can Only Get Better\" in Simlish, the fictional language spoken by characters in Electronic Arts', The Sims 2. Jones was also featured on Katrina Carlson's cover of \"No One Is to Blame\", which entered the US Hot Adult Contemporary Tracks chart in 2007. \nIn October 2006, Jones released \"Building Our Own Future\" as a podsafe track, as one of several established artists looking to use podcasts as a new means of promoting their music and tours. The song debuted at number 1 on the PMC Top10 on 29 October 2006 and spent four weeks at the top of the chart. Howard's track \"Revolution of the Heart\" spent five weeks at number 1 on the PMC Top10 during 2007 and finished the year as the number 2 song in their annual countdown.\n\nJones embarked on an acoustic tour of Australia in 2007, beginning in Brisbane and concluding on 5 April in Perth. The Revolution Remixed & Surrounded album was followed in November by Live in Birkenhead. Jones performed another acoustic set, with other 1980s acts at the Retrofest, on 1 September 2007 at Culzean Castle in Ayrshire, Scotland. Jones also went into the studios with The Young Punx to record vocals for their summer 2008 release, \"And The Feel Goes On\".\n\nJones is a member of Sōka Gakkai International, and is musical director of one of its choirs, the Glorious Life Chorus. The chorus performs some of his songs in its repertoire, including \"Building Our Own Future\" and \"Respected\". He returned to Australia again in 2009, this time accompanied by vocalist Laura Clapp and music technologist Robbie Bronnimann. On 26 February 2009, Jones was at the UK premiere of Roland's new V-Piano in Bristol, and performed \"Hide and Seek\". He continues to tour, and played the 'Big Hair Affair 2009' on 1 August 2009 at the Ryedale Arena, Pickering, North Yorkshire.\nHis latest album, Ordinary Heroes was released in November 2009, and he toured London, Cardiff and Manchester with a string section and the Morriston Orpheus Choir (in St David's Hall in Cardiff). A single, \"Soon You'll Go\", preceded the album's launch.\n\nOn 29 November 2011, a UK tour was announced. Human's Lib and Dream Into Action were performed in April 2012 across eight venues. A weekly radio series coincided with tour called Electronic 80s with Howard Jones on Absolute Radio.\n\nHe recently appeared in \"The Song That Changed My Life\" on BYUtv, the cable station for Brigham Young University focusing on programming relating to the Church of Jesus Christ of Latter-day Saints. \nHe is a member of the board of directors for the Featured Artists Coalition. Jones currently lives in Creech St Michael, near Taunton, Somerset.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1955",
      "country": "Southampton, England, UK",
      "country_code": "GB",
      "died_year": null,
      "disbanded": false,
      "facebook": "",
      "formed_year": "1955",
      "gender": "Male",
      "genre": "Pop",
      "id": "123254",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/jones-howard-50fbc0fcc99a1.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/howard-jones-4f3a82bb3bd83.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/jones-howard-51c692c8f2609.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/jones-howard-580739732907c.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/eagu1h1710879537.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "1",
      "mood": "Good Natured",
      "music_videos": null,
      "musicbrainz_id": "23b2cc78-7595-4630-bebb-a349a4f25262",
      "name": "Howard Jones",
      "raw_data": {},
      "style": "Rock/Pop",
      "twitter": "1",
      "website": ""
    }
  },
  "spotify_id": "6loBF9iQdE11WSX29fNKqY",
  "spotify_url": "https://open.spotify.com/artist/6loBF9iQdE11WSX29fNKqY",
  "updated_at": "2025-07-08T20:52:58.835904",
  "wikipedia_url": null
}