{
  "apple_music_id": "872190",
  "apple_music_url": "https://music.apple.com/gb/artist/jeff-buckley/872190",
  "biography": "Jeffrey Scott \"Jeff\" Buckley (born in Anaheim, California, USA on 17 November 1966 – 29 May 1997), raised as Scotty Moorhead, was an American singer-songwriter and guitarist. He was the son of musicians Tim Buckley and Mary Guibert.\n\nHe had emerged in New York City's avant-garde club scene in the 1990s as one of the most remarkable musical artists of his generation, acclaimed by audiences, critics, and fellow musicians alike. His first commercial recording, the four-song EP Live At Sin-é, was released in December 1993 on Columbia Records. The EP captured Buckley, accompanying himself on electric guitar, in a tiny coffeehouse in New York's East Village, the neighbourhood he'd made his home.\n\nBuckley made his public singing début at a tribute concert for his father called \"Greetings from Tim Buckley\". The event, produced by show business veteran Hal Willner, was held at St. Ann's Church in Brooklyn on 26 April 1991.\n\nBy the time of the EP's release during the fall of 1993, Buckley had already entered the studio with Mick Grondahl (bass), Matt Johnson (drummer), and producer Andy Wallace and recorded seven original songs (including \"Grace\" and \"Last Goodbye\") and three covers (among them Leonard Cohen's \"Hallelujah\", Benjamin Britten's \"Corpus Christi Carol\") that comprised his debut album Grace. Guitarist Michael Tighe became a permanent member of Jeff Buckley's ensemble and went on to co-write and perform on Grace's \"So Real\" just prior to the release of the album.\n\nIn early 1994, not long after Live At Sin-é appeared in stores, Jeff Buckley toured clubs, lounges, and coffeehouses in North America as a solo artist from January 15th to March 5th as well as in Europe from March 11th to 22th. Following extensive rehearsals in April to May of 1994, Buckley's \"Peyote Radio Theatre Tour\" found him on the road with his band from June 2nd to August 16th. His full-length full-band album, Grace, was released in the United States on August 23rd, 1994, the same day Buckley and band kicked off a European tour in Dublin, Ireland; the 1994 European Tour ran through September 22nd, with Buckley and band performing at the CMJ convention at New York's Supper Club on September 24. The group headed back into America's clublands for a Fall Tour lasting from October 19th until December 18th.\n\nOn New Year's Eve 1994-95, Buckley returned to Sin-é to perform a solo set; on New Year's Day, he read an original poem at the annual St. Mark's Church Marathon Poetry Reading. Two weeks later, he and his band were back in Europe for gigs in Dublin, Bristol, and London before launching an extensive tour of Japan, France, Germany, Italy, Holland, Belgium, and the United Kingdom which lasted from January 29th to March 5th. On April 13th 1995, it was announced that Jeff Buckley's Grace had earned him France's prestigious \"Gran Prix International Du Disque -- Academie Charles CROS -- 1995\"; an award given by a jury of producers, journalists, the president of France Culture, and music industry professionals, it had previously been given to Edith Piaf, Jacques Brel, Yves Montand, Georges Brassens, Bruce Springsteen, Leonard Cohen, Bob Dylan, Joan Baez, and Joni Mitchell, among other musical luminaries. France also awarded Buckley a gold record certification for Grace.\n\nFrom March 5th through April 20th, Buckley and his band rehearsed for an American spring tour with gigs running from April 22th until June 2nd. From June through August, Jeff and company toured the United Kingdom, France, Denmark, Belgium, Germany, the Netherlands, Italy, and Switzerland. The band took off for Down Under to play six Australian shows between August 28th and September 6th, 1995. In November 1995, Buckley played two unannounced solo shows at Sin-é. He performed songs including the new \"Woke Up In A Strange Place\" on Vin Scelsa's \"Idiot's Delight\" show on WXRK-FM on December 17 and celebrated New Year's Eve 1995-96 with performances at New York's Mercury Lounge and Sin-é.\n\nJeff Buckley and his touring ensemble went back to Australia, where Grace had earned a gold record certification, for the \"Hard Luck Tour,\" which ran from February 9th to March 1st of 1996. Drummer Matt Johnson left the group after the final Australian show. The posthumous album Mystery White Boy brings together some of the high points from Jeff's 1995-1996 live performances. The DVD/home video release Live In Chicago documents, in its entirety, Jeff's concert at The Cabaret Metro in Chicago on May 13th, 1995.\n\nIn May of '96, Jeff played four gigs as a bass player with Mind Science of the Mind, a side-project of Buckley's friend, Nathan Larson of Shudder To Think. In September Buckley played another unannounced solo gig at his old favorite haunt Sin-é. December of 1996 found Jeff Buckley embarking on his \"phantom solo tour\"; designed to experiment with new songs in a live setting (as in his Sin-é days), these unannounced solo gigs throughout the Northeast U.S. were played under a succession of aliases: the Crackrobats, Possessed By Elves, Father Demo, Smackrobiotic, the Halfspeeds, Crit Club, Topless America, Martha & the Nicotines, and A Puppet Show Named Julio.\n\nAt midnight on February 9th, 1997, Jeff Buckley debuted his new drummer, Parker Kindred, in a show at Arlene Grocery on New York's Lower East Side. He also played a couple of solo gigs in New York during the first months of 1997: a gig at the Daydream Cafe (featuring band members Mick Grondahl and Michael Tighe as \"special guests\") and a solo performance February 4th as part of the Knitting Factory's 10-Year Birthday Party.\n\nBuckley and his band had recorded intermittently — with Tom Verlaine as producer — during Summer/Fall 1996 and early winter 1997 in New York and in February 1997 in Memphis. After the conclusion of those sessions, Jeff sent the band back to New York while, during March and April 1997, he remained in Memphis and continued to craft his work-in-progress, making various four-track home recordings of songs to present to his bandmates. Some of these were revisions of the songs recorded with Verlaine, some were brand new compositions, and some were surprising cover versions. The new lineup debuted Buckley's new songs at Barrister's in Memphis on February 12th and 13th. Beginning March 31st, Jeff began a series of regularly scheduled Monday night solo performances at Barrister's. His last show there was on Monday, May 26th, 1997.\n\nBuckley passed away in a drowning accident in the Wolf River, a tributary of the Mississippi River, on May 29th, 1997. The night Buckley died, he was on his way to meet his band to begin three weeks of rehearsals for My Sweetheart, the Drunk; producer Andy Wallace, who'd helmed the boards on Grace, was to join them in Memphis in late June to record his new album.\n\nIn addition to his Columbia Records releases, Live At Sin-é and Grace, Jeff Buckley has appeared as a guest artist on several other recordings. He can be heard singing \"Jolly Street,\" a track on the Jazz Passengers 1994 album In Love. He contributed tenor vocals to \"Taipan\" and \"D. Popylepis,\" two recordings on John Zorn's Cobra Live At The Knitting Factory (1995). On Rebecca Moore's Admiral Charcoal's Song, Buckley plays electric six-string bass on \"If You Please Me,\" \"Outdoor Elevator,\" and \"Needle Men\" (on which he also plays drums). He both plays guitar and sings backup vocals on Brenda Kahn's \"Faith Salons,\" a key track on her Destination Anywhere album (released 1996). Patti Smith's critically acclaimed Gone Again album features Buckley adding \"voice\" to the song \"Beneath the Southern Cross\" and \"essrage\" (a small fretless Indian stringed instrument) to \"Fireflies.\" On Kerouac: Kicks Joy Darkness, a various artists' spoken word tribute to beat poet Jack Kerouac, Jeff Buckley performed on \"Angel Mine\"; Jeff plays guitar, sitar, and mouth sax (adding words at the poem's conclusion) on the track. Buckley can be heard reading Edgar Allan Poe's \"Ulallume - A Ballad,\" on Closed on Account of Rabies: Poems and Tales of Edgar Allan Poe (disc 2: The Devil's Brew) (Poems & Tales by Edgar Allan Poe) on Mouth Almighty/Mercury Records. He sang \"I Want Someone Badly\" (Epic) for Shudder To Think's soundtrack to First Love, Last Rites. Sandy Bell, a friend of Buckley's during his L.A. days, released the resurrected track \"Hollywould\" in 2000, which she co-wrote and recorded with Buckley.\n\nAn ardent enthusiast for a myriad of musical forms, Jeff Buckley was an early champion among young American musicians for the work of Nusrat Fateh Ali Khan, the world's foremost Qawwali (the music of the Sufis) singer. Buckley conducted an extensive interview with Nusrat in Interview magazine (January 1996) and wrote the liner notes Nusrat's The Supreme Collection album, released on Mercator/Caroline records in August 1997. On May 9th, 2000, Columbia Records released Mystery White Boy, an album of live performances, and Live In Chicago, a full-length concert (available on DVD or VHS) recorded live at The Cabaret Metro in Chicago on May 13, 1995, in the middle of Jeff's \"Mystery White Boy\" tour.\n\nFollowing the release of Grace on August 23rd, 1994, Jeff and his group spent much of 1994-1996 performing around the world on the Unknown, Mystery White Boy, and Hard Luck tours. Mystery White Boy brings together, for the first time, some of the high points of those shows. Produced by Michael Tighe (guitarist for Jeff's band throughout their international touring and the recording of Grace) and Mary Guibert (Jeff's mother) and Mystery White Boy provides an evocative cross-section of Jeff's repertoire: previously-unreleased Buckley compositions, electrifying live interpretations of songs from Grace, and obscure and marvelous cover choices. The recordings heard on Mystery White Boy have been hand-picked from scores of concert tapes by Mary Guibert and the members of Jeff's band who played such a large role in helping Jeff realize his musical vision.\n\nAccording to Mary, the tracks on Mystery White Boy are \"the individual performances that represented transcendent moments from each of the concerts we'd identified as being in the 'overall outstanding' category.\"\n\n\"It was obvious which performances were contenders for the record,\" concurs Michael Tighe, \"and in some cases a performance would be so supreme and unpredictable that I knew it had to be brought to the public.\"\n\nThe posthumous album Sketches For My Sweetheart The Drunk was released in 1998 and included songs Buckley was working on while in Memphis for his upcoming release.\n\nTribute songs:\nPJ Harvey - Memphis\nRufus Wainwright- Memphis Skyline\nMark Eitzel - To the Sea\nZita Swoon - Song for a Dead Singer\nAmy Correia - Blind River Boy\nDuncan Sheik - A Body Goes Down\nChris Cornell - Wave Goodbye\nKatatonia - Nightmares by the Sea\nWillie Nile - On the Road to Calvary\nRachael Sage - Grace\nAimee Mann - Just Like Anyone\nCocteau Twins - Rilkean Heart\nJim Major - Angels Fall (Song for Jeff Buckley)\n\nA film about Buckley's life, a biopic called \"Mystery White Boy\", is currently in pre-production. Actors have not yet been cast, according to IMDB. <a href=\"https://www.last.fm/music/Jeff+Buckley\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T16:51:53.642220",
  "discogs_id": "159169",
  "discogs_url": "https://www.discogs.com/artist/159169-Jeff-Buckley",
  "followers": 2008110,
  "formed_date": null,
  "genres": [
    "Alternative",
    "singer-songwriter",
    "rock",
    "alternative",
    "indie",
    "folk"
  ],
  "id": "jeff-buckley-1751730719",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/a1/7b/ee/a17bee71-1eeb-a3c0-f216-ad7889a2b89e/mza_214942018704718360.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 1520,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/67779606c7f151618a28f62b1d24fb514d39dacf",
      "width": 1000
    },
    {
      "height": 973,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/248e8ddbf1be229fd0c31722fb0a01b31b01f474",
      "width": 640
    },
    {
      "height": 304,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/8822f816dea6ea25c70e942763c9812c6271e516",
      "width": 200
    },
    {
      "height": 97,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/2a93d455e8981b0e1f6f1918b934c454c1243b20",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/OOfeca6DhULKKwmdMPIgHHeuV1Ti_GSTppzm6Z1RqQo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/1N1HROBFbes1VsoNfNnrERu_KvDI-Wx2LFT16jJqpIc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "e6e879c0-3d56-4f12-b3c5-3ce459661a8e",
  "lastfm_url": "https://www.last.fm/music/Jeff+Buckley",
  "local_images": {
    "hi-res": "../public/artist/jeff-buckley/jeff-buckley-hi-res.jpg",
    "medium": "../public/artist/jeff-buckley/jeff-buckley-medium.jpg",
    "small": "../public/artist/jeff-buckley/jeff-buckley-small.jpg"
  },
  "name": "Jeff Buckley",
  "popularity": 75,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/a1/7b/ee/a17bee71-1eeb-a3c0-f216-ad7889a2b89e/mza_214942018704718360.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Alternative"
      ],
      "id": "872190",
      "name": "Jeff Buckley",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/jeff-buckley/872190"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/OOfeca6DhULKKwmdMPIgHHeuV1Ti_GSTppzm6Z1RqQo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "159169",
      "images": [
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/OOfeca6DhULKKwmdMPIgHHeuV1Ti_GSTppzm6Z1RqQo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/OOfeca6DhULKKwmdMPIgHHeuV1Ti_GSTppzm6Z1RqQo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/1N1HROBFbes1VsoNfNnrERu_KvDI-Wx2LFT16jJqpIc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/eMXmfTVTo3HtxeNyqqcpTFFnfst9nPzS8uImYQo3Peo/rs:fit/g:sm/q:90/h:600/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTk0/LTU4MjMuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/eMXmfTVTo3HtxeNyqqcpTFFnfst9nPzS8uImYQo3Peo/rs:fit/g:sm/q:90/h:600/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTk0/LTU4MjMuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/JHCp2XbrCE47xUsz9zo0O8sgwh14K08fvOoTCeY548U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTk0/LTU4MjMuanBlZw.jpeg",
          "width": 527
        },
        {
          "height": 480,
          "resource_url": "https://i.discogs.com/9aHeUD4LwXZ1ZZ8kBhDRqpNxONxEcy0EmaPhY7YeA88/rs:fit/g:sm/q:90/h:480/w:376/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTQ3/LTY2MTkuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/9aHeUD4LwXZ1ZZ8kBhDRqpNxONxEcy0EmaPhY7YeA88/rs:fit/g:sm/q:90/h:480/w:376/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTQ3/LTY2MTkuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/VYL_gls6PETCxsfSQS-k5c-SyILBfSP85jQtntxqojc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTQ3/LTY2MTkuanBlZw.jpeg",
          "width": 376
        },
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/tXXmT5itIKcqFNqI7HxYsmPhcvpq39t1Fi-m2C0EKSM/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzkyOTA5OTg4/LTU1MjMuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/tXXmT5itIKcqFNqI7HxYsmPhcvpq39t1Fi-m2C0EKSM/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzkyOTA5OTg4/LTU1MjMuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/87FKaFN9lyoS_Zad_FxWpUaS0SJUjVtm8KKR4UUOvnU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzkyOTA5OTg4/LTU1MjMuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 391,
          "resource_url": "https://i.discogs.com/3SzNsCEDhPdOmjOaqNSFJd5j_afHoD_WE1CR5t1njdo/rs:fit/g:sm/q:90/h:391/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjM5/LTY0MjMuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/3SzNsCEDhPdOmjOaqNSFJd5j_afHoD_WE1CR5t1njdo/rs:fit/g:sm/q:90/h:391/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjM5/LTY0MjMuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/D49vS9NTM8L1cC5RJPclszeiJCdxt62GqDB6jFV6Ewg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjM5/LTY0MjMuanBlZw.jpeg",
          "width": 600
        },
        {
          "height": 500,
          "resource_url": "https://i.discogs.com/rNhnMkEuwxRbYdsTJAaoFk9SFZobceiMn9f3LlH0Ycg/rs:fit/g:sm/q:90/h:500/w:468/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjI0/LTg1MTkuanBlZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/rNhnMkEuwxRbYdsTJAaoFk9SFZobceiMn9f3LlH0Ycg/rs:fit/g:sm/q:90/h:500/w:468/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjI0/LTg1MTkuanBlZw.jpeg",
          "uri150": "https://i.discogs.com/L-EoYD3Wv3Ht9FpzQa7Ps1dF9y8o2BFfo6s9FocFbsc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjI0/LTg1MTkuanBlZw.jpeg",
          "width": 468
        },
        {
          "height": 403,
          "resource_url": "https://i.discogs.com/YV6bbbxeJgSZWCgAWezUErGCfhFPUaYEPMTAcc9a8S4/rs:fit/g:sm/q:90/h:403/w:334/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTIw/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/YV6bbbxeJgSZWCgAWezUErGCfhFPUaYEPMTAcc9a8S4/rs:fit/g:sm/q:90/h:403/w:334/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTIw/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/zpWTpV90noiLlTl3ua3K5d60rWKxwvp5bLQRK5yI_Tw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTIw/LmpwZWc.jpeg",
          "width": 334
        },
        {
          "height": 335,
          "resource_url": "https://i.discogs.com/-oD-T0MseYZXLHZOXq59OoAjoH-rOzdh0O4GRAwahSc/rs:fit/g:sm/q:90/h:335/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTI5/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/-oD-T0MseYZXLHZOXq59OoAjoH-rOzdh0O4GRAwahSc/rs:fit/g:sm/q:90/h:335/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTI5/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/sm1TVyxMFz4AMQ4ErQlLNFxOuzsz4ReThmqyKDGyQhU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTI5/LmpwZWc.jpeg",
          "width": 360
        },
        {
          "height": 474,
          "resource_url": "https://i.discogs.com/zN0TC7LH8nWBq8algCITRCMaFnYiZMCI2Dl4ycGMZKk/rs:fit/g:sm/q:90/h:474/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTE4/LmpwZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/zN0TC7LH8nWBq8algCITRCMaFnYiZMCI2Dl4ycGMZKk/rs:fit/g:sm/q:90/h:474/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTE4/LmpwZw.jpeg",
          "uri150": "https://i.discogs.com/0eXxDu0nj3CuWz90N8uYRdLgubLZaW7UPHm83BZ9UI4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTE4/LmpwZw.jpeg",
          "width": 300
        },
        {
          "height": 238,
          "resource_url": "https://i.discogs.com/sMloy5JnSwyMGQSUHF0KB7ny02zs8AcR_ktAzAotgF0/rs:fit/g:sm/q:90/h:238/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTEx/LmpwZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/sMloy5JnSwyMGQSUHF0KB7ny02zs8AcR_ktAzAotgF0/rs:fit/g:sm/q:90/h:238/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTEx/LmpwZw.jpeg",
          "uri150": "https://i.discogs.com/C2dxjgasY4iYc2pbxg8_-LO4Ean673SsX3WPiOYVPkk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTEx/LmpwZw.jpeg",
          "width": 300
        },
        {
          "height": 394,
          "resource_url": "https://i.discogs.com/rBAwFFOlDUQzitEicbLXW9YDxF24uZcQVYS2ZFIf3C4/rs:fit/g:sm/q:90/h:394/w:345/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMjk1NTU0MDI3/LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/rBAwFFOlDUQzitEicbLXW9YDxF24uZcQVYS2ZFIf3C4/rs:fit/g:sm/q:90/h:394/w:345/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMjk1NTU0MDI3/LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/0zlgf-Ec0ZtuddUZNZ0kBgzOx3Ri4X1SLZh5mwgrneI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMjk1NTU0MDI3/LmpwZWc.jpeg",
          "width": 345
        },
        {
          "height": 291,
          "resource_url": "https://i.discogs.com/cEkt7COk-cVeHIjU5Zl7p6B42snDaTZ6b7I6tEoiE6Y/rs:fit/g:sm/q:90/h:291/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMDgxNDQzNjM5/LmpwZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/cEkt7COk-cVeHIjU5Zl7p6B42snDaTZ6b7I6tEoiE6Y/rs:fit/g:sm/q:90/h:291/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMDgxNDQzNjM5/LmpwZw.jpeg",
          "uri150": "https://i.discogs.com/l54JqhI9ePpxSzVuyS0sokyShWWOxEsqaVHpQqYgb84/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMDgxNDQzNjM5/LmpwZw.jpeg",
          "width": 200
        },
        {
          "height": 198,
          "resource_url": "https://i.discogs.com/xXwuyq6GO384qGHkRDaUgHG3LausDvoZ7YPJfAyKWCM/rs:fit/g:sm/q:90/h:198/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTAz/LmpwZw.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/xXwuyq6GO384qGHkRDaUgHG3LausDvoZ7YPJfAyKWCM/rs:fit/g:sm/q:90/h:198/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTAz/LmpwZw.jpeg",
          "uri150": "https://i.discogs.com/RNPFEI43B2ITAs2jLEm_F8jWKSNdnmIQxYcrHDHWYxQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTAz/LmpwZw.jpeg",
          "width": 300
        }
      ],
      "members": [],
      "name": "Jeff Buckley",
      "namevariations": [
        "Buckley",
        "J Buckley",
        "J. Beckley",
        "J. Buckely",
        "J. Buckey",
        "J. Buckley",
        "J.Buckley",
        "Jeff"
      ],
      "profile": "Jeffrey Scott Buckley (November 17, 1966 - May 29, 1997) was an American singer and guitarist who died at a young age, just like his father [a71872]. His unique voice, spanning four octaves, quickly launched him to semi-celebrity. After playing with experimental guitarist Gary Lucas in his band [a1263938], he released his first album Grace in 1994. Initial sales were slow but the album quickly received critical acclaim and appreciation from other musicians (among them Jimmy Page, Robert Plant, Bob Dylan and Paul McCartney). Just before recordings began for his second album which was to be called My Sweetheart The Drunk, Buckley drowned in the Wolf River in Memphis, Tennessee, aged 30.\r\n\r\nAfter Buckley's death some of the demo recordings for his second album were released on Sketches For My Sweetheart The Drunk. Early session work recorded in February 1993 was officially released in 2016 and 2019, and several albums composed of live recordings have also been released, along with a DVD of a live performance in Chicago. Fun fact: before breaking through Jeff Buckley had worked for 6 years as a receptionist at Magic Hotel in Los Angeles, California, USA.",
      "raw_data": {
        "aliases": [
          {
            "id": 1003717,
            "name": "Maria Sanchez (2)",
            "resource_url": "https://api.discogs.com/artists/1003717",
            "thumbnail_url": ""
          }
        ],
        "data_quality": "Correct",
        "groups": [
          {
            "active": true,
            "id": 1003716,
            "name": "Un Cuerpo Exquisito",
            "resource_url": "https://api.discogs.com/artists/1003716",
            "thumbnail_url": "https://i.discogs.com/hZZhsSSaPJblVFetMfmo3Nfhka1brHB__tj-atQPVhw/rs:fit/g:sm/q:40/h:350/w:274/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEwMDM3/MTYtMTU5NjczNTQz/Ny03OTUyLmdpZg.jpeg"
          },
          {
            "active": true,
            "id": 1263938,
            "name": "Gods and Monsters",
            "resource_url": "https://api.discogs.com/artists/1263938",
            "thumbnail_url": "https://i.discogs.com/ubvlBggMZxI3gE5mtwwc7UITZgugEEP8qe7OMO7f6UA/rs:fit/g:sm/q:40/h:812/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNjM5/MzgtMTYyNjU5OTg3/NC0xOTI1LmpwZWc.jpeg"
          },
          {
            "active": true,
            "id": 2292699,
            "name": "The Seedy Arkhestra",
            "resource_url": "https://api.discogs.com/artists/2292699",
            "thumbnail_url": ""
          },
          {
            "active": true,
            "id": 8578419,
            "name": "The Jeff Buckley Band",
            "resource_url": "https://api.discogs.com/artists/8578419",
            "thumbnail_url": "https://i.discogs.com/Ba1rhIJw20gj_547i644EElTmnMhhk0IM_1oxlG2o5E/rs:fit/g:sm/q:40/h:331/w:493/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTg1Nzg0/MTktMTYxMDY1ODM4/OC02MDM0LmpwZWc.jpeg"
          }
        ],
        "id": 159169,
        "images": [
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/OOfeca6DhULKKwmdMPIgHHeuV1Ti_GSTppzm6Z1RqQo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/OOfeca6DhULKKwmdMPIgHHeuV1Ti_GSTppzm6Z1RqQo/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/1N1HROBFbes1VsoNfNnrERu_KvDI-Wx2LFT16jJqpIc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/eMXmfTVTo3HtxeNyqqcpTFFnfst9nPzS8uImYQo3Peo/rs:fit/g:sm/q:90/h:600/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTk0/LTU4MjMuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/eMXmfTVTo3HtxeNyqqcpTFFnfst9nPzS8uImYQo3Peo/rs:fit/g:sm/q:90/h:600/w:527/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTk0/LTU4MjMuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/JHCp2XbrCE47xUsz9zo0O8sgwh14K08fvOoTCeY548U/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTk0/LTU4MjMuanBlZw.jpeg",
            "width": 527
          },
          {
            "height": 480,
            "resource_url": "https://i.discogs.com/9aHeUD4LwXZ1ZZ8kBhDRqpNxONxEcy0EmaPhY7YeA88/rs:fit/g:sm/q:90/h:480/w:376/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTQ3/LTY2MTkuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/9aHeUD4LwXZ1ZZ8kBhDRqpNxONxEcy0EmaPhY7YeA88/rs:fit/g:sm/q:90/h:480/w:376/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTQ3/LTY2MTkuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/VYL_gls6PETCxsfSQS-k5c-SyILBfSP85jQtntxqojc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIxMTQ3/LTY2MTkuanBlZw.jpeg",
            "width": 376
          },
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/tXXmT5itIKcqFNqI7HxYsmPhcvpq39t1Fi-m2C0EKSM/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzkyOTA5OTg4/LTU1MjMuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/tXXmT5itIKcqFNqI7HxYsmPhcvpq39t1Fi-m2C0EKSM/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzkyOTA5OTg4/LTU1MjMuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/87FKaFN9lyoS_Zad_FxWpUaS0SJUjVtm8KKR4UUOvnU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzkyOTA5OTg4/LTU1MjMuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 391,
            "resource_url": "https://i.discogs.com/3SzNsCEDhPdOmjOaqNSFJd5j_afHoD_WE1CR5t1njdo/rs:fit/g:sm/q:90/h:391/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjM5/LTY0MjMuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/3SzNsCEDhPdOmjOaqNSFJd5j_afHoD_WE1CR5t1njdo/rs:fit/g:sm/q:90/h:391/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjM5/LTY0MjMuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/D49vS9NTM8L1cC5RJPclszeiJCdxt62GqDB6jFV6Ewg/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjM5/LTY0MjMuanBlZw.jpeg",
            "width": 600
          },
          {
            "height": 500,
            "resource_url": "https://i.discogs.com/rNhnMkEuwxRbYdsTJAaoFk9SFZobceiMn9f3LlH0Ycg/rs:fit/g:sm/q:90/h:500/w:468/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjI0/LTg1MTkuanBlZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/rNhnMkEuwxRbYdsTJAaoFk9SFZobceiMn9f3LlH0Ycg/rs:fit/g:sm/q:90/h:500/w:468/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjI0/LTg1MTkuanBlZw.jpeg",
            "uri150": "https://i.discogs.com/L-EoYD3Wv3Ht9FpzQa7Ps1dF9y8o2BFfo6s9FocFbsc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDI2MDIwNjI0/LTg1MTkuanBlZw.jpeg",
            "width": 468
          },
          {
            "height": 403,
            "resource_url": "https://i.discogs.com/YV6bbbxeJgSZWCgAWezUErGCfhFPUaYEPMTAcc9a8S4/rs:fit/g:sm/q:90/h:403/w:334/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTIw/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/YV6bbbxeJgSZWCgAWezUErGCfhFPUaYEPMTAcc9a8S4/rs:fit/g:sm/q:90/h:403/w:334/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTIw/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/zpWTpV90noiLlTl3ua3K5d60rWKxwvp5bLQRK5yI_Tw/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTIw/LmpwZWc.jpeg",
            "width": 334
          },
          {
            "height": 335,
            "resource_url": "https://i.discogs.com/-oD-T0MseYZXLHZOXq59OoAjoH-rOzdh0O4GRAwahSc/rs:fit/g:sm/q:90/h:335/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTI5/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/-oD-T0MseYZXLHZOXq59OoAjoH-rOzdh0O4GRAwahSc/rs:fit/g:sm/q:90/h:335/w:360/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTI5/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/sm1TVyxMFz4AMQ4ErQlLNFxOuzsz4ReThmqyKDGyQhU/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMzI1OTM5MTI5/LmpwZWc.jpeg",
            "width": 360
          },
          {
            "height": 474,
            "resource_url": "https://i.discogs.com/zN0TC7LH8nWBq8algCITRCMaFnYiZMCI2Dl4ycGMZKk/rs:fit/g:sm/q:90/h:474/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTE4/LmpwZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/zN0TC7LH8nWBq8algCITRCMaFnYiZMCI2Dl4ycGMZKk/rs:fit/g:sm/q:90/h:474/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTE4/LmpwZw.jpeg",
            "uri150": "https://i.discogs.com/0eXxDu0nj3CuWz90N8uYRdLgubLZaW7UPHm83BZ9UI4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTE4/LmpwZw.jpeg",
            "width": 300
          },
          {
            "height": 238,
            "resource_url": "https://i.discogs.com/sMloy5JnSwyMGQSUHF0KB7ny02zs8AcR_ktAzAotgF0/rs:fit/g:sm/q:90/h:238/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTEx/LmpwZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/sMloy5JnSwyMGQSUHF0KB7ny02zs8AcR_ktAzAotgF0/rs:fit/g:sm/q:90/h:238/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTEx/LmpwZw.jpeg",
            "uri150": "https://i.discogs.com/C2dxjgasY4iYc2pbxg8_-LO4Ean673SsX3WPiOYVPkk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTEx/LmpwZw.jpeg",
            "width": 300
          },
          {
            "height": 394,
            "resource_url": "https://i.discogs.com/rBAwFFOlDUQzitEicbLXW9YDxF24uZcQVYS2ZFIf3C4/rs:fit/g:sm/q:90/h:394/w:345/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMjk1NTU0MDI3/LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/rBAwFFOlDUQzitEicbLXW9YDxF24uZcQVYS2ZFIf3C4/rs:fit/g:sm/q:90/h:394/w:345/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMjk1NTU0MDI3/LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/0zlgf-Ec0ZtuddUZNZ0kBgzOx3Ri4X1SLZh5mwgrneI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMjk1NTU0MDI3/LmpwZWc.jpeg",
            "width": 345
          },
          {
            "height": 291,
            "resource_url": "https://i.discogs.com/cEkt7COk-cVeHIjU5Zl7p6B42snDaTZ6b7I6tEoiE6Y/rs:fit/g:sm/q:90/h:291/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMDgxNDQzNjM5/LmpwZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/cEkt7COk-cVeHIjU5Zl7p6B42snDaTZ6b7I6tEoiE6Y/rs:fit/g:sm/q:90/h:291/w:200/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMDgxNDQzNjM5/LmpwZw.jpeg",
            "uri150": "https://i.discogs.com/l54JqhI9ePpxSzVuyS0sokyShWWOxEsqaVHpQqYgb84/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMDgxNDQzNjM5/LmpwZw.jpeg",
            "width": 200
          },
          {
            "height": 198,
            "resource_url": "https://i.discogs.com/xXwuyq6GO384qGHkRDaUgHG3LausDvoZ7YPJfAyKWCM/rs:fit/g:sm/q:90/h:198/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTAz/LmpwZw.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/xXwuyq6GO384qGHkRDaUgHG3LausDvoZ7YPJfAyKWCM/rs:fit/g:sm/q:90/h:198/w:300/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTAz/LmpwZw.jpeg",
            "uri150": "https://i.discogs.com/RNPFEI43B2ITAs2jLEm_F8jWKSNdnmIQxYcrHDHWYxQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xMTA2NjIxNTAz/LmpwZw.jpeg",
            "width": 300
          }
        ],
        "name": "Jeff Buckley",
        "namevariations": [
          "Buckley",
          "J Buckley",
          "J. Beckley",
          "J. Buckely",
          "J. Buckey",
          "J. Buckley",
          "J.Buckley",
          "Jeff"
        ],
        "profile": "Jeffrey Scott Buckley (November 17, 1966 - May 29, 1997) was an American singer and guitarist who died at a young age, just like his father [a71872]. His unique voice, spanning four octaves, quickly launched him to semi-celebrity. After playing with experimental guitarist Gary Lucas in his band [a1263938], he released his first album Grace in 1994. Initial sales were slow but the album quickly received critical acclaim and appreciation from other musicians (among them Jimmy Page, Robert Plant, Bob Dylan and Paul McCartney). Just before recordings began for his second album which was to be called My Sweetheart The Drunk, Buckley drowned in the Wolf River in Memphis, Tennessee, aged 30.\r\n\r\nAfter Buckley's death some of the demo recordings for his second album were released on Sketches For My Sweetheart The Drunk. Early session work recorded in February 1993 was officially released in 2016 and 2019, and several albums composed of live recordings have also been released, along with a DVD of a live performance in Chicago. Fun fact: before breaking through Jeff Buckley had worked for 6 years as a receptionist at Magic Hotel in Los Angeles, California, USA.",
        "realname": "Jeffrey Scott Buckley",
        "releases_url": "https://api.discogs.com/artists/159169/releases",
        "resource_url": "https://api.discogs.com/artists/159169",
        "uri": "https://www.discogs.com/artist/159169-Jeff-Buckley",
        "urls": [
          "https://jeffbuckley.com/",
          "https://www.facebook.com/JeffBuckley",
          "https://twitter.com/jeffbuckley",
          "https://en.wikipedia.org/wiki/Jeff_Buckley",
          "https://www.youtube.com/@jeffbuckleyVEVO"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/159169",
      "thumb": "https://i.discogs.com/1N1HROBFbes1VsoNfNnrERu_KvDI-Wx2LFT16jJqpIc/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE1OTE2/OS0xNDUwMDkxNDI3/LTgzMDcuanBlZw.jpeg",
      "url": "https://www.discogs.com/artist/159169-Jeff-Buckley",
      "urls": [
        "https://jeffbuckley.com/",
        "https://www.facebook.com/JeffBuckley",
        "https://twitter.com/jeffbuckley",
        "https://en.wikipedia.org/wiki/Jeff_Buckley",
        "https://www.youtube.com/@jeffbuckleyVEVO"
      ]
    },
    "lastfm": {
      "bio_content": "Jeffrey Scott \"Jeff\" Buckley (born in Anaheim, California, USA on 17 November 1966 – 29 May 1997), raised as Scotty Moorhead, was an American singer-songwriter and guitarist. He was the son of musicians Tim Buckley and Mary Guibert.\n\nHe had emerged in New York City's avant-garde club scene in the 1990s as one of the most remarkable musical artists of his generation, acclaimed by audiences, critics, and fellow musicians alike. His first commercial recording, the four-song EP Live At Sin-é, was released in December 1993 on Columbia Records. The EP captured Buckley, accompanying himself on electric guitar, in a tiny coffeehouse in New York's East Village, the neighbourhood he'd made his home.\n\nBuckley made his public singing début at a tribute concert for his father called \"Greetings from Tim Buckley\". The event, produced by show business veteran Hal Willner, was held at St. Ann's Church in Brooklyn on 26 April 1991.\n\nBy the time of the EP's release during the fall of 1993, Buckley had already entered the studio with Mick Grondahl (bass), Matt Johnson (drummer), and producer Andy Wallace and recorded seven original songs (including \"Grace\" and \"Last Goodbye\") and three covers (among them Leonard Cohen's \"Hallelujah\", Benjamin Britten's \"Corpus Christi Carol\") that comprised his debut album Grace. Guitarist Michael Tighe became a permanent member of Jeff Buckley's ensemble and went on to co-write and perform on Grace's \"So Real\" just prior to the release of the album.\n\nIn early 1994, not long after Live At Sin-é appeared in stores, Jeff Buckley toured clubs, lounges, and coffeehouses in North America as a solo artist from January 15th to March 5th as well as in Europe from March 11th to 22th. Following extensive rehearsals in April to May of 1994, Buckley's \"Peyote Radio Theatre Tour\" found him on the road with his band from June 2nd to August 16th. His full-length full-band album, Grace, was released in the United States on August 23rd, 1994, the same day Buckley and band kicked off a European tour in Dublin, Ireland; the 1994 European Tour ran through September 22nd, with Buckley and band performing at the CMJ convention at New York's Supper Club on September 24. The group headed back into America's clublands for a Fall Tour lasting from October 19th until December 18th.\n\nOn New Year's Eve 1994-95, Buckley returned to Sin-é to perform a solo set; on New Year's Day, he read an original poem at the annual St. Mark's Church Marathon Poetry Reading. Two weeks later, he and his band were back in Europe for gigs in Dublin, Bristol, and London before launching an extensive tour of Japan, France, Germany, Italy, Holland, Belgium, and the United Kingdom which lasted from January 29th to March 5th. On April 13th 1995, it was announced that Jeff Buckley's Grace had earned him France's prestigious \"Gran Prix International Du Disque -- Academie Charles CROS -- 1995\"; an award given by a jury of producers, journalists, the president of France Culture, and music industry professionals, it had previously been given to Edith Piaf, Jacques Brel, Yves Montand, Georges Brassens, Bruce Springsteen, Leonard Cohen, Bob Dylan, Joan Baez, and Joni Mitchell, among other musical luminaries. France also awarded Buckley a gold record certification for Grace.\n\nFrom March 5th through April 20th, Buckley and his band rehearsed for an American spring tour with gigs running from April 22th until June 2nd. From June through August, Jeff and company toured the United Kingdom, France, Denmark, Belgium, Germany, the Netherlands, Italy, and Switzerland. The band took off for Down Under to play six Australian shows between August 28th and September 6th, 1995. In November 1995, Buckley played two unannounced solo shows at Sin-é. He performed songs including the new \"Woke Up In A Strange Place\" on Vin Scelsa's \"Idiot's Delight\" show on WXRK-FM on December 17 and celebrated New Year's Eve 1995-96 with performances at New York's Mercury Lounge and Sin-é.\n\nJeff Buckley and his touring ensemble went back to Australia, where Grace had earned a gold record certification, for the \"Hard Luck Tour,\" which ran from February 9th to March 1st of 1996. Drummer Matt Johnson left the group after the final Australian show. The posthumous album Mystery White Boy brings together some of the high points from Jeff's 1995-1996 live performances. The DVD/home video release Live In Chicago documents, in its entirety, Jeff's concert at The Cabaret Metro in Chicago on May 13th, 1995.\n\nIn May of '96, Jeff played four gigs as a bass player with Mind Science of the Mind, a side-project of Buckley's friend, Nathan Larson of Shudder To Think. In September Buckley played another unannounced solo gig at his old favorite haunt Sin-é. December of 1996 found Jeff Buckley embarking on his \"phantom solo tour\"; designed to experiment with new songs in a live setting (as in his Sin-é days), these unannounced solo gigs throughout the Northeast U.S. were played under a succession of aliases: the Crackrobats, Possessed By Elves, Father Demo, Smackrobiotic, the Halfspeeds, Crit Club, Topless America, Martha & the Nicotines, and A Puppet Show Named Julio.\n\nAt midnight on February 9th, 1997, Jeff Buckley debuted his new drummer, Parker Kindred, in a show at Arlene Grocery on New York's Lower East Side. He also played a couple of solo gigs in New York during the first months of 1997: a gig at the Daydream Cafe (featuring band members Mick Grondahl and Michael Tighe as \"special guests\") and a solo performance February 4th as part of the Knitting Factory's 10-Year Birthday Party.\n\nBuckley and his band had recorded intermittently — with Tom Verlaine as producer — during Summer/Fall 1996 and early winter 1997 in New York and in February 1997 in Memphis. After the conclusion of those sessions, Jeff sent the band back to New York while, during March and April 1997, he remained in Memphis and continued to craft his work-in-progress, making various four-track home recordings of songs to present to his bandmates. Some of these were revisions of the songs recorded with Verlaine, some were brand new compositions, and some were surprising cover versions. The new lineup debuted Buckley's new songs at Barrister's in Memphis on February 12th and 13th. Beginning March 31st, Jeff began a series of regularly scheduled Monday night solo performances at Barrister's. His last show there was on Monday, May 26th, 1997.\n\nBuckley passed away in a drowning accident in the Wolf River, a tributary of the Mississippi River, on May 29th, 1997. The night Buckley died, he was on his way to meet his band to begin three weeks of rehearsals for My Sweetheart, the Drunk; producer Andy Wallace, who'd helmed the boards on Grace, was to join them in Memphis in late June to record his new album.\n\nIn addition to his Columbia Records releases, Live At Sin-é and Grace, Jeff Buckley has appeared as a guest artist on several other recordings. He can be heard singing \"Jolly Street,\" a track on the Jazz Passengers 1994 album In Love. He contributed tenor vocals to \"Taipan\" and \"D. Popylepis,\" two recordings on John Zorn's Cobra Live At The Knitting Factory (1995). On Rebecca Moore's Admiral Charcoal's Song, Buckley plays electric six-string bass on \"If You Please Me,\" \"Outdoor Elevator,\" and \"Needle Men\" (on which he also plays drums). He both plays guitar and sings backup vocals on Brenda Kahn's \"Faith Salons,\" a key track on her Destination Anywhere album (released 1996). Patti Smith's critically acclaimed Gone Again album features Buckley adding \"voice\" to the song \"Beneath the Southern Cross\" and \"essrage\" (a small fretless Indian stringed instrument) to \"Fireflies.\" On Kerouac: Kicks Joy Darkness, a various artists' spoken word tribute to beat poet Jack Kerouac, Jeff Buckley performed on \"Angel Mine\"; Jeff plays guitar, sitar, and mouth sax (adding words at the poem's conclusion) on the track. Buckley can be heard reading Edgar Allan Poe's \"Ulallume - A Ballad,\" on Closed on Account of Rabies: Poems and Tales of Edgar Allan Poe (disc 2: The Devil's Brew) (Poems & Tales by Edgar Allan Poe) on Mouth Almighty/Mercury Records. He sang \"I Want Someone Badly\" (Epic) for Shudder To Think's soundtrack to First Love, Last Rites. Sandy Bell, a friend of Buckley's during his L.A. days, released the resurrected track \"Hollywould\" in 2000, which she co-wrote and recorded with Buckley.\n\nAn ardent enthusiast for a myriad of musical forms, Jeff Buckley was an early champion among young American musicians for the work of Nusrat Fateh Ali Khan, the world's foremost Qawwali (the music of the Sufis) singer. Buckley conducted an extensive interview with Nusrat in Interview magazine (January 1996) and wrote the liner notes Nusrat's The Supreme Collection album, released on Mercator/Caroline records in August 1997. On May 9th, 2000, Columbia Records released Mystery White Boy, an album of live performances, and Live In Chicago, a full-length concert (available on DVD or VHS) recorded live at The Cabaret Metro in Chicago on May 13, 1995, in the middle of Jeff's \"Mystery White Boy\" tour.\n\nFollowing the release of Grace on August 23rd, 1994, Jeff and his group spent much of 1994-1996 performing around the world on the Unknown, Mystery White Boy, and Hard Luck tours. Mystery White Boy brings together, for the first time, some of the high points of those shows. Produced by Michael Tighe (guitarist for Jeff's band throughout their international touring and the recording of Grace) and Mary Guibert (Jeff's mother) and Mystery White Boy provides an evocative cross-section of Jeff's repertoire: previously-unreleased Buckley compositions, electrifying live interpretations of songs from Grace, and obscure and marvelous cover choices. The recordings heard on Mystery White Boy have been hand-picked from scores of concert tapes by Mary Guibert and the members of Jeff's band who played such a large role in helping Jeff realize his musical vision.\n\nAccording to Mary, the tracks on Mystery White Boy are \"the individual performances that represented transcendent moments from each of the concerts we'd identified as being in the 'overall outstanding' category.\"\n\n\"It was obvious which performances were contenders for the record,\" concurs Michael Tighe, \"and in some cases a performance would be so supreme and unpredictable that I knew it had to be brought to the public.\"\n\nThe posthumous album Sketches For My Sweetheart The Drunk was released in 1998 and included songs Buckley was working on while in Memphis for his upcoming release.\n\nTribute songs:\nPJ Harvey - Memphis\nRufus Wainwright- Memphis Skyline\nMark Eitzel - To the Sea\nZita Swoon - Song for a Dead Singer\nAmy Correia - Blind River Boy\nDuncan Sheik - A Body Goes Down\nChris Cornell - Wave Goodbye\nKatatonia - Nightmares by the Sea\nWillie Nile - On the Road to Calvary\nRachael Sage - Grace\nAimee Mann - Just Like Anyone\nCocteau Twins - Rilkean Heart\nJim Major - Angels Fall (Song for Jeff Buckley)\n\nA film about Buckley's life, a biopic called \"Mystery White Boy\", is currently in pre-production. Actors have not yet been cast, according to IMDB. <a href=\"https://www.last.fm/music/Jeff+Buckley\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Jeffrey Scott \"Jeff\" Buckley (born in Anaheim, California, USA on 17 November 1966 – 29 May 1997), raised as Scotty Moorhead, was an American singer-songwriter and guitarist. He was the son of musicians Tim Buckley and Mary Guibert.\n\nHe had emerged in New York City's avant-garde club scene in the 1990s as one of the most remarkable musical artists of his generation, acclaimed by audiences, critics, and fellow musicians alike. His first commercial recording, the four-song EP Live At Sin-é, was released in December 1993 on Columbia Records. <a href=\"https://www.last.fm/music/Jeff+Buckley\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 2766461,
      "mbid": "e6e879c0-3d56-4f12-b3c5-3ce459661a8e",
      "name": "Jeff Buckley",
      "playcount": 113906257,
      "similar_artists": [
        {
          "name": "Jeff Buckley & Gary Lucas",
          "url": "https://www.last.fm/music/Jeff+Buckley+&+Gary+Lucas"
        },
        {
          "name": "Radiohead",
          "url": "https://www.last.fm/music/Radiohead"
        },
        {
          "name": "Elliott Smith",
          "url": "https://www.last.fm/music/Elliott+Smith"
        },
        {
          "name": "Tim Buckley",
          "url": "https://www.last.fm/music/Tim+Buckley"
        },
        {
          "name": "Fiona Apple",
          "url": "https://www.last.fm/music/Fiona+Apple"
        }
      ],
      "tags": [
        "singer-songwriter",
        "rock",
        "alternative",
        "indie",
        "folk"
      ],
      "url": "https://www.last.fm/music/Jeff+Buckley"
    },
    "spotify": {
      "followers": 2008110,
      "genres": [],
      "id": "3nnQpaTvKb5jCQabZefACI",
      "images": [
        {
          "height": 1520,
          "url": "https://i.scdn.co/image/67779606c7f151618a28f62b1d24fb514d39dacf",
          "width": 1000
        },
        {
          "height": 973,
          "url": "https://i.scdn.co/image/248e8ddbf1be229fd0c31722fb0a01b31b01f474",
          "width": 640
        },
        {
          "height": 304,
          "url": "https://i.scdn.co/image/8822f816dea6ea25c70e942763c9812c6271e516",
          "width": 200
        },
        {
          "height": 97,
          "url": "https://i.scdn.co/image/2a93d455e8981b0e1f6f1918b934c454c1243b20",
          "width": 64
        }
      ],
      "name": "Jeff Buckley",
      "popularity": 75,
      "url": "https://open.spotify.com/artist/3nnQpaTvKb5jCQabZefACI"
    }
  },
  "spotify_id": "3nnQpaTvKb5jCQabZefACI",
  "spotify_url": "https://open.spotify.com/artist/3nnQpaTvKb5jCQabZefACI",
  "updated_at": "2025-07-08T09:44:24.593519",
  "wikipedia_url": null
}