{
  "apple_music_id": "1527554451",
  "apple_music_url": "https://music.apple.com/gb/album/the-seeds-of-love/1527554451",
  "artists": [
    {
      "apple_music_id": "45218",
      "biography": "Tears for Fears are an English pop rock band formed in Bath, England, in 1981 by Roland Orzabal and Curt Smith. Founded after the dissolution of their first band, the mod-influenced Graduate, Tears for Fears were associated with the new wave synthesizer bands of the early 1980s, and attained international chart success.\n\nThe band's debut album, The Hurting (1983), reached number one on the UK Albums Chart, and their first three hit singles – \"Mad World\", \"Change\", and \"Pale Shelter\" – all reached the top five in the UK Singles Chart. Part of the MTV-driven Second British Invasion of the US, their second album, Songs from the Big Chair (1985), reached number one on the US Billboard 200, achieving multi-platinum status in both the UK and the US. The album contained two Billboard Hot 100 number one hits: \"Shout\" and \"Everybody Wants to Rule the World\", both of which reached the top five in the UK with the latter winning the Brit Award for Best British Single in 1986.\n\nAfter the release of their platinum-selling third album, The Seeds of Love (1989), Smith and Orzabal had an acrimonious split in 1991. Orzabal retained the Tears for Fears name as a solo project, releasing the albums Elemental (1993) and Raoul and the Kings of Spain (1995). Orzabal and Smith reconciled in 2000 and released an album of new material, Everybody Loves a Happy Ending, in 2004. The duo have toured on a semi-regular basis since then. After almost a decade in development, the band's seventh album, The Tipping Point, was released in February 2022, giving the band their sixth UK Top 5 album and their highest chart peak in 30 years, and reaching the Top 10 in numerous other countries, including the US where it topped the Billboard Top Alternative Albums and Top Rock Albums.\n\nIn 2021, Orzabal and Smith were honoured with the Ivor Novello Award for 'Outstanding Song Collection' recognising their \"era-defining Tears for Fears albums\" and \"critically acclaimed, innovative hit singles\".\n\nFormation and influences\nOrzabal and Smith met as teenagers in Bath, Somerset, England. Their professional debut came with the band Graduate, a mod revival/new wave act whose influences included the Jam and two-tone music. In 1980, Graduate released an album, Acting My Age, and a single \"Elvis Should Play Ska\" (referring to Elvis Costello). The single just missed the top 100 in the UK, but performed well in Spain and in Switzerland. The band split in 1981. Shortly afterwards, Orzabal and Smith became session musicians for the band Neon, where they first met future Tears for Fears drummer Manny Elias. Neon also featured Pete Byrne and Rob Fisher, who went on to become Naked Eyes. The pair continued working together, with Orzabal beginning to take his songwriting skills more seriously, and drawing inspiration from artists such as Talking Heads, Peter Gabriel and Brian Eno.\n\nOrzabal and Smith had become intrigued by the instrumentation and studio techniques of synth-pop artists including Gary Numan, Orchestral Manoeuvres in the Dark (OMD) and Depeche Mode, and consequently moved their project in a more electronic direction. The likes of OMD and Soft Cell had popularised the \"duo\" presentation within the synth-pop scene, inspiring Orzabal and Smith to package themselves as a two-man unit, initially under the name History of Headaches. The name Tears for Fears was inspired by primal therapy, developed by the American psychologist Arthur Janov, which gained tremendous publicity after John Lennon became Janov's patient in 1970. When Smith and Orzabal finally met Janov in the mid-1980s, they were disillusioned to find he had become quite \"Hollywood\" and wanted the band to write a musical for him.\n\nAs Tears for Fears, Orzabal and Smith intended to form the nucleus of the group and bring in surrounding musicians to help them complete the picture. Around this time they met local musician Ian Stanley, who offered them free use of his home 8-track studio. Stanley began working with the duo as their keyboard-player and, after recording two demos, Tears for Fears were signed to Phonogram Records in the UK in 1981 by A&R manager Dave Bates. Their first single, \"Suffer the Children\", produced by David Lord, was released on that label in November 1981, followed by the first edition of \"Pale Shelter\" (produced by Mike Howlett) in March 1982, but neither release was successful.\n\nThe Hurting and first international successes (1982–1983)\nThe band achieved their first taste of success with their third single, \"Mad World\", which reached No. 3 in the UK in November 1982. Their first album, The Hurting, was released in March 1983. For this album (and the next), keyboardist and composer Ian Stanley and drummer Manny Elias were considered full band members, though Smith and Orzabal were still essentially the frontmen and public face of the band.\n\nThe album, produced by Chris Hughes and Ross Cullum, showcased guitar- and synthesizer-based songs with lyrics reflecting Orzabal's bitter childhood and his interest in primal therapy. The album was a big success and had a lengthy chart run (65 weeks) in the UK, where it reached No. 1 and platinum status. It also reached the top 20 in several other countries and yielded the international hit singles \"Mad World\" (top 5 hit in South Africa), \"Change\" (top 40 hit in Australia, Canada, Ireland, Israel, Italy, the Netherlands, Poland and South Africa – their first single to reach the US Billboard Hot 100), and a re-recorded version of \"Pale Shelter\". All three of these singles reached the Top 5 in the UK.\n\nTowards the end of 1983, the band released a new, slightly more experimental single, \"The Way You Are\", intended as a stopgap while they worked on their second album. The single was a top-30 hit in the UK, but did not come close to matching the success of their three previous hits, despite a national concert tour in December of that year (captured on the In My Mind's Eye live video release). The single, which heavily featured sampling and programmed rhythms, was a departure from Tears for Fears' previous musical approach. In the liner notes to their 1996 B-sides compilation album Saturnine Martial & Lunatic they wrote \"this was the point we realised we had to change direction\", though the somewhat experimental style of the single continued to be reflected in their forthcoming B-sides.\n\nSongs from the Big Chair and worldwide fame (1984–1986)\nIn early 1984, they began working with a new producer, Jeremy Green, on their new single \"Mothers Talk\". However, the band were ultimately unhappy with the results and so producer Chris Hughes was brought back into the fold and the \"Mothers Talk\" single re-produced for release in August 1984. A departure from their earlier works, the single became a top-20 hit in the UK, but it was the follow-up single \"Shout\" (released in the UK in November 1984) that was the real beginning of the band's international fame.\n\n\"Shout\", a top-5 UK hit, paved the way for their second album, Songs from the Big Chair (released in February 1985), which entered the UK album chart at No. 2 and remained in the upper reaches of the chart for the next 12 months. They did away with the predominantly synthpop feel of the first album, instead expanding into a more sophisticated sound that would become the band's stylistic hallmark. Anchored on the creative hub of Orzabal, Stanley and producer Hughes, the new Tears for Fears sound helped to propel Songs from the Big Chair into becoming one of the year's biggest sellers worldwide, eventually being certified triple platinum in the UK and quintuple platinum in the US (where it remained the No. 1 album for five weeks in the summer of 1985).\n\nThe album's title was inspired by the book and television miniseries Sybil, the chronicle of a woman with dissociative identity disorder who sought refuge in her analyst's \"big chair\", Orzabal and Smith stating they felt each of the album's songs had a distinctive personality of its own. The band had also recorded a track titled \"The Big Chair\", which was released as the B-side to \"Shout\" but was not included on the album.\n\nThe album's success came in conjunction with the array of hit singles it yielded: \"Mothers Talk\" (re-recorded yet again for its US release in 1986), \"Shout\" (No. 4 UK, No. 1 in the US, Australia, Canada, Germany, the Netherlands, Switzerland and a huge hit in other territories), \"Everybody Wants to Rule the World\" (their highest-charting UK and Irish hit at No. 2 and another No. 1 in the US and in Canada), \"Head over Heels\" (UK No. 12, US No. 3, Ireland No. 5, Canada No. 8), and \"I Believe (A Soulful Re-Recording)\" (UK No. 23 and Ireland No. 10). Some regions even saw the release of limited edition 10\" singles for these hits, and a variety of double packs and picture discs in addition to the regular 7\" and 12\" formats.\n\nFollowing the album's release, the band went on a world tour that lasted most of the year, playing notably at the Montreux Golden Rose Rock and Pop Festival in May 1985. In September 1985, the band performed \"Shout\" at the 1985 MTV Video Music Awards at the Radio City Music Hall in New York. Also during the tour, Orzabal and Smith discovered an American female singer/pianist, Oleta Adams, who was performing in a Kansas City hotel bar, and whom they invited to collaborate on their next album. Towards the end of the year, they released a video collection/documentary titled Scenes from the Big Chair.\n\nIn February 1986, having completed the lengthy and exhausting Big Chair world tour, Tears for Fears were honoured at the 1986 Brit Awards in London, where they won the Best British Single award for \"Everybody Wants to Rule the World\". The band was also nominated for Best British Group and Best British Album, and Chris Hughes was nominated for Best Producer. The band performed the song at the ceremony, which became the final public performance of drummer Manny Elias who left the group shortly afterwards.\n\nThe same year, Orzabal and Stanley worked together on a side project named Mancrab and released a single, \"Fish for Life\", which was written for the soundtrack of the film The Karate Kid, Part II. The track was written and produced by Orzabal and Stanley, and featured vocals by US singer/dancer Eddie Thomas, who was one of the dancers in the video for \"Everybody Wants to Rule the World\".\n\nLive Aid\nOn 13 July 1985, Tears for Fears were scheduled to perform at JFK Stadium in Philadelphia for the Live Aid charity event. However, on the morning of the historic event, it was announced that the band (who had actually been billed to appear at the event before they had even agreed to do so) had pulled out of the show. They were replaced by blues rock group George Thorogood & The Destroyers, which had a strong Philadelphia-area following. The official reason given for their non-appearance was that two of their backing musicians, guitarist Andrew Sanders and saxophonist Will Gregory, had quit due to the expiration of their contract; they were replaced by Alan Griffiths on guitar and Josephine Wells on saxophone for the remaining bulk of the 1985 world tour. In place of appearing, the band pledged to donate proceeds from their concerts played in Tokyo, Sydney, London and New York.\n\nAs a further donation, the band also recorded a slightly rewritten version of one of their biggest hits and released it for the British fundraising initiative Sport Aid, a sister project of Band Aid in which people took part in running races of varying length and seriousness to raise more money for African famine relief projects. Sport Aid's slogan was \"I Ran the World\", therefore Tears for Fears released \"Everybody Wants to Run the World\" (No. 5 in the UK and No. 4 in Ireland). Indirectly, the band were involved in the earlier Band Aid single \"Do They Know It's Christmas?\" from 1984, which featured a slowed down sample from their song \"The Hurting\" (from their debut album of the same name) in the introduction.\n\nThe Seeds of Love (1987–1990)\nIt was 1989 before the group released their third album, The Seeds of Love (on which Ian Stanley appeared for the last time as a member of Tears for Fears), at a reported production cost of over a million pounds. The album was written largely by Orzabal along with keyboardist Nicky Holland, who had toured with the band on their \"Big Chair\" world tour in 1985. Moving from various studios and using various sets of producers over many months, the band ultimately decided to scrap the recordings and take the reins themselves with assistance from engineer Dave Bascombe. Much of the material was recorded in jam sessions and later edited down. The length of the production impacted on the band's management company, who had financially over-extended themselves in other business matters and were hoping for an earlier release date to pay off their debts.\n\nThe album retained the band's epic sound while showing increasing influences ranging from jazz and blues to the Beatles, the latter being evident on the hit single \"Sowing the Seeds of Love\". The second single from the album was \"Woman in Chains\" (a top 40 hit in the UK, Canada, France, Ireland, Italy, Netherlands, Sweden and the US), on which Phil Collins played drums and Oleta Adams—whom Orzabal would later guide to a successful solo career—shared vocals.\n\nThe album was a worldwide success, entering the UK Albums Chart at no. 1, making the top 10 in the US and in numerous other countries, eventually going on to sell millions of copies internationally. The band set out on an extensive \"Seeds of Love\" world tour sponsored by Philips to start recovering the debt incurred during the recording process. The band's show in Santa Barbara, California, in May 1990 would be captured on the Going to California live video as the singles \"Advice for the Young at Heart\" and \"Famous Last Words\" delivered modest chart success.\n\nA 64-page companion book, simply titled Tears for Fears – The Seeds of Love, was released by Virgin Books in 1990 and offered extensive insight from Orzabal, Holland and Adams into the songwriting and production process for the album, as well as the musical scores for each track and rare promotional photographs from the era.\n\nBreak-up (1991–1992)\nAfter The Seeds of Love, Orzabal and Smith had an acrimonious falling out and parted company in 1991. The split was blamed on Orzabal's perfectionist approach to production and delays caused by Smith's jetsetting lifestyle and desire to slow down the pace of their work (Smith was also going through a divorce at the time). Another factor in the break-up was the band's manager, Paul King, who declared bankruptcy in 1990 and was later convicted of fraud in 2004.\n\nFollowing Smith's departure, Orzabal kept the band name alive by releasing the 1992 hit single \"Laid So Low (Tears Roll Down)\". The single was released to promote the band's greatest hits collection Tears Roll Down (Greatest Hits 82-92), which featured every single to reach the Top 20, either in the UK or internationally, apart from the Sport Aid fundraiser. The album peaked at no. 2 in the UK, where it was certified double platinum, and also reached the Top 10 in several other countries, including France, Italy and New Zealand.\n\nSolo era: Elemental and Raoul and the Kings of Spain (1993–1996)\nIn 1993, Orzabal (still under the name Tears for Fears) released the album Elemental together with longtime collaborator Alan Griffiths. Co-produced by Tim Palmer, it yielded the international hit \"Break It Down Again\" (top 20 in the UK, Canada, France, and Italy) and was supported with another successful world tour, including a college tour of the US where \"Break It Down Again\" reached no. 25. Although it charted considerably lower in the US than the previous two studio albums (no. 45), it still earned a Gold disc there for sales of over half a million copies.\n\nOrzabal, still working with Griffiths and Palmer, released another Tears for Fears album, Raoul and the Kings of Spain, in 1995. This album was a more contemplative work that delved into his own Spanish heritage and showcased a new Latin musical influence (Raoul was originally the name Orzabal's parents wanted to give him, and is also the name of his own first son). The album was not a commercial success by Tears for Fears standards, though minor chart success came via the single release of the title track (top 40 in the UK) and (to a lesser extent) the single \"God's Mistake\".\n\nIn 1996 a B-sides compilation album, Saturnine Martial & Lunatic, was released on Mercury, which included B-sides and some rare tracks from the successful 1982–93 period.\n\nReunion: Everybody Loves a Happy Ending\nIn 2000, routine paperwork obligations led the duo to re-establish contact with each other after Orzabal signed a business document on Smith's behalf. Smith flew back to England (where Orzabal still lived) and they had dinner and decided to work on a new album together.\nThe songwriting sessions included Charlton Pettus (Smith's collaborator since the mid-1990s), and 14 songs were written and recorded in less than six months. The ensuing album, Everybody Loves a Happy Ending, was released in September 2004. Two U.S. tours followed, and the 2004 tour included an unrehearsed guest appearance by Oleta Adams at the Kansas City show for a performance of \"Woman in Chains\".\n\nEverybody Loves a Happy Ending was released in the UK and Europe in March 2005 on Gut Records, shortly after the comeback single \"Closest Thing to Heaven\" became the first Tears for Fears UK Top 40 hit in a decade. The promo video for the single was a colourful fantasy that featured Hollywood actress Brittany Murphy riding in a hot air balloon. The European releases of the album contained all fourteen tracks recorded during the recording sessions, while the US version only contained twelve. A brief tour of larger UK venues followed in April.\n\nA live performance at the Parc des Princes stadium in Paris, recorded in June 2005, was released on CD and DVD in France and Benelux. Titled Secret World - Live in Paris, it was released on the XIII Bis label in early 2006 and became a best-seller, with over 70,000 physical copies sold in addition to downloads. The CD contained a new studio song, \"Floating Down the River\", and a remastered Curt Smith/Mayfield track, \"What Are We Fighting For?\".\n\nDuring this period, \"Mad World\" was re-recorded by Michael Andrews and Gary Jules for the soundtrack of the 2001's film Donnie Darko; a 2003 single release of the song reached number one in the UK for three consecutive weeks and won Orzabal his second Ivor Novello Award. This version also reached the Top 40 in numerous other countries between 2003 and 2013. In 2006, Songs from the Big Chair was re-issued again by Universal Music. It included the rare piano version of \"The Working Hour\", which had previously only been available as a limited edition item. In August 2009, the Raoul and the Kings of Spain album was also re-issued by Cherry Red Records, featuring seven bonus B-side tracks from the time of its original release.\n\n2010–2020\nIn April 2010, Tears for Fears joined the reformed 1980s group Spandau Ballet on their seven-date tour of Australia and New Zealand, before a four-date headlining tour of their own in Southeast Asia (Philippines, Singapore, Hong Kong and Taiwan) and a 17-date tour of the United States. In 2011 and 2012, they played dates in the US, Japan, South Korea, Manila and South America.\n\nIn May 2013, Smith confirmed that he was writing and recording new Tears for Fears material with Orzabal and Charlton Pettus. In August 2013, Tears for Fears released their first newly recorded material in nearly a decade, with a cover of Arcade Fire's \"Ready to Start\" made available on SoundCloud. In 2014, the track was included on a limited edition 3-track 10\" vinyl EP from the band called Ready Boy & Girls?, released exclusively for Record Store Day, which also featured covers of Hot Chip's \"Boy from School\" and Animal Collective's \"My Girls\". All three songs were recorded as \"kick-start\" projects as the band commenced work on their seventh studio album. In an interview on BBC Radio Devon in October 2014, Orzabal stated that the band had now signed to Warner Music Group and that around five or six songs had so far been completed for the new album.\n\nTo commemorate the 30th anniversary of the band's debut album The Hurting, Universal Music reissued it in October 2013 in two deluxe editions. Deluxe editions of the band's second album, Songs From The Big Chair, were released on 10 November 2014. On 12 November 2014, Tears for Fears performed \"Everybody Wants to Rule the World\" on ABC's Jimmy Kimmel Live! TV programme. In mid 2015, the band began a series of live dates in the US and Canada.\n\nIn July 2016, the band played their first live dates in the UK in over ten years: the Newmarket Nights festival at Newmarket Racecourse on 29 July and a closing night headlining appearance at Camp Bestival at Lulworth Castle in Dorset on 31 July. The gigs marked the band's first UK festival appearances since Knebworth in 1990. The band again toured the US and Canada in September and October 2016.\nIn 2017, the band toured North America with co-headliners Hall & Oates, and also played in Israel, at the British Summer Time Festival in London's Hyde Park on 8 July, and at the Rock in Rio festival in Brazil on 22 September. In a July 2017 interview, Orzabal stated that the band had collaborated with songwriter/producer Sacha Skarbek on their seventh album, The Tipping Point, and divulged several song titles from it including \"My Demons\", \"I Love You But I'm Lost\", \"End of Night\" and \"Up Above the World\". In an interview with SiriusXM Canada the same month, Orzabal divulged that although the band had signed with Warner Music to release their new album (which had been scheduled for October 2017), Universal Music had then approached Warner Music about buying the rights to the album so that they could release it (Universal being the rights holders of the vast majority of the band's back catalogue).\n\nRoland Orzabal's wife, Caroline, died in the summer of 2017. Tears for Fears initially withdrew from the remaining shows on their pending North American tour, but they resumed the tour in September 2017 at the Staples Center in Los Angeles. During his late wife's illness, Orzabal began writing songs that appear on the 2022 Tears for Fears album, The Tipping Point.\n\nOn 26 October 2017, the band performed a 65-minute live set at the BBC Radio Theatre in London for the Radio 2 in Concert series, which was broadcast on both radio and television (via the BBC Red Button service). The following night, the band played their first full-length UK concert since 2005, at London's Royal Albert Hall. Prior to this, on 12 October, \"I Love You But I'm Lost\" was released as a single from a new 16-track Tears For Fears compilation album titled Rule the World: The Greatest Hits. In October 2017, the band announced an 11-date UK arena tour for April–May 2018, featuring Alison Moyet as the support act. However, the tour was postponed to early 2019 due to Orzabal's health problems following the death of his wife.\n\nThe band performed at further UK and European festivals in the summer of 2019, starting with the Hampton Court Palace Festival on 18 and 19 June, the Forest Live festival at Delamere Forest on 21 June, and the Nocturne Live Concert Series at Blenheim Palace on 22 June.\nIn February 2020, Songs from the Big Chair was the subject of an episode of the BBC series Classic Albums featuring new interviews with the band and all key personnel from the album's creation and subsequent success. To coincide with the album's 35th anniversary, the 2014 deluxe boxed set was reissued by Universal Music, as well as a new 12-inch vinyl picture disc of the album.\n\nIn October 2020, The Seeds of Love album was reissued as various deluxe editions and returned the band to the UK Top 20.\nIn November 2020, after a change in management, Everybody Loves a Happy Ending was made available through various streaming services for the first time.\n\nThe Tipping Point\nOn 12 June 2021, Tears for Fears released the live double album Live at Massey Hall (recorded in 1985) for Record Store Day and in September, Orzabal and Smith were honoured at the Ivor Novello Awards.\n\nOn 7 October 2021, Smith appeared on the BBC Radio 2 programme The Zoe Ball Breakfast Show to introduce the band's single \"The Tipping Point\", the first track from their seventh album, The Tipping Point, released on Concord Records on 25 February 2022. In November 2021, Tears for Fears announced a summer tour of the US and UK to commence in May 2022. The band had to cancel the tour before its completion, due to Smith suffering four broken ribs in a road accident in July 2022. Two further singles, \"No Small Thing\" and \"Break the Man\", were released before the album (respectively in early December 2021 and mid-January 2022).\n\nThe Tipping Point received largely positive reviews from critics and entered the UK Charts at number 2. It also reached the Top 10 in numerous other countries (entering the US Billboard 200 at number 8) and topped the charts in Scotland and the US Billboard's Top Alternative Albums, Top Rock Albums and Top Album Sales charts. On 1 June 2022, a video was released for the song \"My Demons\" (the fourth single from The Tipping Point), and while the band was on tour, \"Everybody Wants To Rule The World\" re-entered the UK Singles Chart and entered the Billboard Global 200.\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/Tears_for_Fears\n\nStudio albums\nThe Hurting (1983)\nSongs from the Big Chair (1985)\nThe Seeds of Love (1989)\nElemental (1993) (without Curt Smith)\nRaoul and the Kings of Spain (1995) (without Curt Smith)\nEverybody Loves a Happy Ending (2004)\nThe Tipping Point (2022) <a href=\"https://www.last.fm/music/Tears+for+Fears\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "discogs_id": "19814",
      "discogs_original_name": "Tears For Fears",
      "id": null,
      "lastfm_mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
      "name": "Tears For Fears",
      "role": "",
      "spotify_id": "4bthk9UfsYUYdcFyqxmSUU",
      "wikipedia_url": null
    }
  ],
  "artists_wikipedia": {
    "Tears For Fears": {
      "biography": "Tears for Fears are an English pop rock band formed in Bath, England, in 1981 by Roland Orzabal and Curt Smith. Founded after the dissolution of their first band, the mod-influenced Graduate, Tears for Fears were associated with the new wave synthesizer bands of the early 1980s, and attained international chart success.\n\nThe band's debut album, The Hurting (1983), reached number one on the UK Albums Chart, and their first three hit singles – \"Mad World\", \"Change\", and \"Pale Shelter\" – all reached the top five in the UK Singles Chart. Part of the MTV-driven Second British Invasion of the US, their second album, Songs from the Big Chair (1985), reached number one on the US Billboard 200, achieving multi-platinum status in both the UK and the US. The album contained two Billboard Hot 100 number one hits: \"Shout\" and \"Everybody Wants to Rule the World\", both of which reached the top five in the UK with the latter winning the Brit Award for Best British Single in 1986.\n\nAfter the release of their platinum-selling third album, The Seeds of Love (1989), Smith and Orzabal had an acrimonious split in 1991. Orzabal retained the Tears for Fears name as a solo project, releasing the albums Elemental (1993) and Raoul and the Kings of Spain (1995). Orzabal and Smith reconciled in 2000 and released an album of new material, Everybody Loves a Happy Ending, in 2004. The duo have toured on a semi-regular basis since then. After almost a decade in development, the band's seventh album, The Tipping Point, was released in February 2022, giving the band their sixth UK Top 5 album and their highest chart peak in 30 years, and reaching the Top 10 in numerous other countries, including the US where it topped the Billboard Top Alternative Albums and Top Rock Albums.\n\nIn 2021, Orzabal and Smith were honoured with the Ivor Novello Award for 'Outstanding Song Collection' recognising their \"era-defining Tears for Fears albums\" and \"critically acclaimed, innovative hit singles\".\n\nFormation and influences\nOrzabal and Smith met as teenagers in Bath, Somerset, England. Their professional debut came with the band Graduate, a mod revival/new wave act whose influences included the Jam and two-tone music. In 1980, Graduate released an album, Acting My Age, and a single \"Elvis Should Play Ska\" (referring to Elvis Costello). The single just missed the top 100 in the UK, but performed well in Spain and in Switzerland. The band split in 1981. Shortly afterwards, Orzabal and Smith became session musicians for the band Neon, where they first met future Tears for Fears drummer Manny Elias. Neon also featured Pete Byrne and Rob Fisher, who went on to become Naked Eyes. The pair continued working together, with Orzabal beginning to take his songwriting skills more seriously, and drawing inspiration from artists such as Talking Heads, Peter Gabriel and Brian Eno.\n\nOrzabal and Smith had become intrigued by the instrumentation and studio techniques of synth-pop artists including Gary Numan, Orchestral Manoeuvres in the Dark (OMD) and Depeche Mode, and consequently moved their project in a more electronic direction. The likes of OMD and Soft Cell had popularised the \"duo\" presentation within the synth-pop scene, inspiring Orzabal and Smith to package themselves as a two-man unit, initially under the name History of Headaches. The name Tears for Fears was inspired by primal therapy, developed by the American psychologist Arthur Janov, which gained tremendous publicity after John Lennon became Janov's patient in 1970. When Smith and Orzabal finally met Janov in the mid-1980s, they were disillusioned to find he had become quite \"Hollywood\" and wanted the band to write a musical for him.\n\nAs Tears for Fears, Orzabal and Smith intended to form the nucleus of the group and bring in surrounding musicians to help them complete the picture. Around this time they met local musician Ian Stanley, who offered them free use of his home 8-track studio. Stanley began working with the duo as their keyboard-player and, after recording two demos, Tears for Fears were signed to Phonogram Records in the UK in 1981 by A&R manager Dave Bates. Their first single, \"Suffer the Children\", produced by David Lord, was released on that label in November 1981, followed by the first edition of \"Pale Shelter\" (produced by Mike Howlett) in March 1982, but neither release was successful.\n\nThe Hurting and first international successes (1982–1983)\nThe band achieved their first taste of success with their third single, \"Mad World\", which reached No. 3 in the UK in November 1982. Their first album, The Hurting, was released in March 1983. For this album (and the next), keyboardist and composer Ian Stanley and drummer Manny Elias were considered full band members, though Smith and Orzabal were still essentially the frontmen and public face of the band.\n\nThe album, produced by Chris Hughes and Ross Cullum, showcased guitar- and synthesizer-based songs with lyrics reflecting Orzabal's bitter childhood and his interest in primal therapy. The album was a big success and had a lengthy chart run (65 weeks) in the UK, where it reached No. 1 and platinum status. It also reached the top 20 in several other countries and yielded the international hit singles \"Mad World\" (top 5 hit in South Africa), \"Change\" (top 40 hit in Australia, Canada, Ireland, Israel, Italy, the Netherlands, Poland and South Africa – their first single to reach the US Billboard Hot 100), and a re-recorded version of \"Pale Shelter\". All three of these singles reached the Top 5 in the UK.\n\nTowards the end of 1983, the band released a new, slightly more experimental single, \"The Way You Are\", intended as a stopgap while they worked on their second album. The single was a top-30 hit in the UK, but did not come close to matching the success of their three previous hits, despite a national concert tour in December of that year (captured on the In My Mind's Eye live video release). The single, which heavily featured sampling and programmed rhythms, was a departure from Tears for Fears' previous musical approach. In the liner notes to their 1996 B-sides compilation album Saturnine Martial & Lunatic they wrote \"this was the point we realised we had to change direction\", though the somewhat experimental style of the single continued to be reflected in their forthcoming B-sides.\n\nSongs from the Big Chair and worldwide fame (1984–1986)\nIn early 1984, they began working with a new producer, Jeremy Green, on their new single \"Mothers Talk\". However, the band were ultimately unhappy with the results and so producer Chris Hughes was brought back into the fold and the \"Mothers Talk\" single re-produced for release in August 1984. A departure from their earlier works, the single became a top-20 hit in the UK, but it was the follow-up single \"Shout\" (released in the UK in November 1984) that was the real beginning of the band's international fame.\n\n\"Shout\", a top-5 UK hit, paved the way for their second album, Songs from the Big Chair (released in February 1985), which entered the UK album chart at No. 2 and remained in the upper reaches of the chart for the next 12 months. They did away with the predominantly synthpop feel of the first album, instead expanding into a more sophisticated sound that would become the band's stylistic hallmark. Anchored on the creative hub of Orzabal, Stanley and producer Hughes, the new Tears for Fears sound helped to propel Songs from the Big Chair into becoming one of the year's biggest sellers worldwide, eventually being certified triple platinum in the UK and quintuple platinum in the US (where it remained the No. 1 album for five weeks in the summer of 1985).\n\nThe album's title was inspired by the book and television miniseries Sybil, the chronicle of a woman with dissociative identity disorder who sought refuge in her analyst's \"big chair\", Orzabal and Smith stating they felt each of the album's songs had a distinctive personality of its own. The band had also recorded a track titled \"The Big Chair\", which was released as the B-side to \"Shout\" but was not included on the album.\n\nThe album's success came in conjunction with the array of hit singles it yielded: \"Mothers Talk\" (re-recorded yet again for its US release in 1986), \"Shout\" (No. 4 UK, No. 1 in the US, Australia, Canada, Germany, the Netherlands, Switzerland and a huge hit in other territories), \"Everybody Wants to Rule the World\" (their highest-charting UK and Irish hit at No. 2 and another No. 1 in the US and in Canada), \"Head over Heels\" (UK No. 12, US No. 3, Ireland No. 5, Canada No. 8), and \"I Believe (A Soulful Re-Recording)\" (UK No. 23 and Ireland No. 10). Some regions even saw the release of limited edition 10\" singles for these hits, and a variety of double packs and picture discs in addition to the regular 7\" and 12\" formats.\n\nFollowing the album's release, the band went on a world tour that lasted most of the year, playing notably at the Montreux Golden Rose Rock and Pop Festival in May 1985. In September 1985, the band performed \"Shout\" at the 1985 MTV Video Music Awards at the Radio City Music Hall in New York. Also during the tour, Orzabal and Smith discovered an American female singer/pianist, Oleta Adams, who was performing in a Kansas City hotel bar, and whom they invited to collaborate on their next album. Towards the end of the year, they released a video collection/documentary titled Scenes from the Big Chair.\n\nIn February 1986, having completed the lengthy and exhausting Big Chair world tour, Tears for Fears were honoured at the 1986 Brit Awards in London, where they won the Best British Single award for \"Everybody Wants to Rule the World\". The band was also nominated for Best British Group and Best British Album, and Chris Hughes was nominated for Best Producer. The band performed the song at the ceremony, which became the final public performance of drummer Manny Elias who left the group shortly afterwards.\n\nThe same year, Orzabal and Stanley worked together on a side project named Mancrab and released a single, \"Fish for Life\", which was written for the soundtrack of the film The Karate Kid, Part II. The track was written and produced by Orzabal and Stanley, and featured vocals by US singer/dancer Eddie Thomas, who was one of the dancers in the video for \"Everybody Wants to Rule the World\".\n\nLive Aid\nOn 13 July 1985, Tears for Fears were scheduled to perform at JFK Stadium in Philadelphia for the Live Aid charity event. However, on the morning of the historic event, it was announced that the band (who had actually been billed to appear at the event before they had even agreed to do so) had pulled out of the show. They were replaced by blues rock group George Thorogood & The Destroyers, which had a strong Philadelphia-area following. The official reason given for their non-appearance was that two of their backing musicians, guitarist Andrew Sanders and saxophonist Will Gregory, had quit due to the expiration of their contract; they were replaced by Alan Griffiths on guitar and Josephine Wells on saxophone for the remaining bulk of the 1985 world tour. In place of appearing, the band pledged to donate proceeds from their concerts played in Tokyo, Sydney, London and New York.\n\nAs a further donation, the band also recorded a slightly rewritten version of one of their biggest hits and released it for the British fundraising initiative Sport Aid, a sister project of Band Aid in which people took part in running races of varying length and seriousness to raise more money for African famine relief projects. Sport Aid's slogan was \"I Ran the World\", therefore Tears for Fears released \"Everybody Wants to Run the World\" (No. 5 in the UK and No. 4 in Ireland). Indirectly, the band were involved in the earlier Band Aid single \"Do They Know It's Christmas?\" from 1984, which featured a slowed down sample from their song \"The Hurting\" (from their debut album of the same name) in the introduction.\n\nThe Seeds of Love (1987–1990)\nIt was 1989 before the group released their third album, The Seeds of Love (on which Ian Stanley appeared for the last time as a member of Tears for Fears), at a reported production cost of over a million pounds. The album was written largely by Orzabal along with keyboardist Nicky Holland, who had toured with the band on their \"Big Chair\" world tour in 1985. Moving from various studios and using various sets of producers over many months, the band ultimately decided to scrap the recordings and take the reins themselves with assistance from engineer Dave Bascombe. Much of the material was recorded in jam sessions and later edited down. The length of the production impacted on the band's management company, who had financially over-extended themselves in other business matters and were hoping for an earlier release date to pay off their debts.\n\nThe album retained the band's epic sound while showing increasing influences ranging from jazz and blues to the Beatles, the latter being evident on the hit single \"Sowing the Seeds of Love\". The second single from the album was \"Woman in Chains\" (a top 40 hit in the UK, Canada, France, Ireland, Italy, Netherlands, Sweden and the US), on which Phil Collins played drums and Oleta Adams—whom Orzabal would later guide to a successful solo career—shared vocals.\n\nThe album was a worldwide success, entering the UK Albums Chart at no. 1, making the top 10 in the US and in numerous other countries, eventually going on to sell millions of copies internationally. The band set out on an extensive \"Seeds of Love\" world tour sponsored by Philips to start recovering the debt incurred during the recording process. The band's show in Santa Barbara, California, in May 1990 would be captured on the Going to California live video as the singles \"Advice for the Young at Heart\" and \"Famous Last Words\" delivered modest chart success.\n\nA 64-page companion book, simply titled Tears for Fears – The Seeds of Love, was released by Virgin Books in 1990 and offered extensive insight from Orzabal, Holland and Adams into the songwriting and production process for the album, as well as the musical scores for each track and rare promotional photographs from the era.\n\nBreak-up (1991–1992)\nAfter The Seeds of Love, Orzabal and Smith had an acrimonious falling out and parted company in 1991. The split was blamed on Orzabal's perfectionist approach to production and delays caused by Smith's jetsetting lifestyle and desire to slow down the pace of their work (Smith was also going through a divorce at the time). Another factor in the break-up was the band's manager, Paul King, who declared bankruptcy in 1990 and was later convicted of fraud in 2004.\n\nFollowing Smith's departure, Orzabal kept the band name alive by releasing the 1992 hit single \"Laid So Low (Tears Roll Down)\". The single was released to promote the band's greatest hits collection Tears Roll Down (Greatest Hits 82-92), which featured every single to reach the Top 20, either in the UK or internationally, apart from the Sport Aid fundraiser. The album peaked at no. 2 in the UK, where it was certified double platinum, and also reached the Top 10 in several other countries, including France, Italy and New Zealand.\n\nSolo era: Elemental and Raoul and the Kings of Spain (1993–1996)\nIn 1993, Orzabal (still under the name Tears for Fears) released the album Elemental together with longtime collaborator Alan Griffiths. Co-produced by Tim Palmer, it yielded the international hit \"Break It Down Again\" (top 20 in the UK, Canada, France, and Italy) and was supported with another successful world tour, including a college tour of the US where \"Break It Down Again\" reached no. 25. Although it charted considerably lower in the US than the previous two studio albums (no. 45), it still earned a Gold disc there for sales of over half a million copies.\n\nOrzabal, still working with Griffiths and Palmer, released another Tears for Fears album, Raoul and the Kings of Spain, in 1995. This album was a more contemplative work that delved into his own Spanish heritage and showcased a new Latin musical influence (Raoul was originally the name Orzabal's parents wanted to give him, and is also the name of his own first son). The album was not a commercial success by Tears for Fears standards, though minor chart success came via the single release of the title track (top 40 in the UK) and (to a lesser extent) the single \"God's Mistake\".\n\nIn 1996 a B-sides compilation album, Saturnine Martial & Lunatic, was released on Mercury, which included B-sides and some rare tracks from the successful 1982–93 period.\n\nReunion: Everybody Loves a Happy Ending\nIn 2000, routine paperwork obligations led the duo to re-establish contact with each other after Orzabal signed a business document on Smith's behalf. Smith flew back to England (where Orzabal still lived) and they had dinner and decided to work on a new album together.\nThe songwriting sessions included Charlton Pettus (Smith's collaborator since the mid-1990s), and 14 songs were written and recorded in less than six months. The ensuing album, Everybody Loves a Happy Ending, was released in September 2004. Two U.S. tours followed, and the 2004 tour included an unrehearsed guest appearance by Oleta Adams at the Kansas City show for a performance of \"Woman in Chains\".\n\nEverybody Loves a Happy Ending was released in the UK and Europe in March 2005 on Gut Records, shortly after the comeback single \"Closest Thing to Heaven\" became the first Tears for Fears UK Top 40 hit in a decade. The promo video for the single was a colourful fantasy that featured Hollywood actress Brittany Murphy riding in a hot air balloon. The European releases of the album contained all fourteen tracks recorded during the recording sessions, while the US version only contained twelve. A brief tour of larger UK venues followed in April.\n\nA live performance at the Parc des Princes stadium in Paris, recorded in June 2005, was released on CD and DVD in France and Benelux. Titled Secret World - Live in Paris, it was released on the XIII Bis label in early 2006 and became a best-seller, with over 70,000 physical copies sold in addition to downloads. The CD contained a new studio song, \"Floating Down the River\", and a remastered Curt Smith/Mayfield track, \"What Are We Fighting For?\".\n\nDuring this period, \"Mad World\" was re-recorded by Michael Andrews and Gary Jules for the soundtrack of the 2001's film Donnie Darko; a 2003 single release of the song reached number one in the UK for three consecutive weeks and won Orzabal his second Ivor Novello Award. This version also reached the Top 40 in numerous other countries between 2003 and 2013. In 2006, Songs from the Big Chair was re-issued again by Universal Music. It included the rare piano version of \"The Working Hour\", which had previously only been available as a limited edition item. In August 2009, the Raoul and the Kings of Spain album was also re-issued by Cherry Red Records, featuring seven bonus B-side tracks from the time of its original release.\n\n2010–2020\nIn April 2010, Tears for Fears joined the reformed 1980s group Spandau Ballet on their seven-date tour of Australia and New Zealand, before a four-date headlining tour of their own in Southeast Asia (Philippines, Singapore, Hong Kong and Taiwan) and a 17-date tour of the United States. In 2011 and 2012, they played dates in the US, Japan, South Korea, Manila and South America.\n\nIn May 2013, Smith confirmed that he was writing and recording new Tears for Fears material with Orzabal and Charlton Pettus. In August 2013, Tears for Fears released their first newly recorded material in nearly a decade, with a cover of Arcade Fire's \"Ready to Start\" made available on SoundCloud. In 2014, the track was included on a limited edition 3-track 10\" vinyl EP from the band called Ready Boy & Girls?, released exclusively for Record Store Day, which also featured covers of Hot Chip's \"Boy from School\" and Animal Collective's \"My Girls\". All three songs were recorded as \"kick-start\" projects as the band commenced work on their seventh studio album. In an interview on BBC Radio Devon in October 2014, Orzabal stated that the band had now signed to Warner Music Group and that around five or six songs had so far been completed for the new album.\n\nTo commemorate the 30th anniversary of the band's debut album The Hurting, Universal Music reissued it in October 2013 in two deluxe editions. Deluxe editions of the band's second album, Songs From The Big Chair, were released on 10 November 2014. On 12 November 2014, Tears for Fears performed \"Everybody Wants to Rule the World\" on ABC's Jimmy Kimmel Live! TV programme. In mid 2015, the band began a series of live dates in the US and Canada.\n\nIn July 2016, the band played their first live dates in the UK in over ten years: the Newmarket Nights festival at Newmarket Racecourse on 29 July and a closing night headlining appearance at Camp Bestival at Lulworth Castle in Dorset on 31 July. The gigs marked the band's first UK festival appearances since Knebworth in 1990. The band again toured the US and Canada in September and October 2016.\nIn 2017, the band toured North America with co-headliners Hall & Oates, and also played in Israel, at the British Summer Time Festival in London's Hyde Park on 8 July, and at the Rock in Rio festival in Brazil on 22 September. In a July 2017 interview, Orzabal stated that the band had collaborated with songwriter/producer Sacha Skarbek on their seventh album, The Tipping Point, and divulged several song titles from it including \"My Demons\", \"I Love You But I'm Lost\", \"End of Night\" and \"Up Above the World\". In an interview with SiriusXM Canada the same month, Orzabal divulged that although the band had signed with Warner Music to release their new album (which had been scheduled for October 2017), Universal Music had then approached Warner Music about buying the rights to the album so that they could release it (Universal being the rights holders of the vast majority of the band's back catalogue).\n\nRoland Orzabal's wife, Caroline, died in the summer of 2017. Tears for Fears initially withdrew from the remaining shows on their pending North American tour, but they resumed the tour in September 2017 at the Staples Center in Los Angeles. During his late wife's illness, Orzabal began writing songs that appear on the 2022 Tears for Fears album, The Tipping Point.\n\nOn 26 October 2017, the band performed a 65-minute live set at the BBC Radio Theatre in London for the Radio 2 in Concert series, which was broadcast on both radio and television (via the BBC Red Button service). The following night, the band played their first full-length UK concert since 2005, at London's Royal Albert Hall. Prior to this, on 12 October, \"I Love You But I'm Lost\" was released as a single from a new 16-track Tears For Fears compilation album titled Rule the World: The Greatest Hits. In October 2017, the band announced an 11-date UK arena tour for April–May 2018, featuring Alison Moyet as the support act. However, the tour was postponed to early 2019 due to Orzabal's health problems following the death of his wife.\n\nThe band performed at further UK and European festivals in the summer of 2019, starting with the Hampton Court Palace Festival on 18 and 19 June, the Forest Live festival at Delamere Forest on 21 June, and the Nocturne Live Concert Series at Blenheim Palace on 22 June.\nIn February 2020, Songs from the Big Chair was the subject of an episode of the BBC series Classic Albums featuring new interviews with the band and all key personnel from the album's creation and subsequent success. To coincide with the album's 35th anniversary, the 2014 deluxe boxed set was reissued by Universal Music, as well as a new 12-inch vinyl picture disc of the album.\n\nIn October 2020, The Seeds of Love album was reissued as various deluxe editions and returned the band to the UK Top 20.\nIn November 2020, after a change in management, Everybody Loves a Happy Ending was made available through various streaming services for the first time.\n\nThe Tipping Point\nOn 12 June 2021, Tears for Fears released the live double album Live at Massey Hall (recorded in 1985) for Record Store Day and in September, Orzabal and Smith were honoured at the Ivor Novello Awards.\n\nOn 7 October 2021, Smith appeared on the BBC Radio 2 programme The Zoe Ball Breakfast Show to introduce the band's single \"The Tipping Point\", the first track from their seventh album, The Tipping Point, released on Concord Records on 25 February 2022. In November 2021, Tears for Fears announced a summer tour of the US and UK to commence in May 2022. The band had to cancel the tour before its completion, due to Smith suffering four broken ribs in a road accident in July 2022. Two further singles, \"No Small Thing\" and \"Break the Man\", were released before the album (respectively in early December 2021 and mid-January 2022).\n\nThe Tipping Point received largely positive reviews from critics and entered the UK Charts at number 2. It also reached the Top 10 in numerous other countries (entering the US Billboard 200 at number 8) and topped the charts in Scotland and the US Billboard's Top Alternative Albums, Top Rock Albums and Top Album Sales charts. On 1 June 2022, a video was released for the song \"My Demons\" (the fourth single from The Tipping Point), and while the band was on tour, \"Everybody Wants To Rule The World\" re-entered the UK Singles Chart and entered the Billboard Global 200.\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/Tears_for_Fears\n\nStudio albums\nThe Hurting (1983)\nSongs from the Big Chair (1985)\nThe Seeds of Love (1989)\nElemental (1993) (without Curt Smith)\nRaoul and the Kings of Spain (1995) (without Curt Smith)\nEverybody Loves a Happy Ending (2004)\nThe Tipping Point (2022) <a href=\"https://www.last.fm/music/Tears+for+Fears\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "wikipedia_url": null
    }
  },
  "country": "Worldwide",
  "created_at": "2025-07-05T16:01:15.251324",
  "date_added": "2020-10-09T15:45:26-07:00",
  "discogs_id": "16026538",
  "discogs_url": "https://www.discogs.com/release/16026538-Tears-For-Fears-The-Seeds-Of-Love",
  "formats": [
    "Vinyl"
  ],
  "genres": [
    "Rock",
    "Pop",
    "new wave",
    "80s",
    "pop",
    "rock",
    "tears for fears"
  ],
  "id": "16026538",
  "images": [
    {
      "height": 593,
      "resource_url": "https://i.discogs.com/y9phueNpF6BEG3pkDQ673usQtnk1v1Ps9pKq4xGu3CA/rs:fit/g:sm/q:90/h:593/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzQtMjc5NC5qcGVn.jpeg",
      "type": "primary",
      "url": "https://i.discogs.com/y9phueNpF6BEG3pkDQ673usQtnk1v1Ps9pKq4xGu3CA/rs:fit/g:sm/q:90/h:593/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzQtMjc5NC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 600,
      "resource_url": "https://i.discogs.com/CZ42ILCmzV2vDgybNOaJ-itFyG60HtI_K3ZMy6f3AIs/rs:fit/g:sm/q:90/h:600/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzUtMjM2Ny5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/CZ42ILCmzV2vDgybNOaJ-itFyG60HtI_K3ZMy6f3AIs/rs:fit/g:sm/q:90/h:600/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzUtMjM2Ny5qcGVn.jpeg",
      "width": 586
    },
    {
      "height": 593,
      "resource_url": "https://i.discogs.com/DBMBFK4m97L74maOpmHLFqpCZuAiyt5JgRKQG_Ub0Ik/rs:fit/g:sm/q:90/h:593/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzQtODI0NC5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/DBMBFK4m97L74maOpmHLFqpCZuAiyt5JgRKQG_Ub0Ik/rs:fit/g:sm/q:90/h:593/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzQtODI0NC5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 581,
      "resource_url": "https://i.discogs.com/Im1JZKWfRe-gxfxNXTfyIwECbjN0OHO6HGn0oObLdAs/rs:fit/g:sm/q:90/h:581/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzMtNjA3MS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/Im1JZKWfRe-gxfxNXTfyIwECbjN0OHO6HGn0oObLdAs/rs:fit/g:sm/q:90/h:581/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzMtNjA3MS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 588,
      "resource_url": "https://i.discogs.com/s-qj_JbAJWzjIkNalMIgI3aO8QtP2I_AILN9P-y8-4M/rs:fit/g:sm/q:90/h:588/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzAtMTQzOS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/s-qj_JbAJWzjIkNalMIgI3aO8QtP2I_AILN9P-y8-4M/rs:fit/g:sm/q:90/h:588/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzAtMTQzOS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 588,
      "resource_url": "https://i.discogs.com/8uFbh6G-T4ffE89YcCHtJBzpqMTCatJBSAkS1UXp0pA/rs:fit/g:sm/q:90/h:588/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzEtOTE2OS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/8uFbh6G-T4ffE89YcCHtJBzpqMTCatJBSAkS1UXp0pA/rs:fit/g:sm/q:90/h:588/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzEtOTE2OS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 327,
      "resource_url": "https://i.discogs.com/pL6fk8emBhvFtHz0qEkwJVg8Kt4c6cZeO_Mlf4GBCCI/rs:fit/g:sm/q:90/h:327/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzUtMzY3MS5qcGVn.jpeg",
      "type": "secondary",
      "url": "https://i.discogs.com/pL6fk8emBhvFtHz0qEkwJVg8Kt4c6cZeO_Mlf4GBCCI/rs:fit/g:sm/q:90/h:327/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9SLTE2MDI2/NTM4LTE2ODE2NzYx/NzUtMzY3MS5qcGVn.jpeg",
      "width": 600
    },
    {
      "height": 2000,
      "resource_url": null,
      "type": "apple_music_artwork",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music114/v4/7d/c5/26/7dc52696-9a6e-df05-643a-c55fe977e46e/16UMGIM53663.rgb.jpg/2000x2000bb.jpg",
      "width": 2000
    }
  ],
  "labels": [
    "Fontana",
    "Mercury",
    "UMC"
  ],
  "lastfm_mbid": null,
  "lastfm_url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love",
  "local_images": {
    "hi-res": "public/album/the-seeds-of-love-16026538/the-seeds-of-love-16026538-hi-res.jpg",
    "medium": "public/album/the-seeds-of-love-16026538/the-seeds-of-love-16026538-medium.jpg",
    "small": "public/album/the-seeds-of-love-16026538/the-seeds-of-love-16026538-small.jpg"
  },
  "processing_info": {
    "has_local_images": true,
    "local_images_count": 3,
    "processed_at": "2025-07-05T16:01:18.949790",
    "services_used": [
      "discogs",
      "apple_music",
      "spotify",
      "wikipedia"
    ]
  },
  "release_name_apple_music": "The Seeds Of Love",
  "release_name_discogs": "The Seeds Of Love",
  "release_name_spotify": "The Seeds Of Love",
  "released": "2020-10-09",
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music114/v4/7d/c5/26/7dc52696-9a6e-df05-643a-c55fe977e46e/16UMGIM53663.rgb.jpg/2000x2000bb.jpg",
      "content_rating": null,
      "copyright": "℗ 1989 Mercury Records Limited",
      "editorial_notes": null,
      "id": "1527554451",
      "is_complete": true,
      "preview_url": null,
      "raw_attributes": {
        "artistName": "Tears for Fears",
        "artwork": {
          "bgColor": "b7a986",
          "height": 3000,
          "textColor1": "010901",
          "textColor2": "06110e",
          "textColor3": "25291b",
          "textColor4": "292f26",
          "url": "https://is1-ssl.mzstatic.com/image/thumb/Music114/v4/7d/c5/26/7dc52696-9a6e-df05-643a-c55fe977e46e/16UMGIM53663.rgb.jpg/{w}x{h}bb.jpg",
          "width": 3000
        },
        "copyright": "℗ 1989 Mercury Records Limited",
        "genreNames": [
          "Pop",
          "Music",
          "Britpop",
          "Pop/Rock",
          "Rock",
          "Adult Alternative",
          "Alternative",
          "College Rock",
          "New Wave"
        ],
        "isCompilation": false,
        "isComplete": true,
        "isMasteredForItunes": false,
        "isSingle": false,
        "name": "The Seeds Of Love",
        "playParams": {
          "id": "1527554451",
          "kind": "album"
        },
        "recordLabel": "UMC (Universal Music Catalogue)",
        "releaseDate": "1989-09-25",
        "trackCount": 8,
        "upc": "00602547707208",
        "url": "https://music.apple.com/gb/album/the-seeds-of-love/1527554451"
      },
      "url": "https://music.apple.com/gb/album/the-seeds-of-love/1527554451"
    },
    "lastfm": {
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/abac137d6a4ae00c361445cc05d4d3c8.jpg"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/abac137d6a4ae00c361445cc05d4d3c8.jpg"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/abac137d6a4ae00c361445cc05d4d3c8.jpg"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/abac137d6a4ae00c361445cc05d4d3c8.jpg"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/abac137d6a4ae00c361445cc05d4d3c8.jpg"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/abac137d6a4ae00c361445cc05d4d3c8.jpg"
        }
      ],
      "listeners": 341054,
      "mbid": "00e27726-b4a2-4881-843d-cd5d775f47dd",
      "playcount": 3035840,
      "raw_data": {
        "album": {
          "artist": "Tears for Fears",
          "image": [
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/34s/abac137d6a4ae00c361445cc05d4d3c8.jpg",
              "size": "small"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/64s/abac137d6a4ae00c361445cc05d4d3c8.jpg",
              "size": "medium"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/174s/abac137d6a4ae00c361445cc05d4d3c8.jpg",
              "size": "large"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/abac137d6a4ae00c361445cc05d4d3c8.jpg",
              "size": "extralarge"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/abac137d6a4ae00c361445cc05d4d3c8.jpg",
              "size": "mega"
            },
            {
              "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/abac137d6a4ae00c361445cc05d4d3c8.jpg",
              "size": ""
            }
          ],
          "listeners": "341054",
          "mbid": "00e27726-b4a2-4881-843d-cd5d775f47dd",
          "name": "The Seeds of Love",
          "playcount": "3035840",
          "tags": {
            "tag": [
              {
                "name": "new wave",
                "url": "https://www.last.fm/tag/new+wave"
              },
              {
                "name": "80s",
                "url": "https://www.last.fm/tag/80s"
              },
              {
                "name": "pop",
                "url": "https://www.last.fm/tag/pop"
              },
              {
                "name": "rock",
                "url": "https://www.last.fm/tag/rock"
              },
              {
                "name": "tears for fears",
                "url": "https://www.last.fm/tag/tears+for+fears"
              }
            ]
          },
          "tracks": {
            "track": [
              {
                "@attr": {
                  "rank": 1
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 328,
                "name": "Woman in Chains",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Woman+in+Chains"
              },
              {
                "@attr": {
                  "rank": 2
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 514,
                "name": "Badman's Song",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Badman%27s+Song"
              },
              {
                "@attr": {
                  "rank": 3
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 344,
                "name": "Sowing the Seeds of Love",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Sowing+the+Seeds+of+Love"
              },
              {
                "@attr": {
                  "rank": 4
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 287,
                "name": "Advice for the Young at Heart",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Advice+for+the+Young+at+Heart"
              },
              {
                "@attr": {
                  "rank": 5
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 330,
                "name": "Standing on the Corner of the Third World",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Standing+on+the+Corner+of+the+Third+World"
              },
              {
                "@attr": {
                  "rank": 6
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 373,
                "name": "Swords and Knives",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Swords+and+Knives"
              },
              {
                "@attr": {
                  "rank": 7
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 491,
                "name": "Year of the Knife",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Year+of+the+Knife"
              },
              {
                "@attr": {
                  "rank": 8
                },
                "artist": {
                  "mbid": "7c7f9c94-dee8-4903-892b-6cf44652e2de",
                  "name": "Tears for Fears",
                  "url": "https://www.last.fm/music/Tears+for+Fears"
                },
                "duration": 263,
                "name": "Famous Last Words",
                "streamable": {
                  "#text": "0",
                  "fulltrack": "0"
                },
                "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love/Famous+Last+Words"
              }
            ]
          },
          "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love"
        }
      },
      "similar_artists": [],
      "tags": [
        "new wave",
        "80s",
        "pop",
        "rock",
        "tears for fears"
      ],
      "top_albums": [],
      "top_tracks": [],
      "url": "https://www.last.fm/music/Tears+for+Fears/The+Seeds+of+Love",
      "wiki_content": "",
      "wiki_summary": ""
    },
    "spotify": {
      "album_type": "album",
      "available_markets": [],
      "copyrights": [
        {
          "text": "© 1989 Mercury Records Limited",
          "type": "C"
        },
        {
          "text": "℗ 1989 Mercury Records Limited",
          "type": "P"
        }
      ],
      "explicit": false,
      "external_ids": {
        "upc": "00602547707208"
      },
      "id": "4M0DNIYXbpCdKnVV4LoD9X",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab67616d0000b2731499a35b746104aaa751b855",
          "width": 640
        },
        {
          "height": 300,
          "url": "https://i.scdn.co/image/ab67616d00001e021499a35b746104aaa751b855",
          "width": 300
        },
        {
          "height": 64,
          "url": "https://i.scdn.co/image/ab67616d000048511499a35b746104aaa751b855",
          "width": 64
        }
      ],
      "label": "UMC (Universal Music Catalogue)",
      "popularity": 67,
      "preview_url": null,
      "raw_data": {
        "album_type": "album",
        "artists": [
          {
            "external_urls": {
              "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
            },
            "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
            "id": "4bthk9UfsYUYdcFyqxmSUU",
            "name": "Tears For Fears",
            "type": "artist",
            "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
          }
        ],
        "copyrights": [
          {
            "text": "© 1989 Mercury Records Limited",
            "type": "C"
          },
          {
            "text": "℗ 1989 Mercury Records Limited",
            "type": "P"
          }
        ],
        "external_ids": {
          "upc": "00602547707208"
        },
        "external_urls": {
          "spotify": "https://open.spotify.com/album/4M0DNIYXbpCdKnVV4LoD9X"
        },
        "genres": [],
        "href": "https://api.spotify.com/v1/albums/4M0DNIYXbpCdKnVV4LoD9X?market=US",
        "id": "4M0DNIYXbpCdKnVV4LoD9X",
        "images": [
          {
            "height": 640,
            "url": "https://i.scdn.co/image/ab67616d0000b2731499a35b746104aaa751b855",
            "width": 640
          },
          {
            "height": 300,
            "url": "https://i.scdn.co/image/ab67616d00001e021499a35b746104aaa751b855",
            "width": 300
          },
          {
            "height": 64,
            "url": "https://i.scdn.co/image/ab67616d000048511499a35b746104aaa751b855",
            "width": 64
          }
        ],
        "is_playable": true,
        "label": "UMC (Universal Music Catalogue)",
        "name": "The Seeds Of Love",
        "popularity": 67,
        "release_date": "1989-09-25",
        "release_date_precision": "day",
        "total_tracks": 8,
        "tracks": {
          "href": "https://api.spotify.com/v1/albums/4M0DNIYXbpCdKnVV4LoD9X/tracks?offset=0&limit=50&market=US",
          "items": [
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                },
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/1BMb6sQJVkmUyCuodmRs2g"
                  },
                  "href": "https://api.spotify.com/v1/artists/1BMb6sQJVkmUyCuodmRs2g",
                  "id": "1BMb6sQJVkmUyCuodmRs2g",
                  "name": "Oleta Adams",
                  "type": "artist",
                  "uri": "spotify:artist:1BMb6sQJVkmUyCuodmRs2g"
                }
              ],
              "disc_number": 1,
              "duration_ms": 390906,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/1ydGjYPl6SkTBwy6yhRCJT"
              },
              "href": "https://api.spotify.com/v1/tracks/1ydGjYPl6SkTBwy6yhRCJT",
              "id": "1ydGjYPl6SkTBwy6yhRCJT",
              "is_local": false,
              "is_playable": true,
              "name": "Woman In Chains",
              "preview_url": null,
              "track_number": 1,
              "type": "track",
              "uri": "spotify:track:1ydGjYPl6SkTBwy6yhRCJT"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                }
              ],
              "disc_number": 1,
              "duration_ms": 512919,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/10QGEFiAS7ANZ8jLqEkKOE"
              },
              "href": "https://api.spotify.com/v1/tracks/10QGEFiAS7ANZ8jLqEkKOE",
              "id": "10QGEFiAS7ANZ8jLqEkKOE",
              "is_local": false,
              "is_playable": true,
              "name": "Badman’s Song",
              "preview_url": null,
              "track_number": 2,
              "type": "track",
              "uri": "spotify:track:10QGEFiAS7ANZ8jLqEkKOE"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                }
              ],
              "disc_number": 1,
              "duration_ms": 379333,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/62vx6uOYO7PrqKqKTKg9RY"
              },
              "href": "https://api.spotify.com/v1/tracks/62vx6uOYO7PrqKqKTKg9RY",
              "id": "62vx6uOYO7PrqKqKTKg9RY",
              "is_local": false,
              "is_playable": true,
              "name": "Sowing The Seeds Of Love",
              "preview_url": null,
              "track_number": 3,
              "type": "track",
              "uri": "spotify:track:62vx6uOYO7PrqKqKTKg9RY"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                }
              ],
              "disc_number": 1,
              "duration_ms": 290920,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/0mSvo1tBguedny4troEYTU"
              },
              "href": "https://api.spotify.com/v1/tracks/0mSvo1tBguedny4troEYTU",
              "id": "0mSvo1tBguedny4troEYTU",
              "is_local": false,
              "is_playable": true,
              "name": "Advice For The Young At Heart",
              "preview_url": null,
              "track_number": 4,
              "type": "track",
              "uri": "spotify:track:0mSvo1tBguedny4troEYTU"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                }
              ],
              "disc_number": 1,
              "duration_ms": 333840,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/3jYfSG3zPuMInTl3Y2ty0Z"
              },
              "href": "https://api.spotify.com/v1/tracks/3jYfSG3zPuMInTl3Y2ty0Z",
              "id": "3jYfSG3zPuMInTl3Y2ty0Z",
              "is_local": false,
              "is_playable": true,
              "name": "Standing On The Corner Of The Third World",
              "preview_url": null,
              "track_number": 5,
              "type": "track",
              "uri": "spotify:track:3jYfSG3zPuMInTl3Y2ty0Z"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                }
              ],
              "disc_number": 1,
              "duration_ms": 372560,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/4qEyJvBGyOJcUJHoZEE0DR"
              },
              "href": "https://api.spotify.com/v1/tracks/4qEyJvBGyOJcUJHoZEE0DR",
              "id": "4qEyJvBGyOJcUJHoZEE0DR",
              "is_local": false,
              "is_playable": true,
              "name": "Swords And Knives",
              "preview_url": null,
              "track_number": 6,
              "type": "track",
              "uri": "spotify:track:4qEyJvBGyOJcUJHoZEE0DR"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                }
              ],
              "disc_number": 1,
              "duration_ms": 428266,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6zg0o2PLUb7y4MYKdQtL4S"
              },
              "href": "https://api.spotify.com/v1/tracks/6zg0o2PLUb7y4MYKdQtL4S",
              "id": "6zg0o2PLUb7y4MYKdQtL4S",
              "is_local": false,
              "is_playable": true,
              "name": "Year Of The Knife",
              "preview_url": null,
              "track_number": 7,
              "type": "track",
              "uri": "spotify:track:6zg0o2PLUb7y4MYKdQtL4S"
            },
            {
              "artists": [
                {
                  "external_urls": {
                    "spotify": "https://open.spotify.com/artist/4bthk9UfsYUYdcFyqxmSUU"
                  },
                  "href": "https://api.spotify.com/v1/artists/4bthk9UfsYUYdcFyqxmSUU",
                  "id": "4bthk9UfsYUYdcFyqxmSUU",
                  "name": "Tears For Fears",
                  "type": "artist",
                  "uri": "spotify:artist:4bthk9UfsYUYdcFyqxmSUU"
                }
              ],
              "disc_number": 1,
              "duration_ms": 268480,
              "explicit": false,
              "external_urls": {
                "spotify": "https://open.spotify.com/track/6h3wioELQgZTRRMdk3RfuR"
              },
              "href": "https://api.spotify.com/v1/tracks/6h3wioELQgZTRRMdk3RfuR",
              "id": "6h3wioELQgZTRRMdk3RfuR",
              "is_local": false,
              "is_playable": true,
              "name": "Famous Last Words",
              "preview_url": null,
              "track_number": 8,
              "type": "track",
              "uri": "spotify:track:6h3wioELQgZTRRMdk3RfuR"
            }
          ],
          "limit": 50,
          "next": null,
          "offset": 0,
          "previous": null,
          "total": 8
        },
        "type": "album",
        "uri": "spotify:album:4M0DNIYXbpCdKnVV4LoD9X"
      },
      "release_date": "1989-09-25",
      "release_date_precision": "day",
      "total_tracks": 8,
      "tracks": [
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            },
            {
              "id": "1BMb6sQJVkmUyCuodmRs2g",
              "name": "Oleta Adams"
            }
          ],
          "duration_ms": 390906,
          "explicit": false,
          "id": "1ydGjYPl6SkTBwy6yhRCJT",
          "name": "Woman In Chains",
          "preview_url": null,
          "track_number": 1
        },
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            }
          ],
          "duration_ms": 512919,
          "explicit": false,
          "id": "10QGEFiAS7ANZ8jLqEkKOE",
          "name": "Badman’s Song",
          "preview_url": null,
          "track_number": 2
        },
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            }
          ],
          "duration_ms": 379333,
          "explicit": false,
          "id": "62vx6uOYO7PrqKqKTKg9RY",
          "name": "Sowing The Seeds Of Love",
          "preview_url": null,
          "track_number": 3
        },
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            }
          ],
          "duration_ms": 290920,
          "explicit": false,
          "id": "0mSvo1tBguedny4troEYTU",
          "name": "Advice For The Young At Heart",
          "preview_url": null,
          "track_number": 4
        },
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            }
          ],
          "duration_ms": 333840,
          "explicit": false,
          "id": "3jYfSG3zPuMInTl3Y2ty0Z",
          "name": "Standing On The Corner Of The Third World",
          "preview_url": null,
          "track_number": 5
        },
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            }
          ],
          "duration_ms": 372560,
          "explicit": false,
          "id": "4qEyJvBGyOJcUJHoZEE0DR",
          "name": "Swords And Knives",
          "preview_url": null,
          "track_number": 6
        },
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            }
          ],
          "duration_ms": 428266,
          "explicit": false,
          "id": "6zg0o2PLUb7y4MYKdQtL4S",
          "name": "Year Of The Knife",
          "preview_url": null,
          "track_number": 7
        },
        {
          "artists": [
            {
              "id": "4bthk9UfsYUYdcFyqxmSUU",
              "name": "Tears For Fears"
            }
          ],
          "duration_ms": 268480,
          "explicit": false,
          "id": "6h3wioELQgZTRRMdk3RfuR",
          "name": "Famous Last Words",
          "preview_url": null,
          "track_number": 8
        }
      ],
      "url": "https://open.spotify.com/album/4M0DNIYXbpCdKnVV4LoD9X"
    }
  },
  "spotify_id": "4M0DNIYXbpCdKnVV4LoD9X",
  "spotify_url": "https://open.spotify.com/album/4M0DNIYXbpCdKnVV4LoD9X",
  "styles": [
    "Psychedelic Rock",
    "Pop Rock"
  ],
  "title": "The Seeds Of Love",
  "tracklist": [
    {
      "artists": [],
      "duration": "6:31",
      "position": "A1",
      "title": "Woman In Chains"
    },
    {
      "artists": [],
      "duration": "8:32",
      "position": "A2",
      "title": "Badman's Song"
    },
    {
      "artists": [],
      "duration": "6:19",
      "position": "A3",
      "title": "Sowing The Seeds Of Love"
    },
    {
      "artists": [],
      "duration": "4:50",
      "position": "A4",
      "title": "Advice For The Young At Heart"
    },
    {
      "artists": [],
      "duration": "5:33",
      "position": "B1",
      "title": "Standing On The Corner Of The Third World"
    },
    {
      "artists": [],
      "duration": "6:12",
      "position": "B2",
      "title": "Swords And Knives"
    },
    {
      "artists": [],
      "duration": "7:08",
      "position": "B3",
      "title": "Year Of The Knife"
    },
    {
      "artists": [],
      "duration": "4:26",
      "position": "B4",
      "title": "Famous Last Words"
    }
  ],
  "updated_at": "2025-07-05T16:01:16.513462",
  "year": 2020
}