{
  "apple_music_id": "103776",
  "apple_music_url": "https://music.apple.com/gb/artist/eddie-kendricks/103776",
  "biography": "Eddie Kendricks (Edward James Kendrick, Union Springs, Alabama, December 17, 1939 – Birmingham, Alabama, October 5, 1992), was an American singer and songwriter, noted for his distinctive falsetto singing style. Kendricks co-founded the Motown singing group The Temptations, and was one of their lead singers from 1960 until 1971. His was the lead voice on such famous songs as \"The Way You Do The Things You Do\", \"Get Ready\", and \"Just My Imagination\". As a solo artist, Kendricks recorded several hits of his own during the 1970s, including the number-one single \"Keep On Truckin'\".\n\nKendricks' solo career began slowly; he endured two years of singles that missed the Top 40, while The Temptations continued with their string of Norman Whitfield-helmed hits (one of which, \"Superstar (Remember How You Got Where You Are)\", was written as a jab towards Kendricks and Ruffin). Despite enjoying only a modicum of commercial success and radio airplay, Kendricks's 1972 album People... Hold On (with the aid of his touring group, The Young Senators: Jimi Dougans, Frank Hooker, LeRoy Fleming, Wornell Jones, David Lecraft, James Drumer Johnson and John Engram) was a cornerstone of DJ playlists in downtown New York's nascent disco scene. The expansive, eight minute take on \"Girl, You Need A Change Of Mind\", which peaked at number thirteen on the soul chart, from the album was a particular favorite at David Mancuso's Loft. The single was later remade by R&B singer D'Angelo for the Get on the Bus Soundtrack. As the dance craze seeped through into other cities, Kendricks scored a #1 pop hit in 1973 with the Frank Wilson-produced \"Keep on Truckin'\". It sold over one million copies, and was awarded a gold disc. Future hits included \"Boogie Down\" (US #2) (1974) and another million selling release,[3] \"Son of Sagittarius\" (US #28) (1974), \"Shoeshine Boy\" (US #18) (1975), and \"He's a Friend\" (US #36) (1976). Another notable song is \"Intimate Friends\" (1977), which is sampled for the Alicia Keys song \"Unbreakable\", \"A Penny for My Thoughts\" by Common, Sparkle's \"Time to Move on\" on her self-titled first studio album and Sweet Sable's \"Old Time's Sake\" from the soundtrack for the 1994 2pac film, Above the Rim. Erykah Badu also sampled \"Intimate Friends\" for her song \"Fall in Love (Your Funeral)\", as well as his song \"My People... Hold on\" for her song \"My People\" on her album New Amerykah Part One (4th World War).\nExasperated by a lack of creative and financial control, Kendricks left Motown in 1978, with the requirement of signing away the rights to his royalties. He moved first to Arista Records, and later to Atlantic Records. By this time, his popularity had waned, and he was also gradually losing his voice as a result of chain smoking.\nHe and David Ruffin briefly re-joined the Temptations for a 1982 reunion tour. In an interview with Tom Meros, Dennis Edwards, Kendricks's former Temptations band mate, claimed that Kendricks had issues hitting his falsetto notes during recording sessions for the reunion album. Because of his singing difficulty, Edwards said that Kendricks went to a physician to examine his vocal ability. The physician discovered a \"pin drop\" of cancer on one of his lungs. However, Kendricks reportedly refused to undergo chemotherapy at the time because of fear that he would lose his hair.\nRuffin and Kendrick (Kendricks dropped the \"s\" from his stage name during the 1980s) reportedly met up one night when Ruffin went to watch Kendrick perform in a nightclub; Kendrick spotted Ruffin in the crowd, pointed him out, and invited him to come up on stage and perform with him. Afterward they talked about touring on their own and recorded an album as a duo for RCA in 1988.\n\nEarlier, in 1985, they participated in the Hall & Oates live album Live at The Apollo recorded at a benefit at New York City's Apollo Theater; and sang with the duo at Live Aid in Philadelphia and the MTV Video Music Awards in New York. Hall & Oates have cited Kendrick and Ruffin specifically, and the Temptations in general, as a major influence.\nIn 1989, Kendrick, Ruffin, and their Temptations bandmates were inducted into the Rock and Roll Hall of Fame. There, Kendrick and Ruffin made plans with fellow former Temptation Dennis Edwards to tour and record as \"Ruffin/Kendrick/Edwards, Former Leads of The Temptations.\" The Ruffin/Kendrick/ Edwards project was cut short in 1991, when Kendrick was diagnosed with lung cancer and David Ruffin died of a drug overdose, although Kendrick and Edwards continued to tour for the remainder of 1991.\nIn late 1991, Kendrick, by now living in his native Birmingham, Alabama, underwent surgery to have one of his lungs removed in hopes of preventing the spread of the cancer. He continued to tour through the summer of 1992, when he fell ill again and was hospitalized. Kendrick died on October 5, 1992, of lung cancer in Birmingham at the age of 52. Kendrick is survived by his three children: Parris Kendrick, Aika Kendrick and Paul Kendrick. He was buried in Elmwood Cemetery.\nIn 1998, NBC aired The Temptations, a four-hour television miniseries based upon an autobiographical book by Otis Williams. Kendricks was portrayed by actor Terron Brooks.\n\nKendricks was born in  on December 17, 1939, the son of Johnny and Lee Bell Kendrick. He had one sister, Patricia, and three brothers, Charles, Robert, and Clarence. His family moved to Birmingham, where he met and began singing with his best friend Paul Williams in their church choir in the late 1940s. In 1955, Kendricks, Williams, and friends Kell Osborne and Jerome Averette formed a doo-wop group called The Cavaliers, and began performing around Birmingham. The group decided to move for better opportunities in their musical careers, and in 1957 the group moved to Cleveland, Ohio. In Cleveland, they met manager Milton Jenkins, and soon moved with Jenkins to Detroit, Michigan, where the Cavaliers renamed themselves 'The Primes'. Under Jenkins' management, the Primes did well for themselves in the Detroit area, eventually creating a female spin-off group called The Primettes (later The Supremes). In 1961, Osbourne moved to California, and the Primes disbanded. Kendricks and Paul Williams joined forces with members Otis Williams and Melvin \"Blue\" Franklin of Otis Wiliiams and the Distants after three members quit and became The Elgins, who on the same day changed their name to \"The Temptations\" and signed to Motown.\n\nThe Temptations began singing background for Mary Wells. After an initial dry period, The Temptations quickly became the most successful male vocal group of the 1960s. Although technically Kendricks was first tenor in the group's harmony, he predominately sang in a falsetto voice. Among the Temptations songs Kendricks sang lead on were \"Dream Come True\" (1962), the group's first charting single; \"The Way You Do the Things You Do\" (1964), the group's first US Top 20 hit; \"I'll Be in Trouble\" (1964); \"The Girl's Alright With Me\" (1964), a popular b-side that Kendricks co-wrote; \"Girl (Why You Wanna Make Me Blue)\" (1964); \"Get Ready\" (1966); \"Please Return Your Love to Me\" (1968); and \"Just My Imagination\" (1971). He was also allowed to sing a few leads in his natural voice such as \"May I Have This Dance\" (1962). He shares lead vocal duty on other records, including \"You're My Everything\" (1967) (shared with David Ruffin), and a long string of Norman Whitfield produced psychedelic soul records where all five Temptations sang lead, such as the Grammy winner \"Cloud Nine\" (1968), \"I Can't Get Next to You\" (1969), and \"Ball of Confusion\" (1970). He also leads on \"I'm Gonna Make You Love Me\" (1968), a popular duet with Diana Ross and the Supremes, and on the Temptations' famous version of the Christmas classic \"Rudolph the Red-Nosed Reindeer\" (1968).\n\nIn the Temptations, Kendricks was responsible for creating most of the group's vocal arrangements, and also served as wardrobe manager, including the now famous purple suits the group wore for one performance. He also co-wrote several Temptations songs apart from \"The Girl's Alright With Me\" including \"Isn't She Pretty\" (1961) and \"Don't Send Me Away\" (1967). His favorite food was cornbread, and as a result he was nicknamed \"Cornbread\" (or \"Corn\" for short) by his groupmates. According to Otis Williams, Kendricks romantically pursued Diana Ross, lead singer of the Supremes, and he was said to have been close friends with Martha Reeves of the Vandellas. In her second book, Supreme Faith, Supremes singer Mary Wilson writes that she and Kendricks were lovers \"briefly,\" but remained close friends.\nKendricks remained in the group through the rest of the decade, but a number of issues began to push him away from it in the late 1960s and early 1970s. He was uncomfortable with singing the psychedelic style that Whitfield was now crafting for the group as opposed to the romantic ballads they had sung under the direction of Smokey Robinson; his friend Paul Williams was often too ill to perform with the group; and Kendricks often found himself at odds with bandmates Otis Williams and Melvin Franklin. As he grew away from the group, Kendricks began to rekindle his friendship with ex-Temptation David Ruffin, who convinced him to leave the group.\nIn a 1991 interview with a Chicago television series called Urban Street, Kendricks said he had actually considered leaving the group as early as 1965, even though that was when the band was finally starting to take off, because of things that \"weren't quite proper.\" He explained that they were working with people that \"didn't have their best interests at heart.\" Kendricks, however, initially decided to stay in the group because he was worried he would not get the support he needed if he left the group. Kendricks also expressed the fact that his relationship with Berry Gordy was less than cordial. \"Berry Gordy is a man I don't know, I only met him about three times,\" he said, but \"I know he didn't particularly care for me.\" Kendricks stated that he did not agree with many decisions that were made.\nFollowing one final altercation with Williams and Franklin during a run at the Copacabana nightclub in November 1970, Kendricks walked off after the first night and didn't return, and it was mutually decided he would leave the group. While working on his first solo album, Kendricks recorded one last hit single with the Temptations, 1971's \"Just My Imagination (Running Away with Me)\". By the time the record reached #1 on the US pop charts in April 1971, Kendricks had signed a solo deal with Motown's Tamla imprint and was preparing the release of his first solo album, All By Myself. However, many of his problems with Motown would reoccur.\n\n <a href=\"https://www.last.fm/music/Eddie+Kendricks\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T16:09:36.097482",
  "discogs_id": "29810",
  "discogs_url": "https://www.discogs.com/artist/29810-Eddie-Kendricks",
  "followers": 322097,
  "formed_date": null,
  "genres": [
    "R&B/Soul",
    "motown",
    "classic soul",
    "philly soul",
    "soul",
    "funk",
    "Disco",
    "rnb"
  ],
  "id": "eddie-kendricks-1751728183",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/1c/38/bc/1c38bc0d-8173-99f4-eb2e-f5125916cef6/mzl.jdycnrzl.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 1280,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/664f1a004773bd74a4ff5104818e4f383ef95a5e",
      "width": 676
    },
    {
      "height": 1212,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/d5eff2f40af987b8794a43b6df78a47f41e4dc8f",
      "width": 640
    },
    {
      "height": 379,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/04eacbd2e9a333aff1deb625512fef76cd60c754",
      "width": 200
    },
    {
      "height": 121,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/745fd75c3bb492e40f93835e233f3e80d4ab513a",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/jCPJ8sZDfV7jUOFxr4Hxr6bQSuopb2gjdQxWxuBnwAU/rs:fit/g:sm/q:90/h:539/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/2IUOIvh-Y2cLbPMzhz42Kp0ZRI3d_bkXfGVmncay-4o/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "cf3ea6e9-c856-4737-a988-6b64cc9f2bf2",
  "lastfm_url": "https://www.last.fm/music/Eddie+Kendricks",
  "local_images": {
    "hi-res": "../public/artist/eddie-kendricks/eddie-kendricks-hi-res.jpg",
    "medium": "../public/artist/eddie-kendricks/eddie-kendricks-medium.jpg",
    "small": "../public/artist/eddie-kendricks/eddie-kendricks-small.jpg"
  },
  "name": "Eddie Kendricks",
  "popularity": 41,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/1c/38/bc/1c38bc0d-8173-99f4-eb2e-f5125916cef6/mzl.jdycnrzl.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "R&B/Soul"
      ],
      "id": "103776",
      "name": "Eddie Kendricks",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/eddie-kendricks/103776"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/jCPJ8sZDfV7jUOFxr4Hxr6bQSuopb2gjdQxWxuBnwAU/rs:fit/g:sm/q:90/h:539/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "29810",
      "images": [
        {
          "height": 539,
          "resource_url": "https://i.discogs.com/jCPJ8sZDfV7jUOFxr4Hxr6bQSuopb2gjdQxWxuBnwAU/rs:fit/g:sm/q:90/h:539/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/jCPJ8sZDfV7jUOFxr4Hxr6bQSuopb2gjdQxWxuBnwAU/rs:fit/g:sm/q:90/h:539/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
          "uri150": "https://i.discogs.com/2IUOIvh-Y2cLbPMzhz42Kp0ZRI3d_bkXfGVmncay-4o/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
          "width": 600
        },
        {
          "height": 198,
          "resource_url": "https://i.discogs.com/3fGDy0QCmD3QLNWHmKOersFoMmwNYxvIUzhAKFkm_58/rs:fit/g:sm/q:90/h:198/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTAwMS5qcGc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/3fGDy0QCmD3QLNWHmKOersFoMmwNYxvIUzhAKFkm_58/rs:fit/g:sm/q:90/h:198/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTAwMS5qcGc.jpeg",
          "uri150": "https://i.discogs.com/G_nRga7lbirj_Kshjc69BEPKsztbylyQAN-Qq5iNfuQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTAwMS5qcGc.jpeg",
          "width": 150
        },
        {
          "height": 771,
          "resource_url": "https://i.discogs.com/o5EFV2AL2er50FC7Bc5kn3tQ3wqZcH6bQJ_H5Kw3gjI/rs:fit/g:sm/q:90/h:771/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/NDg3OS5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/o5EFV2AL2er50FC7Bc5kn3tQ3wqZcH6bQJ_H5Kw3gjI/rs:fit/g:sm/q:90/h:771/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/NDg3OS5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/qyHL-QW6NGKSRFu4T3SdYCSU6yAtDdoGThCNzj8fBUk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/NDg3OS5qcGVn.jpeg",
          "width": 600
        },
        {
          "height": 461,
          "resource_url": "https://i.discogs.com/lmmIhb2-UzeeYEaV67BmVR2iWG6mBuTLvO6AYJ9F9FQ/rs:fit/g:sm/q:90/h:461/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/MzM4Ni5qcGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/lmmIhb2-UzeeYEaV67BmVR2iWG6mBuTLvO6AYJ9F9FQ/rs:fit/g:sm/q:90/h:461/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/MzM4Ni5qcGVn.jpeg",
          "uri150": "https://i.discogs.com/tpuNzVMcf900aqL_xbM92oUTyAd-mo4cFE59rXXp_qE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/MzM4Ni5qcGVn.jpeg",
          "width": 600
        }
      ],
      "members": [],
      "name": "Eddie Kendricks",
      "namevariations": [
        "Charles Kendrick",
        "Charles Kendricks",
        "E Kendricks",
        "E. J. K.",
        "E. Kendrick",
        "E. Kendricks",
        "E. Kendrix",
        "E.J.K.",
        "E.Kendrick",
        "Ed Kendricks",
        "Eddie",
        "Eddie Hendricks",
        "Eddie Kenaricks",
        "Eddie Kendrick",
        "Eddie Kendriks",
        "Eddie Kendrix",
        "Eddie Kindricks",
        "Eddy Kendricks",
        "Kendrick",
        "Kendricks",
        "エディー・ケンドリックス"
      ],
      "profile": "American singer and songwriter, best known by the stage name Eddie Kendricks.\r\nKnown for his distinctive falsetto singing style, Kendricks co-founded the Motown vocal group [a28332].\r\nAs a solo artist, Kendricks recorded several hits of his own during the 1970s, including the number-one single [m=148270].\r\nHe also founded the [l=E. J. K. Records] label.\r\n\r\nBorn : 17th December 1939, Union Springs, Alabama, U.S.A.\r\nDied : 5th October 1992, Alabama, U.S.A.",
      "raw_data": {
        "data_quality": "Needs Vote",
        "groups": [
          {
            "active": false,
            "id": 28332,
            "name": "The Temptations",
            "resource_url": "https://api.discogs.com/artists/28332",
            "thumbnail_url": "https://i.discogs.com/-9jANTUgLik12RuqZNcaOZGr4Bg4dAZlK9yhzST8URc/rs:fit/g:sm/q:40/h:536/w:383/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI4MzMy/LTE0MDU2OTQwODUt/MzA0Ny5qcGVn.jpeg"
          },
          {
            "active": true,
            "id": 143887,
            "name": "Artists United Against Apartheid",
            "resource_url": "https://api.discogs.com/artists/143887",
            "thumbnail_url": "https://i.discogs.com/xm8VbRYMYLmQ2A_p1vNVPVf5i-yH1JzjiZP4VxpvgfE/rs:fit/g:sm/q:40/h:204/w:496/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTE0Mzg4/Ny0xMTEwNjQ5NzA5/LmpwZw.jpeg"
          },
          {
            "active": true,
            "id": 1586761,
            "name": "The Eddie Kendricks Singers",
            "resource_url": "https://api.discogs.com/artists/1586761",
            "thumbnail_url": ""
          },
          {
            "active": false,
            "id": 3209368,
            "name": "The Original Lead Singers Of The Temptations",
            "resource_url": "https://api.discogs.com/artists/3209368",
            "thumbnail_url": ""
          }
        ],
        "id": 29810,
        "images": [
          {
            "height": 539,
            "resource_url": "https://i.discogs.com/jCPJ8sZDfV7jUOFxr4Hxr6bQSuopb2gjdQxWxuBnwAU/rs:fit/g:sm/q:90/h:539/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/jCPJ8sZDfV7jUOFxr4Hxr6bQSuopb2gjdQxWxuBnwAU/rs:fit/g:sm/q:90/h:539/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
            "uri150": "https://i.discogs.com/2IUOIvh-Y2cLbPMzhz42Kp0ZRI3d_bkXfGVmncay-4o/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
            "width": 600
          },
          {
            "height": 198,
            "resource_url": "https://i.discogs.com/3fGDy0QCmD3QLNWHmKOersFoMmwNYxvIUzhAKFkm_58/rs:fit/g:sm/q:90/h:198/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTAwMS5qcGc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/3fGDy0QCmD3QLNWHmKOersFoMmwNYxvIUzhAKFkm_58/rs:fit/g:sm/q:90/h:198/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTAwMS5qcGc.jpeg",
            "uri150": "https://i.discogs.com/G_nRga7lbirj_Kshjc69BEPKsztbylyQAN-Qq5iNfuQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTAwMS5qcGc.jpeg",
            "width": 150
          },
          {
            "height": 771,
            "resource_url": "https://i.discogs.com/o5EFV2AL2er50FC7Bc5kn3tQ3wqZcH6bQJ_H5Kw3gjI/rs:fit/g:sm/q:90/h:771/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/NDg3OS5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/o5EFV2AL2er50FC7Bc5kn3tQ3wqZcH6bQJ_H5Kw3gjI/rs:fit/g:sm/q:90/h:771/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/NDg3OS5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/qyHL-QW6NGKSRFu4T3SdYCSU6yAtDdoGThCNzj8fBUk/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/NDg3OS5qcGVn.jpeg",
            "width": 600
          },
          {
            "height": 461,
            "resource_url": "https://i.discogs.com/lmmIhb2-UzeeYEaV67BmVR2iWG6mBuTLvO6AYJ9F9FQ/rs:fit/g:sm/q:90/h:461/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/MzM4Ni5qcGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/lmmIhb2-UzeeYEaV67BmVR2iWG6mBuTLvO6AYJ9F9FQ/rs:fit/g:sm/q:90/h:461/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/MzM4Ni5qcGVn.jpeg",
            "uri150": "https://i.discogs.com/tpuNzVMcf900aqL_xbM92oUTyAd-mo4cFE59rXXp_qE/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTE2NzY5MDgxMTAt/MzM4Ni5qcGVn.jpeg",
            "width": 600
          }
        ],
        "name": "Eddie Kendricks",
        "namevariations": [
          "Charles Kendrick",
          "Charles Kendricks",
          "E Kendricks",
          "E. J. K.",
          "E. Kendrick",
          "E. Kendricks",
          "E. Kendrix",
          "E.J.K.",
          "E.Kendrick",
          "Ed Kendricks",
          "Eddie",
          "Eddie Hendricks",
          "Eddie Kenaricks",
          "Eddie Kendrick",
          "Eddie Kendriks",
          "Eddie Kendrix",
          "Eddie Kindricks",
          "Eddy Kendricks",
          "Kendrick",
          "Kendricks",
          "エディー・ケンドリックス"
        ],
        "profile": "American singer and songwriter, best known by the stage name Eddie Kendricks.\r\nKnown for his distinctive falsetto singing style, Kendricks co-founded the Motown vocal group [a28332].\r\nAs a solo artist, Kendricks recorded several hits of his own during the 1970s, including the number-one single [m=148270].\r\nHe also founded the [l=E. J. K. Records] label.\r\n\r\nBorn : 17th December 1939, Union Springs, Alabama, U.S.A.\r\nDied : 5th October 1992, Alabama, U.S.A.",
        "realname": "Edward James Kendrick",
        "releases_url": "https://api.discogs.com/artists/29810/releases",
        "resource_url": "https://api.discogs.com/artists/29810",
        "uri": "https://www.discogs.com/artist/29810-Eddie-Kendricks",
        "urls": [
          "http://en.wikipedia.org/wiki/Eddie_Kendricks",
          "https://soulstrutter.blogspot.com/2022/12/eddie-kendricks-profile.html",
          "http://www.myspace.com/formertemptations",
          "http://www.allmusic.com/artist/eddie-kendricks-mn0000170211",
          "http://www.whosampled.com/Eddie-Kendricks/",
          "http://marvellousmotown.com/motown-artists/Eddie-kendricks"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/29810",
      "thumb": "https://i.discogs.com/2IUOIvh-Y2cLbPMzhz42Kp0ZRI3d_bkXfGVmncay-4o/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI5ODEw/LTExNjk3NzUyMjUu/anBlZw.jpeg",
      "url": "https://www.discogs.com/artist/29810-Eddie-Kendricks",
      "urls": [
        "http://en.wikipedia.org/wiki/Eddie_Kendricks",
        "https://soulstrutter.blogspot.com/2022/12/eddie-kendricks-profile.html",
        "http://www.myspace.com/formertemptations",
        "http://www.allmusic.com/artist/eddie-kendricks-mn0000170211",
        "http://www.whosampled.com/Eddie-Kendricks/",
        "http://marvellousmotown.com/motown-artists/Eddie-kendricks"
      ]
    },
    "lastfm": {
      "bio_content": "Eddie Kendricks (Edward James Kendrick, Union Springs, Alabama, December 17, 1939 – Birmingham, Alabama, October 5, 1992), was an American singer and songwriter, noted for his distinctive falsetto singing style. Kendricks co-founded the Motown singing group The Temptations, and was one of their lead singers from 1960 until 1971. His was the lead voice on such famous songs as \"The Way You Do The Things You Do\", \"Get Ready\", and \"Just My Imagination\". As a solo artist, Kendricks recorded several hits of his own during the 1970s, including the number-one single \"Keep On Truckin'\".\n\nKendricks' solo career began slowly; he endured two years of singles that missed the Top 40, while The Temptations continued with their string of Norman Whitfield-helmed hits (one of which, \"Superstar (Remember How You Got Where You Are)\", was written as a jab towards Kendricks and Ruffin). Despite enjoying only a modicum of commercial success and radio airplay, Kendricks's 1972 album People... Hold On (with the aid of his touring group, The Young Senators: Jimi Dougans, Frank Hooker, LeRoy Fleming, Wornell Jones, David Lecraft, James Drumer Johnson and John Engram) was a cornerstone of DJ playlists in downtown New York's nascent disco scene. The expansive, eight minute take on \"Girl, You Need A Change Of Mind\", which peaked at number thirteen on the soul chart, from the album was a particular favorite at David Mancuso's Loft. The single was later remade by R&B singer D'Angelo for the Get on the Bus Soundtrack. As the dance craze seeped through into other cities, Kendricks scored a #1 pop hit in 1973 with the Frank Wilson-produced \"Keep on Truckin'\". It sold over one million copies, and was awarded a gold disc. Future hits included \"Boogie Down\" (US #2) (1974) and another million selling release,[3] \"Son of Sagittarius\" (US #28) (1974), \"Shoeshine Boy\" (US #18) (1975), and \"He's a Friend\" (US #36) (1976). Another notable song is \"Intimate Friends\" (1977), which is sampled for the Alicia Keys song \"Unbreakable\", \"A Penny for My Thoughts\" by Common, Sparkle's \"Time to Move on\" on her self-titled first studio album and Sweet Sable's \"Old Time's Sake\" from the soundtrack for the 1994 2pac film, Above the Rim. Erykah Badu also sampled \"Intimate Friends\" for her song \"Fall in Love (Your Funeral)\", as well as his song \"My People... Hold on\" for her song \"My People\" on her album New Amerykah Part One (4th World War).\nExasperated by a lack of creative and financial control, Kendricks left Motown in 1978, with the requirement of signing away the rights to his royalties. He moved first to Arista Records, and later to Atlantic Records. By this time, his popularity had waned, and he was also gradually losing his voice as a result of chain smoking.\nHe and David Ruffin briefly re-joined the Temptations for a 1982 reunion tour. In an interview with Tom Meros, Dennis Edwards, Kendricks's former Temptations band mate, claimed that Kendricks had issues hitting his falsetto notes during recording sessions for the reunion album. Because of his singing difficulty, Edwards said that Kendricks went to a physician to examine his vocal ability. The physician discovered a \"pin drop\" of cancer on one of his lungs. However, Kendricks reportedly refused to undergo chemotherapy at the time because of fear that he would lose his hair.\nRuffin and Kendrick (Kendricks dropped the \"s\" from his stage name during the 1980s) reportedly met up one night when Ruffin went to watch Kendrick perform in a nightclub; Kendrick spotted Ruffin in the crowd, pointed him out, and invited him to come up on stage and perform with him. Afterward they talked about touring on their own and recorded an album as a duo for RCA in 1988.\n\nEarlier, in 1985, they participated in the Hall & Oates live album Live at The Apollo recorded at a benefit at New York City's Apollo Theater; and sang with the duo at Live Aid in Philadelphia and the MTV Video Music Awards in New York. Hall & Oates have cited Kendrick and Ruffin specifically, and the Temptations in general, as a major influence.\nIn 1989, Kendrick, Ruffin, and their Temptations bandmates were inducted into the Rock and Roll Hall of Fame. There, Kendrick and Ruffin made plans with fellow former Temptation Dennis Edwards to tour and record as \"Ruffin/Kendrick/Edwards, Former Leads of The Temptations.\" The Ruffin/Kendrick/ Edwards project was cut short in 1991, when Kendrick was diagnosed with lung cancer and David Ruffin died of a drug overdose, although Kendrick and Edwards continued to tour for the remainder of 1991.\nIn late 1991, Kendrick, by now living in his native Birmingham, Alabama, underwent surgery to have one of his lungs removed in hopes of preventing the spread of the cancer. He continued to tour through the summer of 1992, when he fell ill again and was hospitalized. Kendrick died on October 5, 1992, of lung cancer in Birmingham at the age of 52. Kendrick is survived by his three children: Parris Kendrick, Aika Kendrick and Paul Kendrick. He was buried in Elmwood Cemetery.\nIn 1998, NBC aired The Temptations, a four-hour television miniseries based upon an autobiographical book by Otis Williams. Kendricks was portrayed by actor Terron Brooks.\n\nKendricks was born in  on December 17, 1939, the son of Johnny and Lee Bell Kendrick. He had one sister, Patricia, and three brothers, Charles, Robert, and Clarence. His family moved to Birmingham, where he met and began singing with his best friend Paul Williams in their church choir in the late 1940s. In 1955, Kendricks, Williams, and friends Kell Osborne and Jerome Averette formed a doo-wop group called The Cavaliers, and began performing around Birmingham. The group decided to move for better opportunities in their musical careers, and in 1957 the group moved to Cleveland, Ohio. In Cleveland, they met manager Milton Jenkins, and soon moved with Jenkins to Detroit, Michigan, where the Cavaliers renamed themselves 'The Primes'. Under Jenkins' management, the Primes did well for themselves in the Detroit area, eventually creating a female spin-off group called The Primettes (later The Supremes). In 1961, Osbourne moved to California, and the Primes disbanded. Kendricks and Paul Williams joined forces with members Otis Williams and Melvin \"Blue\" Franklin of Otis Wiliiams and the Distants after three members quit and became The Elgins, who on the same day changed their name to \"The Temptations\" and signed to Motown.\n\nThe Temptations began singing background for Mary Wells. After an initial dry period, The Temptations quickly became the most successful male vocal group of the 1960s. Although technically Kendricks was first tenor in the group's harmony, he predominately sang in a falsetto voice. Among the Temptations songs Kendricks sang lead on were \"Dream Come True\" (1962), the group's first charting single; \"The Way You Do the Things You Do\" (1964), the group's first US Top 20 hit; \"I'll Be in Trouble\" (1964); \"The Girl's Alright With Me\" (1964), a popular b-side that Kendricks co-wrote; \"Girl (Why You Wanna Make Me Blue)\" (1964); \"Get Ready\" (1966); \"Please Return Your Love to Me\" (1968); and \"Just My Imagination\" (1971). He was also allowed to sing a few leads in his natural voice such as \"May I Have This Dance\" (1962). He shares lead vocal duty on other records, including \"You're My Everything\" (1967) (shared with David Ruffin), and a long string of Norman Whitfield produced psychedelic soul records where all five Temptations sang lead, such as the Grammy winner \"Cloud Nine\" (1968), \"I Can't Get Next to You\" (1969), and \"Ball of Confusion\" (1970). He also leads on \"I'm Gonna Make You Love Me\" (1968), a popular duet with Diana Ross and the Supremes, and on the Temptations' famous version of the Christmas classic \"Rudolph the Red-Nosed Reindeer\" (1968).\n\nIn the Temptations, Kendricks was responsible for creating most of the group's vocal arrangements, and also served as wardrobe manager, including the now famous purple suits the group wore for one performance. He also co-wrote several Temptations songs apart from \"The Girl's Alright With Me\" including \"Isn't She Pretty\" (1961) and \"Don't Send Me Away\" (1967). His favorite food was cornbread, and as a result he was nicknamed \"Cornbread\" (or \"Corn\" for short) by his groupmates. According to Otis Williams, Kendricks romantically pursued Diana Ross, lead singer of the Supremes, and he was said to have been close friends with Martha Reeves of the Vandellas. In her second book, Supreme Faith, Supremes singer Mary Wilson writes that she and Kendricks were lovers \"briefly,\" but remained close friends.\nKendricks remained in the group through the rest of the decade, but a number of issues began to push him away from it in the late 1960s and early 1970s. He was uncomfortable with singing the psychedelic style that Whitfield was now crafting for the group as opposed to the romantic ballads they had sung under the direction of Smokey Robinson; his friend Paul Williams was often too ill to perform with the group; and Kendricks often found himself at odds with bandmates Otis Williams and Melvin Franklin. As he grew away from the group, Kendricks began to rekindle his friendship with ex-Temptation David Ruffin, who convinced him to leave the group.\nIn a 1991 interview with a Chicago television series called Urban Street, Kendricks said he had actually considered leaving the group as early as 1965, even though that was when the band was finally starting to take off, because of things that \"weren't quite proper.\" He explained that they were working with people that \"didn't have their best interests at heart.\" Kendricks, however, initially decided to stay in the group because he was worried he would not get the support he needed if he left the group. Kendricks also expressed the fact that his relationship with Berry Gordy was less than cordial. \"Berry Gordy is a man I don't know, I only met him about three times,\" he said, but \"I know he didn't particularly care for me.\" Kendricks stated that he did not agree with many decisions that were made.\nFollowing one final altercation with Williams and Franklin during a run at the Copacabana nightclub in November 1970, Kendricks walked off after the first night and didn't return, and it was mutually decided he would leave the group. While working on his first solo album, Kendricks recorded one last hit single with the Temptations, 1971's \"Just My Imagination (Running Away with Me)\". By the time the record reached #1 on the US pop charts in April 1971, Kendricks had signed a solo deal with Motown's Tamla imprint and was preparing the release of his first solo album, All By Myself. However, many of his problems with Motown would reoccur.\n\n <a href=\"https://www.last.fm/music/Eddie+Kendricks\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Eddie Kendricks (Edward James Kendrick, Union Springs, Alabama, December 17, 1939 – Birmingham, Alabama, October 5, 1992), was an American singer and songwriter, noted for his distinctive falsetto singing style. Kendricks co-founded the Motown singing group The Temptations, and was one of their lead singers from 1960 until 1971. His was the lead voice on such famous songs as \"The Way You Do The Things You Do\", \"Get Ready\", and \"Just My Imagination\". <a href=\"https://www.last.fm/music/Eddie+Kendricks\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 267178,
      "mbid": "cf3ea6e9-c856-4737-a988-6b64cc9f2bf2",
      "name": "Eddie Kendricks",
      "playcount": 1419840,
      "similar_artists": [
        {
          "name": "The O'Jays",
          "url": "https://www.last.fm/music/The+O%27Jays"
        },
        {
          "name": "David Ruffin",
          "url": "https://www.last.fm/music/David+Ruffin"
        },
        {
          "name": "The Dramatics",
          "url": "https://www.last.fm/music/The+Dramatics"
        },
        {
          "name": "Gladys Knight & The Pips",
          "url": "https://www.last.fm/music/Gladys+Knight+&+The+Pips"
        },
        {
          "name": "The Temptations",
          "url": "https://www.last.fm/music/The+Temptations"
        }
      ],
      "tags": [
        "soul",
        "motown",
        "funk",
        "Disco",
        "rnb"
      ],
      "url": "https://www.last.fm/music/Eddie+Kendricks"
    },
    "spotify": {
      "followers": 322097,
      "genres": [
        "motown",
        "classic soul",
        "philly soul",
        "soul"
      ],
      "id": "2Uuon75BhnuuxdKLYn4wHn",
      "images": [
        {
          "height": 1280,
          "url": "https://i.scdn.co/image/664f1a004773bd74a4ff5104818e4f383ef95a5e",
          "width": 676
        },
        {
          "height": 1212,
          "url": "https://i.scdn.co/image/d5eff2f40af987b8794a43b6df78a47f41e4dc8f",
          "width": 640
        },
        {
          "height": 379,
          "url": "https://i.scdn.co/image/04eacbd2e9a333aff1deb625512fef76cd60c754",
          "width": 200
        },
        {
          "height": 121,
          "url": "https://i.scdn.co/image/745fd75c3bb492e40f93835e233f3e80d4ab513a",
          "width": 64
        }
      ],
      "name": "Eddie Kendricks",
      "popularity": 41,
      "url": "https://open.spotify.com/artist/2Uuon75BhnuuxdKLYn4wHn"
    }
  },
  "spotify_id": "2Uuon75BhnuuxdKLYn4wHn",
  "spotify_url": "https://open.spotify.com/artist/2Uuon75BhnuuxdKLYn4wHn",
  "updated_at": "2025-07-08T09:57:37.083816",
  "wikipedia_url": null
}