{
  "apple_music_id": "724648",
  "apple_music_url": "https://music.apple.com/gb/artist/orbital/724648",
  "biography": "Orbital are an electronic music duo consisting of brothers Phil Hartnoll and Paul Hartnoll formed in Sevenoaks, Kent, England in 1989.  Orbital take their name from Greater London's orbital motorway, the M25, which was central to the early rave scene and party network in the South East during the early days of acid house. One of the biggest names in British electronica during the 1990s, Orbital were both critically and commercially successful, being particularly known for an element of live improvisation during their shows, a rarity with techno acts. They were initially influenced by early electro and punk rock.\n\nIn 1989, Orbital recorded a track called \"Chime\" on their father's cassette deck. It was released on Oh Zone Records in December 1989, and re-released on FFRR a few months later. The track became a rave anthem, reaching number 17 in the UK charts, and earning them an appearance on Top of the Pops, during which they wore anti-Poll Tax t-shirts. A few singles and EPs followed, and their first self-titled album, a collection of tracks recorded at various times, was released in late 1991.\n\nIn late 1992, the \"Radiccio\" EP barely reached the UK top 40, but it included probably their most well-known song, \"Halcyon\". The song featured a backwards sample of Kirsty Hawkshaw from Opus III's \"It's a Fine Day\", and B-side \"The Naked and the Dead\" was similarly based on a line from Scott Walker's rendition of Jacques Brel's song \"Next\". Halcyon was dedicated to the Hartnolls' mother, who was addicted to the tranquiliser Halcion for many years.\n\nThe duo's popularity grew rapidly with the release of their second album, titled \"Orbital 2\" in 1993. The album featured complex arrangements and textures, and opens with the two minute track \"Time Becomes\", which comprises nothing more than 2 slightly detuned, looped samples of a Michael Dorn line from Star Trek: The Next Generation, \"...where time becomes a loop\" being played simultaneously through the left and right channels, respectively (until 1 cycle of phase difference has happened). This very same sample was used at the beginning of \"The Mobius\", the opening track in the previous album. This audible pun was intended to make listeners believe that they had bought a mis-pressed album (Orbital 1 packaged in Orbital 2). The album reached #28 on the UK album charts, staying in the top chart for fifteen weeks. Halcyon was remixed for the album, as \"Halcyon + On + On\". The version played live has also gained notoriety amongst fans for containing a complete mashup of diverse samples including \"You give love a bad name\" by the band \"Bon Jovi\", \"Heaven is a place on Earth\" by Belinda Carlisle, and most recently \"I believe in a thing called love\" by the band \"The Darkness\". The first two albums are commonly known as the \"Green Album\" and the \"Brown Album\", after the colour of their covers.\n\nOrbital won a NME award for \"Vibes Best Dance Act\" early in 1994, but it was their headline appearance at the Glastonbury Festival on 25 June 1994 that brought them most attention. Q magazine classed it as one of the top 50 gigs of all time, and in 2002 included Orbital in their list of \"50 Bands to See Before You Die\". Orbital gave an improvisational element to live electronic music as the brothers mixed and sequenced their tracks on the fly, wearing their trademark head-mounted torches behind banks of equipment. Orbital were one of the few electronic acts invited to play at Woodstock '94.\n\nThe third album \"Snivilisation\" was released in August 1994. Alison Goldfrapp provided vocals on a couple of the tracks, including the single \"Are We Here?\". This track also included a sample from \"Man at C&A\" by \"The Specials\". Among the remixes of Are We Here? was \"Criminal Justice Bill?\" - four minutes of silence, a reference to the Criminal Justice and Public Order Act 1994, which was in part intended to clamp down on the rave scene which had given birth to Orbital. The other track with Goldfrapp vocals, \"Sad But True\", was remixed for the \"Times Fly\" EP, the band's only release in 1995.\n\nThe single \"The Box\" was released in April 1996, reaching #11 in the UK, and its parent album \"In Sides\", released in May 1996, became their second top five album. It revealed a less obviously dance-oriented sound than previously, and had more in common with soundtrack music. In Sides has since come to be considered one of their most critically well-regarded works. As with the previous album, there was a vague theme of ecological disaster and dissatisfaction with society. The following year, the duo contributed to film soundtracks (The Saint & Event Horizon) and enjoyed the biggest singles of their career, with a live version of Satan and their reworking of the aforementioned \"The Saint\" theme both reaching #3 in the UK.\n\n1998 saw a return to the studio to work on their fifth album \"The Middle of Nowhere\". This was released in 1999, becoming their third top five album, and was a return to a more upbeat style, with Alison Goldfrapp returning on vocals, and included the single \"Style\" featuring the stylophone. In 2000 the single Beached was released from the soundtrack to the film \"The Beach\", mixing the brothers' musical style with a melody by Angelo Badalamenti and the words of Leonardo DiCaprio from the film.\n\n2001's \"The Altogether\" featured guest vocals by the Hartnolls' brother-in-law David Gray, a sampled Ian Dury, and a version of the \"Doctor Who\" theme, entitled \"Doctor ?\". It was to be their last album for FFRR, and had a mixed critical reception. The following year, \"Work 1989-2002\" collected various singles from Chime onwards.\n\nOrbital split up in 2004. They played a final series of gigs from June through July 2004 at the \"Glastonbury Festival\", the \"T in the Park\" Festival in Scotland, the \"Oxegen\" festival (formerly known as \"Witness\") in Ireland, and the \"Wire Festival\" in Japan, concluding with a live \"Peel Session\" gig at Maida Vale Studios in London on 28 July 2004. The release of their seventh and last original album, the \"Blue Album\" (which, unlike the untitled previous green and brown albums, was actually named the \"Blue Album\"), coincided with this final wave of shows. The album featured \"Sparks\" (on \"Acid Pants\") and Lisa Gerrard (on the final single \"One Perfect Sunrise\").\n\nPaul Hartnoll continued to record music under his own name, including tracks for the new \"Wipeout Pure\" game for the PSP. He released his first full length solo album, entitled \"The Ideal Condition\" on the ACP record label in June 2007. Phil Hartnoll formed a new electronica duo, \"Long Range\", with Nick Smith. Their debut album, \"Madness and Me\", was released on their own label, Long Range Recordings, on August 6.\n\nIn 2008 as \"Long Range\", they signed to commercial management company Angel Artists who additionally represent the likes of Dave Ball (of \"Soft Cell\"), \"The Grid\", Paul Dakeyne & \"Icehouse Project\". He lives in Brighton with his three sons, Louis, Milo and Conrad.\n\nOrbital released a 2 CD/DVD compilation \"Orbital: Live at Glastonbury 1994-2004\" on 11 June 2007. The collection contains over 2 hours of music recorded from the group's performances at the festival over the course of a decade of appearances there.\n\nOn 21 November 2008, Orbital announced they would be reforming to play a gig together called \"20 years after Chime\" at The Big Chill Festival 2009. They preceded this show with a headline performance at RockNess 2009 in June.\n\nOn 26 January 2009, their official website Loopz announced confirmed dates for their 20th anniversary tour. \"The Orbital reformation gathers momentum with headline shows now confirmed for Manchester and London this September.\" The concerts met with positive reviews.  The band's first performance after the breakup took place in June 2009 at Selector Festival in Cracow, Poland.\n\nOn 16 June 2009, Orbital released a 2-CD collection of their favourite tracks. The collection, Orbital 20 (stylised as \"20rbital\"), covered the 20 years since \"Chime\" and contained 20 tracks. A single, \"Don't Stop Me\" / \"The Gun is Good\" was issued in 2010 on 12\" and digital download. At the Glastonbury Festival on 27 June 2010 to close their set, Matt Smith, who played the Eleventh Doctor, came on stage and performed with Orbital their cover of the Doctor Who theme tune.\n\nOn 16 February 2011, Orbital posted a video diary on YouTube, via Loopz. The video diary reported their progress on the recording of their new album, along with remixes of existing material for their DJ sets. Subsequent diary updates have been published. In October 2011, Orbital announced a six gig UK tour (including a date at the Royal Albert Hall) and new album in April 2012. \"Never\", a track from the forthcoming album, was offered as a free download. The album titled Wonky was released on 2 April 2012, and included collaborations with singer Zola Jesus and MC Lady Leshurr. The albums release was featured on US radio on PrototypeRadio, which also marked the bands debut radio appearance on American radio.\n\nOrbital appeared at the opening ceremony for the London 2012 Paralympic Games, performing \"Where Is It Going?\" live with Stephen Hawking delivering a speech about the Large Hadron Collider.\n\nOn 8 October 2012, Orbital released their soundtrack to the 2012 re-make of Pusher, including vocals from Toni Halliday.\n\nOn 21 October 2014, Orbital announced on their official website that they were \"hanging up their iconic torch-glasses and parting ways for the final time\" but would continue to work on projects separately. Phil Hartnoll focused on a DJ career, including a performance at Fuji Rock Festival, while Paul Hartnoll worked on a variety of music projects, including a solo album under the name 8:58 in 2015, a collaboration with Vince Clarke of Erasure called 2Square, and soundtrack work for Peaky Blinders and American Ultra.\n\nIn February 2017, Orbital reunited and announced tour dates in June and July, at Forbidden Fruit in Dublin, Bluedot Festival at Jodrell Bank and Standon Calling in Hertfordshire, and announced that they were working on a new album,releasing \"Kinetic 2017\", an updated remix of an early single, alongside the announcement. At the Bluedot Festival in July, the BBC Radiophonic Workshop joined Orbital on stage to perform \"Doctor?\" live, and in August 2017 the band released non-album single \"Copenhagen\" after working on the song during their summer live sets.\n\nIn December 2017, Orbital played two sell out shows over two nights at the Manchester O2 Apollo and the London Eventim Apollo. The sets included two previously unheard songs, \"Phuk\" (stylised \"P.H.U.K.\") and \"Tiny Foldable Cities\". These two shows were released on CD through Pledge Music. A third previously unheard song, \"The End is Nigh\", was debuted May 2018 at the Biggest Weekend festival in Belfast.\n\nA new album, entitled Monsters Exist, was released on 14 September 2018. It was the first Orbital album since In Sides to feature artwork by John Greenwood, and featured physicist Brian Cox on its final track.\n\nIn 2019, Orbital revealed plans for a 30th anniversary album, which would feature a compilation of updated versions of their songs created by themselves and their contemporaries. In early 2020, Orbital began performing two new songs tentatively titled \"One Day\" and \"Treadmill\" at live shows, including a live streamed \"Stay-At-Home-Rave\" hosted by United We Stream and The Haçienda, benefiting those impacted by the COVID-19 pandemic in Greater Manchester.\n\nIn 2022, the duo composed and recorded the soundtrack for the Netflix comedy series The Pentaverate created by Mike Myers. On 20 October, they announced their tenth studio album titled Optical Delusion, which was released on 17 February 2023, along with a lead single titled \"Dirty Rat\", featuring Sleaford Mods.\n\nPolitical commentary\nOrbital sometimes incorporated political and environmental commentary into their music. The track \"Forever\" on Snivilisation samples a speech by Graham Crowden from the 1982 Lindsay Anderson film Britannia Hospital, in which he lambasts humankind for its destructive ways; and the track \"You Lot\" on the Blue Album, features a confrontational, partially vocoded anti-genetic engineering sample from Christopher Eccleston, originally from the TV two-part series The Second Coming written by Russell T Davies.\n\nThey recorded \"The Girl With The Sun In Her Head\" from \"In Sides\" using Greenpeace's mobile solar power generator CYRUS. They named an early record \"Belfast\" after playing live in the city of Belfast at the height of The Troubles in 1990. Other album track titles suggest environmental concern such as \"Kein Trink Wasser\" (\"no drinking water\" in German) from Snivilisaton and \"Dŵr Budr\" (\"dirty water\" in Welsh) and \"P.E.T.R.O.L.\" from \"In Sides\".\n\nAlthough Orbital has done many live shows, Phil Hartnoll said in an interview, that he only learned to DJ in the last few years. LRR is the music label of Phil Hartnoll (Orbital) and Nick Smith and home to the band, Long Range. www.longrange.tv and www.myspace.com/longrangemusic\n\nOrbital website: https://orbitalofficial.com/ <a href=\"https://www.last.fm/music/Orbital\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T14:34:25.535029",
  "discogs_id": "1279",
  "discogs_url": "https://www.discogs.com/artist/1279-Orbital",
  "followers": 380768,
  "formed_date": null,
  "genres": [
    "Electronic",
    "idm",
    "big beat",
    "acid house",
    "breakbeat",
    "electronic",
    "techno",
    "ambient",
    "electronica"
  ],
  "id": "orbital-1751722466",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages112/v4/6c/1c/e7/6c1ce76b-98f6-e611-be96-f6fc458f6bed/cb864218-07b7-42b6-a80d-ec718a8a9cef_ami-identity-2a22923e637c42da59f8d6a4b3a54147-2024-02-16T13-45-44.683Z_cropped.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5ebd5143e239460a4d3c722ffab",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174d5143e239460a4d3c722ffab",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178d5143e239460a4d3c722ffab",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_primary",
      "url": "https://i.discogs.com/_gl4qjtosHHsYlZRexnQQiLalRe8omuVMz6TVxiuCaw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
      "width": null
    },
    {
      "height": null,
      "type": "discogs_artist_thumb",
      "url": "https://i.discogs.com/HKnaVJ9inP_r4p3RbHd_qvKR340-P04l-ynn1oUxC4Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
      "width": null
    }
  ],
  "lastfm_mbid": "f3e2a7d9-c6bb-4848-95e5-04c0a1e2f511",
  "lastfm_url": "https://www.last.fm/music/Orbital",
  "local_images": {
    "hi-res": "../public/artist/orbital/orbital-hi-res.jpg",
    "medium": "../public/artist/orbital/orbital-medium.jpg",
    "small": "../public/artist/orbital/orbital-small.jpg"
  },
  "name": "Orbital",
  "popularity": 54,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages112/v4/6c/1c/e7/6c1ce76b-98f6-e611-be96-f6fc458f6bed/cb864218-07b7-42b6-a80d-ec718a8a9cef_ami-identity-2a22923e637c42da59f8d6a4b3a54147-2024-02-16T13-45-44.683Z_cropped.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Electronic"
      ],
      "id": "724648",
      "name": "Orbital",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/orbital/724648"
    },
    "discogs": {
      "cover_image": "https://i.discogs.com/_gl4qjtosHHsYlZRexnQQiLalRe8omuVMz6TVxiuCaw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
      "fetch_timestamp": "2025-07-06T13:50:00Z",
      "fetched_externally": true,
      "id": "1279",
      "images": [
        {
          "height": 600,
          "resource_url": "https://i.discogs.com/_gl4qjtosHHsYlZRexnQQiLalRe8omuVMz6TVxiuCaw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
          "type": "primary",
          "uri": "https://i.discogs.com/_gl4qjtosHHsYlZRexnQQiLalRe8omuVMz6TVxiuCaw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/HKnaVJ9inP_r4p3RbHd_qvKR340-P04l-ynn1oUxC4Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 666,
          "resource_url": "https://i.discogs.com/VXIdKhZnyDgQvq4Ky993kceSnALqqjRZ41r9dNLbo_I/rs:fit/g:sm/q:90/h:666/w:597/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTc0NTk0ODIzMy05/NTM1LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/VXIdKhZnyDgQvq4Ky993kceSnALqqjRZ41r9dNLbo_I/rs:fit/g:sm/q:90/h:666/w:597/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTc0NTk0ODIzMy05/NTM1LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/KjwENmZGmLT_XjOIABgVo2n_KoxP8Fs4492Yc4F8OmA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTc0NTk0ODIzMy05/NTM1LmpwZWc.jpeg",
          "width": 597
        },
        {
          "height": 377,
          "resource_url": "https://i.discogs.com/w3p-Llk2TeVAlkLOi4t70JK7a26H-gP78ArwOiZwZfA/rs:fit/g:sm/q:90/h:377/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY0MzgxMjU0Ny00/MzY1LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/w3p-Llk2TeVAlkLOi4t70JK7a26H-gP78ArwOiZwZfA/rs:fit/g:sm/q:90/h:377/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY0MzgxMjU0Ny00/MzY1LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/aVNPAaxwUTV_-m6ifHcN4uqMax_naPC-3vrQf_u1cJQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY0MzgxMjU0Ny00/MzY1LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 383,
          "resource_url": "https://i.discogs.com/GPA3ikAcORtUAVCWqsTZ9fuo0-AbnH-esA4Jcu_u_mU/rs:fit/g:sm/q:90/h:383/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY1NzMwNDUyMC01/ODQ1LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/GPA3ikAcORtUAVCWqsTZ9fuo0-AbnH-esA4Jcu_u_mU/rs:fit/g:sm/q:90/h:383/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY1NzMwNDUyMC01/ODQ1LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/p1uILdUXh7veL77ZwfkWmPc1mheE2Yj94DLy5OSsZj4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY1NzMwNDUyMC01/ODQ1LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 452,
          "resource_url": "https://i.discogs.com/fdy3zlPv0qPOxzxlIu3jB64jdIz7FQCCZ_Ehd4DHNGA/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTUzNDU2NzE3Mi0y/MTYwLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/fdy3zlPv0qPOxzxlIu3jB64jdIz7FQCCZ_Ehd4DHNGA/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTUzNDU2NzE3Mi0y/MTYwLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/BClmMu7XuIpvgc-PZfUbb5OxDnFiFVn6phF-HDNpTws/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTUzNDU2NzE3Mi0y/MTYwLmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 585,
          "resource_url": "https://i.discogs.com/AH82AV38dUkZgFye4VCVDztwyj23H_og2Sj0vObndUk/rs:fit/g:sm/q:90/h:585/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTcwOTMxNjIyNi05/NTAyLmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/AH82AV38dUkZgFye4VCVDztwyj23H_og2Sj0vObndUk/rs:fit/g:sm/q:90/h:585/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTcwOTMxNjIyNi05/NTAyLmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/ih61C3bFcnN4vFW8ZNdiaQjSy-1UO4qBF8ihOWrvblI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTcwOTMxNjIyNi05/NTAyLmpwZWc.jpeg",
          "width": 586
        },
        {
          "height": 580,
          "resource_url": "https://i.discogs.com/WMm1pA_Qidl7LjAVGIDb6GiZQKQVqXlHVqbj6Lp9hb4/rs:fit/g:sm/q:90/h:580/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY4MDI4NTEwMC01/OTk1LmpwZWc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/WMm1pA_Qidl7LjAVGIDb6GiZQKQVqXlHVqbj6Lp9hb4/rs:fit/g:sm/q:90/h:580/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY4MDI4NTEwMC01/OTk1LmpwZWc.jpeg",
          "uri150": "https://i.discogs.com/NYfQAIIeabxU0KJdwMqcJgCiWr2mL4Q-XgEgVEbPKc8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY4MDI4NTEwMC01/OTk1LmpwZWc.jpeg",
          "width": 600
        },
        {
          "height": 450,
          "resource_url": "https://i.discogs.com/d8m70QpEgJmPPcTEzMsYmjIMNjG49n_SVEmHt5-bd2g/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTMyODE4MTIzNy5q/cGVn.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/d8m70QpEgJmPPcTEzMsYmjIMNjG49n_SVEmHt5-bd2g/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTMyODE4MTIzNy5q/cGVn.jpeg",
          "uri150": "https://i.discogs.com/NXex_cM5is42Ph-ngApF74aYtbU4rMSvy8EwHh_BciM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTMyODE4MTIzNy5q/cGVn.jpeg",
          "width": 600
        },
        {
          "height": 420,
          "resource_url": "https://i.discogs.com/WfYOrKY2OiVmE-OQeKsxSZyhZF_FRYUHp-Ga3cq-kfc/rs:fit/g:sm/q:90/h:420/w:536/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTExMTYxNTc3Mi5q/cGc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/WfYOrKY2OiVmE-OQeKsxSZyhZF_FRYUHp-Ga3cq-kfc/rs:fit/g:sm/q:90/h:420/w:536/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTExMTYxNTc3Mi5q/cGc.jpeg",
          "uri150": "https://i.discogs.com/-ApQuuFeIfp9wXlpSa_4dCpi5cqDt3y2lW3_N_5PXBQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTExMTYxNTc3Mi5q/cGc.jpeg",
          "width": 536
        },
        {
          "height": 231,
          "resource_url": "https://i.discogs.com/2DrqCm2hacyUdYuBQi0Mo3qvrzFv0kwQkZPbvGNvZyI/rs:fit/g:sm/q:90/h:231/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTA5ODU0MTA5Ny5q/cGc.jpeg",
          "type": "secondary",
          "uri": "https://i.discogs.com/2DrqCm2hacyUdYuBQi0Mo3qvrzFv0kwQkZPbvGNvZyI/rs:fit/g:sm/q:90/h:231/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTA5ODU0MTA5Ny5q/cGc.jpeg",
          "uri150": "https://i.discogs.com/Pai1KVJkrYW0qNfCdi6f-MQlmmila6apGCUMlgzuFIQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTA5ODU0MTA5Ny5q/cGc.jpeg",
          "width": 250
        }
      ],
      "members": [
        {
          "active": true,
          "id": 63854,
          "name": "Paul Hartnoll",
          "resource_url": "https://api.discogs.com/artists/63854",
          "thumbnail_url": "https://i.discogs.com/Dlbx_qyC9wqDkRlEmC8W3ZC8g_5KkPeXE1u3rhhT4ck/rs:fit/g:sm/q:40/h:255/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYzODU0/LTExNjEyMDE3Mzcu/anBlZw.jpeg"
        },
        {
          "active": true,
          "id": 206444,
          "name": "Phil Hartnoll",
          "resource_url": "https://api.discogs.com/artists/206444",
          "thumbnail_url": "https://i.discogs.com/rTvPOWBZ0wfFFTRaPV6P0Br6tYXwVGs6OsHj_5SMyV0/rs:fit/g:sm/q:40/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjQ0/NC0xNzM5MDkxNzAy/LTY4NTMuanBlZw.jpeg"
        }
      ],
      "name": "Orbital",
      "namevariations": [
        "Orbitol",
        "Oribital"
      ],
      "profile": "Techno outfit founded in the late 80s by the brothers Paul and Phil Hartnoll.",
      "raw_data": {
        "aliases": [
          {
            "id": 46249,
            "name": "Industry Standard",
            "resource_url": "https://api.discogs.com/artists/46249",
            "thumbnail_url": ""
          },
          {
            "id": 247667,
            "name": "P&P Hartnoll",
            "resource_url": "https://api.discogs.com/artists/247667",
            "thumbnail_url": "https://i.discogs.com/-76JuyTb6WYiOiuVg9WaedeUmlLv09W074NzeHeR09o/rs:fit/g:sm/q:40/h:430/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI0NzY2/Ny0xNTE4NTE5NjAx/LTQyMjAuanBlZw.jpeg"
          }
        ],
        "data_quality": "Needs Vote",
        "id": 1279,
        "images": [
          {
            "height": 600,
            "resource_url": "https://i.discogs.com/_gl4qjtosHHsYlZRexnQQiLalRe8omuVMz6TVxiuCaw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
            "type": "primary",
            "uri": "https://i.discogs.com/_gl4qjtosHHsYlZRexnQQiLalRe8omuVMz6TVxiuCaw/rs:fit/g:sm/q:90/h:600/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/HKnaVJ9inP_r4p3RbHd_qvKR340-P04l-ynn1oUxC4Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 666,
            "resource_url": "https://i.discogs.com/VXIdKhZnyDgQvq4Ky993kceSnALqqjRZ41r9dNLbo_I/rs:fit/g:sm/q:90/h:666/w:597/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTc0NTk0ODIzMy05/NTM1LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/VXIdKhZnyDgQvq4Ky993kceSnALqqjRZ41r9dNLbo_I/rs:fit/g:sm/q:90/h:666/w:597/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTc0NTk0ODIzMy05/NTM1LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/KjwENmZGmLT_XjOIABgVo2n_KoxP8Fs4492Yc4F8OmA/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTc0NTk0ODIzMy05/NTM1LmpwZWc.jpeg",
            "width": 597
          },
          {
            "height": 377,
            "resource_url": "https://i.discogs.com/w3p-Llk2TeVAlkLOi4t70JK7a26H-gP78ArwOiZwZfA/rs:fit/g:sm/q:90/h:377/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY0MzgxMjU0Ny00/MzY1LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/w3p-Llk2TeVAlkLOi4t70JK7a26H-gP78ArwOiZwZfA/rs:fit/g:sm/q:90/h:377/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY0MzgxMjU0Ny00/MzY1LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/aVNPAaxwUTV_-m6ifHcN4uqMax_naPC-3vrQf_u1cJQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY0MzgxMjU0Ny00/MzY1LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 383,
            "resource_url": "https://i.discogs.com/GPA3ikAcORtUAVCWqsTZ9fuo0-AbnH-esA4Jcu_u_mU/rs:fit/g:sm/q:90/h:383/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY1NzMwNDUyMC01/ODQ1LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/GPA3ikAcORtUAVCWqsTZ9fuo0-AbnH-esA4Jcu_u_mU/rs:fit/g:sm/q:90/h:383/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY1NzMwNDUyMC01/ODQ1LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/p1uILdUXh7veL77ZwfkWmPc1mheE2Yj94DLy5OSsZj4/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY1NzMwNDUyMC01/ODQ1LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 452,
            "resource_url": "https://i.discogs.com/fdy3zlPv0qPOxzxlIu3jB64jdIz7FQCCZ_Ehd4DHNGA/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTUzNDU2NzE3Mi0y/MTYwLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/fdy3zlPv0qPOxzxlIu3jB64jdIz7FQCCZ_Ehd4DHNGA/rs:fit/g:sm/q:90/h:452/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTUzNDU2NzE3Mi0y/MTYwLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/BClmMu7XuIpvgc-PZfUbb5OxDnFiFVn6phF-HDNpTws/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTUzNDU2NzE3Mi0y/MTYwLmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 585,
            "resource_url": "https://i.discogs.com/AH82AV38dUkZgFye4VCVDztwyj23H_og2Sj0vObndUk/rs:fit/g:sm/q:90/h:585/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTcwOTMxNjIyNi05/NTAyLmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/AH82AV38dUkZgFye4VCVDztwyj23H_og2Sj0vObndUk/rs:fit/g:sm/q:90/h:585/w:586/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTcwOTMxNjIyNi05/NTAyLmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/ih61C3bFcnN4vFW8ZNdiaQjSy-1UO4qBF8ihOWrvblI/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTcwOTMxNjIyNi05/NTAyLmpwZWc.jpeg",
            "width": 586
          },
          {
            "height": 580,
            "resource_url": "https://i.discogs.com/WMm1pA_Qidl7LjAVGIDb6GiZQKQVqXlHVqbj6Lp9hb4/rs:fit/g:sm/q:90/h:580/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY4MDI4NTEwMC01/OTk1LmpwZWc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/WMm1pA_Qidl7LjAVGIDb6GiZQKQVqXlHVqbj6Lp9hb4/rs:fit/g:sm/q:90/h:580/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY4MDI4NTEwMC01/OTk1LmpwZWc.jpeg",
            "uri150": "https://i.discogs.com/NYfQAIIeabxU0KJdwMqcJgCiWr2mL4Q-XgEgVEbPKc8/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY4MDI4NTEwMC01/OTk1LmpwZWc.jpeg",
            "width": 600
          },
          {
            "height": 450,
            "resource_url": "https://i.discogs.com/d8m70QpEgJmPPcTEzMsYmjIMNjG49n_SVEmHt5-bd2g/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTMyODE4MTIzNy5q/cGVn.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/d8m70QpEgJmPPcTEzMsYmjIMNjG49n_SVEmHt5-bd2g/rs:fit/g:sm/q:90/h:450/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTMyODE4MTIzNy5q/cGVn.jpeg",
            "uri150": "https://i.discogs.com/NXex_cM5is42Ph-ngApF74aYtbU4rMSvy8EwHh_BciM/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTMyODE4MTIzNy5q/cGVn.jpeg",
            "width": 600
          },
          {
            "height": 420,
            "resource_url": "https://i.discogs.com/WfYOrKY2OiVmE-OQeKsxSZyhZF_FRYUHp-Ga3cq-kfc/rs:fit/g:sm/q:90/h:420/w:536/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTExMTYxNTc3Mi5q/cGc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/WfYOrKY2OiVmE-OQeKsxSZyhZF_FRYUHp-Ga3cq-kfc/rs:fit/g:sm/q:90/h:420/w:536/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTExMTYxNTc3Mi5q/cGc.jpeg",
            "uri150": "https://i.discogs.com/-ApQuuFeIfp9wXlpSa_4dCpi5cqDt3y2lW3_N_5PXBQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTExMTYxNTc3Mi5q/cGc.jpeg",
            "width": 536
          },
          {
            "height": 231,
            "resource_url": "https://i.discogs.com/2DrqCm2hacyUdYuBQi0Mo3qvrzFv0kwQkZPbvGNvZyI/rs:fit/g:sm/q:90/h:231/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTA5ODU0MTA5Ny5q/cGc.jpeg",
            "type": "secondary",
            "uri": "https://i.discogs.com/2DrqCm2hacyUdYuBQi0Mo3qvrzFv0kwQkZPbvGNvZyI/rs:fit/g:sm/q:90/h:231/w:250/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTA5ODU0MTA5Ny5q/cGc.jpeg",
            "uri150": "https://i.discogs.com/Pai1KVJkrYW0qNfCdi6f-MQlmmila6apGCUMlgzuFIQ/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTA5ODU0MTA5Ny5q/cGc.jpeg",
            "width": 250
          }
        ],
        "members": [
          {
            "active": true,
            "id": 63854,
            "name": "Paul Hartnoll",
            "resource_url": "https://api.discogs.com/artists/63854",
            "thumbnail_url": "https://i.discogs.com/Dlbx_qyC9wqDkRlEmC8W3ZC8g_5KkPeXE1u3rhhT4ck/rs:fit/g:sm/q:40/h:255/w:170/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTYzODU0/LTExNjEyMDE3Mzcu/anBlZw.jpeg"
          },
          {
            "active": true,
            "id": 206444,
            "name": "Phil Hartnoll",
            "resource_url": "https://api.discogs.com/artists/206444",
            "thumbnail_url": "https://i.discogs.com/rTvPOWBZ0wfFFTRaPV6P0Br6tYXwVGs6OsHj_5SMyV0/rs:fit/g:sm/q:40/h:399/w:600/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTIwNjQ0/NC0xNzM5MDkxNzAy/LTY4NTMuanBlZw.jpeg"
          }
        ],
        "name": "Orbital",
        "namevariations": [
          "Orbitol",
          "Oribital"
        ],
        "profile": "Techno outfit founded in the late 80s by the brothers Paul and Phil Hartnoll.",
        "releases_url": "https://api.discogs.com/artists/1279/releases",
        "resource_url": "https://api.discogs.com/artists/1279",
        "uri": "https://www.discogs.com/artist/1279-Orbital",
        "urls": [
          "https://www.orbitalofficial.com/",
          "https://orbitalofficial.bandcamp.com/music",
          "https://orbitalsoundtrack.bandcamp.com/",
          "https://equipboard.com/pros/orbital",
          "https://www.flickr.com/photos/75157598@N08",
          "https://www.loopzorbital.com/",
          "https://myspace.com/orbitalofficial",
          "https://soundcloud.com/orbital-4",
          "https://twitter.com/orbitalband",
          "https://en.wikipedia.org/wiki/Orbital_(band)",
          "https://www.youtube.com/user/orbitalofficial",
          "https://www.instagram.com/orbital/"
        ]
      },
      "resource_url": "https://api.discogs.com/artists/1279",
      "thumb": "https://i.discogs.com/HKnaVJ9inP_r4p3RbHd_qvKR340-P04l-ynn1oUxC4Y/rs:fit/g:sm/q:40/h:150/w:150/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTEyNzkt/MTY3NjA1MDQyMi01/MzIwLmpwZWc.jpeg",
      "url": "https://www.discogs.com/artist/1279-Orbital",
      "urls": [
        "https://www.orbitalofficial.com/",
        "https://orbitalofficial.bandcamp.com/music",
        "https://orbitalsoundtrack.bandcamp.com/",
        "https://equipboard.com/pros/orbital",
        "https://www.flickr.com/photos/75157598@N08",
        "https://www.loopzorbital.com/",
        "https://myspace.com/orbitalofficial",
        "https://soundcloud.com/orbital-4",
        "https://twitter.com/orbitalband",
        "https://en.wikipedia.org/wiki/Orbital_(band)",
        "https://www.youtube.com/user/orbitalofficial",
        "https://www.instagram.com/orbital/"
      ]
    },
    "lastfm": {
      "bio_content": "Orbital are an electronic music duo consisting of brothers Phil Hartnoll and Paul Hartnoll formed in Sevenoaks, Kent, England in 1989.  Orbital take their name from Greater London's orbital motorway, the M25, which was central to the early rave scene and party network in the South East during the early days of acid house. One of the biggest names in British electronica during the 1990s, Orbital were both critically and commercially successful, being particularly known for an element of live improvisation during their shows, a rarity with techno acts. They were initially influenced by early electro and punk rock.\n\nIn 1989, Orbital recorded a track called \"Chime\" on their father's cassette deck. It was released on Oh Zone Records in December 1989, and re-released on FFRR a few months later. The track became a rave anthem, reaching number 17 in the UK charts, and earning them an appearance on Top of the Pops, during which they wore anti-Poll Tax t-shirts. A few singles and EPs followed, and their first self-titled album, a collection of tracks recorded at various times, was released in late 1991.\n\nIn late 1992, the \"Radiccio\" EP barely reached the UK top 40, but it included probably their most well-known song, \"Halcyon\". The song featured a backwards sample of Kirsty Hawkshaw from Opus III's \"It's a Fine Day\", and B-side \"The Naked and the Dead\" was similarly based on a line from Scott Walker's rendition of Jacques Brel's song \"Next\". Halcyon was dedicated to the Hartnolls' mother, who was addicted to the tranquiliser Halcion for many years.\n\nThe duo's popularity grew rapidly with the release of their second album, titled \"Orbital 2\" in 1993. The album featured complex arrangements and textures, and opens with the two minute track \"Time Becomes\", which comprises nothing more than 2 slightly detuned, looped samples of a Michael Dorn line from Star Trek: The Next Generation, \"...where time becomes a loop\" being played simultaneously through the left and right channels, respectively (until 1 cycle of phase difference has happened). This very same sample was used at the beginning of \"The Mobius\", the opening track in the previous album. This audible pun was intended to make listeners believe that they had bought a mis-pressed album (Orbital 1 packaged in Orbital 2). The album reached #28 on the UK album charts, staying in the top chart for fifteen weeks. Halcyon was remixed for the album, as \"Halcyon + On + On\". The version played live has also gained notoriety amongst fans for containing a complete mashup of diverse samples including \"You give love a bad name\" by the band \"Bon Jovi\", \"Heaven is a place on Earth\" by Belinda Carlisle, and most recently \"I believe in a thing called love\" by the band \"The Darkness\". The first two albums are commonly known as the \"Green Album\" and the \"Brown Album\", after the colour of their covers.\n\nOrbital won a NME award for \"Vibes Best Dance Act\" early in 1994, but it was their headline appearance at the Glastonbury Festival on 25 June 1994 that brought them most attention. Q magazine classed it as one of the top 50 gigs of all time, and in 2002 included Orbital in their list of \"50 Bands to See Before You Die\". Orbital gave an improvisational element to live electronic music as the brothers mixed and sequenced their tracks on the fly, wearing their trademark head-mounted torches behind banks of equipment. Orbital were one of the few electronic acts invited to play at Woodstock '94.\n\nThe third album \"Snivilisation\" was released in August 1994. Alison Goldfrapp provided vocals on a couple of the tracks, including the single \"Are We Here?\". This track also included a sample from \"Man at C&A\" by \"The Specials\". Among the remixes of Are We Here? was \"Criminal Justice Bill?\" - four minutes of silence, a reference to the Criminal Justice and Public Order Act 1994, which was in part intended to clamp down on the rave scene which had given birth to Orbital. The other track with Goldfrapp vocals, \"Sad But True\", was remixed for the \"Times Fly\" EP, the band's only release in 1995.\n\nThe single \"The Box\" was released in April 1996, reaching #11 in the UK, and its parent album \"In Sides\", released in May 1996, became their second top five album. It revealed a less obviously dance-oriented sound than previously, and had more in common with soundtrack music. In Sides has since come to be considered one of their most critically well-regarded works. As with the previous album, there was a vague theme of ecological disaster and dissatisfaction with society. The following year, the duo contributed to film soundtracks (The Saint & Event Horizon) and enjoyed the biggest singles of their career, with a live version of Satan and their reworking of the aforementioned \"The Saint\" theme both reaching #3 in the UK.\n\n1998 saw a return to the studio to work on their fifth album \"The Middle of Nowhere\". This was released in 1999, becoming their third top five album, and was a return to a more upbeat style, with Alison Goldfrapp returning on vocals, and included the single \"Style\" featuring the stylophone. In 2000 the single Beached was released from the soundtrack to the film \"The Beach\", mixing the brothers' musical style with a melody by Angelo Badalamenti and the words of Leonardo DiCaprio from the film.\n\n2001's \"The Altogether\" featured guest vocals by the Hartnolls' brother-in-law David Gray, a sampled Ian Dury, and a version of the \"Doctor Who\" theme, entitled \"Doctor ?\". It was to be their last album for FFRR, and had a mixed critical reception. The following year, \"Work 1989-2002\" collected various singles from Chime onwards.\n\nOrbital split up in 2004. They played a final series of gigs from June through July 2004 at the \"Glastonbury Festival\", the \"T in the Park\" Festival in Scotland, the \"Oxegen\" festival (formerly known as \"Witness\") in Ireland, and the \"Wire Festival\" in Japan, concluding with a live \"Peel Session\" gig at Maida Vale Studios in London on 28 July 2004. The release of their seventh and last original album, the \"Blue Album\" (which, unlike the untitled previous green and brown albums, was actually named the \"Blue Album\"), coincided with this final wave of shows. The album featured \"Sparks\" (on \"Acid Pants\") and Lisa Gerrard (on the final single \"One Perfect Sunrise\").\n\nPaul Hartnoll continued to record music under his own name, including tracks for the new \"Wipeout Pure\" game for the PSP. He released his first full length solo album, entitled \"The Ideal Condition\" on the ACP record label in June 2007. Phil Hartnoll formed a new electronica duo, \"Long Range\", with Nick Smith. Their debut album, \"Madness and Me\", was released on their own label, Long Range Recordings, on August 6.\n\nIn 2008 as \"Long Range\", they signed to commercial management company Angel Artists who additionally represent the likes of Dave Ball (of \"Soft Cell\"), \"The Grid\", Paul Dakeyne & \"Icehouse Project\". He lives in Brighton with his three sons, Louis, Milo and Conrad.\n\nOrbital released a 2 CD/DVD compilation \"Orbital: Live at Glastonbury 1994-2004\" on 11 June 2007. The collection contains over 2 hours of music recorded from the group's performances at the festival over the course of a decade of appearances there.\n\nOn 21 November 2008, Orbital announced they would be reforming to play a gig together called \"20 years after Chime\" at The Big Chill Festival 2009. They preceded this show with a headline performance at RockNess 2009 in June.\n\nOn 26 January 2009, their official website Loopz announced confirmed dates for their 20th anniversary tour. \"The Orbital reformation gathers momentum with headline shows now confirmed for Manchester and London this September.\" The concerts met with positive reviews.  The band's first performance after the breakup took place in June 2009 at Selector Festival in Cracow, Poland.\n\nOn 16 June 2009, Orbital released a 2-CD collection of their favourite tracks. The collection, Orbital 20 (stylised as \"20rbital\"), covered the 20 years since \"Chime\" and contained 20 tracks. A single, \"Don't Stop Me\" / \"The Gun is Good\" was issued in 2010 on 12\" and digital download. At the Glastonbury Festival on 27 June 2010 to close their set, Matt Smith, who played the Eleventh Doctor, came on stage and performed with Orbital their cover of the Doctor Who theme tune.\n\nOn 16 February 2011, Orbital posted a video diary on YouTube, via Loopz. The video diary reported their progress on the recording of their new album, along with remixes of existing material for their DJ sets. Subsequent diary updates have been published. In October 2011, Orbital announced a six gig UK tour (including a date at the Royal Albert Hall) and new album in April 2012. \"Never\", a track from the forthcoming album, was offered as a free download. The album titled Wonky was released on 2 April 2012, and included collaborations with singer Zola Jesus and MC Lady Leshurr. The albums release was featured on US radio on PrototypeRadio, which also marked the bands debut radio appearance on American radio.\n\nOrbital appeared at the opening ceremony for the London 2012 Paralympic Games, performing \"Where Is It Going?\" live with Stephen Hawking delivering a speech about the Large Hadron Collider.\n\nOn 8 October 2012, Orbital released their soundtrack to the 2012 re-make of Pusher, including vocals from Toni Halliday.\n\nOn 21 October 2014, Orbital announced on their official website that they were \"hanging up their iconic torch-glasses and parting ways for the final time\" but would continue to work on projects separately. Phil Hartnoll focused on a DJ career, including a performance at Fuji Rock Festival, while Paul Hartnoll worked on a variety of music projects, including a solo album under the name 8:58 in 2015, a collaboration with Vince Clarke of Erasure called 2Square, and soundtrack work for Peaky Blinders and American Ultra.\n\nIn February 2017, Orbital reunited and announced tour dates in June and July, at Forbidden Fruit in Dublin, Bluedot Festival at Jodrell Bank and Standon Calling in Hertfordshire, and announced that they were working on a new album,releasing \"Kinetic 2017\", an updated remix of an early single, alongside the announcement. At the Bluedot Festival in July, the BBC Radiophonic Workshop joined Orbital on stage to perform \"Doctor?\" live, and in August 2017 the band released non-album single \"Copenhagen\" after working on the song during their summer live sets.\n\nIn December 2017, Orbital played two sell out shows over two nights at the Manchester O2 Apollo and the London Eventim Apollo. The sets included two previously unheard songs, \"Phuk\" (stylised \"P.H.U.K.\") and \"Tiny Foldable Cities\". These two shows were released on CD through Pledge Music. A third previously unheard song, \"The End is Nigh\", was debuted May 2018 at the Biggest Weekend festival in Belfast.\n\nA new album, entitled Monsters Exist, was released on 14 September 2018. It was the first Orbital album since In Sides to feature artwork by John Greenwood, and featured physicist Brian Cox on its final track.\n\nIn 2019, Orbital revealed plans for a 30th anniversary album, which would feature a compilation of updated versions of their songs created by themselves and their contemporaries. In early 2020, Orbital began performing two new songs tentatively titled \"One Day\" and \"Treadmill\" at live shows, including a live streamed \"Stay-At-Home-Rave\" hosted by United We Stream and The Haçienda, benefiting those impacted by the COVID-19 pandemic in Greater Manchester.\n\nIn 2022, the duo composed and recorded the soundtrack for the Netflix comedy series The Pentaverate created by Mike Myers. On 20 October, they announced their tenth studio album titled Optical Delusion, which was released on 17 February 2023, along with a lead single titled \"Dirty Rat\", featuring Sleaford Mods.\n\nPolitical commentary\nOrbital sometimes incorporated political and environmental commentary into their music. The track \"Forever\" on Snivilisation samples a speech by Graham Crowden from the 1982 Lindsay Anderson film Britannia Hospital, in which he lambasts humankind for its destructive ways; and the track \"You Lot\" on the Blue Album, features a confrontational, partially vocoded anti-genetic engineering sample from Christopher Eccleston, originally from the TV two-part series The Second Coming written by Russell T Davies.\n\nThey recorded \"The Girl With The Sun In Her Head\" from \"In Sides\" using Greenpeace's mobile solar power generator CYRUS. They named an early record \"Belfast\" after playing live in the city of Belfast at the height of The Troubles in 1990. Other album track titles suggest environmental concern such as \"Kein Trink Wasser\" (\"no drinking water\" in German) from Snivilisaton and \"Dŵr Budr\" (\"dirty water\" in Welsh) and \"P.E.T.R.O.L.\" from \"In Sides\".\n\nAlthough Orbital has done many live shows, Phil Hartnoll said in an interview, that he only learned to DJ in the last few years. LRR is the music label of Phil Hartnoll (Orbital) and Nick Smith and home to the band, Long Range. www.longrange.tv and www.myspace.com/longrangemusic\n\nOrbital website: https://orbitalofficial.com/ <a href=\"https://www.last.fm/music/Orbital\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Orbital are an electronic music duo consisting of brothers Phil Hartnoll and Paul Hartnoll formed in Sevenoaks, Kent, England in 1989.  Orbital take their name from Greater London's orbital motorway, the M25, which was central to the early rave scene and party network in the South East during the early days of acid house. One of the biggest names in British electronica during the 1990s, Orbital were both critically and commercially successful, being particularly known for an element of live improvisation during their shows <a href=\"https://www.last.fm/music/Orbital\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 1024258,
      "mbid": "f3e2a7d9-c6bb-4848-95e5-04c0a1e2f511",
      "name": "Orbital",
      "playcount": 19719760,
      "similar_artists": [
        {
          "name": "The Orb",
          "url": "https://www.last.fm/music/The+Orb"
        },
        {
          "name": "Underworld",
          "url": "https://www.last.fm/music/Underworld"
        },
        {
          "name": "Leftfield",
          "url": "https://www.last.fm/music/Leftfield"
        },
        {
          "name": "The Future Sound of London",
          "url": "https://www.last.fm/music/The+Future+Sound+of+London"
        },
        {
          "name": "Paul Hartnoll",
          "url": "https://www.last.fm/music/Paul+Hartnoll"
        }
      ],
      "tags": [
        "electronic",
        "techno",
        "ambient",
        "electronica",
        "idm"
      ],
      "url": "https://www.last.fm/music/Orbital"
    },
    "spotify": {
      "followers": 380768,
      "genres": [
        "idm",
        "big beat",
        "acid house",
        "breakbeat"
      ],
      "id": "3csPCeXsj2wezyvkRFzvmV",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5ebd5143e239460a4d3c722ffab",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174d5143e239460a4d3c722ffab",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178d5143e239460a4d3c722ffab",
          "width": 160
        }
      ],
      "name": "Orbital",
      "popularity": 54,
      "url": "https://open.spotify.com/artist/3csPCeXsj2wezyvkRFzvmV"
    }
  },
  "spotify_id": "3csPCeXsj2wezyvkRFzvmV",
  "spotify_url": "https://open.spotify.com/artist/3csPCeXsj2wezyvkRFzvmV",
  "updated_at": "2025-07-08T09:22:28.558849",
  "wikipedia_url": null
}