{
  "apple_music_id": "600730426",
  "apple_music_url": "https://music.apple.com/gb/artist/ghost/600730426",
  "biography": "There are several artists sharing the moniker Ghost;\n\n1) Ghost, also formerly known as Ghost B.C. in the United States, is a Swedish metal band that was formed in Linköping in 2006. In 2010, they released a three-track demo followed by a 7-inch vinyl titled \"Elizabeth\", and later their debut full-length album Opus Eponymous. The song \"Ritual\" was chosen by Kerrang! as one of \"The 50 Most Evil Songs Ever.\" The Grammis-nominated album was widely praised and significantly increased their popularity. Their second album and major label debut, Infestissumam, was released in 2013, debuted at number one in Sweden, and won the Grammis Award for Best Hard Rock/Metal Album. The band released their third studio album, Meliora, in 2015 to much critical acclaim and high record sales, reaching number one in their home country of Sweden, and number eight in the United States. Its lead single, \"Cirice\", earned them the 2016 Grammy Award for Best Metal Performance. The band released their fourth studio album, Prequelle, in 2018. Their fifth studio album, Impera, followed in 2022. In 2024, they debuted a concert film titled Rite Here Rite Now, which was shown in theaters for a limited time. An accompanying live album under the same name was released alongside the film. In 2025, they released their sixth album, Skeletá, which peaked at #1 on the Billboard Hot 200. \n\nGhost is an easily recognizable band, owing greatly to their highly theatrical stage presence. Their aesthetic leans heavily on inverted, \"satanic\" depictions of Catholic imagery. The band's instrumentalists and backup singers, called 'Nameless Ghouls', wear virtually identical, face-concealing costumes. Onstage, lead singer and songwriter Tobias Forge portrays a character-- or, rather, lineage of characters-- named Papa Emeritus. Prior to a 2017 lawsuit filed by ex-band members which revealed his identity, Forge remained fully anonymous and only ever appeared as Papa to the public. The character, which consists of Forge in a prosthetic mask and makeup, is described as a \"demonic anti-pope\". There have been six Papa Emerituses throughout Ghost's existence-- I, II, III, Nihil, IV, and V, each with distinct designs and, to some extent, personalities. In-universe, they are treated as separate people. The band's Youtube channel publishes an ongoing web series involving some of the characters, which takes place through short, sketch comedy-esque videos. The storyline has become increasingly complex over the years, and was significantly elaborated on during the Rite Here Rite Now concert film. \n\nFor the release of the 2018 album Prequelle and subsequent world , Forge introduced a new frontman named Cardinal Copia, who wore minimal face paint and a cassock or tightly tailored suit, in place of the usual papal robes worn by previous Papas. Copia's introduction marked an increase in the complexity and depth of the band's storytelling; the Youtube web series began during this era. In  March 2020, at the final show of A Pale Tour Named Death, Cardinal Copia ascended to the papacy, becoming Papa Emeritus IV. He remained as frontman for the entirety of the Impera album cycle. Papa V Perpetua, the current incarnation of the frontman, is notable for being the first character for which Forge does not wear a full prosthetic mask; he instead wears a half-face metallic skeleton mask with face paint underneath. Within the Ghost storyline, Papa V is said to be Copia's twin.\n\nGhost's music has been categorized in many genres. Critics have classified them as hard rock, heavy metal, doom metal, pop rock, progressive rock, psychedelic rock, occult rock, and arena rock. Adrien Begrand of PopMatters stated that Ghost recalls \"the early sounds of Black Sabbath, Pentagram, and Judas Priest, as well as the progressive and psychedelic rock of the late '60s.\" Early in Ghost's career, a Nameless Ghoul (speaking to Noisey.com) described Ghost as a black metal band in the traditional sense, but said that they probably do not fit into the norms of the current black metal scene. This Nameless Ghoul described Ghost's music as a mix between pop music and death metal.\n\nIn an interview, a Nameless Ghoul said they are influenced by \"everything ranging from classic rock to the extreme underground metal bands of the '80s to film scores to the grandeur of emotional harmonic music.\" A member of the band said the Swedish and Scandinavian black metal movement of the early '90s plays a major role in their act, and said that each member has come from a metal background. However, the band has stated several times that they do not aim to be a metal band. For their second album, Ghost chose a more diverse songwriting style; a member said, \"we tried to deliberately have every song have its own signature.\"\n\nTobias Forge is the sole songwriter and creative force for the band, although he often collaborates with an external songwriting duo. Pre-2017, Martin Persner, then a member of the band, occasionally contributed to songs. In 2017, Forge claimed that he was the main author of every song except \"Year Zero\" and \"Zenith\", which were Persner's ideas. When asked how he keeps Ghost's sound intact despite large lineup changes, Forge said he has to teach them to play like he does; explaining that while he is a good guitar player, he is only an \"okay\" drummer, bassist and keyboardist. So it is a matter of getting them to \"underperform together.\"\n\n2) Ghost is an experimental rock group formed in Tokyo, Japan, in 1984.\n\nCore-member Masaki Batoh grew up in Kyoto, Japan where he attended a private school. During this time, he became interested in American and British rock music ranging from Bob Dylan and Pink Floyd to the Velvet Underground and Japanese rock bands such as the Taj Mahal Travellers and the Flower Travellin' Band.\n\nLater, Batoh formed Ghost with a large and often varying lineup. According to reports posted on Allmusic, the group lived a nomadic existence, drifting from ruins of ancient temples to disused subway stations around the Tokyo area.\n\nThe band began releasing their work with the albums Ghost and Second Time Around, which were released, respectively, in 1991 and 1992. The American independent label Drag City licensed each of the albums for distribution, and the Los Angeles The Now Sound label picked up two of Batoh's solo albums, released together as well under the title Collected Works. Two albums, Tune In, Turn On, Free Tibet and Snuffbox Immanence, were released simultaneously in 1999.\n\nAs well as their own work, Ghost have recorded and performed with the ex-Galaxie 500 duo Damon and Naomi. Five years after releasing both Snuffbox Immanence and Tune In, Turn On, Free Tibet, Ghost returned with Hypnotic Underworld, and there were some changes in the band. Cellist Hiromichi Sakamoto and percussionist Setsuko Furuya left and were replaced by a rhythm section of Takuyuki Moriya (electric bass guitar, double bass, and cello) and Junzo Tateiwa (drums, tabla, and percussion). In January 2007, Ghost released its latest studio album titled In Stormy Nights.\n\n3)  A British hip hop/trip hop/electronic producer on the Breakin Bread label who has an impressive discography dating back to 2003. Their body of work includes three solo albums, a collaborative group album, a dynamic mix CD, a series of 12-inch vinyl releases, captivating EPs, and two digital download albums filled with remixes and unreleased tracks. Ghost has left an indelible mark on the music scene through extensive touring, while also maintaining a strong presence as a skillful DJ and a regular radio performer.\n\nInitially rooted in the world of Hip Hop as a dedicated enthusiast (a passion that endures), Ghost's artistic evolution over the past eight years has been noteworthy. This period has seen a deliberate expansion of musical horizons, embracing genres beyond Hip Hop. Notably, Ghost has delved into the realms of Wonky, Electronic beats, Future Beats, and Bass, demonstrating an impressive versatility that resonates with diverse audiences.\n\nhttps://ghost-uk.bandcamp.com\n\n4) The collaboration between one of Dubstep's forefathers El-B and J Da Flex, they created a darker, rawer offshoot of UK Garage on a label of the same name, that would ultimately pave the way for the sound of Dubstep. Blackdown is due to pay homage that early sound on his sequel to 'The Roots of Dubstep', with a collection of rare El-B and Ghost cuts on the new album 'The Roots of El-B'.\n\n5) Jamaican Reggae artist Carlton Hylton.\n\n6) A visual kei band (see ＧＨＯＳＴ for more info)\n\n7) A Death Metal group from Poland (Gdańsk).\n\nThe Lost of Mercy\nhttp://ghost.metal.pl/\n\n8) Ghost is an electronic music producer and member of Cambridge based life4land crew.\n\n9) A One-man band played Experimental Black / Doom Metal from France.\n\n10 Rashard \"Ghost\" Acuna was born and raised in East Oakland,California. He discovered his urge to make music while freestyling in the back of car to the Hot Boys' Guerilla Warfare. The group \"Y.B.G\" was formed with longtime friends Birch Boy Barie amd Murda Boy D. Since then he has been recording, battling, producing and performing whenever possible. Catapulted by the popularity of a rap beef, he went on to make a solo mixtape which established him as a Bay Area native to pay attention too. \n\nMixing lyricism with the East Oakland swagger and adding some bass, his style was born. \"Bwaaaaaaa\" is a phrase often heard when mentioning Ghost's name. Since the start of his career, he had been a part many songs, instrumentals, performances, collaborations, contests, and is in completion of his 2nd underground mixtape.\n\n11 Ghost is an English Melodic/Progressive Rock band.\n\n12) Ghost is an Italian pop-rock band formed in Rome in end of the year 2001. The founding members are Alex Magistri and Enrico Magistri.\n\n13) Ghost was a Swedish Rock / Powerpop band located in Finspång, Sweden. \nMembers: \nAnders Måreby (Vocals, Guitar, Keyboard)\nDag \"Tom Nouga\" Swanö (Guitar)\nPer Runesson (Bass)\n\n14) Ghost and Pals, an experimental and electronic musician from the Midwestern United States. They primarily write music that features VOCALOIDs, which are singing vocal synthesizers. If you listen to a song by Ghost you might contract rubella or maybe get a headache so  listen with caution. <a href=\"https://www.last.fm/music/Ghost\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T14:57:41.346485",
  "discogs_id": "1966143",
  "discogs_url": "https://www.discogs.com/artist/1966143",
  "followers": 3638930,
  "formed_date": null,
  "genres": [
    "Metal",
    "metal",
    "hard rock",
    "heavy metal",
    "Psychedelic Rock",
    "doom metal",
    "seen live",
    "psychedelic"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages211/v4/8c/c3/76/8cc376ff-f617-ef6d-c183-ec74eca73919/ami-identity-98c9d70b1188e46f77e54bcd8ad4e255-2025-03-05T18-35-49.431Z_cropped.png/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5eb2d972470f1f8110be7c07017",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab676161000051742d972470f1f8110be7c07017",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f1782d972470f1f8110be7c07017",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "ed81302a-c095-4f0d-a243-ec362956fee7",
  "lastfm_url": "https://www.last.fm/music/Ghost",
  "local_images": {
    "hi-res": "public/artist/ghost/ghost-hi-res.jpg",
    "medium": "public/artist/ghost/ghost-medium.jpg",
    "small": "public/artist/ghost/ghost-small.jpg"
  },
  "name": "Ghost",
  "popularity": 78,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/AMCArtistImages211/v4/8c/c3/76/8cc376ff-f617-ef6d-c183-ec74eca73919/ami-identity-98c9d70b1188e46f77e54bcd8ad4e255-2025-03-05T18-35-49.431Z_cropped.png/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Metal"
      ],
      "id": "600730426",
      "name": "Ghost",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/ghost/600730426"
    },
    "discogs": {
      "id": 1966143,
      "original_name": "Ghost (32)",
      "role": ""
    },
    "lastfm": {
      "bio_content": "There are several artists sharing the moniker Ghost;\n\n1) Ghost, also formerly known as Ghost B.C. in the United States, is a Swedish metal band that was formed in Linköping in 2006. In 2010, they released a three-track demo followed by a 7-inch vinyl titled \"Elizabeth\", and later their debut full-length album Opus Eponymous. The song \"Ritual\" was chosen by Kerrang! as one of \"The 50 Most Evil Songs Ever.\" The Grammis-nominated album was widely praised and significantly increased their popularity. Their second album and major label debut, Infestissumam, was released in 2013, debuted at number one in Sweden, and won the Grammis Award for Best Hard Rock/Metal Album. The band released their third studio album, Meliora, in 2015 to much critical acclaim and high record sales, reaching number one in their home country of Sweden, and number eight in the United States. Its lead single, \"Cirice\", earned them the 2016 Grammy Award for Best Metal Performance. The band released their fourth studio album, Prequelle, in 2018. Their fifth studio album, Impera, followed in 2022. In 2024, they debuted a concert film titled Rite Here Rite Now, which was shown in theaters for a limited time. An accompanying live album under the same name was released alongside the film. In 2025, they released their sixth album, Skeletá, which peaked at #1 on the Billboard Hot 200. \n\nGhost is an easily recognizable band, owing greatly to their highly theatrical stage presence. Their aesthetic leans heavily on inverted, \"satanic\" depictions of Catholic imagery. The band's instrumentalists and backup singers, called 'Nameless Ghouls', wear virtually identical, face-concealing costumes. Onstage, lead singer and songwriter Tobias Forge portrays a character-- or, rather, lineage of characters-- named Papa Emeritus. Prior to a 2017 lawsuit filed by ex-band members which revealed his identity, Forge remained fully anonymous and only ever appeared as Papa to the public. The character, which consists of Forge in a prosthetic mask and makeup, is described as a \"demonic anti-pope\". There have been six Papa Emerituses throughout Ghost's existence-- I, II, III, Nihil, IV, and V, each with distinct designs and, to some extent, personalities. In-universe, they are treated as separate people. The band's Youtube channel publishes an ongoing web series involving some of the characters, which takes place through short, sketch comedy-esque videos. The storyline has become increasingly complex over the years, and was significantly elaborated on during the Rite Here Rite Now concert film. \n\nFor the release of the 2018 album Prequelle and subsequent world , Forge introduced a new frontman named Cardinal Copia, who wore minimal face paint and a cassock or tightly tailored suit, in place of the usual papal robes worn by previous Papas. Copia's introduction marked an increase in the complexity and depth of the band's storytelling; the Youtube web series began during this era. In  March 2020, at the final show of A Pale Tour Named Death, Cardinal Copia ascended to the papacy, becoming Papa Emeritus IV. He remained as frontman for the entirety of the Impera album cycle. Papa V Perpetua, the current incarnation of the frontman, is notable for being the first character for which Forge does not wear a full prosthetic mask; he instead wears a half-face metallic skeleton mask with face paint underneath. Within the Ghost storyline, Papa V is said to be Copia's twin.\n\nGhost's music has been categorized in many genres. Critics have classified them as hard rock, heavy metal, doom metal, pop rock, progressive rock, psychedelic rock, occult rock, and arena rock. Adrien Begrand of PopMatters stated that Ghost recalls \"the early sounds of Black Sabbath, Pentagram, and Judas Priest, as well as the progressive and psychedelic rock of the late '60s.\" Early in Ghost's career, a Nameless Ghoul (speaking to Noisey.com) described Ghost as a black metal band in the traditional sense, but said that they probably do not fit into the norms of the current black metal scene. This Nameless Ghoul described Ghost's music as a mix between pop music and death metal.\n\nIn an interview, a Nameless Ghoul said they are influenced by \"everything ranging from classic rock to the extreme underground metal bands of the '80s to film scores to the grandeur of emotional harmonic music.\" A member of the band said the Swedish and Scandinavian black metal movement of the early '90s plays a major role in their act, and said that each member has come from a metal background. However, the band has stated several times that they do not aim to be a metal band. For their second album, Ghost chose a more diverse songwriting style; a member said, \"we tried to deliberately have every song have its own signature.\"\n\nTobias Forge is the sole songwriter and creative force for the band, although he often collaborates with an external songwriting duo. Pre-2017, Martin Persner, then a member of the band, occasionally contributed to songs. In 2017, Forge claimed that he was the main author of every song except \"Year Zero\" and \"Zenith\", which were Persner's ideas. When asked how he keeps Ghost's sound intact despite large lineup changes, Forge said he has to teach them to play like he does; explaining that while he is a good guitar player, he is only an \"okay\" drummer, bassist and keyboardist. So it is a matter of getting them to \"underperform together.\"\n\n2) Ghost is an experimental rock group formed in Tokyo, Japan, in 1984.\n\nCore-member Masaki Batoh grew up in Kyoto, Japan where he attended a private school. During this time, he became interested in American and British rock music ranging from Bob Dylan and Pink Floyd to the Velvet Underground and Japanese rock bands such as the Taj Mahal Travellers and the Flower Travellin' Band.\n\nLater, Batoh formed Ghost with a large and often varying lineup. According to reports posted on Allmusic, the group lived a nomadic existence, drifting from ruins of ancient temples to disused subway stations around the Tokyo area.\n\nThe band began releasing their work with the albums Ghost and Second Time Around, which were released, respectively, in 1991 and 1992. The American independent label Drag City licensed each of the albums for distribution, and the Los Angeles The Now Sound label picked up two of Batoh's solo albums, released together as well under the title Collected Works. Two albums, Tune In, Turn On, Free Tibet and Snuffbox Immanence, were released simultaneously in 1999.\n\nAs well as their own work, Ghost have recorded and performed with the ex-Galaxie 500 duo Damon and Naomi. Five years after releasing both Snuffbox Immanence and Tune In, Turn On, Free Tibet, Ghost returned with Hypnotic Underworld, and there were some changes in the band. Cellist Hiromichi Sakamoto and percussionist Setsuko Furuya left and were replaced by a rhythm section of Takuyuki Moriya (electric bass guitar, double bass, and cello) and Junzo Tateiwa (drums, tabla, and percussion). In January 2007, Ghost released its latest studio album titled In Stormy Nights.\n\n3)  A British hip hop/trip hop/electronic producer on the Breakin Bread label who has an impressive discography dating back to 2003. Their body of work includes three solo albums, a collaborative group album, a dynamic mix CD, a series of 12-inch vinyl releases, captivating EPs, and two digital download albums filled with remixes and unreleased tracks. Ghost has left an indelible mark on the music scene through extensive touring, while also maintaining a strong presence as a skillful DJ and a regular radio performer.\n\nInitially rooted in the world of Hip Hop as a dedicated enthusiast (a passion that endures), Ghost's artistic evolution over the past eight years has been noteworthy. This period has seen a deliberate expansion of musical horizons, embracing genres beyond Hip Hop. Notably, Ghost has delved into the realms of Wonky, Electronic beats, Future Beats, and Bass, demonstrating an impressive versatility that resonates with diverse audiences.\n\nhttps://ghost-uk.bandcamp.com\n\n4) The collaboration between one of Dubstep's forefathers El-B and J Da Flex, they created a darker, rawer offshoot of UK Garage on a label of the same name, that would ultimately pave the way for the sound of Dubstep. Blackdown is due to pay homage that early sound on his sequel to 'The Roots of Dubstep', with a collection of rare El-B and Ghost cuts on the new album 'The Roots of El-B'.\n\n5) Jamaican Reggae artist Carlton Hylton.\n\n6) A visual kei band (see ＧＨＯＳＴ for more info)\n\n7) A Death Metal group from Poland (Gdańsk).\n\nThe Lost of Mercy\nhttp://ghost.metal.pl/\n\n8) Ghost is an electronic music producer and member of Cambridge based life4land crew.\n\n9) A One-man band played Experimental Black / Doom Metal from France.\n\n10 Rashard \"Ghost\" Acuna was born and raised in East Oakland,California. He discovered his urge to make music while freestyling in the back of car to the Hot Boys' Guerilla Warfare. The group \"Y.B.G\" was formed with longtime friends Birch Boy Barie amd Murda Boy D. Since then he has been recording, battling, producing and performing whenever possible. Catapulted by the popularity of a rap beef, he went on to make a solo mixtape which established him as a Bay Area native to pay attention too. \n\nMixing lyricism with the East Oakland swagger and adding some bass, his style was born. \"Bwaaaaaaa\" is a phrase often heard when mentioning Ghost's name. Since the start of his career, he had been a part many songs, instrumentals, performances, collaborations, contests, and is in completion of his 2nd underground mixtape.\n\n11 Ghost is an English Melodic/Progressive Rock band.\n\n12) Ghost is an Italian pop-rock band formed in Rome in end of the year 2001. The founding members are Alex Magistri and Enrico Magistri.\n\n13) Ghost was a Swedish Rock / Powerpop band located in Finspång, Sweden. \nMembers: \nAnders Måreby (Vocals, Guitar, Keyboard)\nDag \"Tom Nouga\" Swanö (Guitar)\nPer Runesson (Bass)\n\n14) Ghost and Pals, an experimental and electronic musician from the Midwestern United States. They primarily write music that features VOCALOIDs, which are singing vocal synthesizers. If you listen to a song by Ghost you might contract rubella or maybe get a headache so  listen with caution. <a href=\"https://www.last.fm/music/Ghost\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "There are several artists sharing the moniker Ghost;\n\n1) Ghost, also formerly known as Ghost B.C. in the United States, is a Swedish metal band that was formed in Linköping in 2006. In 2010, they released a three-track demo followed by a 7-inch vinyl titled \"Elizabeth\", and later their debut full-length album Opus Eponymous. The song \"Ritual\" was chosen by Kerrang! as one of \"The 50 Most Evil Songs Ever.\" The Grammis-nominated album was widely praised and significantly increased their popularity. <a href=\"https://www.last.fm/music/Ghost\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 1434095,
      "mbid": "ed81302a-c095-4f0d-a243-ec362956fee7",
      "name": "Ghost",
      "playcount": 132526756,
      "similar_artists": [
        {
          "name": "Volbeat",
          "url": "https://www.last.fm/music/Volbeat"
        },
        {
          "name": "Iron Maiden",
          "url": "https://www.last.fm/music/Iron+Maiden"
        },
        {
          "name": "Avenged Sevenfold",
          "url": "https://www.last.fm/music/Avenged+Sevenfold"
        },
        {
          "name": "Metallica",
          "url": "https://www.last.fm/music/Metallica"
        },
        {
          "name": "Ozzy Osbourne",
          "url": "https://www.last.fm/music/Ozzy+Osbourne"
        }
      ],
      "tags": [
        "heavy metal",
        "Psychedelic Rock",
        "doom metal",
        "seen live",
        "psychedelic"
      ],
      "url": "https://www.last.fm/music/Ghost"
    },
    "spotify": {
      "followers": 3638930,
      "genres": [
        "metal",
        "hard rock"
      ],
      "id": "1Qp56T7n950O3EGMsSl81D",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5eb2d972470f1f8110be7c07017",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab676161000051742d972470f1f8110be7c07017",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f1782d972470f1f8110be7c07017",
          "width": 160
        }
      ],
      "name": "Ghost",
      "popularity": 78,
      "url": "https://open.spotify.com/artist/1Qp56T7n950O3EGMsSl81D"
    }
  },
  "spotify_id": "1Qp56T7n950O3EGMsSl81D",
  "spotify_url": "https://open.spotify.com/artist/1Qp56T7n950O3EGMsSl81D",
  "updated_at": "2025-07-05T14:57:45.245341",
  "wikipedia_url": null
}