{
  "apple_music_id": "601067",
  "apple_music_url": "https://music.apple.com/gb/artist/stevie-ray-vaughan-double-trouble/601067",
  "biography": "Stephen \"Stevie\" Ray Vaughan (October 3, 1954 – August 27, 1990) was an American blues-rock guitarist, whose broad appeal made him an influential electric blues guitarist.[1] In 2003, Rolling Stone magazine ranked Stevie Ray Vaughan #7 in its list of the 100 Greatest Guitarists of All Time,[2] and Classic Rock Magazine ranked him #3 in their list of the 100 Wildest Guitar Heroes in 2007.\n\nEarly life\n\nStephen Ray Vaughan was born to Martha and Jimmie Lee Vaughan at Methodist Hospital in Dallas, Texas on October 3, 1954, three years after his brother, Jimmie Vaughan. Stevie's father, whose nickname became \"Big Jim\", was an asbestos worker whose job carried the family to cities across Texas. Wherever there was an opening, the family would pack up and move to another city.\n\nThe Vaughan family finally moved into a small house in Dallas. The tension in the house was high, however, as Big Jim had a temper when he drank alcohol.[citation needed]\n\nBig Jim and Martha loved to dance to Western Swing, and it was the boys' first exposure to music. The Texas Playboys, a country band, would hang out at the Vaughan's house often, and would play dominoes with Big Jim. The Playboys would bring alcoholic beverages to the house and soon led Stevie to sneak sips when nobody was looking. It was at this young age where he started his addiction to alcohol.\n\nWhen Jimmie was 12, after a broken shoulder from playing football, a family friend, Michael Quinn, gave him his first guitar, which had all six strings. Soon after, Stevie got one of his own: a plastic Roy Rogers toy guitar from Sears, with only three strings. Stevie recalls that it also came with a set of blankets.\n\nThe boys taught themselves to play by listening to records, as they weren't interested in guitar lessons. It was the late 60s at the time, the era of Jimi Hendrix, The Yardbirds, and The Beatles, and Jimmie would bring home records of all these new bands to play and listen to. The Vaughan brothers were also drawn to another sound, a raw, emotional music with feeling and soul: the blues. The boys taught themselves the guitar techniques of blues wizards like Albert and B.B. King, Otis Rush, and Buddy Guy.\n\nBy the time he was 15, Jimmie was the lead guitarist in a local cover band called The Chessmen, and played gigs all over Texas. Back home, Stevie kept on practicing. He'd spend hours in his room, and played until he sounded exactly like what he heard.\n\nOne of the first to take notice was Jimmie's band mate in The Chessmen, singer, Doyle Bramhall. When he was picking up Jimmie at the house to go to a gig, he opened a room door and saw young Stevie playing along to Jeff's Boogie by The Yardbirds. He was the first to tell him that he was actually good.\n\n Early career\n\nStevie was playing in rock bands by age 12. His first recording was for a garage rock band called \"A Cast of Thousands\", and his style stood out. He had paying gigs when he entered high school: first with Jimmie's new band, Texas Storm, and then with his own group, Blackbird. Stevie would play late night sets at local bars like.\n\nAfter playing gigs all night, Stevie managed to fall asleep in class so often he flunked music theory. His brother's grades were just as bad. Alarmed by their boys' behavior, Big Jim and Martha tried to stop Jimmie and Stevie's music careers and make them focus on school. It was too late, however, when in 1967, Jimmie moved out of the house and into Doyle's, leaving his brother failing in school, and miserable at home. Stevie decided to take a job washing dishes at the local Dairy Mart. Part of his job was to clean out the trash bin, which required standing on top of 55 gallon barrels with wooden lids that were used for storing grease. One day while cleaning the trash bin, the wooden lid broke on one of the barrels causing him to fall up to his chest in grease. As he climbed out of the barrel, the cooks came out with two fresh vats of hot boiling grease. He was then fired from the job for breaking the wooden lid and decided he instead wanted to pursue his dream of being a guitar player like Albert King in the records he was listening to at the time rather than having any other job.\n\n 1970's\n\nIn early 1971, both Jimmie and Doyle grew tired of the fading music scene in Dallas and moved to Austin to give it another try. A year later, Stevie followed with his band Blackbird. At 17 years old, he dropped out of high school during Christmas break and hit the road.\n\nWhen he first came to Austin, Stevie and his band didn't have much money, so he would sleep on a barroom pool table, but he fit in with the more appreciative music scene on the east side of town. With blues clubs like the Soap Creek Saloon, Vulcan Gas Company, and Antone's, Stevie could trade licks with the blues masters he grew up listening to. Clifford Antone was one of the club owners to take notice and practically begged Albert King to let 17 year old Stevie play guitar with him. After much convincing, he finally said \"Yes!\", and King was blown away when he heard Stevie play the licks that he made up himself.\n\nIt was a dream for Stevie to play and share riffs with these masters, day and night, but making a career in Austin came out to be tougher than he thought.\n\nIn 1973, he joined a promising rock group called Krackerjack, which included future bassist Tommy Shannon that he met after a stint at a club in Dallas called \"The Fog\". Stevie quit when the leader decided they should wear makeup on stage.\n\nThe next year, he was asked to join Marc Benno and the Nightcrawlers, a blues band that included singer Doyle Bramhall. The Nightcrawlers drove from Texas to Los Angeles to record an album, but Benno's record label rejected the tapes, and Stevie traveled back to Texas.\n\nIn 1975, he hooked up with another popular Austin group, Paul Ray and the Cobras, a two-guitar band with Stevie in the background. After two years, they only had one single recorded, and Stevie grew frustrated and quit.\n\nHe was still in the shadow of his big brother. Jimmie's new group, The Fabulous Thunderbirds, were the talk of Austin, and became the house band at Antone's.\n\nIn late 1977, Stevie decided it was time to put together a band of his own called \"Triple Threat\", which included bass player, W.C. Clark, Freddie \"Pharoah\" Walden on drums, and singer Lou Ann Barton. With his hot new band, Stevie could take a step forward and play the blues with energy that set audiences on the edge of their seats. He recalls that some nights he played until the skin on his fingers shredded and had to stick the calluses back on with Super Glue and play more.\n\nOn December 23, 1979, Stevie Vaughan married a tough-minded, Lebanese bombshell named Lenora \"Lenny\" Bailey between sets at the Rome Inn in Austin, TX.\n\nW.C. Clark left Triple Threat in mid-1978, and Stevie renamed the band \"Double Trouble.\" He then asked drummer Chris Layton to join the band. After an embarrassing incident with drunken Lou Ann Barton post show, Stevie was angry and fired her, as he became the new lead singer and guitar player. Around this time, he hired a management company called \"Classic Management\" that consisted of manager Chesley Milikin, and financial assistant, Frances Carr.\n\n         1980's\n\nStevie's drummer at the time, Chris Layton, stayed with Stevie. After almost four years, Jackie Newhouse was dropped from the band in the spring of 1981, and bass player Tommy Shannon decided he wanted in. In turn, he was asked to join Double Trouble.\n\nThe first show with the new trio format band was at Joe Ely's annual Texas Tornado Jam, a music festival featuring a host of local bands held at the Manor Downs Racetrack, just outside of Austin. The Fabulous Thunderbirds were after Stevie and Double Trouble. The whole show was broadcast on TV.\n\nMick Jagger from The Rolling Stones saw a tape of the show and liked what he saw. He asked Stevie and his band to play a private party hosted by The Rolling Stones at the Danceteria club in New York. After the show, Mick and guitar player Keith Richards talked to the band about getting them a record deal. It never went through, however, and they went back to Texas.\n\nJerry Wexler, record executive from Atlantic Records, saw the band playing at a record release party for Lou Ann Barton's new position as singer for Roomful of Blues. He recommended that the band play the Montreux International Jazz Festival in Switzerland. Manager Chesley Milikin put in a call to Claude Nobs, the host of the Montreux Jazz Festival and would be the first unsigned act to perform at the festival.\n\nThe band was booked on a jazz acoustic night, a setup that involved an upright bass, piano, and generally soft music. With the loud and powerful sound that Stevie and Double Trouble had, it shocked the staid crowd. After a few songs, the gig seemed headed for disaster, as some of the audience members booed. Larry Graham, from Sly & The Family Stone was looking forward to an encore with the band, but unfortunately, it never happened.\n\nAs the band was backstage, devastated and disappointed, the performance was appreciated by two celebrities in the audience: pop star David Bowie and musician Jackson Browne. Browne offered the band 72 hours of free studio time at his own studio in downtown Los Angeles. David Bowie also offered Stevie to play on his upcoming album, Let's Dance, co-produced by Nile Rodgers.\n\nTo be able to afford the gasoline to at least drive to Los Angeles all the way from Texas, the band booked a small tour at various clubs like Fitzgerald's in Houston and The Continental Club in Austin. When they finally traveled to Los Angeles during Thanksgiving weekend in 1982, they recorded an album's worth of songs: eight songs the first day, and two the second day. Stevie and the band then went back to Texas and he recorded the vocals at Riverside Sound in Austin.\n\n\n             Fame and success\n\nThe band sent the tapes to legendary talent scout, John Hammond, Sr., a veteran of the record business who discovered Aretha Franklin, Billie Holiday, and Bob Dylan. He liked what he heard and got the band a major contract with Epic Records. The mixed and mastered tapes were morphed into an album called Texas Flood. On June 3, 1983, the album made it to #38 on the Billboard 200 charts, received positive reviews, and sold over 500,000 units. Stevie Ray Vaughan and Double Trouble were an overnight success. The band then embarked on a successful tour for the album.\n\n        Couldn't Stand the Weather\n\nIn mid-December 1983, the band took two weeks off to write new material for a new album. They went to The Power Station in New York City to record in January 1984. The new album took two weeks to record, but finally finished and released the album as Couldn't Stand the Weather. They went on another successful tour and played many TV shows including Solid Gold and Rockpalast.\n\nOn October 4, 1984, Stevie Ray Vaughan and Double Trouble played a show at Carnegie Hall in New York City for his 30th birthday. To celebrate the special occasion, the show would feature two sets: one with him and Double Trouble, and the second with a host of special guests. He originally lined up the Tower of Power horn section and Booker T. Jones to play keyboards. The plan somehow fell through and they were replaced with the Roomful of Blues horn section and New Orleans' very own Dr. John. Also guest starring were drummer George Rains, Stevie's brother Jimmie, and singer Angela Strehli. Friends and family were in the audience as well.\n\nThe whole eleven-piece band wore custom-tailored mariachi suits. Stevie and Double Trouble's suits were made from velvet, custom tailored at Nelda's Tailors in Austin. Chris and Tommy had royal blue suits and Stevie had both ruby red and royal blue made. The horn section had their suits sewn across the border in Neuvo Laredo, Mexico after a pattern that Jimmie Vaughan had on his suit. Stevie designed the staging for the show as well. The stage floor, drum and horn risers were made of 2x4 plywood painted lapis blue enamel with gold lamé striping.\n\nStevie also originally envisioned the project as a full-length video. However, the band already booked studio time in Dallas to record another album, one that would hopefully feature the new direction for the band with the experimentation of the expanded trio. This would make it difficult for Epic to market the video, so the project was shelved and the show was recorded to audio tape instead.\n\nThe band rehearsed for two weeks to prepare for the show. First they rehearsed at a sound stage in Austin called \"Third Coast\". For two consecutive nights in late September, Stevie and all the guests played at the newly-opened Caravan of Dreams in Fort Worth. They then flew to New York and rented a warehouse in the area for a dress rehearsal, where the special staging was constructed. The staging was then stripped down and reconstructed at Carnegie Hall and the band ran through the program a final time. The show started at 8 pm, Thursday night. It was a show none could ever forget.\n\nAfter the show, MTV invited all the guests a local club where the new TV network would throw an after-party. It was official: Stevie Ray Vaughan had hit the big time!\n\nWith several more shows after Carnegie Hall, the band flew to Australia and played two sold-out shows at the Sydney Opera House. Then it was off to New Zealand, with a few concert halls and stadiums on the itinerary. While in New Zealand, Stevie received word that he won two W.C. Handy Blues Awards: one for Entertainer of the Year and one Instrumentalist of the Year. He was the first white person to win both awards. He was presented the awards on November 18, 1984, and jammed with B.B. King, Rufus Thomas, Robert Cray, and Albert King. The ceremony was held at the Orpheum Theatre in Memphis on Beale Street.\n\n                Soul to Soul\n\nBy early 1985, Stevie's performance contract required a fifth of Scotch in his dressing room each night and his cocaine habit rose to 4 grams/day. After late-night parties, he would dissolve the cocaine in Crown Royal whiskey for a \"pick-me-up\" and hangover cure.\n\nStevie and Double Trouble went to the Dallas Sound Labs in March 1985. After a couple of weeks of trying to come up with new material, it became evident that Stevie Ray Vaughan and Double Trouble needed a stronger rhythm section. Desperate, he got in touch with, Reese Wynans, an ace keyboard player who was playing with Delbert McClinton at the time.\n\nOn April 10, 1985, Stevie Ray was asked to play The Star Spangled Banner on opening day at the Houston Astrodome. Unfortunately, he didn't get a good audience response, as he played his rendition with slide guitar work.\n\nThe new quartet finished the album in May 1985 and was named Soul to Soul. The album was released on September 30, 1985, but lacked the fire and bite of previous albums.\n\nBy 1986, the band was touring the world non-stop, and Stevie's cocaine habit rose to 7 grams a day. Sometimes they'd share the bill with The Fabulous Thunderbirds.\n\nBoth bands were on tour in New Zealand when Stevie saw a group of schoolgirls walking back to a nearby hotel. He honed in on one girl in particular: model Janna Lapidus. Strikingly beautiful with dark hair and olive skin, her parents flew from Russia when she was a child. Stevie met Janna when she was 17 and took her with him on tour in Australia.\n\n                 Live Alive\n\nIn mid-1986, Stevie and Double Trouble were told that they'd have to record another album. As this was the last thing that the band wanted to do, they decided to record a live album. It would be simple: they book shows at the Austin Opera House and the Starfest in Dallas and everything would turn out great.\n\nIt didn't prove to be easy, however, as many of the recordings were flooded with technical difficulties and touch-ups or errors that needed to be corrected. The band started booking studio time to overdub drums or vocals, surely the worst way to record a live album.\n\nStevie's marriage to Lenny was also on the verge of collapse. His fame, fortune, success and attention pushed her to the sidelines, and she reacted bitterly. One night after a long stretch on the road, he came home to find their house in Austin padlocked, electricity shut off, their dog gone, and Lenny nowhere to be found. As a result, it escalated Stevie's cocaine and alcohol abuse.\n\nStevie then moved to Los Angeles where he moved in with an old Austin acquaintance, Timothy Duckworth, who later became Stevie's personal assistant.\n\n\"Live Alive\" was released on November 30, 1986.\n\nOn August 27, 1986, Stevie and Jimmie's father died from heart failure, complications from Parkinson's disease. The boys rushed home to comfort their mother, but there was little time to mourn over the death of their father. A funeral was held three days later, and when it was done, a jet rushed Stevie back on the road with Double Trouble.\n\nA month later on tour in Europe, the hardcore addictive lifestyle finally caught up with Stevie. Drummer Chris Layton recalls being out in the street with Stevie when he suddenly dropped to his knees and acted confused, then began retching blood and bile. He said he needed a drink, but no drug stores were open. Composing himself, the two walked back to their hotel in Ludwigshafen. Then Stevie began shaking, sweating and his eyes \"were like the eyes of a dead animal.\" When the animation came back into his eyes, he sat up and quietly said, \"I need help.\" Chris called an ambulance; the paramedics later described the trip to the hospital as a near death dehydration. Stevie was admitted under the care of Dr. Victor Bloom in London, the same doctor who helped Eric Clapton kick his addiction to heroin. Bloom monitored Stevie overnight to see his stomach reactions; it turned out that the whiskey was eating away his stomach lining, and the cocaine was crystallizing again and eating into his intestines.\n\n             Rehabilitation\n\nAfter a failed attempt to get sober in London, he asked his mother to fly the band to Atlanta, Georgia, where Stevie checked into Peachford Hospital, and Tommy checked into a hospital in Austin; both men spent a month in the Charter treatment program.\n\nStevie made a phone call to his wife Lenny, asking her to visit him in rehab and rework their marriage but she refused. In turn, he filed for a divorce, but wasn't finalized until June 1988, due to a delay in an agreement between Stevie and Lenny.\n\n                  Recovery\n\nBy late 1986, Stevie Ray Vaughan and Double Trouble went back on the road with confidence and energy as Stevie and Tommy now played clean and sober.\n\nOn February 28, 1987, the band played MTV Mardi Gras in New Orleans with The Fabulous Thunderbirds. Both groups were interviewed as well and the whole occasion was broadcast on television.\n\nStevie also made an appearance with B.B. King for an HBO special that was broadcast at the Ebony Showcase Theater in Los Angeles, California on April 15, 1987. It was a lineup that included B.B. King, Albert King, Eric Clapton, Paul Butterfield (who died only a few weeks later), Phil Collins, Gladys Knight, and Etta James.\n\nStevie Wonder hosted a TV special called \"Characters\", in which a number of musical guests came to perform various hits of Wonder's. Stevie Ray played with Wonder on \"Superstition\" and \"Come Let Me Make Your Love Come Down\" and was broadcast in April 1988.\n\nStevie wanted to help others recover and overcome their problems with alcohol or drugs, as during the song \"Life Without You\", he would often speak to the audience about recovering and being there for others when they need love.\n\nOn the road, he would attend Alcoholics Anonymous (A.A.) meetings regularly, sharing the lessons of his ordeal.\n\n                 In Step\n\nBy 1988, the band was ready to return to the recording studio. For the new record, they traveled to Memphis to record in Ardent Studios, a pro recording studio that has such clientele as ZZ Top, Tina Turner, and Led Zeppelin. Together, old friend Doyle Bramhall and Stevie began writing songs about walking the tightrope to recovery, including \"Tightrope\", \"Wall of Denial\", and \"Crossfire\".\n\nThe album was named appropriately, \"In Step\", released on June 6, 1989. \"Crossfire\" reached the #1 position on the Mainstream Rock Charts. It was the only hit single that they ever had.\n\nIn the spring of 1990, Stevie and his brother recorded an album together, one that would feature the music they had grown up with. They recorded at Ardent Studios in Memphis and was produced by Nile Rodgers. Both brothers decided to name it \"Family Style\".\n\nIn the summer of 1990, Stevie and Double Trouble went on tour with British soul singer Joe Cocker, touring places like Alaska and the Benson & Hedges Blues Festival.\n\n               Death\n\nTo finish off the summer leg of the \"In Step\" tour, Stevie Ray Vaughan and Double Trouble played two shows on August 25 & 26 at Alpine Valley Music Theatre in East Troy, WI, a couple of miles away from the ski resort. The shows also featured Eric Clapton and Robert Cray with The Memphis Horns.\n\nAfter Double Trouble's set at the final show, Stevie & Jimmie (with wife Connie) originally planned to return to Chicago by automobile. Bass player Tommy Shannon and keyboardist Reese Wynans had already left. The venue was difficult to reach via highway and Stevie wanted badly to get back to Chicago so he could talk to his girlfriend, Janna Lapidus, in New York City. She was modeling and staying with him at the time.\n\nTour manager Skip Rickert had rented helicopters with Omni Flights to beat the congested traffic on highways going back to Chicago. Most of the places had been reserved by Eric Clapton's entourage, but one seat was free, which Stevie took.\n\nThe helicopters departed at 12:44 a.m into a thick fog. Just past the landing zone was a 200-foot hill. Stevie's helicopter was piloted by Jeffrey Browne, who was unfamiliar with the flight pattern for exiting the area. He guided the helicopter to about half of the altitude needed to clear the hill before crashing into it. The force of the impact scattered various pieces of the aircraft over a 200-foot area. The coroner's report stated Stevie died of severe loss of blood due to a rupture of the aorta, resulting from the force of impact.\n\nAs the other helicopters flew past, no one suspected anything was wrong. Several hours would pass before anyone signaled the flight had failed to arrive in Chicago. The search for wreckage began around 5 a.m. Hours later, word started to spread that a musician has been killed, and that the musician was in fact Stevie. At 7 a.m., Eric Clapton and Jimmie Vaughan were called to the site to identify the victims. Jimmie saw Stevie's bolero hat and was instantly shaken and devastated, so much so he returned to the car. A short time later, somebody knocked on the window and handed him Stevie's Coptic cross.\n\nA sad and strange coincidence for the Vaughan family was that Stevie Ray died exactly four years to the day after his father.\n\nOn August 31, 1990, funeral services were held for Ray Vaughan in his hometown of Oak Cliff. Thousands of friends, musicians, family members who knew him gathered to say goodbye. Among the mourners were all three members of ZZ Top, Bonnie Raitt, Stevie Wonder, Jackson Browne, Janna Lapidus, mother Martha Vaughan, and Jimmie Vaughan. Stevie is now at rest in Laurel Land Cemetary in Dallas, Texas.\n\n            Legacy\n\nVaughan memorial at Lady Bird Lake, in Austin, Texas.\n\nSeptember 1990 saw the release of Family Style.\n\nThe 1991 album The Sky Is Crying was the first of several posthumous Vaughan releases to achieve chart success. Jimmie Vaughan later co-wrote and recorded a song in tribute to his brother and other deceased blues guitarists, titled \"Six Strings Down\".\n\nThe 1991 album of Bonnie Raitt, Luck of the Draw, was dedicated to him.\n\nMany other artists recorded songs in remembrance of Vaughan, including Eric Johnson,[3] Buddy Guy and Steve Vai (\"Jibboom\" on the album The Ultra Zone, 1999).\n\nIn 1991, Texas governor Ann Richards proclaimed October 3, Vaughan's birthday, to be \"Stevie Ray Vaughan Day.\" An annual motorcycle ride and concert in Central Texas benefits the Stevie Ray Vaughan Memorial Scholarship Fund.[4]\n\nIn 1992, the Fender Musical Instruments Corporation released the Stevie Ray Vaughan Signature Stratocaster, which Vaughan had helped design. As of 2007, the model is still in production. In 2004, Fender also released a limited edition exact replica of \"Number One\".[5]\n\nStevie Wonder included a song on his 1995 live album Natural Wonder titled \"Stevie Ray Blues\". On the album, Wonder refers to the song as \"Stevie Ray Vaughan Blues\".\n\nStephen King's short story \"You Know They Got a Hell of a Band\" concerns a small town called Rock and Roll Heaven that's populated by late rock musicians, one of whom is Vaughan.\n\nIn 1994, the city of Austin erected the Stevie Ray Vaughan Memorial Statue at Auditorium Shores on Lady Bird Lake,( [show location on an interactive map] 30°15′47.1774″N 97°45′2.4228″W﻿ / ﻿30.263104833°N 97.750673°W﻿ / 30.263104833; -97.750673) the site of a number of Vaughan's concerts. It has become one of the city's most popular tourist attractions.\n\nIn 2000, Stevie Ray Vaughan was inducted into the Blues Hall of Fame.\n\nThe last guitar that Vaughan played before his death is on display in the Hard Rock Cafe in Gatlinburg, Tennessee.\n\nIn November 2007, Fender Musical Instruments Corporation released a second tribute to Vaughan, an exact replica of his second beloved guitar: Lenny. This guitar was given to him by his wife Lennora (\"Lenny\") on his 26th birthday and Vaughan was very fond of it. According to Fender, the original Lenny was a 1965 Strat that he saw in the window of a pawn shop that he was unable to afford. The guitar is sold with a strap, a case with Vaughan's name embroidered in the fabric lining, a number of brochures and memorabilia and a leather bound certificate of authenticity.\n\n        \"A little over four years ago on June 24, 2004 Lenny was put up for auction and was sold to Guitar Center for $629,500. \"[1]\n\nAlso in November 2007, Sony BMG, Epic Records, and Legacy Records released the CD Stevie Ray Vaughan & Friends: Solos, Sessions & Encores.\n\nStevie Ray Vaughan became eligible for the Rock and Roll Hall of Fame in 2008.[6]\n\nIn 2008, residents voted to rename Dallas' Industrial Boulevard, with Vaughan's name being one of the finalists alongside Stanley Marcus, Eddie Bernice Johnson, and Cesar Chavez. [2]\n\nHis music has been used in the popular Guitar Hero series featuring Texas Flood and Pride And Joy.\n\nHarmonix has also announced that Stevie's album Texas Flood will be released for download for its popular Rock Band video game.[3]\n\n             Personal life\n\nStevie Ray had several girlfriends in his early career, one of them being Lindi Bethel. \"Pride and Joy\" was influenced by Lindi when he wrote it.\n\nStevie married Lenora \"Lenny\" Bailey on December 23, 1979 between sets at the Rome Inn in Austin, TX. They divorced in 1988.\n\nStevie and model Janna Lapidus met each other in New Zealand in March 1986. They remained a couple until his death.\n\nHe did not have any children.\n\nMusical influences and style:\n\nVaughan's blues style was strongly influenced by many blues guitarists. Foremost among them were Albert King, who dubbed himself Stevie's \"godfather,\" Otis Rush, Eric Clapton, Buddy Guy, and Jimi Hendrix. The song \"Rude Mood\" is a direct derivative (according to Vaughan himself) of a Lightnin' Hopkins tune called \"Lightning Sky Hop.\" He was also strongly influenced by early blues-rock guitarist Lonnie Mack, who, according to Vaughan, \"really taught me to play guitar from the heart\" (Davis, History of the Blues, DaCapo 2003, p. 246). Vaughan, who had idolized Mack since childhood, produced and played on Mack's 1985 Alligator Records album Strike Like Lightning[7] and covered \"Wham!\" which was written by Mack, as well as playing on a Mack tune from the 1980s, \"If You Have To Know.\" \"Scuttle Buttin'\" was influenced by one of Mack's songs \"Chicken Pickin'\". Vaughan's brother Jimmie Vaughan has stated that Johnny \"Guitar\" Watson was the guitarist he and Stevie studied the most.\n\nVaughan's sound and playing style, which often incorporated simultaneous lead and rhythm parts, drew comparisons to Hendrix; Vaughan covered several Hendrix tunes on his studio albums and in performance, such as \"Little Wing,\" \"Voodoo Child (Slight Return),\" and \"Third Stone from the Sun.\" Some blues greats say that \"Vaughan can play Hendrix better than Hendrix himself.\" He was also heavily influenced by Freddie King, another Texas bluesman, mainly in the use of tone and attack; King's heavy vibrato can clearly be heard in Vaughan's playing. Another stylistic influence was Albert Collins. By utilizing his index finger as a pick a la Albert Collins, he was able to coax various tonal nuances from his amplifiers.\n\nKnown for his warm blues-rock tone, Vaughan characteristically used very heavy strings on his guitar ranging from 13 to 58-gauge sets to give a fuller sound which he tuned down a half-step to the key of E flat.\n\nMusicians such as John Mayer, Robert Randolph, Kenny Wayne Shepherd, Colin James, Jonny Lang, Los Lonely Boys, Mike McCready, Eric Johnson, John Petrucci, and Doyle Bramhall II have cited Vaughan as an influence.\n\n\n <a href=\"https://www.last.fm/music/+noredirect/STEVIE+RAY+VAUGHAN+&+DOUBLE+TROUBLE\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T15:45:17.017016",
  "discogs_id": "284965",
  "discogs_url": "https://www.discogs.com/artist/284965",
  "followers": 79,
  "formed_date": null,
  "genres": [
    "Rock",
    "blues",
    "blues rock",
    "guitar",
    "Texas Blues",
    "electric blues"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/ff/5b/49/ff5b49b7-5d59-8fb3-a901-001d20f29f6e/mzl.bzbetibz.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "f5426431-f490-4678-ad44-a75c71097bb4",
  "lastfm_url": "https://www.last.fm/music/+noredirect/STEVIE+RAY+VAUGHAN+&+DOUBLE+TROUBLE",
  "local_images": {
    "hi-res": "public/artist/stevie-ray-vaughan-double-trouble/stevie-ray-vaughan-double-trouble-hi-res.jpg",
    "medium": "public/artist/stevie-ray-vaughan-double-trouble/stevie-ray-vaughan-double-trouble-medium.jpg",
    "small": "public/artist/stevie-ray-vaughan-double-trouble/stevie-ray-vaughan-double-trouble-small.jpg"
  },
  "name": "Stevie Ray Vaughan & Double Trouble",
  "popularity": null,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features115/v4/ff/5b/49/ff5b49b7-5d59-8fb3-a901-001d20f29f6e/mzl.bzbetibz.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Rock"
      ],
      "id": "601067",
      "name": "Stevie Ray Vaughan & Double Trouble",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/stevie-ray-vaughan-double-trouble/601067"
    },
    "discogs": {
      "id": 284965,
      "original_name": "Stevie Ray Vaughan & Double Trouble",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Stephen \"Stevie\" Ray Vaughan (October 3, 1954 – August 27, 1990) was an American blues-rock guitarist, whose broad appeal made him an influential electric blues guitarist.[1] In 2003, Rolling Stone magazine ranked Stevie Ray Vaughan #7 in its list of the 100 Greatest Guitarists of All Time,[2] and Classic Rock Magazine ranked him #3 in their list of the 100 Wildest Guitar Heroes in 2007.\n\nEarly life\n\nStephen Ray Vaughan was born to Martha and Jimmie Lee Vaughan at Methodist Hospital in Dallas, Texas on October 3, 1954, three years after his brother, Jimmie Vaughan. Stevie's father, whose nickname became \"Big Jim\", was an asbestos worker whose job carried the family to cities across Texas. Wherever there was an opening, the family would pack up and move to another city.\n\nThe Vaughan family finally moved into a small house in Dallas. The tension in the house was high, however, as Big Jim had a temper when he drank alcohol.[citation needed]\n\nBig Jim and Martha loved to dance to Western Swing, and it was the boys' first exposure to music. The Texas Playboys, a country band, would hang out at the Vaughan's house often, and would play dominoes with Big Jim. The Playboys would bring alcoholic beverages to the house and soon led Stevie to sneak sips when nobody was looking. It was at this young age where he started his addiction to alcohol.\n\nWhen Jimmie was 12, after a broken shoulder from playing football, a family friend, Michael Quinn, gave him his first guitar, which had all six strings. Soon after, Stevie got one of his own: a plastic Roy Rogers toy guitar from Sears, with only three strings. Stevie recalls that it also came with a set of blankets.\n\nThe boys taught themselves to play by listening to records, as they weren't interested in guitar lessons. It was the late 60s at the time, the era of Jimi Hendrix, The Yardbirds, and The Beatles, and Jimmie would bring home records of all these new bands to play and listen to. The Vaughan brothers were also drawn to another sound, a raw, emotional music with feeling and soul: the blues. The boys taught themselves the guitar techniques of blues wizards like Albert and B.B. King, Otis Rush, and Buddy Guy.\n\nBy the time he was 15, Jimmie was the lead guitarist in a local cover band called The Chessmen, and played gigs all over Texas. Back home, Stevie kept on practicing. He'd spend hours in his room, and played until he sounded exactly like what he heard.\n\nOne of the first to take notice was Jimmie's band mate in The Chessmen, singer, Doyle Bramhall. When he was picking up Jimmie at the house to go to a gig, he opened a room door and saw young Stevie playing along to Jeff's Boogie by The Yardbirds. He was the first to tell him that he was actually good.\n\n Early career\n\nStevie was playing in rock bands by age 12. His first recording was for a garage rock band called \"A Cast of Thousands\", and his style stood out. He had paying gigs when he entered high school: first with Jimmie's new band, Texas Storm, and then with his own group, Blackbird. Stevie would play late night sets at local bars like.\n\nAfter playing gigs all night, Stevie managed to fall asleep in class so often he flunked music theory. His brother's grades were just as bad. Alarmed by their boys' behavior, Big Jim and Martha tried to stop Jimmie and Stevie's music careers and make them focus on school. It was too late, however, when in 1967, Jimmie moved out of the house and into Doyle's, leaving his brother failing in school, and miserable at home. Stevie decided to take a job washing dishes at the local Dairy Mart. Part of his job was to clean out the trash bin, which required standing on top of 55 gallon barrels with wooden lids that were used for storing grease. One day while cleaning the trash bin, the wooden lid broke on one of the barrels causing him to fall up to his chest in grease. As he climbed out of the barrel, the cooks came out with two fresh vats of hot boiling grease. He was then fired from the job for breaking the wooden lid and decided he instead wanted to pursue his dream of being a guitar player like Albert King in the records he was listening to at the time rather than having any other job.\n\n 1970's\n\nIn early 1971, both Jimmie and Doyle grew tired of the fading music scene in Dallas and moved to Austin to give it another try. A year later, Stevie followed with his band Blackbird. At 17 years old, he dropped out of high school during Christmas break and hit the road.\n\nWhen he first came to Austin, Stevie and his band didn't have much money, so he would sleep on a barroom pool table, but he fit in with the more appreciative music scene on the east side of town. With blues clubs like the Soap Creek Saloon, Vulcan Gas Company, and Antone's, Stevie could trade licks with the blues masters he grew up listening to. Clifford Antone was one of the club owners to take notice and practically begged Albert King to let 17 year old Stevie play guitar with him. After much convincing, he finally said \"Yes!\", and King was blown away when he heard Stevie play the licks that he made up himself.\n\nIt was a dream for Stevie to play and share riffs with these masters, day and night, but making a career in Austin came out to be tougher than he thought.\n\nIn 1973, he joined a promising rock group called Krackerjack, which included future bassist Tommy Shannon that he met after a stint at a club in Dallas called \"The Fog\". Stevie quit when the leader decided they should wear makeup on stage.\n\nThe next year, he was asked to join Marc Benno and the Nightcrawlers, a blues band that included singer Doyle Bramhall. The Nightcrawlers drove from Texas to Los Angeles to record an album, but Benno's record label rejected the tapes, and Stevie traveled back to Texas.\n\nIn 1975, he hooked up with another popular Austin group, Paul Ray and the Cobras, a two-guitar band with Stevie in the background. After two years, they only had one single recorded, and Stevie grew frustrated and quit.\n\nHe was still in the shadow of his big brother. Jimmie's new group, The Fabulous Thunderbirds, were the talk of Austin, and became the house band at Antone's.\n\nIn late 1977, Stevie decided it was time to put together a band of his own called \"Triple Threat\", which included bass player, W.C. Clark, Freddie \"Pharoah\" Walden on drums, and singer Lou Ann Barton. With his hot new band, Stevie could take a step forward and play the blues with energy that set audiences on the edge of their seats. He recalls that some nights he played until the skin on his fingers shredded and had to stick the calluses back on with Super Glue and play more.\n\nOn December 23, 1979, Stevie Vaughan married a tough-minded, Lebanese bombshell named Lenora \"Lenny\" Bailey between sets at the Rome Inn in Austin, TX.\n\nW.C. Clark left Triple Threat in mid-1978, and Stevie renamed the band \"Double Trouble.\" He then asked drummer Chris Layton to join the band. After an embarrassing incident with drunken Lou Ann Barton post show, Stevie was angry and fired her, as he became the new lead singer and guitar player. Around this time, he hired a management company called \"Classic Management\" that consisted of manager Chesley Milikin, and financial assistant, Frances Carr.\n\n         1980's\n\nStevie's drummer at the time, Chris Layton, stayed with Stevie. After almost four years, Jackie Newhouse was dropped from the band in the spring of 1981, and bass player Tommy Shannon decided he wanted in. In turn, he was asked to join Double Trouble.\n\nThe first show with the new trio format band was at Joe Ely's annual Texas Tornado Jam, a music festival featuring a host of local bands held at the Manor Downs Racetrack, just outside of Austin. The Fabulous Thunderbirds were after Stevie and Double Trouble. The whole show was broadcast on TV.\n\nMick Jagger from The Rolling Stones saw a tape of the show and liked what he saw. He asked Stevie and his band to play a private party hosted by The Rolling Stones at the Danceteria club in New York. After the show, Mick and guitar player Keith Richards talked to the band about getting them a record deal. It never went through, however, and they went back to Texas.\n\nJerry Wexler, record executive from Atlantic Records, saw the band playing at a record release party for Lou Ann Barton's new position as singer for Roomful of Blues. He recommended that the band play the Montreux International Jazz Festival in Switzerland. Manager Chesley Milikin put in a call to Claude Nobs, the host of the Montreux Jazz Festival and would be the first unsigned act to perform at the festival.\n\nThe band was booked on a jazz acoustic night, a setup that involved an upright bass, piano, and generally soft music. With the loud and powerful sound that Stevie and Double Trouble had, it shocked the staid crowd. After a few songs, the gig seemed headed for disaster, as some of the audience members booed. Larry Graham, from Sly & The Family Stone was looking forward to an encore with the band, but unfortunately, it never happened.\n\nAs the band was backstage, devastated and disappointed, the performance was appreciated by two celebrities in the audience: pop star David Bowie and musician Jackson Browne. Browne offered the band 72 hours of free studio time at his own studio in downtown Los Angeles. David Bowie also offered Stevie to play on his upcoming album, Let's Dance, co-produced by Nile Rodgers.\n\nTo be able to afford the gasoline to at least drive to Los Angeles all the way from Texas, the band booked a small tour at various clubs like Fitzgerald's in Houston and The Continental Club in Austin. When they finally traveled to Los Angeles during Thanksgiving weekend in 1982, they recorded an album's worth of songs: eight songs the first day, and two the second day. Stevie and the band then went back to Texas and he recorded the vocals at Riverside Sound in Austin.\n\n\n             Fame and success\n\nThe band sent the tapes to legendary talent scout, John Hammond, Sr., a veteran of the record business who discovered Aretha Franklin, Billie Holiday, and Bob Dylan. He liked what he heard and got the band a major contract with Epic Records. The mixed and mastered tapes were morphed into an album called Texas Flood. On June 3, 1983, the album made it to #38 on the Billboard 200 charts, received positive reviews, and sold over 500,000 units. Stevie Ray Vaughan and Double Trouble were an overnight success. The band then embarked on a successful tour for the album.\n\n        Couldn't Stand the Weather\n\nIn mid-December 1983, the band took two weeks off to write new material for a new album. They went to The Power Station in New York City to record in January 1984. The new album took two weeks to record, but finally finished and released the album as Couldn't Stand the Weather. They went on another successful tour and played many TV shows including Solid Gold and Rockpalast.\n\nOn October 4, 1984, Stevie Ray Vaughan and Double Trouble played a show at Carnegie Hall in New York City for his 30th birthday. To celebrate the special occasion, the show would feature two sets: one with him and Double Trouble, and the second with a host of special guests. He originally lined up the Tower of Power horn section and Booker T. Jones to play keyboards. The plan somehow fell through and they were replaced with the Roomful of Blues horn section and New Orleans' very own Dr. John. Also guest starring were drummer George Rains, Stevie's brother Jimmie, and singer Angela Strehli. Friends and family were in the audience as well.\n\nThe whole eleven-piece band wore custom-tailored mariachi suits. Stevie and Double Trouble's suits were made from velvet, custom tailored at Nelda's Tailors in Austin. Chris and Tommy had royal blue suits and Stevie had both ruby red and royal blue made. The horn section had their suits sewn across the border in Neuvo Laredo, Mexico after a pattern that Jimmie Vaughan had on his suit. Stevie designed the staging for the show as well. The stage floor, drum and horn risers were made of 2x4 plywood painted lapis blue enamel with gold lamé striping.\n\nStevie also originally envisioned the project as a full-length video. However, the band already booked studio time in Dallas to record another album, one that would hopefully feature the new direction for the band with the experimentation of the expanded trio. This would make it difficult for Epic to market the video, so the project was shelved and the show was recorded to audio tape instead.\n\nThe band rehearsed for two weeks to prepare for the show. First they rehearsed at a sound stage in Austin called \"Third Coast\". For two consecutive nights in late September, Stevie and all the guests played at the newly-opened Caravan of Dreams in Fort Worth. They then flew to New York and rented a warehouse in the area for a dress rehearsal, where the special staging was constructed. The staging was then stripped down and reconstructed at Carnegie Hall and the band ran through the program a final time. The show started at 8 pm, Thursday night. It was a show none could ever forget.\n\nAfter the show, MTV invited all the guests a local club where the new TV network would throw an after-party. It was official: Stevie Ray Vaughan had hit the big time!\n\nWith several more shows after Carnegie Hall, the band flew to Australia and played two sold-out shows at the Sydney Opera House. Then it was off to New Zealand, with a few concert halls and stadiums on the itinerary. While in New Zealand, Stevie received word that he won two W.C. Handy Blues Awards: one for Entertainer of the Year and one Instrumentalist of the Year. He was the first white person to win both awards. He was presented the awards on November 18, 1984, and jammed with B.B. King, Rufus Thomas, Robert Cray, and Albert King. The ceremony was held at the Orpheum Theatre in Memphis on Beale Street.\n\n                Soul to Soul\n\nBy early 1985, Stevie's performance contract required a fifth of Scotch in his dressing room each night and his cocaine habit rose to 4 grams/day. After late-night parties, he would dissolve the cocaine in Crown Royal whiskey for a \"pick-me-up\" and hangover cure.\n\nStevie and Double Trouble went to the Dallas Sound Labs in March 1985. After a couple of weeks of trying to come up with new material, it became evident that Stevie Ray Vaughan and Double Trouble needed a stronger rhythm section. Desperate, he got in touch with, Reese Wynans, an ace keyboard player who was playing with Delbert McClinton at the time.\n\nOn April 10, 1985, Stevie Ray was asked to play The Star Spangled Banner on opening day at the Houston Astrodome. Unfortunately, he didn't get a good audience response, as he played his rendition with slide guitar work.\n\nThe new quartet finished the album in May 1985 and was named Soul to Soul. The album was released on September 30, 1985, but lacked the fire and bite of previous albums.\n\nBy 1986, the band was touring the world non-stop, and Stevie's cocaine habit rose to 7 grams a day. Sometimes they'd share the bill with The Fabulous Thunderbirds.\n\nBoth bands were on tour in New Zealand when Stevie saw a group of schoolgirls walking back to a nearby hotel. He honed in on one girl in particular: model Janna Lapidus. Strikingly beautiful with dark hair and olive skin, her parents flew from Russia when she was a child. Stevie met Janna when she was 17 and took her with him on tour in Australia.\n\n                 Live Alive\n\nIn mid-1986, Stevie and Double Trouble were told that they'd have to record another album. As this was the last thing that the band wanted to do, they decided to record a live album. It would be simple: they book shows at the Austin Opera House and the Starfest in Dallas and everything would turn out great.\n\nIt didn't prove to be easy, however, as many of the recordings were flooded with technical difficulties and touch-ups or errors that needed to be corrected. The band started booking studio time to overdub drums or vocals, surely the worst way to record a live album.\n\nStevie's marriage to Lenny was also on the verge of collapse. His fame, fortune, success and attention pushed her to the sidelines, and she reacted bitterly. One night after a long stretch on the road, he came home to find their house in Austin padlocked, electricity shut off, their dog gone, and Lenny nowhere to be found. As a result, it escalated Stevie's cocaine and alcohol abuse.\n\nStevie then moved to Los Angeles where he moved in with an old Austin acquaintance, Timothy Duckworth, who later became Stevie's personal assistant.\n\n\"Live Alive\" was released on November 30, 1986.\n\nOn August 27, 1986, Stevie and Jimmie's father died from heart failure, complications from Parkinson's disease. The boys rushed home to comfort their mother, but there was little time to mourn over the death of their father. A funeral was held three days later, and when it was done, a jet rushed Stevie back on the road with Double Trouble.\n\nA month later on tour in Europe, the hardcore addictive lifestyle finally caught up with Stevie. Drummer Chris Layton recalls being out in the street with Stevie when he suddenly dropped to his knees and acted confused, then began retching blood and bile. He said he needed a drink, but no drug stores were open. Composing himself, the two walked back to their hotel in Ludwigshafen. Then Stevie began shaking, sweating and his eyes \"were like the eyes of a dead animal.\" When the animation came back into his eyes, he sat up and quietly said, \"I need help.\" Chris called an ambulance; the paramedics later described the trip to the hospital as a near death dehydration. Stevie was admitted under the care of Dr. Victor Bloom in London, the same doctor who helped Eric Clapton kick his addiction to heroin. Bloom monitored Stevie overnight to see his stomach reactions; it turned out that the whiskey was eating away his stomach lining, and the cocaine was crystallizing again and eating into his intestines.\n\n             Rehabilitation\n\nAfter a failed attempt to get sober in London, he asked his mother to fly the band to Atlanta, Georgia, where Stevie checked into Peachford Hospital, and Tommy checked into a hospital in Austin; both men spent a month in the Charter treatment program.\n\nStevie made a phone call to his wife Lenny, asking her to visit him in rehab and rework their marriage but she refused. In turn, he filed for a divorce, but wasn't finalized until June 1988, due to a delay in an agreement between Stevie and Lenny.\n\n                  Recovery\n\nBy late 1986, Stevie Ray Vaughan and Double Trouble went back on the road with confidence and energy as Stevie and Tommy now played clean and sober.\n\nOn February 28, 1987, the band played MTV Mardi Gras in New Orleans with The Fabulous Thunderbirds. Both groups were interviewed as well and the whole occasion was broadcast on television.\n\nStevie also made an appearance with B.B. King for an HBO special that was broadcast at the Ebony Showcase Theater in Los Angeles, California on April 15, 1987. It was a lineup that included B.B. King, Albert King, Eric Clapton, Paul Butterfield (who died only a few weeks later), Phil Collins, Gladys Knight, and Etta James.\n\nStevie Wonder hosted a TV special called \"Characters\", in which a number of musical guests came to perform various hits of Wonder's. Stevie Ray played with Wonder on \"Superstition\" and \"Come Let Me Make Your Love Come Down\" and was broadcast in April 1988.\n\nStevie wanted to help others recover and overcome their problems with alcohol or drugs, as during the song \"Life Without You\", he would often speak to the audience about recovering and being there for others when they need love.\n\nOn the road, he would attend Alcoholics Anonymous (A.A.) meetings regularly, sharing the lessons of his ordeal.\n\n                 In Step\n\nBy 1988, the band was ready to return to the recording studio. For the new record, they traveled to Memphis to record in Ardent Studios, a pro recording studio that has such clientele as ZZ Top, Tina Turner, and Led Zeppelin. Together, old friend Doyle Bramhall and Stevie began writing songs about walking the tightrope to recovery, including \"Tightrope\", \"Wall of Denial\", and \"Crossfire\".\n\nThe album was named appropriately, \"In Step\", released on June 6, 1989. \"Crossfire\" reached the #1 position on the Mainstream Rock Charts. It was the only hit single that they ever had.\n\nIn the spring of 1990, Stevie and his brother recorded an album together, one that would feature the music they had grown up with. They recorded at Ardent Studios in Memphis and was produced by Nile Rodgers. Both brothers decided to name it \"Family Style\".\n\nIn the summer of 1990, Stevie and Double Trouble went on tour with British soul singer Joe Cocker, touring places like Alaska and the Benson & Hedges Blues Festival.\n\n               Death\n\nTo finish off the summer leg of the \"In Step\" tour, Stevie Ray Vaughan and Double Trouble played two shows on August 25 & 26 at Alpine Valley Music Theatre in East Troy, WI, a couple of miles away from the ski resort. The shows also featured Eric Clapton and Robert Cray with The Memphis Horns.\n\nAfter Double Trouble's set at the final show, Stevie & Jimmie (with wife Connie) originally planned to return to Chicago by automobile. Bass player Tommy Shannon and keyboardist Reese Wynans had already left. The venue was difficult to reach via highway and Stevie wanted badly to get back to Chicago so he could talk to his girlfriend, Janna Lapidus, in New York City. She was modeling and staying with him at the time.\n\nTour manager Skip Rickert had rented helicopters with Omni Flights to beat the congested traffic on highways going back to Chicago. Most of the places had been reserved by Eric Clapton's entourage, but one seat was free, which Stevie took.\n\nThe helicopters departed at 12:44 a.m into a thick fog. Just past the landing zone was a 200-foot hill. Stevie's helicopter was piloted by Jeffrey Browne, who was unfamiliar with the flight pattern for exiting the area. He guided the helicopter to about half of the altitude needed to clear the hill before crashing into it. The force of the impact scattered various pieces of the aircraft over a 200-foot area. The coroner's report stated Stevie died of severe loss of blood due to a rupture of the aorta, resulting from the force of impact.\n\nAs the other helicopters flew past, no one suspected anything was wrong. Several hours would pass before anyone signaled the flight had failed to arrive in Chicago. The search for wreckage began around 5 a.m. Hours later, word started to spread that a musician has been killed, and that the musician was in fact Stevie. At 7 a.m., Eric Clapton and Jimmie Vaughan were called to the site to identify the victims. Jimmie saw Stevie's bolero hat and was instantly shaken and devastated, so much so he returned to the car. A short time later, somebody knocked on the window and handed him Stevie's Coptic cross.\n\nA sad and strange coincidence for the Vaughan family was that Stevie Ray died exactly four years to the day after his father.\n\nOn August 31, 1990, funeral services were held for Ray Vaughan in his hometown of Oak Cliff. Thousands of friends, musicians, family members who knew him gathered to say goodbye. Among the mourners were all three members of ZZ Top, Bonnie Raitt, Stevie Wonder, Jackson Browne, Janna Lapidus, mother Martha Vaughan, and Jimmie Vaughan. Stevie is now at rest in Laurel Land Cemetary in Dallas, Texas.\n\n            Legacy\n\nVaughan memorial at Lady Bird Lake, in Austin, Texas.\n\nSeptember 1990 saw the release of Family Style.\n\nThe 1991 album The Sky Is Crying was the first of several posthumous Vaughan releases to achieve chart success. Jimmie Vaughan later co-wrote and recorded a song in tribute to his brother and other deceased blues guitarists, titled \"Six Strings Down\".\n\nThe 1991 album of Bonnie Raitt, Luck of the Draw, was dedicated to him.\n\nMany other artists recorded songs in remembrance of Vaughan, including Eric Johnson,[3] Buddy Guy and Steve Vai (\"Jibboom\" on the album The Ultra Zone, 1999).\n\nIn 1991, Texas governor Ann Richards proclaimed October 3, Vaughan's birthday, to be \"Stevie Ray Vaughan Day.\" An annual motorcycle ride and concert in Central Texas benefits the Stevie Ray Vaughan Memorial Scholarship Fund.[4]\n\nIn 1992, the Fender Musical Instruments Corporation released the Stevie Ray Vaughan Signature Stratocaster, which Vaughan had helped design. As of 2007, the model is still in production. In 2004, Fender also released a limited edition exact replica of \"Number One\".[5]\n\nStevie Wonder included a song on his 1995 live album Natural Wonder titled \"Stevie Ray Blues\". On the album, Wonder refers to the song as \"Stevie Ray Vaughan Blues\".\n\nStephen King's short story \"You Know They Got a Hell of a Band\" concerns a small town called Rock and Roll Heaven that's populated by late rock musicians, one of whom is Vaughan.\n\nIn 1994, the city of Austin erected the Stevie Ray Vaughan Memorial Statue at Auditorium Shores on Lady Bird Lake,( [show location on an interactive map] 30°15′47.1774″N 97°45′2.4228″W﻿ / ﻿30.263104833°N 97.750673°W﻿ / 30.263104833; -97.750673) the site of a number of Vaughan's concerts. It has become one of the city's most popular tourist attractions.\n\nIn 2000, Stevie Ray Vaughan was inducted into the Blues Hall of Fame.\n\nThe last guitar that Vaughan played before his death is on display in the Hard Rock Cafe in Gatlinburg, Tennessee.\n\nIn November 2007, Fender Musical Instruments Corporation released a second tribute to Vaughan, an exact replica of his second beloved guitar: Lenny. This guitar was given to him by his wife Lennora (\"Lenny\") on his 26th birthday and Vaughan was very fond of it. According to Fender, the original Lenny was a 1965 Strat that he saw in the window of a pawn shop that he was unable to afford. The guitar is sold with a strap, a case with Vaughan's name embroidered in the fabric lining, a number of brochures and memorabilia and a leather bound certificate of authenticity.\n\n        \"A little over four years ago on June 24, 2004 Lenny was put up for auction and was sold to Guitar Center for $629,500. \"[1]\n\nAlso in November 2007, Sony BMG, Epic Records, and Legacy Records released the CD Stevie Ray Vaughan & Friends: Solos, Sessions & Encores.\n\nStevie Ray Vaughan became eligible for the Rock and Roll Hall of Fame in 2008.[6]\n\nIn 2008, residents voted to rename Dallas' Industrial Boulevard, with Vaughan's name being one of the finalists alongside Stanley Marcus, Eddie Bernice Johnson, and Cesar Chavez. [2]\n\nHis music has been used in the popular Guitar Hero series featuring Texas Flood and Pride And Joy.\n\nHarmonix has also announced that Stevie's album Texas Flood will be released for download for its popular Rock Band video game.[3]\n\n             Personal life\n\nStevie Ray had several girlfriends in his early career, one of them being Lindi Bethel. \"Pride and Joy\" was influenced by Lindi when he wrote it.\n\nStevie married Lenora \"Lenny\" Bailey on December 23, 1979 between sets at the Rome Inn in Austin, TX. They divorced in 1988.\n\nStevie and model Janna Lapidus met each other in New Zealand in March 1986. They remained a couple until his death.\n\nHe did not have any children.\n\nMusical influences and style:\n\nVaughan's blues style was strongly influenced by many blues guitarists. Foremost among them were Albert King, who dubbed himself Stevie's \"godfather,\" Otis Rush, Eric Clapton, Buddy Guy, and Jimi Hendrix. The song \"Rude Mood\" is a direct derivative (according to Vaughan himself) of a Lightnin' Hopkins tune called \"Lightning Sky Hop.\" He was also strongly influenced by early blues-rock guitarist Lonnie Mack, who, according to Vaughan, \"really taught me to play guitar from the heart\" (Davis, History of the Blues, DaCapo 2003, p. 246). Vaughan, who had idolized Mack since childhood, produced and played on Mack's 1985 Alligator Records album Strike Like Lightning[7] and covered \"Wham!\" which was written by Mack, as well as playing on a Mack tune from the 1980s, \"If You Have To Know.\" \"Scuttle Buttin'\" was influenced by one of Mack's songs \"Chicken Pickin'\". Vaughan's brother Jimmie Vaughan has stated that Johnny \"Guitar\" Watson was the guitarist he and Stevie studied the most.\n\nVaughan's sound and playing style, which often incorporated simultaneous lead and rhythm parts, drew comparisons to Hendrix; Vaughan covered several Hendrix tunes on his studio albums and in performance, such as \"Little Wing,\" \"Voodoo Child (Slight Return),\" and \"Third Stone from the Sun.\" Some blues greats say that \"Vaughan can play Hendrix better than Hendrix himself.\" He was also heavily influenced by Freddie King, another Texas bluesman, mainly in the use of tone and attack; King's heavy vibrato can clearly be heard in Vaughan's playing. Another stylistic influence was Albert Collins. By utilizing his index finger as a pick a la Albert Collins, he was able to coax various tonal nuances from his amplifiers.\n\nKnown for his warm blues-rock tone, Vaughan characteristically used very heavy strings on his guitar ranging from 13 to 58-gauge sets to give a fuller sound which he tuned down a half-step to the key of E flat.\n\nMusicians such as John Mayer, Robert Randolph, Kenny Wayne Shepherd, Colin James, Jonny Lang, Los Lonely Boys, Mike McCready, Eric Johnson, John Petrucci, and Doyle Bramhall II have cited Vaughan as an influence.\n\n\n <a href=\"https://www.last.fm/music/+noredirect/STEVIE+RAY+VAUGHAN+&+DOUBLE+TROUBLE\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Stephen \"Stevie\" Ray Vaughan (October 3, 1954 – August 27, 1990) was an American blues-rock guitarist, whose broad appeal made him an influential electric blues guitarist.[1] In 2003, Rolling Stone magazine ranked Stevie Ray Vaughan #7 in its list of the 100 Greatest Guitarists of All Time,[2] and Classic Rock Magazine ranked him #3 in their list of the 100 Wildest Guitar Heroes in 2007.\n\nEarly life\n\nStephen Ray Vaughan was born to Martha and Jimmie Lee Vaughan at Methodist Hospital in Dallas <a href=\"https://www.last.fm/music/+noredirect/STEVIE+RAY+VAUGHAN+&+DOUBLE+TROUBLE\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 23567,
      "mbid": "f5426431-f490-4678-ad44-a75c71097bb4",
      "name": "STEVIE RAY VAUGHAN & DOUBLE TROUBLE",
      "playcount": 421986,
      "similar_artists": [],
      "tags": [
        "blues",
        "blues rock",
        "guitar",
        "Texas Blues",
        "electric blues"
      ],
      "url": "https://www.last.fm/music/+noredirect/STEVIE+RAY+VAUGHAN+&+DOUBLE+TROUBLE"
    },
    "spotify": {
      "followers": 79,
      "genres": [],
      "id": "4qT2EJ5diHFTjv1FBz9NsH",
      "images": [],
      "name": "Stevie Ray Vaughan & Double Trouble",
      "popularity": 0,
      "url": "https://open.spotify.com/artist/4qT2EJ5diHFTjv1FBz9NsH"
    }
  },
  "spotify_id": "4qT2EJ5diHFTjv1FBz9NsH",
  "spotify_url": "https://open.spotify.com/artist/4qT2EJ5diHFTjv1FBz9NsH",
  "updated_at": "2025-07-05T15:45:20.697935",
  "wikipedia_url": null
}