{
  "apple_music_id": "100065",
  "apple_music_url": "https://music.apple.com/gb/artist/curve/100065",
  "biography": "Curve were an English alternative rock and electronica duo from London, formed in 1990 and split in 2005. The band consisted of Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, drums, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. An important collaborator was the producer Alan Moulder, who helped them to shape their blend of heavy beats and densely layered guitar tracks set against Halliday's vocals. \nCurve released five studio albums (Doppelgänger in 1992, Cuckoo in 1993, Come Clean in 1998, Gift in 2001, and The New Adventures of Curve in 2002), five compilation albums (Pubic Fruit in 1992, Radio Sessions in 1993, Open Day at the Hate Fest in 2001, The Way of Curve in 2004, and Rare and Unreleased in 2010), and a string of EPs and singles. \n\nHistory:\nDean Garcia, half Hawaiian and half Irish, had played in some small bands when he auditioned for Eurythmics. The English Toni Halliday met Dave Stewart of Eurythmics after he had read a rock magazine interview with her in which she praised his pre-Eurythmics band, The Tourists. Halliday and Garcia were introduced to each other by Stewart. Garcia had played bass guitar as part of Eurythmics' live band in 1983-84 and on two of their studio albums, while Halliday was signed to Stewart's Anxious Records label as a solo artist. The pair formed an ill-fated group named State of Play in the mid-1980s before parting ways, embarking on a no less ill-fated solo career (Halliday) and further stints as a backing musician (Garcia), and then reuniting for a more long-term partnership in Curve. \nAs Curve, Halliday and Garcia released three acclaimed and increasingly successful EPs (Blindfold, Frozen, and Cherry) throughout 1991 on Anxious Records. They also made an impact on the UK album charts in 1992 with their debut studio album Doppelgänger. The group toured extensively during this period, with Halliday and Garcia being supported on stage by two additional guitarists (Debbie Smith, later of Echobelly, and Alex Mitchell) and a drummer (Steve Monti, formerly of Ian Dury and the Blockheads). Highlights of Curve's live career included a performance at the 1992 Glastonbury Festival, and a package tour of the United States with The Jesus and Mary Chain and Spiritualized. \nIn 1992, the band released the compilation album Pubic Fruit, containing their first three EPs and an extended mix of the single \"Faît Accompli\". Toni Halliday also featured on two songs (\"Edge to Life\" and \"Bloodline\") from Recoil's album, Bloodline. In 1993, Curve issued Radio Sessions, a compilation album of recordings made during their two sessions for John Peel's show on the UK broadcasting station BBC Radio 1. \nCurve's second studio album, the harder-edged Cuckoo (1993), did not repeat the UK Top 20 success of the band's debut. That coupled with the stressfulness of the tour in support of the record, may have contributed to Halliday and Garcia's decision to disband the group in 1994. \"It got to the point where Dean didn't want to tour,\" Halliday told Select magazine (August 1996 edition). \"We did reach that point of hedonistic head-fuckery: glugging JD, hollering, 'Where's the schnozz?' You finally get that out of your system and think, 'This is sad.' We couldn't have gone on like that.\" \n\nDuring their hiatus, Halliday formed the band Scylla and Garcia began a solo project under the name Headcase. Scylla's track \"Helen's Face\" was featured on the Showgirls soundtrack. Halliday also collaborated with The Future Sound of London for the song \"Cerebral\" from Lifeforms (1994), with Freaky Chakra for the song \"Budded on Earth to Bloom in Heaven\" from Lowdown Motivator (1995), and with Leftfield for their #18 UK hit \"Original\" from Leftism (1995). She also featured on \"Original\"'s music video. \nCurve returned to the music business in 1996 with the EP Pink Girl With the Blues. In the same year, Curve collaborated with Paul Van Dyk by reworking the mostly instrumental song \"Words\" from the album Seven Ways and also adding Halliday's vocals. \nIn 1997, they released \"Chinese Burn\", the first single to be taken from their third studio album Come Clean (1998). The album is a set of songs displaying a more pronounced influence of electronic music than earlier releases. Come Clean was met with a certain amount of acclaim and commercial success, which encouraged the group to continue their recording career. Curve continued to do small-scale live shows in and around Europe. \nThe follow-up to Come Clean was an internet-only compilation titled Open Day at the Hate Fest which was released in 2001. Also in the same year, Curve issued Gift, their fourth studio album. Kevin Shields of My Bloody Valentine also played guitar on the songs \"Want More Need Less\" and \"Perish\". The opening song \"Hell Above Water\" has gained the highest public profile as a result of its use in trailers for the 2002 film Spider-Man and the 2008 film Iron Man. \nIn 2002, Curve released the internet-only fifth studio album The New Adventures of Curve and various download-only tracks via their official site. In 2003, Toni Halliday collaborated with the industrial rock Japanese band Acid Android on the song \"Faults\" from the album with the same name. \nA two-CD retrospective compilation entitled The Way of Curve summarized the group's output in 2004. The first disc included the band' singles. The second disc contained a selection of B-sides, rarities and remixes. In early 2005, Halliday announced that she had left Curve for good. \nIn 2010, Curve published some of their most important releases as digital downloads on their Bandcamp page, including a new compilation with 39 songs entitled Rare and Unreleased. \n\nPost-Curve projects:\n\nToni Halliday:\nToni Halliday featured on The Killers' 2006 Christmas track \"A Great Big Sled\". This song was later included in the 2011 compilation (RED) Christmas EP. \nOn 27 February 2008, she introduced on MySpace a new solo project called Chatelaine. A number of tracks could be previewed, and were credited to Halliday/Dowd/Salmon, and its MySpace blog declared that a new album was being worked on. \nChatelaine's debut album Take a Line For a Walk was released in 16 June 2010. It featured nine new tracks: \"Broken Bones\", \"Oh Daddy\", \"Life Remains\", \"Stripped Out\", \"Shifting Sands\", \"Killing Feeling\", \"Take a Line For a Walk\", \"Head To Head\" and \"Seen and Lost\". \nIn 2012, Halliday contributed vocals to Orbital's soundtrack for remake of the film Pusher. \n\nDean Garcia:\nDean Garcia is currently a member of the band SPC ECO with his daughter Rose Berlin and Joey Levenson (2007-present). In February 2009, SPC ECO released their first album, 3-D, through their website and via Collide's label Noiseplus Music. 3-D was followed by the albums You Tell Me in 2011 and Dark Notes in 2012. \nGarcia is also member of the bands The Black Holes (with Jo Neale; 2007-present), The Chronologic (2006-present), Inkraktare (with Mark Wallbridge aka Vasko The Pig; 2009-present),The Secret Meeting (with kaRIN and Statik of Collide; 2007-present),KGC (with Sascha Konietzko and Lucia Cifarelli of KMFDM; 2006-present) and Morpheme (2010-present). \nGarcia's newest project Morpheme is a collaboration with Perry Pelonero (Clenched Fist, Skylight, Bliss City East), and Kim Welsh (Skylight, Bliss City East). On 8 December 2010, Morpheme released their first track, Infection and on 5 May 2011, they released their second track, Stratosphere on their debut single Infection. \nDean Garcia has also released a solo album on 1 January 2011, entitled How Do You Feel?, with special guests Vasko the Pig, Todd Astromass and Jeff Beck. \n\nMusic style and influences:\nStephen Thomas Erlewine of Allmusic described Curve's style as as a \"towering monolith of guitar noise, dance tracks, dark goth, and airy melodies\". He also regarded the band's music as a combination of \"shoegazer atmospherics and techno beats\". \nCurve has been inspired by My Bloody Valentine,Cocteau Twins,Killing Joke, Eurythmics,Colourbox,The Cure, and The Jesus and Mary Chain. \nToni Halliday has occasionally commented on the comparisons between Curve and Garbage, stating in an 1996 interview with Volume magazine, that she could \"see bits of Garbage in what we've done, just like we see bits of Sonic Youth or the Valentines or really any band that was doing something supposedly outside the norm. In a way it's very flattering to be tied in with (Garbage drummer and co-producer) Butch Vig, not just because he's a brilliant human being, but because he's a brilliant producer, and he's worked on some of our favourite records. But eventually Garbage are a pop band, and Curve were never a pop band\". \nHalliday has, on other occasions, also offered contrasting opinions. Interviewed by Cosmik Debris Magazine in 2001, she reminisced on how \"Curve had put records out and we always thought they were nice little pop albums full of nice little pop songs. I've always thought that Curve have made great pop. It might come in a different guise to what people presume is pop, you know, like... it doesn't sound like Backstreet Boys pop, but still, there's melody there, and there are hooks, and we've done that on every record we've ever made. ... We've been called 'goth' in England, and we've been called 'noise merchants' and the whole gamut of labels, but not once have we been called a pop band, and I'd really like to be called that\". \n\nBand members:\n\nOfficial members:\nToni Halliday (born 5 July 1964 in Parsons Green, Fulham, England) - vocals, occasionally guitar, \nDean Garcia (born 3 May 1958) - bass, guitar, drums, programming, \n\nTouring members:\nDebbie Smith - guitar (from 1991 until 1994), \nAlex Mitchell - guitar (from 1991 until 1994), \nRob Holliday - guitar (Come Clean era), \nSteve Monti - drums, \nStephen Spring - drums, \n\nEquipment:\nA detailed gear diagram of Dean Garcia's 2002 Curve bass rig is well-documented., \nA detailed gear diagram of Rob Holliday's 2002 Curve guitar rig is well-documented., \nOn YouTube, there's a video available with Alan Moulder working in Curve' recording studio., \nAn in-depth interview with Dean Garcia and Toni Halliday from 2002 that covers their live gear as well as their recording methods at their studio, Todal Studios.",
  "country": null,
  "created_at": "2025-07-05T15:21:21.683565",
  "discogs_id": "5373",
  "discogs_url": "https://www.discogs.com/artist/5373",
  "followers": 47356,
  "formed_date": null,
  "genres": [
    "Electronic",
    "shoegaze",
    "dream pop",
    "electronic",
    "alternative",
    "female vocalists",
    "indie",
    "Alternative Rock"
  ],
  "id": "curve-1751725282",
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/07/b2/c2/07b2c246-07c2-ef18-3021-cb517fffe3d2/mzi.zogvweul.jpg/2000x2000ac.jpg",
      "width": 2000
    },
    {
      "height": 1497,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/e4c0849f33e49989dc29ad31940411870a5491a4",
      "width": 1000
    },
    {
      "height": 958,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/63718ceeb7ef296f84fd1a898ebe5299aa0fae37",
      "width": 640
    },
    {
      "height": 299,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/276abc39d5e9d5fa2e7dc91b79b3cef9be1f609c",
      "width": 200
    },
    {
      "height": 96,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/87153f5028b03b3a41810e13cee115229f6fbbc8",
      "width": 64
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": 1000,
      "type": "artist",
      "url": "https://r2.theaudiodb.com/images/media/artist/thumb/zdpyq71694601252.jpg",
      "width": 1000
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/euf2jy1694601574.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ah7po01694602315.jpg",
      "width": 1920
    },
    {
      "height": 1080,
      "type": "fanart",
      "url": "https://r2.theaudiodb.com/images/media/artist/fanart/1fs7331694602334.jpg",
      "width": 1920
    },
    {
      "height": 185,
      "type": "banner",
      "url": "https://www.theaudiodb.com/images/media/artist/banner/tx7piv1694602767.jpg",
      "width": 1000
    },
    {
      "height": 155,
      "type": "logo",
      "url": "https://www.theaudiodb.com/images/media/artist/logo/curve-5e8c84c456dd3.png",
      "width": 400
    }
  ],
  "lastfm_mbid": "9bb90124-a5e3-4d5b-baa9-87d7615c4ebc",
  "lastfm_url": "https://www.last.fm/music/Curve",
  "local_images": {
    "hi-res": "../public/artist/curve/curve-hi-res.jpg",
    "medium": "../public/artist/curve/curve-medium.jpg",
    "small": "../public/artist/curve/curve-small.jpg"
  },
  "name": "Curve",
  "popularity": 30,
  "raw_data": {
    "apple_music": "ArtistAppleMusicData(id='100065', url='https://music.apple.com/gb/artist/curve/100065', name='Curve', artwork_url='https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/07/b2/c2/07b2c246-07c2-ef18-3021-cb517fffe3d2/mzi.zogvweul.jpg/2000x2000ac.jpg', genres=['Electronic'], origin='', born_or_formed=None, editorial_video_url=None, editorial_notes=None, raw_data={'id': '100065', 'type': 'artists', 'href': '/v1/catalog/gb/artists/100065', 'attributes': {'name': 'Curve', 'genreNames': ['Electronic'], 'artwork': {'width': 600, 'height': 600, 'url': 'https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/07/b2/c2/07b2c246-07c2-ef18-3021-cb517fffe3d2/mzi.zogvweul.jpg/{w}x{h}ac.jpg', 'bgColor': '7d3d1c', 'textColor1': 'f8f5f3', 'textColor2': 'f1ebe8', 'textColor3': 'dfd0c8', 'textColor4': 'dac8bf'}, 'url': 'https://music.apple.com/gb/artist/curve/100065'}, 'relationships': {'albums': {'href': '/v1/catalog/gb/artists/100065/albums', 'data': [{'id': '390862009', 'type': 'albums', 'href': '/v1/catalog/gb/albums/390862009'}, {'id': '456787519', 'type': 'albums', 'href': '/v1/catalog/gb/albums/456787519'}, {'id': '1790183391', 'type': 'albums', 'href': '/v1/catalog/gb/albums/1790183391'}]}}})",
    "discogs": {
      "cover_image": "",
      "id": "5373",
      "images": [],
      "members": [],
      "name": "Curve",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "5373",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/5373"
      },
      "resource_url": "https://api.discogs.com/artists/5373",
      "thumb": "",
      "url": "https://www.discogs.com/artist/5373",
      "urls": []
    },
    "lastfm": "ArtistLastFmData(name='Curve', url='https://www.last.fm/music/Curve', mbid='9bb90124-a5e3-4d5b-baa9-87d7615c4ebc', listeners=210902, playcount=4139201, bio_summary='1. Curve was an alternative rock/electronic duo formed in 1990 in England, United Kingdom. The band members were Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. Their sound is a blend of alternative rock, shoegaze and electronic music.\\n\\nHalliday and Garcia were introduced to each other by Dave Stewart of Eurythmics. Dean <a href=\"https://www.last.fm/music/Curve\">Read more on Last.fm</a>', bio_content='1. Curve was an alternative rock/electronic duo formed in 1990 in England, United Kingdom. The band members were Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. Their sound is a blend of alternative rock, shoegaze and electronic music.\\n\\nHalliday and Garcia were introduced to each other by Dave Stewart of Eurythmics. Dean Garcia had played bass guitar as part of Eurythmics\\' live band in 1983–84 and on two of their studio albums, Touch and Be Yourself Tonight. Toni Halliday was signed to Stewart\\'s Anxious Records label as a solo artist. She also sang with The Uncles and Bonk in the early 1980s. \\n\\nToni Halliday and Dean Garcia briefly formed the unsuccessful group State of Play in the late 1980s before parting ways. She attempted a solo career, releasing the album Hearts & Handshakes in 1989. The album was produced by Toni Halliday and Alan Moulder, who later got married. Alan Moulder also produced music for artists like Depeche Mode, Nine Inch Nails and My Bloody Valentine. \\n\\nIn 1991, Halliday reunited with Garcia to form Curve. Their alchemy the second time around created sonically charged music, setting heavy beats and Garcia\\'s densely-layered guitar tracks and feedback against Halliday\\'s airy vocalization of lyrics that frequently explore such topics as alienation, addiction and love on the wane. Curve released three acclaimed EPs throughout 1991 on Stewart\\'s label Anxious Records: Blindfold EP, Frozen and Cherry. These EPs will be included on the compilation Pubic Fruit, issued a year later. \\n\\nIn 1992, Curve released their debut album Doppelgänger. The group also toured extensively during this period, with Halliday and Garcia being supported on stage by the additional guitarists Debbie Smith and Alex Mitchell, plus the drummer Steve Monti. Songs such as \"Horror Head\", \"Coast Is Clear\" and \"Faît Accompli\" brought them critical acclaim and built a solid fanbase for the group.\\n\\nTheir sophomore studio album, Cuckoo, was issued in 1993. The album was a musically more varied but significantly darker release than their debut. On their first two albums, Curve worked with producer Flood (U2, Smashing Pumpkins). Also in 1993, it saw the light of the day the live compilation Radio Sessions.\\n\\nAfter nearly a decade and a half of partnership the band split in 1994. During their hiatus, Halliday formed the band Scylla. Their track \"Helen\\'s Face\" was featured on the Showgirls soundtrack. Garcia began a solo project under the name Headcase.\\n\\nToni Halliday also collaborated with other artists, most notably with Leftfield on the track \"Original\", with Recoil on two songs, \"Edge to Life\" and \"Bloodline\" from Bloodline, with The Future Sound of London on the song \"Cerebral\", with Paul van Dyk on \"Words (Curved Headcase Mix)\" and with DJ? Acucrack on the song “So To Speak”.\\n\\nIn 1996, the single \"Pink Girl With the Blues\", marked Curve\\'s official return, followed by the EP Chinese Burn. In 1997, the band released their fourth studio album Come Clean. Curve also contributed the track \"Nowhere\" to Greg Araki\\'s movie of the same name. Halliday married producer Alan Moulder.\\n\\nIn 2001, the band released on the internet the compilation Open Day at the Hate Fest. This album contained music recorded by Curve since their reformation in 1996. In the same year, the band released the critically acclaimed album Gift. The single \"Hell Above Water\" has gained the highest public profile as a result of its use in trailers for the 2002 film Spider-Man and the 2008 film Iron Man.\\n\\nTheir final album was 2002\\'s The New Adventures of Curve, released only over the internet. In 2004 The Way of Curve, a best-of compilation was released, featuring their most popular songs and singles, as well as rare B-sides and fan favorites. Halliday announced on their official web site in early 2005 that the group split again. \\n\\nAfter the split, Toni Halliday started a solo project entitled Chatelaine and released the album Take a Line For a Walk in 2010. \\n\\nDean Garcia founded SPC ECO in 2007 with his daughter Rose Berlin on lead vocals, and guitarist Joey Levenson; and welcomed the addition of guitarist Perry Pelonero in 2011. Garcia is also currently a member of the bands The Black Holes (with Jo Neale; 2007-present), The Chronologic (2006-present), Inkraktare (with Mark Wallbridge aka Vasko The Pig; 2009-present), The Secret Meeting (with kaRIN and Statik of Collide; 2007-present), KGC (with Sascha Konietzko and Lucia Cifarelli of KMFDM; 2006-present) and Morpheme (with Perry Pelonero and Kim Welsh of Bliss.City.East, Skylight and Clenched Fist; 2010-present). \\n\\nIn 2011, SPC ECO released the Big Fat World EP; and the album  You Tell Me which includes a track titled Let It Out -- an updated version of Curve\\'s Something Familiar from the album Come Clean. Morpheme released their debut single INFECTION // SINGLE and the RED DOG EP; and Garcia released a solo album entitled How Do You Feel ?, with special guests Mark Wallbridge, Todd Astromass and Jeff Beck.\\n\\n\\nOfficial sites:\\nhttp://curve.co.uk\\nhttp://curve.bandcamp.com\\nhttp://on.fb.me/CurveOfficialManagedByDean\\n\\n2. Starting in the early 2000\\'s, Japanese curve was a two piece for much of their existence, only gaining a third member with their most recent album. They\\'ve also had quite a bit of exposure throughout the world, touring through Malysia/Singapore and appearing on a split in the USA.\\n\\nOfficial Site\\nhttp://www.curve-official.com/ <a href=\"https://www.last.fm/music/Curve\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.', tags=['shoegaze', 'electronic', 'alternative', 'female vocalists', 'indie'], similar_artists=[{'name': 'SPC ECO', 'url': 'https://www.last.fm/music/SPC+ECO'}, {'name': 'Catherine Wheel', 'url': 'https://www.last.fm/music/Catherine+Wheel'}, {'name': 'Chapterhouse', 'url': 'https://www.last.fm/music/Chapterhouse'}, {'name': 'Adorable', 'url': 'https://www.last.fm/music/Adorable'}, {'name': 'Lush', 'url': 'https://www.last.fm/music/Lush'}], images=[{'size': 'small', 'url': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'medium', 'url': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'large', 'url': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'extralarge', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': 'mega', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}, {'size': '', 'url': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png'}], top_albums=[], top_tracks=[], raw_data={'artist': {'name': 'Curve', 'mbid': '9bb90124-a5e3-4d5b-baa9-87d7615c4ebc', 'url': 'https://www.last.fm/music/Curve', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}], 'streamable': '0', 'ontour': '0', 'stats': {'listeners': '210902', 'playcount': '4139201'}, 'similar': {'artist': [{'name': 'SPC ECO', 'url': 'https://www.last.fm/music/SPC+ECO', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Catherine Wheel', 'url': 'https://www.last.fm/music/Catherine+Wheel', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Chapterhouse', 'url': 'https://www.last.fm/music/Chapterhouse', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Adorable', 'url': 'https://www.last.fm/music/Adorable', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}, {'name': 'Lush', 'url': 'https://www.last.fm/music/Lush', 'image': [{'#text': 'https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'small'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'medium'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'large'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'extralarge'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': 'mega'}, {'#text': 'https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png', 'size': ''}]}]}, 'tags': {'tag': [{'name': 'shoegaze', 'url': 'https://www.last.fm/tag/shoegaze'}, {'name': 'electronic', 'url': 'https://www.last.fm/tag/electronic'}, {'name': 'alternative', 'url': 'https://www.last.fm/tag/alternative'}, {'name': 'female vocalists', 'url': 'https://www.last.fm/tag/female+vocalists'}, {'name': 'indie', 'url': 'https://www.last.fm/tag/indie'}]}, 'bio': {'links': {'link': {'#text': '', 'rel': 'original', 'href': 'https://last.fm/music/Curve/+wiki'}}, 'published': '11 Feb 2006, 01:45', 'summary': '1. Curve was an alternative rock/electronic duo formed in 1990 in England, United Kingdom. The band members were Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. Their sound is a blend of alternative rock, shoegaze and electronic music.\\n\\nHalliday and Garcia were introduced to each other by Dave Stewart of Eurythmics. Dean <a href=\"https://www.last.fm/music/Curve\">Read more on Last.fm</a>', 'content': '1. Curve was an alternative rock/electronic duo formed in 1990 in England, United Kingdom. The band members were Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. Their sound is a blend of alternative rock, shoegaze and electronic music.\\n\\nHalliday and Garcia were introduced to each other by Dave Stewart of Eurythmics. Dean Garcia had played bass guitar as part of Eurythmics\\' live band in 1983–84 and on two of their studio albums, Touch and Be Yourself Tonight. Toni Halliday was signed to Stewart\\'s Anxious Records label as a solo artist. She also sang with The Uncles and Bonk in the early 1980s. \\n\\nToni Halliday and Dean Garcia briefly formed the unsuccessful group State of Play in the late 1980s before parting ways. She attempted a solo career, releasing the album Hearts & Handshakes in 1989. The album was produced by Toni Halliday and Alan Moulder, who later got married. Alan Moulder also produced music for artists like Depeche Mode, Nine Inch Nails and My Bloody Valentine. \\n\\nIn 1991, Halliday reunited with Garcia to form Curve. Their alchemy the second time around created sonically charged music, setting heavy beats and Garcia\\'s densely-layered guitar tracks and feedback against Halliday\\'s airy vocalization of lyrics that frequently explore such topics as alienation, addiction and love on the wane. Curve released three acclaimed EPs throughout 1991 on Stewart\\'s label Anxious Records: Blindfold EP, Frozen and Cherry. These EPs will be included on the compilation Pubic Fruit, issued a year later. \\n\\nIn 1992, Curve released their debut album Doppelgänger. The group also toured extensively during this period, with Halliday and Garcia being supported on stage by the additional guitarists Debbie Smith and Alex Mitchell, plus the drummer Steve Monti. Songs such as \"Horror Head\", \"Coast Is Clear\" and \"Faît Accompli\" brought them critical acclaim and built a solid fanbase for the group.\\n\\nTheir sophomore studio album, Cuckoo, was issued in 1993. The album was a musically more varied but significantly darker release than their debut. On their first two albums, Curve worked with producer Flood (U2, Smashing Pumpkins). Also in 1993, it saw the light of the day the live compilation Radio Sessions.\\n\\nAfter nearly a decade and a half of partnership the band split in 1994. During their hiatus, Halliday formed the band Scylla. Their track \"Helen\\'s Face\" was featured on the Showgirls soundtrack. Garcia began a solo project under the name Headcase.\\n\\nToni Halliday also collaborated with other artists, most notably with Leftfield on the track \"Original\", with Recoil on two songs, \"Edge to Life\" and \"Bloodline\" from Bloodline, with The Future Sound of London on the song \"Cerebral\", with Paul van Dyk on \"Words (Curved Headcase Mix)\" and with DJ? Acucrack on the song “So To Speak”.\\n\\nIn 1996, the single \"Pink Girl With the Blues\", marked Curve\\'s official return, followed by the EP Chinese Burn. In 1997, the band released their fourth studio album Come Clean. Curve also contributed the track \"Nowhere\" to Greg Araki\\'s movie of the same name. Halliday married producer Alan Moulder.\\n\\nIn 2001, the band released on the internet the compilation Open Day at the Hate Fest. This album contained music recorded by Curve since their reformation in 1996. In the same year, the band released the critically acclaimed album Gift. The single \"Hell Above Water\" has gained the highest public profile as a result of its use in trailers for the 2002 film Spider-Man and the 2008 film Iron Man.\\n\\nTheir final album was 2002\\'s The New Adventures of Curve, released only over the internet. In 2004 The Way of Curve, a best-of compilation was released, featuring their most popular songs and singles, as well as rare B-sides and fan favorites. Halliday announced on their official web site in early 2005 that the group split again. \\n\\nAfter the split, Toni Halliday started a solo project entitled Chatelaine and released the album Take a Line For a Walk in 2010. \\n\\nDean Garcia founded SPC ECO in 2007 with his daughter Rose Berlin on lead vocals, and guitarist Joey Levenson; and welcomed the addition of guitarist Perry Pelonero in 2011. Garcia is also currently a member of the bands The Black Holes (with Jo Neale; 2007-present), The Chronologic (2006-present), Inkraktare (with Mark Wallbridge aka Vasko The Pig; 2009-present), The Secret Meeting (with kaRIN and Statik of Collide; 2007-present), KGC (with Sascha Konietzko and Lucia Cifarelli of KMFDM; 2006-present) and Morpheme (with Perry Pelonero and Kim Welsh of Bliss.City.East, Skylight and Clenched Fist; 2010-present). \\n\\nIn 2011, SPC ECO released the Big Fat World EP; and the album  You Tell Me which includes a track titled Let It Out -- an updated version of Curve\\'s Something Familiar from the album Come Clean. Morpheme released their debut single INFECTION // SINGLE and the RED DOG EP; and Garcia released a solo album entitled How Do You Feel ?, with special guests Mark Wallbridge, Todd Astromass and Jeff Beck.\\n\\n\\nOfficial sites:\\nhttp://curve.co.uk\\nhttp://curve.bandcamp.com\\nhttp://on.fb.me/CurveOfficialManagedByDean\\n\\n2. Starting in the early 2000\\'s, Japanese curve was a two piece for much of their existence, only gaining a third member with their most recent album. They\\'ve also had quite a bit of exposure throughout the world, touring through Malysia/Singapore and appearing on a split in the USA.\\n\\nOfficial Site\\nhttp://www.curve-official.com/ <a href=\"https://www.last.fm/music/Curve\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.'}}})",
    "spotify": "ArtistSpotifyData(id='6WYkr1SJofUO79alKPjop0', url='https://open.spotify.com/artist/6WYkr1SJofUO79alKPjop0', name='Curve', popularity=30, followers=47356, genres=['shoegaze', 'dream pop'], images=[{'url': 'https://i.scdn.co/image/e4c0849f33e49989dc29ad31940411870a5491a4', 'height': 1497, 'width': 1000}, {'url': 'https://i.scdn.co/image/63718ceeb7ef296f84fd1a898ebe5299aa0fae37', 'height': 958, 'width': 640}, {'url': 'https://i.scdn.co/image/276abc39d5e9d5fa2e7dc91b79b3cef9be1f609c', 'height': 299, 'width': 200}, {'url': 'https://i.scdn.co/image/87153f5028b03b3a41810e13cee115229f6fbbc8', 'height': 96, 'width': 64}], external_urls={'spotify': 'https://open.spotify.com/artist/6WYkr1SJofUO79alKPjop0'}, raw_data={'external_urls': {'spotify': 'https://open.spotify.com/artist/6WYkr1SJofUO79alKPjop0'}, 'followers': {'href': None, 'total': 47356}, 'genres': ['shoegaze', 'dream pop'], 'href': 'https://api.spotify.com/v1/artists/6WYkr1SJofUO79alKPjop0', 'id': '6WYkr1SJofUO79alKPjop0', 'images': [{'url': 'https://i.scdn.co/image/e4c0849f33e49989dc29ad31940411870a5491a4', 'height': 1497, 'width': 1000}, {'url': 'https://i.scdn.co/image/63718ceeb7ef296f84fd1a898ebe5299aa0fae37', 'height': 958, 'width': 640}, {'url': 'https://i.scdn.co/image/276abc39d5e9d5fa2e7dc91b79b3cef9be1f609c', 'height': 299, 'width': 200}, {'url': 'https://i.scdn.co/image/87153f5028b03b3a41810e13cee115229f6fbbc8', 'height': 96, 'width': 64}], 'name': 'Curve', 'popularity': 30, 'type': 'artist', 'uri': 'spotify:artist:6WYkr1SJofUO79alKPjop0'})",
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Curve were an English alternative rock and electronica duo from London, formed in 1990 and split in 2005. The band consisted of Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, drums, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. An important collaborator was the producer Alan Moulder, who helped them to shape their blend of heavy beats and densely layered guitar tracks set against Halliday's vocals. \nCurve released five studio albums (Doppelgänger in 1992, Cuckoo in 1993, Come Clean in 1998, Gift in 2001, and The New Adventures of Curve in 2002), five compilation albums (Pubic Fruit in 1992, Radio Sessions in 1993, Open Day at the Hate Fest in 2001, The Way of Curve in 2004, and Rare and Unreleased in 2010), and a string of EPs and singles. \n\nHistory:\nDean Garcia, half Hawaiian and half Irish, had played in some small bands when he auditioned for Eurythmics. The English Toni Halliday met Dave Stewart of Eurythmics after he had read a rock magazine interview with her in which she praised his pre-Eurythmics band, The Tourists. Halliday and Garcia were introduced to each other by Stewart. Garcia had played bass guitar as part of Eurythmics' live band in 1983-84 and on two of their studio albums, while Halliday was signed to Stewart's Anxious Records label as a solo artist. The pair formed an ill-fated group named State of Play in the mid-1980s before parting ways, embarking on a no less ill-fated solo career (Halliday) and further stints as a backing musician (Garcia), and then reuniting for a more long-term partnership in Curve. \nAs Curve, Halliday and Garcia released three acclaimed and increasingly successful EPs (Blindfold, Frozen, and Cherry) throughout 1991 on Anxious Records. They also made an impact on the UK album charts in 1992 with their debut studio album Doppelgänger. The group toured extensively during this period, with Halliday and Garcia being supported on stage by two additional guitarists (Debbie Smith, later of Echobelly, and Alex Mitchell) and a drummer (Steve Monti, formerly of Ian Dury and the Blockheads). Highlights of Curve's live career included a performance at the 1992 Glastonbury Festival, and a package tour of the United States with The Jesus and Mary Chain and Spiritualized. \nIn 1992, the band released the compilation album Pubic Fruit, containing their first three EPs and an extended mix of the single \"Faît Accompli\". Toni Halliday also featured on two songs (\"Edge to Life\" and \"Bloodline\") from Recoil's album, Bloodline. In 1993, Curve issued Radio Sessions, a compilation album of recordings made during their two sessions for John Peel's show on the UK broadcasting station BBC Radio 1. \nCurve's second studio album, the harder-edged Cuckoo (1993), did not repeat the UK Top 20 success of the band's debut. That coupled with the stressfulness of the tour in support of the record, may have contributed to Halliday and Garcia's decision to disband the group in 1994. \"It got to the point where Dean didn't want to tour,\" Halliday told Select magazine (August 1996 edition). \"We did reach that point of hedonistic head-fuckery: glugging JD, hollering, 'Where's the schnozz?' You finally get that out of your system and think, 'This is sad.' We couldn't have gone on like that.\" \n\nDuring their hiatus, Halliday formed the band Scylla and Garcia began a solo project under the name Headcase. Scylla's track \"Helen's Face\" was featured on the Showgirls soundtrack. Halliday also collaborated with The Future Sound of London for the song \"Cerebral\" from Lifeforms (1994), with Freaky Chakra for the song \"Budded on Earth to Bloom in Heaven\" from Lowdown Motivator (1995), and with Leftfield for their #18 UK hit \"Original\" from Leftism (1995). She also featured on \"Original\"'s music video. \nCurve returned to the music business in 1996 with the EP Pink Girl With the Blues. In the same year, Curve collaborated with Paul Van Dyk by reworking the mostly instrumental song \"Words\" from the album Seven Ways and also adding Halliday's vocals. \nIn 1997, they released \"Chinese Burn\", the first single to be taken from their third studio album Come Clean (1998). The album is a set of songs displaying a more pronounced influence of electronic music than earlier releases. Come Clean was met with a certain amount of acclaim and commercial success, which encouraged the group to continue their recording career. Curve continued to do small-scale live shows in and around Europe. \nThe follow-up to Come Clean was an internet-only compilation titled Open Day at the Hate Fest which was released in 2001. Also in the same year, Curve issued Gift, their fourth studio album. Kevin Shields of My Bloody Valentine also played guitar on the songs \"Want More Need Less\" and \"Perish\". The opening song \"Hell Above Water\" has gained the highest public profile as a result of its use in trailers for the 2002 film Spider-Man and the 2008 film Iron Man. \nIn 2002, Curve released the internet-only fifth studio album The New Adventures of Curve and various download-only tracks via their official site. In 2003, Toni Halliday collaborated with the industrial rock Japanese band Acid Android on the song \"Faults\" from the album with the same name. \nA two-CD retrospective compilation entitled The Way of Curve summarized the group's output in 2004. The first disc included the band' singles. The second disc contained a selection of B-sides, rarities and remixes. In early 2005, Halliday announced that she had left Curve for good. \nIn 2010, Curve published some of their most important releases as digital downloads on their Bandcamp page, including a new compilation with 39 songs entitled Rare and Unreleased. \n\nPost-Curve projects:\n\nToni Halliday:\nToni Halliday featured on The Killers' 2006 Christmas track \"A Great Big Sled\". This song was later included in the 2011 compilation (RED) Christmas EP. \nOn 27 February 2008, she introduced on MySpace a new solo project called Chatelaine. A number of tracks could be previewed, and were credited to Halliday/Dowd/Salmon, and its MySpace blog declared that a new album was being worked on. \nChatelaine's debut album Take a Line For a Walk was released in 16 June 2010. It featured nine new tracks: \"Broken Bones\", \"Oh Daddy\", \"Life Remains\", \"Stripped Out\", \"Shifting Sands\", \"Killing Feeling\", \"Take a Line For a Walk\", \"Head To Head\" and \"Seen and Lost\". \nIn 2012, Halliday contributed vocals to Orbital's soundtrack for remake of the film Pusher. \n\nDean Garcia:\nDean Garcia is currently a member of the band SPC ECO with his daughter Rose Berlin and Joey Levenson (2007-present). In February 2009, SPC ECO released their first album, 3-D, through their website and via Collide's label Noiseplus Music. 3-D was followed by the albums You Tell Me in 2011 and Dark Notes in 2012. \nGarcia is also member of the bands The Black Holes (with Jo Neale; 2007-present), The Chronologic (2006-present), Inkraktare (with Mark Wallbridge aka Vasko The Pig; 2009-present),The Secret Meeting (with kaRIN and Statik of Collide; 2007-present),KGC (with Sascha Konietzko and Lucia Cifarelli of KMFDM; 2006-present) and Morpheme (2010-present). \nGarcia's newest project Morpheme is a collaboration with Perry Pelonero (Clenched Fist, Skylight, Bliss City East), and Kim Welsh (Skylight, Bliss City East). On 8 December 2010, Morpheme released their first track, Infection and on 5 May 2011, they released their second track, Stratosphere on their debut single Infection. \nDean Garcia has also released a solo album on 1 January 2011, entitled How Do You Feel?, with special guests Vasko the Pig, Todd Astromass and Jeff Beck. \n\nMusic style and influences:\nStephen Thomas Erlewine of Allmusic described Curve's style as as a \"towering monolith of guitar noise, dance tracks, dark goth, and airy melodies\". He also regarded the band's music as a combination of \"shoegazer atmospherics and techno beats\". \nCurve has been inspired by My Bloody Valentine,Cocteau Twins,Killing Joke, Eurythmics,Colourbox,The Cure, and The Jesus and Mary Chain. \nToni Halliday has occasionally commented on the comparisons between Curve and Garbage, stating in an 1996 interview with Volume magazine, that she could \"see bits of Garbage in what we've done, just like we see bits of Sonic Youth or the Valentines or really any band that was doing something supposedly outside the norm. In a way it's very flattering to be tied in with (Garbage drummer and co-producer) Butch Vig, not just because he's a brilliant human being, but because he's a brilliant producer, and he's worked on some of our favourite records. But eventually Garbage are a pop band, and Curve were never a pop band\". \nHalliday has, on other occasions, also offered contrasting opinions. Interviewed by Cosmik Debris Magazine in 2001, she reminisced on how \"Curve had put records out and we always thought they were nice little pop albums full of nice little pop songs. I've always thought that Curve have made great pop. It might come in a different guise to what people presume is pop, you know, like... it doesn't sound like Backstreet Boys pop, but still, there's melody there, and there are hooks, and we've done that on every record we've ever made. ... We've been called 'goth' in England, and we've been called 'noise merchants' and the whole gamut of labels, but not once have we been called a pop band, and I'd really like to be called that\". \n\nBand members:\n\nOfficial members:\nToni Halliday (born 5 July 1964 in Parsons Green, Fulham, England) - vocals, occasionally guitar, \nDean Garcia (born 3 May 1958) - bass, guitar, drums, programming, \n\nTouring members:\nDebbie Smith - guitar (from 1991 until 1994), \nAlex Mitchell - guitar (from 1991 until 1994), \nRob Holliday - guitar (Come Clean era), \nSteve Monti - drums, \nStephen Spring - drums, \n\nEquipment:\nA detailed gear diagram of Dean Garcia's 2002 Curve bass rig is well-documented., \nA detailed gear diagram of Rob Holliday's 2002 Curve guitar rig is well-documented., \nOn YouTube, there's a video available with Alan Moulder working in Curve' recording studio., \nAn in-depth interview with Dean Garcia and Toni Halliday from 2002 that covers their live gear as well as their recording methods at their studio, Todal Studios.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1989",
      "country": "London",
      "country_code": "GB",
      "died_year": "2005",
      "disbanded": true,
      "facebook": "",
      "formed_year": "1989",
      "gender": "Mixed",
      "genre": "Alternative Rock",
      "id": "124693",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/zdpyq71694601252.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/euf2jy1694601574.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ah7po01694602315.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/1fs7331694602334.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/tx7piv1694602767.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/curve-5e8c84c456dd3.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "2",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "104d65cc-ac4e-4351-b62d-32438c84259f",
      "name": "Curve",
      "raw_data": {},
      "style": "Electronic",
      "twitter": "1",
      "website": ""
    }
  },
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Music124/v4/07/b2/c2/07b2c246-07c2-ef18-3021-cb517fffe3d2/mzi.zogvweul.jpg/2000x2000ac.jpg",
      "editorial_notes": null,
      "genres": [
        "Electronic"
      ],
      "id": "100065",
      "name": "Curve",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/curve/100065"
    },
    "discogs": {
      "cover_image": "",
      "id": "5373",
      "images": [],
      "members": [],
      "name": "Curve",
      "namevariations": [],
      "profile": "",
      "raw_data": {
        "id": "5373",
        "note": "Failed to fetch data automatically",
        "resource_url": "https://api.discogs.com/artists/5373"
      },
      "resource_url": "https://api.discogs.com/artists/5373",
      "thumb": "",
      "url": "https://www.discogs.com/artist/5373",
      "urls": []
    },
    "lastfm": {
      "bio_content": "1. Curve was an alternative rock/electronic duo formed in 1990 in England, United Kingdom. The band members were Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. Their sound is a blend of alternative rock, shoegaze and electronic music.\n\nHalliday and Garcia were introduced to each other by Dave Stewart of Eurythmics. Dean Garcia had played bass guitar as part of Eurythmics' live band in 1983–84 and on two of their studio albums, Touch and Be Yourself Tonight. Toni Halliday was signed to Stewart's Anxious Records label as a solo artist. She also sang with The Uncles and Bonk in the early 1980s. \n\nToni Halliday and Dean Garcia briefly formed the unsuccessful group State of Play in the late 1980s before parting ways. She attempted a solo career, releasing the album Hearts & Handshakes in 1989. The album was produced by Toni Halliday and Alan Moulder, who later got married. Alan Moulder also produced music for artists like Depeche Mode, Nine Inch Nails and My Bloody Valentine. \n\nIn 1991, Halliday reunited with Garcia to form Curve. Their alchemy the second time around created sonically charged music, setting heavy beats and Garcia's densely-layered guitar tracks and feedback against Halliday's airy vocalization of lyrics that frequently explore such topics as alienation, addiction and love on the wane. Curve released three acclaimed EPs throughout 1991 on Stewart's label Anxious Records: Blindfold EP, Frozen and Cherry. These EPs will be included on the compilation Pubic Fruit, issued a year later. \n\nIn 1992, Curve released their debut album Doppelgänger. The group also toured extensively during this period, with Halliday and Garcia being supported on stage by the additional guitarists Debbie Smith and Alex Mitchell, plus the drummer Steve Monti. Songs such as \"Horror Head\", \"Coast Is Clear\" and \"Faît Accompli\" brought them critical acclaim and built a solid fanbase for the group.\n\nTheir sophomore studio album, Cuckoo, was issued in 1993. The album was a musically more varied but significantly darker release than their debut. On their first two albums, Curve worked with producer Flood (U2, Smashing Pumpkins). Also in 1993, it saw the light of the day the live compilation Radio Sessions.\n\nAfter nearly a decade and a half of partnership the band split in 1994. During their hiatus, Halliday formed the band Scylla. Their track \"Helen's Face\" was featured on the Showgirls soundtrack. Garcia began a solo project under the name Headcase.\n\nToni Halliday also collaborated with other artists, most notably with Leftfield on the track \"Original\", with Recoil on two songs, \"Edge to Life\" and \"Bloodline\" from Bloodline, with The Future Sound of London on the song \"Cerebral\", with Paul van Dyk on \"Words (Curved Headcase Mix)\" and with DJ? Acucrack on the song “So To Speak”.\n\nIn 1996, the single \"Pink Girl With the Blues\", marked Curve's official return, followed by the EP Chinese Burn. In 1997, the band released their fourth studio album Come Clean. Curve also contributed the track \"Nowhere\" to Greg Araki's movie of the same name. Halliday married producer Alan Moulder.\n\nIn 2001, the band released on the internet the compilation Open Day at the Hate Fest. This album contained music recorded by Curve since their reformation in 1996. In the same year, the band released the critically acclaimed album Gift. The single \"Hell Above Water\" has gained the highest public profile as a result of its use in trailers for the 2002 film Spider-Man and the 2008 film Iron Man.\n\nTheir final album was 2002's The New Adventures of Curve, released only over the internet. In 2004 The Way of Curve, a best-of compilation was released, featuring their most popular songs and singles, as well as rare B-sides and fan favorites. Halliday announced on their official web site in early 2005 that the group split again. \n\nAfter the split, Toni Halliday started a solo project entitled Chatelaine and released the album Take a Line For a Walk in 2010. \n\nDean Garcia founded SPC ECO in 2007 with his daughter Rose Berlin on lead vocals, and guitarist Joey Levenson; and welcomed the addition of guitarist Perry Pelonero in 2011. Garcia is also currently a member of the bands The Black Holes (with Jo Neale; 2007-present), The Chronologic (2006-present), Inkraktare (with Mark Wallbridge aka Vasko The Pig; 2009-present), The Secret Meeting (with kaRIN and Statik of Collide; 2007-present), KGC (with Sascha Konietzko and Lucia Cifarelli of KMFDM; 2006-present) and Morpheme (with Perry Pelonero and Kim Welsh of Bliss.City.East, Skylight and Clenched Fist; 2010-present). \n\nIn 2011, SPC ECO released the Big Fat World EP; and the album  You Tell Me which includes a track titled Let It Out -- an updated version of Curve's Something Familiar from the album Come Clean. Morpheme released their debut single INFECTION // SINGLE and the RED DOG EP; and Garcia released a solo album entitled How Do You Feel ?, with special guests Mark Wallbridge, Todd Astromass and Jeff Beck.\n\n\nOfficial sites:\nhttp://curve.co.uk\nhttp://curve.bandcamp.com\nhttp://on.fb.me/CurveOfficialManagedByDean\n\n2. Starting in the early 2000's, Japanese curve was a two piece for much of their existence, only gaining a third member with their most recent album. They've also had quite a bit of exposure throughout the world, touring through Malysia/Singapore and appearing on a split in the USA.\n\nOfficial Site\nhttp://www.curve-official.com/ <a href=\"https://www.last.fm/music/Curve\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "1. Curve was an alternative rock/electronic duo formed in 1990 in England, United Kingdom. The band members were Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. Their sound is a blend of alternative rock, shoegaze and electronic music.\n\nHalliday and Garcia were introduced to each other by Dave Stewart of Eurythmics. Dean <a href=\"https://www.last.fm/music/Curve\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 210902,
      "mbid": "9bb90124-a5e3-4d5b-baa9-87d7615c4ebc",
      "name": "Curve",
      "playcount": 4139201,
      "similar_artists": [
        {
          "name": "SPC ECO",
          "url": "https://www.last.fm/music/SPC+ECO"
        },
        {
          "name": "Catherine Wheel",
          "url": "https://www.last.fm/music/Catherine+Wheel"
        },
        {
          "name": "Chapterhouse",
          "url": "https://www.last.fm/music/Chapterhouse"
        },
        {
          "name": "Adorable",
          "url": "https://www.last.fm/music/Adorable"
        },
        {
          "name": "Lush",
          "url": "https://www.last.fm/music/Lush"
        }
      ],
      "tags": [
        "shoegaze",
        "electronic",
        "alternative",
        "female vocalists",
        "indie"
      ],
      "url": "https://www.last.fm/music/Curve"
    },
    "spotify": {
      "followers": 47356,
      "genres": [
        "shoegaze",
        "dream pop"
      ],
      "id": "6WYkr1SJofUO79alKPjop0",
      "images": [
        {
          "height": 1497,
          "url": "https://i.scdn.co/image/e4c0849f33e49989dc29ad31940411870a5491a4",
          "width": 1000
        },
        {
          "height": 958,
          "url": "https://i.scdn.co/image/63718ceeb7ef296f84fd1a898ebe5299aa0fae37",
          "width": 640
        },
        {
          "height": 299,
          "url": "https://i.scdn.co/image/276abc39d5e9d5fa2e7dc91b79b3cef9be1f609c",
          "width": 200
        },
        {
          "height": 96,
          "url": "https://i.scdn.co/image/87153f5028b03b3a41810e13cee115229f6fbbc8",
          "width": 64
        }
      ],
      "name": "Curve",
      "popularity": 30,
      "url": "https://open.spotify.com/artist/6WYkr1SJofUO79alKPjop0"
    },
    "theaudiodb": {
      "albums": null,
      "alternate_names": "",
      "biography_de": null,
      "biography_en": "Curve were an English alternative rock and electronica duo from London, formed in 1990 and split in 2005. The band consisted of Toni Halliday (vocals, occasionally guitar) and Dean Garcia (bass, guitar, drums, programming). Halliday wrote also the lyrics of their songs and they both contributed to songwriting. An important collaborator was the producer Alan Moulder, who helped them to shape their blend of heavy beats and densely layered guitar tracks set against Halliday's vocals. \nCurve released five studio albums (Doppelgänger in 1992, Cuckoo in 1993, Come Clean in 1998, Gift in 2001, and The New Adventures of Curve in 2002), five compilation albums (Pubic Fruit in 1992, Radio Sessions in 1993, Open Day at the Hate Fest in 2001, The Way of Curve in 2004, and Rare and Unreleased in 2010), and a string of EPs and singles. \n\nHistory:\nDean Garcia, half Hawaiian and half Irish, had played in some small bands when he auditioned for Eurythmics. The English Toni Halliday met Dave Stewart of Eurythmics after he had read a rock magazine interview with her in which she praised his pre-Eurythmics band, The Tourists. Halliday and Garcia were introduced to each other by Stewart. Garcia had played bass guitar as part of Eurythmics' live band in 1983-84 and on two of their studio albums, while Halliday was signed to Stewart's Anxious Records label as a solo artist. The pair formed an ill-fated group named State of Play in the mid-1980s before parting ways, embarking on a no less ill-fated solo career (Halliday) and further stints as a backing musician (Garcia), and then reuniting for a more long-term partnership in Curve. \nAs Curve, Halliday and Garcia released three acclaimed and increasingly successful EPs (Blindfold, Frozen, and Cherry) throughout 1991 on Anxious Records. They also made an impact on the UK album charts in 1992 with their debut studio album Doppelgänger. The group toured extensively during this period, with Halliday and Garcia being supported on stage by two additional guitarists (Debbie Smith, later of Echobelly, and Alex Mitchell) and a drummer (Steve Monti, formerly of Ian Dury and the Blockheads). Highlights of Curve's live career included a performance at the 1992 Glastonbury Festival, and a package tour of the United States with The Jesus and Mary Chain and Spiritualized. \nIn 1992, the band released the compilation album Pubic Fruit, containing their first three EPs and an extended mix of the single \"Faît Accompli\". Toni Halliday also featured on two songs (\"Edge to Life\" and \"Bloodline\") from Recoil's album, Bloodline. In 1993, Curve issued Radio Sessions, a compilation album of recordings made during their two sessions for John Peel's show on the UK broadcasting station BBC Radio 1. \nCurve's second studio album, the harder-edged Cuckoo (1993), did not repeat the UK Top 20 success of the band's debut. That coupled with the stressfulness of the tour in support of the record, may have contributed to Halliday and Garcia's decision to disband the group in 1994. \"It got to the point where Dean didn't want to tour,\" Halliday told Select magazine (August 1996 edition). \"We did reach that point of hedonistic head-fuckery: glugging JD, hollering, 'Where's the schnozz?' You finally get that out of your system and think, 'This is sad.' We couldn't have gone on like that.\" \n\nDuring their hiatus, Halliday formed the band Scylla and Garcia began a solo project under the name Headcase. Scylla's track \"Helen's Face\" was featured on the Showgirls soundtrack. Halliday also collaborated with The Future Sound of London for the song \"Cerebral\" from Lifeforms (1994), with Freaky Chakra for the song \"Budded on Earth to Bloom in Heaven\" from Lowdown Motivator (1995), and with Leftfield for their #18 UK hit \"Original\" from Leftism (1995). She also featured on \"Original\"'s music video. \nCurve returned to the music business in 1996 with the EP Pink Girl With the Blues. In the same year, Curve collaborated with Paul Van Dyk by reworking the mostly instrumental song \"Words\" from the album Seven Ways and also adding Halliday's vocals. \nIn 1997, they released \"Chinese Burn\", the first single to be taken from their third studio album Come Clean (1998). The album is a set of songs displaying a more pronounced influence of electronic music than earlier releases. Come Clean was met with a certain amount of acclaim and commercial success, which encouraged the group to continue their recording career. Curve continued to do small-scale live shows in and around Europe. \nThe follow-up to Come Clean was an internet-only compilation titled Open Day at the Hate Fest which was released in 2001. Also in the same year, Curve issued Gift, their fourth studio album. Kevin Shields of My Bloody Valentine also played guitar on the songs \"Want More Need Less\" and \"Perish\". The opening song \"Hell Above Water\" has gained the highest public profile as a result of its use in trailers for the 2002 film Spider-Man and the 2008 film Iron Man. \nIn 2002, Curve released the internet-only fifth studio album The New Adventures of Curve and various download-only tracks via their official site. In 2003, Toni Halliday collaborated with the industrial rock Japanese band Acid Android on the song \"Faults\" from the album with the same name. \nA two-CD retrospective compilation entitled The Way of Curve summarized the group's output in 2004. The first disc included the band' singles. The second disc contained a selection of B-sides, rarities and remixes. In early 2005, Halliday announced that she had left Curve for good. \nIn 2010, Curve published some of their most important releases as digital downloads on their Bandcamp page, including a new compilation with 39 songs entitled Rare and Unreleased. \n\nPost-Curve projects:\n\nToni Halliday:\nToni Halliday featured on The Killers' 2006 Christmas track \"A Great Big Sled\". This song was later included in the 2011 compilation (RED) Christmas EP. \nOn 27 February 2008, she introduced on MySpace a new solo project called Chatelaine. A number of tracks could be previewed, and were credited to Halliday/Dowd/Salmon, and its MySpace blog declared that a new album was being worked on. \nChatelaine's debut album Take a Line For a Walk was released in 16 June 2010. It featured nine new tracks: \"Broken Bones\", \"Oh Daddy\", \"Life Remains\", \"Stripped Out\", \"Shifting Sands\", \"Killing Feeling\", \"Take a Line For a Walk\", \"Head To Head\" and \"Seen and Lost\". \nIn 2012, Halliday contributed vocals to Orbital's soundtrack for remake of the film Pusher. \n\nDean Garcia:\nDean Garcia is currently a member of the band SPC ECO with his daughter Rose Berlin and Joey Levenson (2007-present). In February 2009, SPC ECO released their first album, 3-D, through their website and via Collide's label Noiseplus Music. 3-D was followed by the albums You Tell Me in 2011 and Dark Notes in 2012. \nGarcia is also member of the bands The Black Holes (with Jo Neale; 2007-present), The Chronologic (2006-present), Inkraktare (with Mark Wallbridge aka Vasko The Pig; 2009-present),The Secret Meeting (with kaRIN and Statik of Collide; 2007-present),KGC (with Sascha Konietzko and Lucia Cifarelli of KMFDM; 2006-present) and Morpheme (2010-present). \nGarcia's newest project Morpheme is a collaboration with Perry Pelonero (Clenched Fist, Skylight, Bliss City East), and Kim Welsh (Skylight, Bliss City East). On 8 December 2010, Morpheme released their first track, Infection and on 5 May 2011, they released their second track, Stratosphere on their debut single Infection. \nDean Garcia has also released a solo album on 1 January 2011, entitled How Do You Feel?, with special guests Vasko the Pig, Todd Astromass and Jeff Beck. \n\nMusic style and influences:\nStephen Thomas Erlewine of Allmusic described Curve's style as as a \"towering monolith of guitar noise, dance tracks, dark goth, and airy melodies\". He also regarded the band's music as a combination of \"shoegazer atmospherics and techno beats\". \nCurve has been inspired by My Bloody Valentine,Cocteau Twins,Killing Joke, Eurythmics,Colourbox,The Cure, and The Jesus and Mary Chain. \nToni Halliday has occasionally commented on the comparisons between Curve and Garbage, stating in an 1996 interview with Volume magazine, that she could \"see bits of Garbage in what we've done, just like we see bits of Sonic Youth or the Valentines or really any band that was doing something supposedly outside the norm. In a way it's very flattering to be tied in with (Garbage drummer and co-producer) Butch Vig, not just because he's a brilliant human being, but because he's a brilliant producer, and he's worked on some of our favourite records. But eventually Garbage are a pop band, and Curve were never a pop band\". \nHalliday has, on other occasions, also offered contrasting opinions. Interviewed by Cosmik Debris Magazine in 2001, she reminisced on how \"Curve had put records out and we always thought they were nice little pop albums full of nice little pop songs. I've always thought that Curve have made great pop. It might come in a different guise to what people presume is pop, you know, like... it doesn't sound like Backstreet Boys pop, but still, there's melody there, and there are hooks, and we've done that on every record we've ever made. ... We've been called 'goth' in England, and we've been called 'noise merchants' and the whole gamut of labels, but not once have we been called a pop band, and I'd really like to be called that\". \n\nBand members:\n\nOfficial members:\nToni Halliday (born 5 July 1964 in Parsons Green, Fulham, England) - vocals, occasionally guitar, \nDean Garcia (born 3 May 1958) - bass, guitar, drums, programming, \n\nTouring members:\nDebbie Smith - guitar (from 1991 until 1994), \nAlex Mitchell - guitar (from 1991 until 1994), \nRob Holliday - guitar (Come Clean era), \nSteve Monti - drums, \nStephen Spring - drums, \n\nEquipment:\nA detailed gear diagram of Dean Garcia's 2002 Curve bass rig is well-documented., \nA detailed gear diagram of Rob Holliday's 2002 Curve guitar rig is well-documented., \nOn YouTube, there's a video available with Alan Moulder working in Curve' recording studio., \nAn in-depth interview with Dean Garcia and Toni Halliday from 2002 that covers their live gear as well as their recording methods at their studio, Todal Studios.",
      "biography_es": null,
      "biography_fr": null,
      "biography_it": null,
      "biography_jp": null,
      "biography_nl": null,
      "biography_pt": null,
      "biography_ru": null,
      "biography_se": null,
      "born_year": "1989",
      "country": "London",
      "country_code": "GB",
      "died_year": "2005",
      "disbanded": true,
      "facebook": "",
      "formed_year": "1989",
      "gender": "Mixed",
      "genre": "Alternative Rock",
      "id": "124693",
      "images": [
        {
          "height": 1000,
          "resource_url": null,
          "type": "artist",
          "url": "https://r2.theaudiodb.com/images/media/artist/thumb/zdpyq71694601252.jpg",
          "width": 1000
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/euf2jy1694601574.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/ah7po01694602315.jpg",
          "width": 1920
        },
        {
          "height": 1080,
          "resource_url": null,
          "type": "fanart",
          "url": "https://r2.theaudiodb.com/images/media/artist/fanart/1fs7331694602334.jpg",
          "width": 1920
        },
        {
          "height": 185,
          "resource_url": null,
          "type": "banner",
          "url": "https://www.theaudiodb.com/images/media/artist/banner/tx7piv1694602767.jpg",
          "width": 1000
        },
        {
          "height": 155,
          "resource_url": null,
          "type": "logo",
          "url": "https://www.theaudiodb.com/images/media/artist/logo/curve-5e8c84c456dd3.png",
          "width": 400
        }
      ],
      "last_fm_chart": null,
      "members": "2",
      "mood": "",
      "music_videos": null,
      "musicbrainz_id": "104d65cc-ac4e-4351-b62d-32438c84259f",
      "name": "Curve",
      "raw_data": {},
      "style": "Electronic",
      "twitter": "1",
      "website": ""
    }
  },
  "spotify_id": "6WYkr1SJofUO79alKPjop0",
  "spotify_url": "https://open.spotify.com/artist/6WYkr1SJofUO79alKPjop0",
  "updated_at": "2025-07-08T20:34:22.547304",
  "wikipedia_url": null
}