{
  "apple_music_id": "395429",
  "apple_music_url": "https://music.apple.com/gb/artist/thompson-twins/395429",
  "biography": "Thompson Twins were an English new wave band. The band formed in April 1977, and disbanded in May 1993. Massively popular in the mid-1980s, the band scored a string of hits in the UK, broke into the U.S. and Canada and enjoyed huge popularity around the globe. The band was named after the two bumbling detectives Thomson and Thompson from Hergé's comic strip, The Adventures of Tintin.\n\nIn 1977, the original Thompson Twins lineup consisted of Tom Bailey (born January 18, 1956, in Halifax, Yorkshire) on bass and vocals, Pete Dodd on guitar and vocals, John Roog on guitar, and Jon Podgorski (known as \"Pod\") on drums. Dodd and Roog first met when they were both 13 years old.\n\nAfter moving to London but having so little money, they lived as squatters in Lillieshall Road, London. Future Thompson Twins' member, Alannah Currie, lived in another squat in the same street — which is how she met Bailey. It was in this ramshackle and run-down house that they found an illegal way of \"borrowing\" electricity from the house next door. Bailey described themselves (laughingly) as \"spongers\" (meaning parasites) back then, as they were living on very little, and scavenging everything they could lay their hands on. He even said that the only instruments they had were bought, or had been \"stolen or borrowed\". Dodd managed to get a council flat not far away. Their roadie at that time was John Hade, who lived in the same house, and who later became their manager.\n\nAs \"Pod\" Podgorski had decided to stay in the north, they auditoned for drummers at The Point Studio in Victoria, London. Dick O'Dell (Disco Dell) the manager of The Pop Group and The Slits also had an office in the same building. Andrew Edge joined them on drums for less than one year, but left because of the subliminal tension between the other band members. Edge went on to join Savage Progress, who later toured with the Thompson Twins as their support act on the 1984 UK tour.\n\nBy 1981, the line-up was Bailey, Dodd, Roog and three new members: Chris Bell on drums, Joe Leeway on congas and percussion, and Jane Shorter on saxophone. This line up recorded the first Thompson Twins album A Product of ... (Participation). Currie, who had been hanging out with the band for a few years, played and sang on the first album, but was not yet a full member.\n\nBell admitted in the beginning that he was \"not a drummer at all,\" but with the encouragement and help of Bailey he steadily improved to provide a solid back-beat. The group's personnel eventually rose to as many as eleven members, who often invited enthusiastic audience members onstage to pound on makeshift percussion instruments.\n\nAfter the first album, the band's line-up shifted yet again. Saxophone player Shorter dropped out, Currie was made an official member, and added was bassist Matthew Seligman, a former member of The Soft Boys. Bailey, meanwhile, moved to keyboards and became the band's lead vocalist, with Leeway being vocalist on some tracks.\n\nThe band signed to Arista Records and released the album Set. Thomas Dolby played some keyboards, such as the Oberheim, on Set and some live gigs, as Bailey had little experience with synthesizers before then.\n\nSet contained the single \"In The Name Of Love\", sung and largely written by Bailey. It became a substantial dance club hit in the U.S., and the Set album would be released as In The Name Of Love in the U.S. to capitalize on the song's popularity. It entered the Billboard 200.\n\nAfter the success of \"In The Name Of Love\", Bailey, Currie and Leeway, wanting to pursue the single's different sound, toyed with the idea of starting a new band on the side, which they planned to call \"The Bermuda Triangle\". When the single and album failed to make a substantial impact in the UK charts, manager Hade convinced Bailey, Leeway and Currie to downsize the Thompson Twins to a core of the three in April 1982. On UK TV, Seligman explained it so:\n\n“ We were all given a piece of paper that we had to sign, which said that we were to be paid 500 pounds, and we could keep our instruments and equipment. It sounded like quite a good deal at the time...\" ” \n\nAll the former members are still on friendly speaking terms, although Dodd once had the job of delivering a keyboard to Thomas Dolby some time later, but (to Dodd's irritation) Dolby failed to recognise him.\n\nNo longer having to work out songs in beer-sodden and sweaty rehearsal rooms, as well as dealing with the opinions of other musicians, Bailey could now work on his own, and at his own pace. Unfortunately this would back-fire on him in later years, as the strain of doing almost everything led to a breakdown.\n\nThe Thompson Twins trio then decided to go abroad and to free themselves of any UK influences, as well as to combine the songwriting for their first \"trio\" album with a very long holiday: \"We went to Egypt to be totally isolated\", Currie explained. \"The old version of The Thompson Twins had just split up (sic) and now there were the three of us — Tom, Joe and myself — and we needed to get some new songs written\". \"We were always London-based\", Bailey added. \"Making London-type music, for London people. It was the bane of our lives and we wanted to make a break from that. So Egypt seemed a good place to go...\"\n\nThe new trio also had their share of in-fighting even after the other members had gone, Currie: \"We did have terrible fights when we tried to work together. We threw things at one another and cried. It was all very traumatic, but we've worked so long together that we can cope with that. We know how to manipulate one another, you see, and stick the knife in. There's no democracy in the Thompson Twins; we run it on a totally fascist basis\". \"After Egypt, we went to the Bahamas\" Currie commented, \"but we got bored\", said Leeway. \"There was nothing to do but swim around and look at different coloured corals.\" Currie continues: \"So we came back to Britain and set up a studio in the ballroom of a mansion presided over by a crazy woman in Wiltshire\" \n\nThey broke into the UK Singles Chart and the U.S. Billboard Hot 100 chart at the beginning of 1983 with \"Lies\" and \"Love On Your Side\". Further singles from their third album Quick Step And Side Kick (called simply Side Kicks in the U.S.) followed with \"We Are Detective\" and \"Watching\". Bailey's flame-red hair and bright ponytail and Currie's wasp-swatting style at the xylophone swiftly becoming endearing images of an exciting new act. Bailey primarily wrote the music (with significant enough input from Leeway that he received co-authorship credit on all tracks), and Currie contributed most (if not all) of the lyrics. Leeway was also responsible for the band's exciting live visuals.\n\nAt the end of 1983, a new single \"Hold Me Now\" was released. An extremely simple love song with gentle guitar lines, it marked a clear break from the Thompson Twins' previously dance-oriented sound. It hit the top ten in both the UK and US.\n\nFurther hit singles followed in 1984: the pop hit \"Doctor! Doctor!\"; the quirky \"You Take Me Up\" (reaching number two and their biggest UK hit); the haunting \"Sister of Mercy\"; and \"The Gap\" with its Middle Eastern rhythms (this was not released in the UK). The corresponding album, Into The Gap, was one of the bestsellers of the year, selling five million units worldwide and topping the British album charts. The band also embarked on a world tour in support fo the album.\n\nA late 1984 single, \"Lay Your Hands On Me\", saw the band attempt to build on their success, but an insensitive theme (showing the band draped in jewels) contrasted sharply with the prevalent theme of Live Aid currently obsessing the music press in the UK. The single did well, making the US top ten (#13 in the UK), but by then the trio had peaked.\n\nWorking on the follow up to Into The Gap, Bailey suffered a nervous breakdown. Nile Rodgers was subsequently called in to help finish the album, which appeared in 1985. Here's To Future Days (itself making the top 5 in the UK and top 20 in the US) spawned the track: \"King For a Day\", which made the US top ten, but only reached no.22 in the UK. Other singles included the anti-drug message \"Don't Mess With Doctor Dream\" (UK #15) and a cover of The Beatles' 1968 hit \"Revolution\". The Thompson Twins made headlines when they performed at the American-end of Live Aid and were joined on-stage by the fresh-faced Madonna, who was in only her second year of fame. The UK leg of the album's support tour had to be cancelled because of Bailey's breakdown (fans with tickets received a free live album as compensation) and the album itself was delayed by many months, causing the band to lose momentum. Despite this, the latter half of 1985 saw sell out tours for the band in the USA and Japan.\n\nLeeway left the band in 1986, and the remaining duo of Bailey and Currie carried on making music for another seven years. 1987 saw the release of Close To the Bone and the single \"Get That Love\" which made it to number thirty-one in the U.S. \"In The Name of Love\" was given a new lease of life in 1988, after a remix by Shep Petitbone made #46 in the UK. 1989 saw the release of another album, Big Trash, and a new record deal with Warner Bros. Records. The single \"Sugar Daddy\" peaked at number twenty-eight in the USA and would be their last brush with mainstream chart success. 1991's Queer would be the band's swan song, and was supported by various techno-induced singles under the moniker of Feedback Max (in the UK) to disguise club DJs of the source of the records. The single \"Come Inside\" reached number seven in the U.S. Dance Chart and number one in the UK Dance Chart. However, once it was discovered that the Thompson Twins were behind the record, sales dropped and the album never had a UK release.\n\nPrior to this, Bailey and Currie (now a couple) had their first child together in 1988, and in the following years they spent a lot of time writing material for other artists including the hit single \"I Want That Man\" for Debbie Harry. In 1991, Bailey and Currie got married in Las Vegas and the following year moved to New Zealand with their two children. In 1992, the Thompson Twins contributed the song \"Play With Me\" to the soundtrack of the Ralph Bakshi film Cool World; Tom Bailey alone contributed a second track, \"Industry and Seduction\". The following year, the group finally formally disbanded, and Bailey and Currie teamed up with engineer Keith Fernley to form a new group called Babble. The Thompson Twins have declined to follow the examples of many of their contemporaries and reform to tie-in with a nostalgic rebirth of the 1980s, although Bailey, Currie and Leeway appeared together on the UK Channel 4 show \"Top Ten Electro Bands\" in 2001 as the Thompson Twins were placed at no.9.\n\nBailey and Currie are now divorced. Bailey resides with his new wife in London. Currie is now a furniture designer. Her furniture is stuffed with animals to bring attention to the cruelty of animals used for furniture.  <a href=\"https://www.last.fm/music/Thompson+Twins\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
  "country": null,
  "created_at": "2025-07-05T17:30:19.055663",
  "discogs_id": "44581",
  "discogs_url": "https://www.discogs.com/artist/44581",
  "followers": 699827,
  "formed_date": null,
  "genres": [
    "Pop",
    "new wave",
    "synthpop",
    "80s",
    "pop",
    "synth pop"
  ],
  "id": null,
  "images": [
    {
      "height": 2000,
      "type": "apple_music_artist",
      "url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/d0/5b/5b/d05b5b6f-da57-1c33-71bd-8eab77537bc0/mzl.yjezmqnz.jpg/2000x2000bb.jpg",
      "width": 2000
    },
    {
      "height": 640,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000e5ebe1d9c03cc2d86e3babc83c59",
      "width": 640
    },
    {
      "height": 320,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab67616100005174e1d9c03cc2d86e3babc83c59",
      "width": 320
    },
    {
      "height": 160,
      "type": "spotify_artist",
      "url": "https://i.scdn.co/image/ab6761610000f178e1d9c03cc2d86e3babc83c59",
      "width": 160
    },
    {
      "height": null,
      "type": "lastfm_artist_small",
      "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_medium",
      "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_large",
      "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_extralarge",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_mega",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    },
    {
      "height": null,
      "type": "lastfm_artist_",
      "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png",
      "width": null
    }
  ],
  "lastfm_mbid": "228af6b5-f691-4ed2-a63b-10cc6fcc1144",
  "lastfm_url": "https://www.last.fm/music/Thompson+Twins",
  "local_images": {
    "hi-res": "public/artist/thompson-twins/thompson-twins-hi-res.jpg",
    "medium": "public/artist/thompson-twins/thompson-twins-medium.jpg",
    "small": "public/artist/thompson-twins/thompson-twins-small.jpg"
  },
  "name": "Thompson Twins",
  "popularity": 58,
  "services": {
    "apple_music": {
      "artwork_url": "https://is1-ssl.mzstatic.com/image/thumb/Features125/v4/d0/5b/5b/d05b5b6f-da57-1c33-71bd-8eab77537bc0/mzl.yjezmqnz.jpg/2000x2000bb.jpg",
      "editorial_notes": null,
      "genres": [
        "Pop"
      ],
      "id": "395429",
      "name": "Thompson Twins",
      "origin": "",
      "url": "https://music.apple.com/gb/artist/thompson-twins/395429"
    },
    "discogs": {
      "id": 44581,
      "original_name": "Thompson Twins",
      "role": ""
    },
    "lastfm": {
      "bio_content": "Thompson Twins were an English new wave band. The band formed in April 1977, and disbanded in May 1993. Massively popular in the mid-1980s, the band scored a string of hits in the UK, broke into the U.S. and Canada and enjoyed huge popularity around the globe. The band was named after the two bumbling detectives Thomson and Thompson from Hergé's comic strip, The Adventures of Tintin.\n\nIn 1977, the original Thompson Twins lineup consisted of Tom Bailey (born January 18, 1956, in Halifax, Yorkshire) on bass and vocals, Pete Dodd on guitar and vocals, John Roog on guitar, and Jon Podgorski (known as \"Pod\") on drums. Dodd and Roog first met when they were both 13 years old.\n\nAfter moving to London but having so little money, they lived as squatters in Lillieshall Road, London. Future Thompson Twins' member, Alannah Currie, lived in another squat in the same street — which is how she met Bailey. It was in this ramshackle and run-down house that they found an illegal way of \"borrowing\" electricity from the house next door. Bailey described themselves (laughingly) as \"spongers\" (meaning parasites) back then, as they were living on very little, and scavenging everything they could lay their hands on. He even said that the only instruments they had were bought, or had been \"stolen or borrowed\". Dodd managed to get a council flat not far away. Their roadie at that time was John Hade, who lived in the same house, and who later became their manager.\n\nAs \"Pod\" Podgorski had decided to stay in the north, they auditoned for drummers at The Point Studio in Victoria, London. Dick O'Dell (Disco Dell) the manager of The Pop Group and The Slits also had an office in the same building. Andrew Edge joined them on drums for less than one year, but left because of the subliminal tension between the other band members. Edge went on to join Savage Progress, who later toured with the Thompson Twins as their support act on the 1984 UK tour.\n\nBy 1981, the line-up was Bailey, Dodd, Roog and three new members: Chris Bell on drums, Joe Leeway on congas and percussion, and Jane Shorter on saxophone. This line up recorded the first Thompson Twins album A Product of ... (Participation). Currie, who had been hanging out with the band for a few years, played and sang on the first album, but was not yet a full member.\n\nBell admitted in the beginning that he was \"not a drummer at all,\" but with the encouragement and help of Bailey he steadily improved to provide a solid back-beat. The group's personnel eventually rose to as many as eleven members, who often invited enthusiastic audience members onstage to pound on makeshift percussion instruments.\n\nAfter the first album, the band's line-up shifted yet again. Saxophone player Shorter dropped out, Currie was made an official member, and added was bassist Matthew Seligman, a former member of The Soft Boys. Bailey, meanwhile, moved to keyboards and became the band's lead vocalist, with Leeway being vocalist on some tracks.\n\nThe band signed to Arista Records and released the album Set. Thomas Dolby played some keyboards, such as the Oberheim, on Set and some live gigs, as Bailey had little experience with synthesizers before then.\n\nSet contained the single \"In The Name Of Love\", sung and largely written by Bailey. It became a substantial dance club hit in the U.S., and the Set album would be released as In The Name Of Love in the U.S. to capitalize on the song's popularity. It entered the Billboard 200.\n\nAfter the success of \"In The Name Of Love\", Bailey, Currie and Leeway, wanting to pursue the single's different sound, toyed with the idea of starting a new band on the side, which they planned to call \"The Bermuda Triangle\". When the single and album failed to make a substantial impact in the UK charts, manager Hade convinced Bailey, Leeway and Currie to downsize the Thompson Twins to a core of the three in April 1982. On UK TV, Seligman explained it so:\n\n“ We were all given a piece of paper that we had to sign, which said that we were to be paid 500 pounds, and we could keep our instruments and equipment. It sounded like quite a good deal at the time...\" ” \n\nAll the former members are still on friendly speaking terms, although Dodd once had the job of delivering a keyboard to Thomas Dolby some time later, but (to Dodd's irritation) Dolby failed to recognise him.\n\nNo longer having to work out songs in beer-sodden and sweaty rehearsal rooms, as well as dealing with the opinions of other musicians, Bailey could now work on his own, and at his own pace. Unfortunately this would back-fire on him in later years, as the strain of doing almost everything led to a breakdown.\n\nThe Thompson Twins trio then decided to go abroad and to free themselves of any UK influences, as well as to combine the songwriting for their first \"trio\" album with a very long holiday: \"We went to Egypt to be totally isolated\", Currie explained. \"The old version of The Thompson Twins had just split up (sic) and now there were the three of us — Tom, Joe and myself — and we needed to get some new songs written\". \"We were always London-based\", Bailey added. \"Making London-type music, for London people. It was the bane of our lives and we wanted to make a break from that. So Egypt seemed a good place to go...\"\n\nThe new trio also had their share of in-fighting even after the other members had gone, Currie: \"We did have terrible fights when we tried to work together. We threw things at one another and cried. It was all very traumatic, but we've worked so long together that we can cope with that. We know how to manipulate one another, you see, and stick the knife in. There's no democracy in the Thompson Twins; we run it on a totally fascist basis\". \"After Egypt, we went to the Bahamas\" Currie commented, \"but we got bored\", said Leeway. \"There was nothing to do but swim around and look at different coloured corals.\" Currie continues: \"So we came back to Britain and set up a studio in the ballroom of a mansion presided over by a crazy woman in Wiltshire\" \n\nThey broke into the UK Singles Chart and the U.S. Billboard Hot 100 chart at the beginning of 1983 with \"Lies\" and \"Love On Your Side\". Further singles from their third album Quick Step And Side Kick (called simply Side Kicks in the U.S.) followed with \"We Are Detective\" and \"Watching\". Bailey's flame-red hair and bright ponytail and Currie's wasp-swatting style at the xylophone swiftly becoming endearing images of an exciting new act. Bailey primarily wrote the music (with significant enough input from Leeway that he received co-authorship credit on all tracks), and Currie contributed most (if not all) of the lyrics. Leeway was also responsible for the band's exciting live visuals.\n\nAt the end of 1983, a new single \"Hold Me Now\" was released. An extremely simple love song with gentle guitar lines, it marked a clear break from the Thompson Twins' previously dance-oriented sound. It hit the top ten in both the UK and US.\n\nFurther hit singles followed in 1984: the pop hit \"Doctor! Doctor!\"; the quirky \"You Take Me Up\" (reaching number two and their biggest UK hit); the haunting \"Sister of Mercy\"; and \"The Gap\" with its Middle Eastern rhythms (this was not released in the UK). The corresponding album, Into The Gap, was one of the bestsellers of the year, selling five million units worldwide and topping the British album charts. The band also embarked on a world tour in support fo the album.\n\nA late 1984 single, \"Lay Your Hands On Me\", saw the band attempt to build on their success, but an insensitive theme (showing the band draped in jewels) contrasted sharply with the prevalent theme of Live Aid currently obsessing the music press in the UK. The single did well, making the US top ten (#13 in the UK), but by then the trio had peaked.\n\nWorking on the follow up to Into The Gap, Bailey suffered a nervous breakdown. Nile Rodgers was subsequently called in to help finish the album, which appeared in 1985. Here's To Future Days (itself making the top 5 in the UK and top 20 in the US) spawned the track: \"King For a Day\", which made the US top ten, but only reached no.22 in the UK. Other singles included the anti-drug message \"Don't Mess With Doctor Dream\" (UK #15) and a cover of The Beatles' 1968 hit \"Revolution\". The Thompson Twins made headlines when they performed at the American-end of Live Aid and were joined on-stage by the fresh-faced Madonna, who was in only her second year of fame. The UK leg of the album's support tour had to be cancelled because of Bailey's breakdown (fans with tickets received a free live album as compensation) and the album itself was delayed by many months, causing the band to lose momentum. Despite this, the latter half of 1985 saw sell out tours for the band in the USA and Japan.\n\nLeeway left the band in 1986, and the remaining duo of Bailey and Currie carried on making music for another seven years. 1987 saw the release of Close To the Bone and the single \"Get That Love\" which made it to number thirty-one in the U.S. \"In The Name of Love\" was given a new lease of life in 1988, after a remix by Shep Petitbone made #46 in the UK. 1989 saw the release of another album, Big Trash, and a new record deal with Warner Bros. Records. The single \"Sugar Daddy\" peaked at number twenty-eight in the USA and would be their last brush with mainstream chart success. 1991's Queer would be the band's swan song, and was supported by various techno-induced singles under the moniker of Feedback Max (in the UK) to disguise club DJs of the source of the records. The single \"Come Inside\" reached number seven in the U.S. Dance Chart and number one in the UK Dance Chart. However, once it was discovered that the Thompson Twins were behind the record, sales dropped and the album never had a UK release.\n\nPrior to this, Bailey and Currie (now a couple) had their first child together in 1988, and in the following years they spent a lot of time writing material for other artists including the hit single \"I Want That Man\" for Debbie Harry. In 1991, Bailey and Currie got married in Las Vegas and the following year moved to New Zealand with their two children. In 1992, the Thompson Twins contributed the song \"Play With Me\" to the soundtrack of the Ralph Bakshi film Cool World; Tom Bailey alone contributed a second track, \"Industry and Seduction\". The following year, the group finally formally disbanded, and Bailey and Currie teamed up with engineer Keith Fernley to form a new group called Babble. The Thompson Twins have declined to follow the examples of many of their contemporaries and reform to tie-in with a nostalgic rebirth of the 1980s, although Bailey, Currie and Leeway appeared together on the UK Channel 4 show \"Top Ten Electro Bands\" in 2001 as the Thompson Twins were placed at no.9.\n\nBailey and Currie are now divorced. Bailey resides with his new wife in London. Currie is now a furniture designer. Her furniture is stuffed with animals to bring attention to the cruelty of animals used for furniture.  <a href=\"https://www.last.fm/music/Thompson+Twins\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.",
      "bio_summary": "Thompson Twins were an English new wave band. The band formed in April 1977, and disbanded in May 1993. Massively popular in the mid-1980s, the band scored a string of hits in the UK, broke into the U.S. and Canada and enjoyed huge popularity around the globe. The band was named after the two bumbling detectives Thomson and Thompson from Hergé's comic strip, The Adventures of Tintin.\n\nIn 1977, the original Thompson Twins lineup consisted of Tom Bailey (born January 18 <a href=\"https://www.last.fm/music/Thompson+Twins\">Read more on Last.fm</a>",
      "images": [
        {
          "size": "small",
          "url": "https://lastfm.freetls.fastly.net/i/u/34s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "medium",
          "url": "https://lastfm.freetls.fastly.net/i/u/64s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "large",
          "url": "https://lastfm.freetls.fastly.net/i/u/174s/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "extralarge",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "mega",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        },
        {
          "size": "",
          "url": "https://lastfm.freetls.fastly.net/i/u/300x300/2a96cbd8b46e442fc41c2b86b821562f.png"
        }
      ],
      "listeners": 644511,
      "mbid": "228af6b5-f691-4ed2-a63b-10cc6fcc1144",
      "name": "Thompson Twins",
      "playcount": 5373705,
      "similar_artists": [
        {
          "name": "Howard Jones",
          "url": "https://www.last.fm/music/Howard+Jones"
        },
        {
          "name": "ABC",
          "url": "https://www.last.fm/music/ABC"
        },
        {
          "name": "The Human League",
          "url": "https://www.last.fm/music/The+Human+League"
        },
        {
          "name": "Blancmange",
          "url": "https://www.last.fm/music/Blancmange"
        },
        {
          "name": "Heaven 17",
          "url": "https://www.last.fm/music/Heaven+17"
        }
      ],
      "tags": [
        "80s",
        "new wave",
        "pop",
        "synth pop",
        "synthpop"
      ],
      "url": "https://www.last.fm/music/Thompson+Twins"
    },
    "spotify": {
      "followers": 699827,
      "genres": [
        "new wave",
        "synthpop"
      ],
      "id": "5jVeqi3PNaTOajfvBa4uFn",
      "images": [
        {
          "height": 640,
          "url": "https://i.scdn.co/image/ab6761610000e5ebe1d9c03cc2d86e3babc83c59",
          "width": 640
        },
        {
          "height": 320,
          "url": "https://i.scdn.co/image/ab67616100005174e1d9c03cc2d86e3babc83c59",
          "width": 320
        },
        {
          "height": 160,
          "url": "https://i.scdn.co/image/ab6761610000f178e1d9c03cc2d86e3babc83c59",
          "width": 160
        }
      ],
      "name": "Thompson Twins",
      "popularity": 58,
      "url": "https://open.spotify.com/artist/5jVeqi3PNaTOajfvBa4uFn"
    }
  },
  "spotify_id": "5jVeqi3PNaTOajfvBa4uFn",
  "spotify_url": "https://open.spotify.com/artist/5jVeqi3PNaTOajfvBa4uFn",
  "updated_at": "2025-07-05T17:30:20.834472",
  "wikipedia_url": null
}